adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/*

Copyright (c) 2010 - 2024, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF54H20_ENGB_TYPES_H
#define NRF54H20_ENGB_TYPES_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdint.h>
#include "compiler_abstraction.h"


/* ============================================ Include required type specifiers ============================================= */

#ifndef __I
  #ifdef __cplusplus
    #define __I     volatile                         /*!< Defines 'read only' permissions                                      */
  #else
    #define __I     volatile const                   /*!< Defines 'read only' permissions                                      */
  #endif
#endif
#ifndef __O
  #define __O     volatile                           /*!< Defines 'write only' permissions                                     */
#endif
#ifndef __IO
  #define __IO    volatile                           /*!< Defines 'read / write' permissions                                   */
#endif

/* The following defines should be used for structure members */
#ifndef __IM
  #define __IM     volatile const                    /*!< Defines 'read only' structure member permissions                     */
#endif
#ifndef __OM
  #define __OM     volatile                          /*!< Defines 'write only' structure member permissions                    */
#endif
#ifndef __IOM
  #define __IOM    volatile                          /*!< Defines 'read / write' structure member permissions                  */
#endif

/* ======================================================= Domain IDs ======================================================== */
/**
  * @brief (unspecified)
  */
typedef enum {
  NRF_DOMAIN_SECURE                          = 1,    /*!< Secure Domain                                                        */
  NRF_DOMAIN_APPLICATION                     = 2,    /*!< Application Core                                                     */
  NRF_DOMAIN_RADIOCORE                       = 3,    /*!< Radio Core                                                           */
  NRF_DOMAIN_GLOBALFAST                      = 12,   /*!< Global Domain - Fast clock domain                                    */
  NRF_DOMAIN_GLOBALSLOW                      = 13,   /*!< Global Domain - Slow clock domain                                    */
  NRF_DOMAIN_GLOBAL                          = 15,   /*!< Global Domain                                                        */
} NRF_DOMAINID_Type;

/* ====================================================== Processor IDs ====================================================== */
/**
  * @brief (unspecified)
  */
typedef enum {
  NRF_PROCESSOR_SECURE                       = 1,    /*!< Secure Domain Processor                                              */
  NRF_PROCESSOR_APPLICATION                  = 2,    /*!< Application Core Processor                                           */
  NRF_PROCESSOR_RADIOCORE                    = 3,    /*!< Radio Core Processor                                                 */
  NRF_PROCESSOR_BBPR                         = 11,   /*!< Baseband Processor                                                   */
  NRF_PROCESSOR_SYSCTRL                      = 12,   /*!< System Controller Processor                                          */
  NRF_PROCESSOR_PPR                          = 13,   /*!< Peripheral Processor                                                 */
  NRF_PROCESSOR_FLPR                         = 14,   /*!< Fast Lightweight Processor                                           */
} NRF_PROCESSORID_Type;

/* ======================================================== Owner IDs ======================================================== */
/**
  * @brief (unspecified)
  */
typedef enum {
  NRF_OWNER_NONE                             = 0,    /*!< Used to denote that ownership is not enforced                        */
  NRF_OWNER_GLOBAL                           = 0,    /*!< Used to denote that ownership is not enforced                        */
  NRF_OWNER_SECURE                           = 1,    /*!< Secure Domain Processor                                              */
  NRF_OWNER_APPLICATION                      = 2,    /*!< Application Core                                                     */
  NRF_OWNER_RADIOCORE                        = 3,    /*!< Radio Core                                                           */
  NRF_OWNER_SYSCTRL                          = 8,    /*!< System Controller, owned by the Secure Domain                        */
  NRF_OWNER_DBG_SECURE                       = 9,    /*!< AHB-AP for Secure Domain CPU                                         */
  NRF_OWNER_DBG_APPLICATION                  = 10,   /*!< AHB-AP for Application Core CPU                                      */
  NRF_OWNER_DBG_RADIOCORE                    = 11,   /*!< AHB-AP for Radio core CPU                                            */
  NRF_OWNER_NONEXISTENT                      = 15,   /*!< Non-existing owner in SecDom                                         */
} NRF_OWNERID_Type;


