adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ABB_CONFIG_CTRL4: ABB control 4 */
  #define ABB_CONFIG_CTRL4_ResetValue (0x00010800UL) /*!< Reset value of CTRL4 register.                                       */

/* CP @Bits 0..15 : Proportional path coefficient of the closed loop body bias controller. */
  #define ABB_CONFIG_CTRL4_CP_Pos (0UL)              /*!< Position of CP field.                                                */
  #define ABB_CONFIG_CTRL4_CP_Msk (0xFFFFUL << ABB_CONFIG_CTRL4_CP_Pos) /*!< Bit mask of CP field.                             */

/* CI @Bits 16..18 : Integral path coefficient of the closed loop body bias controller. */
  #define ABB_CONFIG_CTRL4_CI_Pos (16UL)             /*!< Position of CI field.                                                */
  #define ABB_CONFIG_CTRL4_CI_Msk (0x7UL << ABB_CONFIG_CTRL4_CI_Pos) /*!< Bit mask of CI field.                                */


/* ABB_CONFIG_VENDORCONFIG0: Vendor config 0 */
  #define ABB_CONFIG_VENDORCONFIG0_ResetValue (0xB6000002UL) /*!< Reset value of VENDORCONFIG0 register.                       */

/* CONFIG @Bits 0..31 : ABB vendor config register 0. */
  #define ABB_CONFIG_VENDORCONFIG0_CONFIG_Pos (0UL)  /*!< Position of CONFIG field.                                            */
  #define ABB_CONFIG_VENDORCONFIG0_CONFIG_Msk (0xFFFFFFFFUL << ABB_CONFIG_VENDORCONFIG0_CONFIG_Pos) /*!< Bit mask of CONFIG
                                                                            field.*/


/* ABB_CONFIG_VENDORCONFIG1: Vendor config 1 */
  #define ABB_CONFIG_VENDORCONFIG1_ResetValue (0x000120E7UL) /*!< Reset value of VENDORCONFIG1 register.                       */

/* CONFIG @Bits 0..20 : ABB vendor config register 1. */
  #define ABB_CONFIG_VENDORCONFIG1_CONFIG_Pos (0UL)  /*!< Position of CONFIG field.                                            */
  #define ABB_CONFIG_VENDORCONFIG1_CONFIG_Msk (0x1FFFFFUL << ABB_CONFIG_VENDORCONFIG1_CONFIG_Pos) /*!< Bit mask of CONFIG
                                                                            field.*/



/* ===================================================== Struct ABB_TRIM ===================================================== */
/**
  * @brief TRIM [ABB_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RINGO[4];                          /*!< (@ 0x00000000) RINGO trim values for operation points                */
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  LOCKRANGE[4];                      /*!< (@ 0x00000020) LOCKRANGE trim values for operation points            */
  __IOM uint32_t  PVTMONCYCLES[4];                   /*!< (@ 0x00000030) PVTMONCYCLES trim values for operation points         */
} NRF_ABB_TRIM_Type;                                 /*!< Size = 64 (0x040)                                                    */

/* ABB_TRIM_RINGO: RINGO trim values for operation points */
  #define ABB_TRIM_RINGO_MaxCount (4UL)              /*!< Max size of RINGO[4] array.                                          */
  #define ABB_TRIM_RINGO_MaxIndex (3UL)              /*!< Max index of RINGO[4] array.                                         */
  #define ABB_TRIM_RINGO_MinIndex (0UL)              /*!< Min index of RINGO[4] array.                                         */
  #define ABB_TRIM_RINGO_ResetValue (0x00000000UL)   /*!< Reset value of RINGO[4] register.                                    */

/* RINGOTARGETVALP @Bits 0..12 : Target performance for VPW biased devices. */
  #define ABB_TRIM_RINGO_RINGOTARGETVALP_Pos (0UL)   /*!< Position of RINGOTARGETVALP field.                                   */
  #define ABB_TRIM_RINGO_RINGOTARGETVALP_Msk (0x1FFFUL << ABB_TRIM_RINGO_RINGOTARGETVALP_Pos) /*!< Bit mask of RINGOTARGETVALP
                                                                            field.*/

/* RINGOTARGETVALN @Bits 16..28 : Target performance for VNW biased devices. */
  #define ABB_TRIM_RINGO_RINGOTARGETVALN_Pos (16UL)  /*!< Position of RINGOTARGETVALN field.                                   */
  #define ABB_TRIM_RINGO_RINGOTARGETVALN_Msk (0x1FFFUL << ABB_TRIM_RINGO_RINGOTARGETVALN_Pos) /*!< Bit mask of RINGOTARGETVALN
                                                                            field.*/


/* ABB_TRIM_LOCKRANGE: LOCKRANGE trim values for operation points */
  #define ABB_TRIM_LOCKRANGE_MaxCount (4UL)          /*!< Max size of LOCKRANGE[4] array.                                      */
  #define ABB_TRIM_LOCKRANGE_MaxIndex (3UL)          /*!< Max index of LOCKRANGE[4] array.                                     */
  #define ABB_TRIM_LOCKRANGE_MinIndex (0UL)          /*!< Min index of LOCKRANGE[4] array.                                     */
  #define ABB_TRIM_LOCKRANGE_ResetValue (0x00000000UL) /*!< Reset value of LOCKRANGE[4] register.                              */

/* LOCKRANGELOWN @Bits 0..7 : Lock range low boundary for VNW biased devices. */
  #define ABB_TRIM_LOCKRANGE_LOCKRANGELOWN_Pos (0UL) /*!< Position of LOCKRANGELOWN field.                                     */
  #define ABB_TRIM_LOCKRANGE_LOCKRANGELOWN_Msk (0xFFUL << ABB_TRIM_LOCKRANGE_LOCKRANGELOWN_Pos) /*!< Bit mask of LOCKRANGELOWN
                                                                            field.*/

/* LOCKRANGEHIGHN @Bits 8..15 : Lock range high boundary for VNW biased devices. */
  #define ABB_TRIM_LOCKRANGE_LOCKRANGEHIGHN_Pos (8UL) /*!< Position of LOCKRANGEHIGHN field.                                   */
  #define ABB_TRIM_LOCKRANGE_LOCKRANGEHIGHN_Msk (0xFFUL << ABB_TRIM_LOCKRANGE_LOCKRANGEHIGHN_Pos) /*!< Bit mask of
                                                                            LOCKRANGEHIGHN field.*/

/* LOCKRANGELOWP @Bits 16..23 : Lock range low boundary for VPW biased devices. */
  #define ABB_TRIM_LOCKRANGE_LOCKRANGELOWP_Pos (16UL) /*!< Position of LOCKRANGELOWP field.                                    */
  #define ABB_TRIM_LOCKRANGE_LOCKRANGELOWP_Msk (0xFFUL << ABB_TRIM_LOCKRANGE_LOCKRANGELOWP_Pos) /*!< Bit mask of LOCKRANGELOWP
                                                                            field.*/

/* LOCKRANGEHIGHP @Bits 24..31 : Lock range high boundary for VPW biased devices. */
  #define ABB_TRIM_LOCKRANGE_LOCKRANGEHIGHP_Pos (24UL) /*!< Position of LOCKRANGEHIGHP field.                                  */
  #define ABB_TRIM_LOCKRANGE_LOCKRANGEHIGHP_Msk (0xFFUL << ABB_TRIM_LOCKRANGE_LOCKRANGEHIGHP_Pos) /*!< Bit mask of
                                                                            LOCKRANGEHIGHP field.*/


/* ABB_TRIM_PVTMONCYCLES: PVTMONCYCLES trim values for operation points */
  #define ABB_TRIM_PVTMONCYCLES_MaxCount (4UL)       /*!< Max size of PVTMONCYCLES[4] array.                                   */
  #define ABB_TRIM_PVTMONCYCLES_MaxIndex (3UL)       /*!< Max index of PVTMONCYCLES[4] array.                                  */
  #define ABB_TRIM_PVTMONCYCLES_MinIndex (0UL)       /*!< Min index of PVTMONCYCLES[4] array.                                  */
  #define ABB_TRIM_PVTMONCYCLES_ResetValue (0x00000000UL) /*!< Reset value of PVTMONCYCLES[4] register.                        */

