adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VAL @Bits 0..3 : These bits configure the internal monitor */
  #define ABB_TRIM_PVTMONCYCLES_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define ABB_TRIM_PVTMONCYCLES_VAL_Msk (0xFUL << ABB_TRIM_PVTMONCYCLES_VAL_Pos) /*!< Bit mask of VAL field.                   */



/* =================================================== Struct ABB_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [ABB_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LOCKED;                            /*!< (@ 0x00000000) Override the LOCKED signal from the analog module     */
  __IOM uint32_t  STATUSVALID;                       /*!< (@ 0x00000004) Override the STATUS_VALID signal from the analog
                                                                         module*/
} NRF_ABB_OVERRIDE_Type;                             /*!< Size = 8 (0x008)                                                     */

/* ABB_OVERRIDE_LOCKED: Override the LOCKED signal from the analog module */
  #define ABB_OVERRIDE_LOCKED_ResetValue (0x00000000UL) /*!< Reset value of LOCKED register.                                   */

/* VAL @Bit 0 : Current value of the signal */
  #define ABB_OVERRIDE_LOCKED_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define ABB_OVERRIDE_LOCKED_VAL_Msk (0x1UL << ABB_OVERRIDE_LOCKED_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define ABB_OVERRIDE_LOCKED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define ABB_OVERRIDE_LOCKED_EN_Msk (0x1UL << ABB_OVERRIDE_LOCKED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define ABB_OVERRIDE_LOCKED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define ABB_OVERRIDE_LOCKED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define ABB_OVERRIDE_LOCKED_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define ABB_OVERRIDE_LOCKED_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* ABB_OVERRIDE_STATUSVALID: Override the STATUS_VALID signal from the analog module */
  #define ABB_OVERRIDE_STATUSVALID_ResetValue (0x00000000UL) /*!< Reset value of STATUSVALID register.                         */

/* VAL @Bit 0 : Current value of the signal */
  #define ABB_OVERRIDE_STATUSVALID_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define ABB_OVERRIDE_STATUSVALID_VAL_Msk (0x1UL << ABB_OVERRIDE_STATUSVALID_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define ABB_OVERRIDE_STATUSVALID_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define ABB_OVERRIDE_STATUSVALID_EN_Msk (0x1UL << ABB_OVERRIDE_STATUSVALID_EN_Pos) /*!< Bit mask of EN field.                */
  #define ABB_OVERRIDE_STATUSVALID_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define ABB_OVERRIDE_STATUSVALID_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define ABB_OVERRIDE_STATUSVALID_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define ABB_OVERRIDE_STATUSVALID_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* ======================================================= Struct ABB ======================================================== */
/**
  * @brief ABB peripheral
  */
  typedef struct {                                   /*!< ABB Structure                                                        */
    __OM uint32_t TASKS_GETABBSTATUS;                /*!< (@ 0x00000000) Get ABB status                                        */
    __IM uint32_t RESERVED[63];
    __IOM uint32_t EVENTS_ABBSTATUSREADY;            /*!< (@ 0x00000100) The ABB status is ready for read                      */
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) ABB status                                            */
    __IM uint32_t STATUSABB;                         /*!< (@ 0x00000404) ABB macro status                                      */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000408) Status of ABB macro output signals                    */
    __IM uint32_t RESERVED3;
    __IOM NRF_ABB_CONFIG_Type CONFIG;                /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[6];
    __IOM NRF_ABB_TRIM_Type TRIM;                    /*!< (@ 0x00000440) (unspecified)                                         */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000480) ABB control                                           */
    __IM uint32_t RESERVED5[31];
    __IOM NRF_ABB_OVERRIDE_Type OVERRIDE;            /*!< (@ 0x00000500) (unspecified)                                         */
  } NRF_ABB_Type;                                    /*!< Size = 1288 (0x508)                                                  */

/* ABB_TASKS_GETABBSTATUS: Get ABB status */
  #define ABB_TASKS_GETABBSTATUS_ResetValue (0x00000000UL) /*!< Reset value of TASKS_GETABBSTATUS register.                    */

/* TASKS_GETABBSTATUS @Bit 0 : Get ABB status */
  #define ABB_TASKS_GETABBSTATUS_TASKS_GETABBSTATUS_Pos (0UL) /*!< Position of TASKS_GETABBSTATUS field.                       */
  #define ABB_TASKS_GETABBSTATUS_TASKS_GETABBSTATUS_Msk (0x1UL << ABB_TASKS_GETABBSTATUS_TASKS_GETABBSTATUS_Pos) /*!< Bit mask
                                                                            of TASKS_GETABBSTATUS field.*/
  #define ABB_TASKS_GETABBSTATUS_TASKS_GETABBSTATUS_Min (0x1UL) /*!< Min enumerator value of TASKS_GETABBSTATUS field.         */
  #define ABB_TASKS_GETABBSTATUS_TASKS_GETABBSTATUS_Max (0x1UL) /*!< Max enumerator value of TASKS_GETABBSTATUS field.         */
  #define ABB_TASKS_GETABBSTATUS_TASKS_GETABBSTATUS_Trigger (0x1UL) /*!< Trigger task                                          */


