adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ABB_EVENTS_ABBSTATUSREADY: The ABB status is ready for read */
  #define ABB_EVENTS_ABBSTATUSREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ABBSTATUSREADY register.              */

/* EVENTS_ABBSTATUSREADY @Bit 0 : The ABB status is ready for read */
  #define ABB_EVENTS_ABBSTATUSREADY_EVENTS_ABBSTATUSREADY_Pos (0UL) /*!< Position of EVENTS_ABBSTATUSREADY field.              */
  #define ABB_EVENTS_ABBSTATUSREADY_EVENTS_ABBSTATUSREADY_Msk (0x1UL << ABB_EVENTS_ABBSTATUSREADY_EVENTS_ABBSTATUSREADY_Pos)
                                                                            /*!< Bit mask of EVENTS_ABBSTATUSREADY field.*/
  #define ABB_EVENTS_ABBSTATUSREADY_EVENTS_ABBSTATUSREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_ABBSTATUSREADY field.*/
  #define ABB_EVENTS_ABBSTATUSREADY_EVENTS_ABBSTATUSREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_ABBSTATUSREADY field.*/
  #define ABB_EVENTS_ABBSTATUSREADY_EVENTS_ABBSTATUSREADY_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define ABB_EVENTS_ABBSTATUSREADY_EVENTS_ABBSTATUSREADY_Generated (0x1UL) /*!< Event generated                               */


/* ABB_INTEN: Enable or disable interrupt */
  #define ABB_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* ABBSTATUSREADY @Bit 0 : Enable or disable interrupt for event ABBSTATUSREADY */
  #define ABB_INTEN_ABBSTATUSREADY_Pos (0UL)         /*!< Position of ABBSTATUSREADY field.                                    */
  #define ABB_INTEN_ABBSTATUSREADY_Msk (0x1UL << ABB_INTEN_ABBSTATUSREADY_Pos) /*!< Bit mask of ABBSTATUSREADY field.          */
  #define ABB_INTEN_ABBSTATUSREADY_Min (0x0UL)       /*!< Min enumerator value of ABBSTATUSREADY field.                        */
  #define ABB_INTEN_ABBSTATUSREADY_Max (0x1UL)       /*!< Max enumerator value of ABBSTATUSREADY field.                        */
  #define ABB_INTEN_ABBSTATUSREADY_Disabled (0x0UL)  /*!< Disable                                                              */
  #define ABB_INTEN_ABBSTATUSREADY_Enabled (0x1UL)   /*!< Enable                                                               */


/* ABB_INTENSET: Enable interrupt */
  #define ABB_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* ABBSTATUSREADY @Bit 0 : Write '1' to enable interrupt for event ABBSTATUSREADY */
  #define ABB_INTENSET_ABBSTATUSREADY_Pos (0UL)      /*!< Position of ABBSTATUSREADY field.                                    */
  #define ABB_INTENSET_ABBSTATUSREADY_Msk (0x1UL << ABB_INTENSET_ABBSTATUSREADY_Pos) /*!< Bit mask of ABBSTATUSREADY field.    */
  #define ABB_INTENSET_ABBSTATUSREADY_Min (0x0UL)    /*!< Min enumerator value of ABBSTATUSREADY field.                        */
  #define ABB_INTENSET_ABBSTATUSREADY_Max (0x1UL)    /*!< Max enumerator value of ABBSTATUSREADY field.                        */
  #define ABB_INTENSET_ABBSTATUSREADY_Set (0x1UL)    /*!< Enable                                                               */
  #define ABB_INTENSET_ABBSTATUSREADY_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define ABB_INTENSET_ABBSTATUSREADY_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* ABB_INTENCLR: Disable interrupt */
  #define ABB_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* ABBSTATUSREADY @Bit 0 : Write '1' to disable interrupt for event ABBSTATUSREADY */
  #define ABB_INTENCLR_ABBSTATUSREADY_Pos (0UL)      /*!< Position of ABBSTATUSREADY field.                                    */
  #define ABB_INTENCLR_ABBSTATUSREADY_Msk (0x1UL << ABB_INTENCLR_ABBSTATUSREADY_Pos) /*!< Bit mask of ABBSTATUSREADY field.    */
  #define ABB_INTENCLR_ABBSTATUSREADY_Min (0x0UL)    /*!< Min enumerator value of ABBSTATUSREADY field.                        */
  #define ABB_INTENCLR_ABBSTATUSREADY_Max (0x1UL)    /*!< Max enumerator value of ABBSTATUSREADY field.                        */
  #define ABB_INTENCLR_ABBSTATUSREADY_Clear (0x1UL)  /*!< Disable                                                              */
  #define ABB_INTENCLR_ABBSTATUSREADY_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define ABB_INTENCLR_ABBSTATUSREADY_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* ABB_INTPEND: Pending interrupts */
  #define ABB_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* ABBSTATUSREADY @Bit 0 : Read pending status of interrupt for event ABBSTATUSREADY */
  #define ABB_INTPEND_ABBSTATUSREADY_Pos (0UL)       /*!< Position of ABBSTATUSREADY field.                                    */
  #define ABB_INTPEND_ABBSTATUSREADY_Msk (0x1UL << ABB_INTPEND_ABBSTATUSREADY_Pos) /*!< Bit mask of ABBSTATUSREADY field.      */
  #define ABB_INTPEND_ABBSTATUSREADY_Min (0x0UL)     /*!< Min enumerator value of ABBSTATUSREADY field.                        */
  #define ABB_INTPEND_ABBSTATUSREADY_Max (0x1UL)     /*!< Max enumerator value of ABBSTATUSREADY field.                        */
  #define ABB_INTPEND_ABBSTATUSREADY_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define ABB_INTPEND_ABBSTATUSREADY_Pending (0x1UL) /*!< Read: Pending                                                        */


/* ABB_STATUS: ABB status */
  #define ABB_STATUS_ResetValue (0x00000000UL)       /*!< Reset value of STATUS register.                                      */

/* OPPOINT @Bits 0..1 : The current ABB operating point */
  #define ABB_STATUS_OPPOINT_Pos (0UL)               /*!< Position of OPPOINT field.                                           */
  #define ABB_STATUS_OPPOINT_Msk (0x3UL << ABB_STATUS_OPPOINT_Pos) /*!< Bit mask of OPPOINT field.                             */
  #define ABB_STATUS_OPPOINT_Min (0x0UL)             /*!< Min enumerator value of OPPOINT field.                               */
  #define ABB_STATUS_OPPOINT_Max (0x3UL)             /*!< Max enumerator value of OPPOINT field.                               */
  #define ABB_STATUS_OPPOINT_OpPoint0V4 (0x0UL)      /*!< Operating point 0.4V                                                 */
  #define ABB_STATUS_OPPOINT_OpPoint0V5 (0x1UL)      /*!< Operating point 0.5V                                                 */
  #define ABB_STATUS_OPPOINT_OpPoint0V6 (0x2UL)      /*!< Operating point 0.6V                                                 */
  #define ABB_STATUS_OPPOINT_OpPoint0V8 (0x3UL)      /*!< Operating point 0.8V                                                 */

/* EN @Bit 4 : The ABB enable status. */
  #define ABB_STATUS_EN_Pos (4UL)                    /*!< Position of EN field.                                                */
  #define ABB_STATUS_EN_Msk (0x1UL << ABB_STATUS_EN_Pos) /*!< Bit mask of EN field.                                            */
  #define ABB_STATUS_EN_Min (0x0UL)                  /*!< Min enumerator value of EN field.                                    */
  #define ABB_STATUS_EN_Max (0x1UL)                  /*!< Max enumerator value of EN field.                                    */
  #define ABB_STATUS_EN_Disabled (0x0UL)             /*!< ABB disabled                                                         */
  #define ABB_STATUS_EN_Enabled (0x1UL)              /*!< ABB enabled                                                          */

/* LOCKED @Bit 5 : The ABB lock status. */
  #define ABB_STATUS_LOCKED_Pos (5UL)                /*!< Position of LOCKED field.                                            */
  #define ABB_STATUS_LOCKED_Msk (0x1UL << ABB_STATUS_LOCKED_Pos) /*!< Bit mask of LOCKED field.                                */
  #define ABB_STATUS_LOCKED_Min (0x0UL)              /*!< Min enumerator value of LOCKED field.                                */
  #define ABB_STATUS_LOCKED_Max (0x1UL)              /*!< Max enumerator value of LOCKED field.                                */
  #define ABB_STATUS_LOCKED_NotLocked (0x0UL)        /*!< Not locked                                                           */
  #define ABB_STATUS_LOCKED_Locked (0x1UL)           /*!< Locked.                                                              */


/* ABB_STATUSABB: ABB macro status */
  #define ABB_STATUSABB_ResetValue (0x00000000UL)    /*!< Reset value of STATUSABB register.                                   */

/* STATUS @Bits 0..31 : ABB macro status. */
  #define ABB_STATUSABB_STATUS_Pos (0UL)             /*!< Position of STATUS field.                                            */
  #define ABB_STATUSABB_STATUS_Msk (0xFFFFFFFFUL << ABB_STATUSABB_STATUS_Pos) /*!< Bit mask of STATUS field.                   */


/* ABB_STATUSANA: Status of ABB macro output signals */
  #define ABB_STATUSANA_ResetValue (0x00000000UL)    /*!< Reset value of STATUSANA register.                                   */

/* LOCKED @Bit 0 : Current value of the LOCKED signal from the ABB macro */
  #define ABB_STATUSANA_LOCKED_Pos (0UL)             /*!< Position of LOCKED field.                                            */
  #define ABB_STATUSANA_LOCKED_Msk (0x1UL << ABB_STATUSANA_LOCKED_Pos) /*!< Bit mask of LOCKED field.                          */

/* STATUSVALID @Bit 1 : Current value of the STATUS_VALID signal from the ABB macro */
  #define ABB_STATUSANA_STATUSVALID_Pos (1UL)        /*!< Position of STATUSVALID field.                                       */
  #define ABB_STATUSANA_STATUSVALID_Msk (0x1UL << ABB_STATUSANA_STATUSVALID_Pos) /*!< Bit mask of STATUSVALID field.           */


/* ABB_MODE: ABB control */
  #define ABB_MODE_ResetValue (0x00000000UL)         /*!< Reset value of MODE register.                                        */

