adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VAL @Bits 0..4 : Tuning value */
  #define AUXPLL_TRIM_CTUNE_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define AUXPLL_TRIM_CTUNE_VAL_Msk (0x1FUL << AUXPLL_TRIM_CTUNE_VAL_Pos) /*!< Bit mask of VAL field.                          */
  #define AUXPLL_TRIM_CTUNE_VAL_Max (0x00UL)         /*!< Highest frequency                                                    */
  #define AUXPLL_TRIM_CTUNE_VAL_Default (0x0DUL)     /*!< Default center frequency for audio and USB                           */
  #define AUXPLL_TRIM_CTUNE_VAL_Min (0x1FUL)         /*!< Lowest frequency                                                     */



/* ================================================ Struct AUXPLL_AUXPLLCTRL ================================================= */
/**
  * @brief AUXPLLCTRL [AUXPLL_AUXPLLCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FREQUENCY;                         /*!< (@ 0x00000000) AUXPLL frequency selection                            */
  __IOM uint32_t  FREQINC;                           /*!< (@ 0x00000004) Frequency increment                                   */
  __IOM uint32_t  FREQINCPERIOD;                     /*!< (@ 0x00000008) Frequency increment period in 1 us steps              */
  __IOM uint32_t  OUTSEL;                            /*!< (@ 0x0000000C) AUXPLL output prescaler                               */
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000010) Freerunning mode control                              */
} NRF_AUXPLL_AUXPLLCTRL_Type;                        /*!< Size = 20 (0x014)                                                    */

/* AUXPLL_AUXPLLCTRL_FREQUENCY: AUXPLL frequency selection */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_ResetValue (0x00008000UL) /*!< Reset value of FREQUENCY register.                        */

/* FREQUENCY @Bits 0..15 : Set fractional PLL divider ratio */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Pos (0UL) /*!< Position of FREQUENCY field.                                    */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Msk (0xFFFFUL << AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of
                                                                            FREQUENCY field.*/
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Min (0x0UL) /*!< Min enumerator value of FREQUENCY field.                      */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Max (0xFFFFUL) /*!< Max enumerator value of FREQUENCY field.                   */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_MinimumDiv (0x0000UL) /*!< Division ratio of 4                                 */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Audio44k1 (0x3BCDUL) /*!< Division ratio for audio 44.1kHz frequency family    */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_USB24M (0x8000UL) /*!< Division ratio for USB PHY 24MHz clock                  */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Audio48k (0x9BA5UL) /*!< Division ratio for audio 48kHz frequency family       */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_MaximumDiv (0xFFFFUL) /*!< Division ratio of 5                                 */


/* AUXPLL_AUXPLLCTRL_FREQINC: Frequency increment */
  #define AUXPLL_AUXPLLCTRL_FREQINC_ResetValue (0x00000000UL) /*!< Reset value of FREQINC register.                            */

/* FREQINC @Bits 0..7 : Signed 8-bit frequency increment, applied to FREQUENCY */
  #define AUXPLL_AUXPLLCTRL_FREQINC_FREQINC_Pos (0UL) /*!< Position of FREQINC field.                                          */
  #define AUXPLL_AUXPLLCTRL_FREQINC_FREQINC_Msk (0xFFUL << AUXPLL_AUXPLLCTRL_FREQINC_FREQINC_Pos) /*!< Bit mask of FREQINC
                                                                            field.*/


/* AUXPLL_AUXPLLCTRL_FREQINCPERIOD: Frequency increment period in 1 us steps */
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_ResetValue (0x00000000UL) /*!< Reset value of FREQINCPERIOD register.                */

/* FREQINCPERIOD @Bits 0..15 : Frequency increment period */
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Pos (0UL) /*!< Position of FREQINCPERIOD field.                        */
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Msk (0xFFFFUL << AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Pos) /*!<
                                                                            Bit mask of FREQINCPERIOD field.*/
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Min (0x0001UL) /*!< Min value of FREQINCPERIOD field.                  */
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Max (0xFFFFUL) /*!< Max size of FREQINCPERIOD field.                   */


/* AUXPLL_AUXPLLCTRL_OUTSEL: AUXPLL output prescaler */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_ResetValue (0x00000007UL) /*!< Reset value of OUTSEL register.                              */

/* OUTSEL @Bits 0..3 : Prescaler ratio */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Pos (0UL)  /*!< Position of OUTSEL field.                                            */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Msk (0xFUL << AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Pos) /*!< Bit mask of OUTSEL field.    */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Min (0x0UL) /*!< Min enumerator value of OUTSEL field.                               */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Max (0x8UL) /*!< Max enumerator value of OUTSEL field.                               */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_DivDisabled (0x0UL) /*!< Divider disabled. Bypassed external clock still supported   */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div1 (0x1UL) /*!< Divide by 1                                                        */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div2 (0x2UL) /*!< Divide by 2                                                        */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div3 (0x3UL) /*!< Divide by 3                                                        */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div4 (0x4UL) /*!< Divide by 4                                                        */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div6 (0x5UL) /*!< Divide by 6                                                        */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div8 (0x6UL) /*!< Divide by 8                                                        */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div12 (0x7UL) /*!< Divide by 12                                                      */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div16 (0x8UL) /*!< Divide by 16                                                      */


/* AUXPLL_AUXPLLCTRL_MODE: Freerunning mode control */
  #define AUXPLL_AUXPLLCTRL_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                  */

/* MODECTRL @Bits 0..1 : Freerunning mode control */
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Pos (0UL)  /*!< Position of MODECTRL field.                                          */
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Msk (0x3UL << AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Pos) /*!< Bit mask of MODECTRL field.  */
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Min (0x0UL) /*!< Min enumerator value of MODECTRL field.                             */
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Max (0x2UL) /*!< Max enumerator value of MODECTRL field.                             */
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Auto (0x0UL) /*!< Automatically handled by the AUXPLL peripheral                     */
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Freerun (0x1UL) /*!< Keep AUXPLL in freerunning mode                                 */
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Locked (0x2UL) /*!< Keep AUXPLL in locked mode                                       */



/* ================================================= Struct AUXPLL_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [AUXPLL_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  OPAENABLE;                         /*!< (@ 0x00000004) Override the OPA_ENABLE signal to the analog module   */
  __IOM uint32_t  COREENABLE;                        /*!< (@ 0x00000008) Override the CORE_ENABLE signal to the analog module  */
  __IOM uint32_t  ARSTSD;                            /*!< (@ 0x0000000C) Override the ARSTSD signal to the analog module       */
  __IOM uint32_t  LOOPPRESET;                        /*!< (@ 0x00000010) Override the LOOP_PRESET signal to the analog module  */
  __IOM uint32_t  FREQ;                              /*!< (@ 0x00000014) Override the FREQUENCY signal to the analog module    */
  __IOM uint32_t  FREQVALID;                         /*!< (@ 0x00000018) Override the FREQVALID signal to the analog module    */
  __IOM uint32_t  BYPASS;                            /*!< (@ 0x0000001C) Override the BYPASS signal to the analog module       */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000020) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  FAKEMODE;                          /*!< (@ 0x00000024) Broadcast specific mode regardless of actual mode     */
  __IOM uint32_t  MUTE;                              /*!< (@ 0x00000028) Override MUTE                                         */
} NRF_AUXPLL_OVERRIDE_Type;                          /*!< Size = 44 (0x02C)                                                    */

