adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* AUXPLL_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define AUXPLL_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_PWRUP_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_PWRUP_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_PWRUP_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_PWRUP_EN_Msk (0x1UL << AUXPLL_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                      */
  #define AUXPLL_OVERRIDE_PWRUP_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_PWRUP_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_PWRUP_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define AUXPLL_OVERRIDE_PWRUP_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* AUXPLL_OVERRIDE_OPAENABLE: Override the OPA_ENABLE signal to the analog module */
  #define AUXPLL_OVERRIDE_OPAENABLE_ResetValue (0x00000000UL) /*!< Reset value of OPAENABLE register.                          */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_OPAENABLE_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_OPAENABLE_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_OPAENABLE_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_OPAENABLE_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_OPAENABLE_EN_Msk (0x1UL << AUXPLL_OVERRIDE_OPAENABLE_EN_Pos) /*!< Bit mask of EN field.              */
  #define AUXPLL_OVERRIDE_OPAENABLE_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_OPAENABLE_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_OPAENABLE_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define AUXPLL_OVERRIDE_OPAENABLE_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* AUXPLL_OVERRIDE_COREENABLE: Override the CORE_ENABLE signal to the analog module */
  #define AUXPLL_OVERRIDE_COREENABLE_ResetValue (0x00000000UL) /*!< Reset value of COREENABLE register.                        */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_COREENABLE_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_COREENABLE_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_COREENABLE_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_COREENABLE_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_COREENABLE_EN_Msk (0x1UL << AUXPLL_OVERRIDE_COREENABLE_EN_Pos) /*!< Bit mask of EN field.            */
  #define AUXPLL_OVERRIDE_COREENABLE_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_COREENABLE_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_COREENABLE_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define AUXPLL_OVERRIDE_COREENABLE_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* AUXPLL_OVERRIDE_ARSTSD: Override the ARSTSD signal to the analog module */
  #define AUXPLL_OVERRIDE_ARSTSD_ResetValue (0x00000000UL) /*!< Reset value of ARSTSD register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_ARSTSD_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_ARSTSD_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_ARSTSD_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_ARSTSD_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_ARSTSD_EN_Msk (0x1UL << AUXPLL_OVERRIDE_ARSTSD_EN_Pos) /*!< Bit mask of EN field.                    */
  #define AUXPLL_OVERRIDE_ARSTSD_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_ARSTSD_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_ARSTSD_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define AUXPLL_OVERRIDE_ARSTSD_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* AUXPLL_OVERRIDE_LOOPPRESET: Override the LOOP_PRESET signal to the analog module */
  #define AUXPLL_OVERRIDE_LOOPPRESET_ResetValue (0x00000000UL) /*!< Reset value of LOOPPRESET register.                        */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_LOOPPRESET_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_LOOPPRESET_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_LOOPPRESET_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_LOOPPRESET_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_LOOPPRESET_EN_Msk (0x1UL << AUXPLL_OVERRIDE_LOOPPRESET_EN_Pos) /*!< Bit mask of EN field.            */
  #define AUXPLL_OVERRIDE_LOOPPRESET_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_LOOPPRESET_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_LOOPPRESET_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define AUXPLL_OVERRIDE_LOOPPRESET_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


