adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ==================================================== Struct AUXPLL_DFT ==================================================== */
/**
  * @brief DFT [AUXPLL_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_AUXPLL_DFT_Type;                               /*!< Size = 52 (0x034)                                                    */

/* AUXPLL_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define AUXPLL_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                             */

/* EN @Bit 31 : Enable VCP on the analog test bus */
  #define AUXPLL_DFT_ATB0CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define AUXPLL_DFT_ATB0CONFIG_EN_Msk (0x1UL << AUXPLL_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define AUXPLL_DFT_ATB0CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_DFT_ATB0CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_DFT_ATB0CONFIG_EN_Disabled (0x0UL)  /*!< Analog test bus is disabled                                          */
  #define AUXPLL_DFT_ATB0CONFIG_EN_Enabled (0x1UL)   /*!< Analog test bus is enabled                                           */


/* AUXPLL_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define AUXPLL_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                             */

/* EN @Bit 31 : Enable AVDD_0V8 on the analog test bus */
  #define AUXPLL_DFT_ATB1CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define AUXPLL_DFT_ATB1CONFIG_EN_Msk (0x1UL << AUXPLL_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define AUXPLL_DFT_ATB1CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_DFT_ATB1CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_DFT_ATB1CONFIG_EN_Disabled (0x0UL)  /*!< Analog test bus is disabled                                          */
  #define AUXPLL_DFT_ATB1CONFIG_EN_Enabled (0x1UL)   /*!< Analog test bus is enabled                                           */


/* AUXPLL_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define AUXPLL_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                             */

/* EN @Bit 31 : Enable analog IP output clock on DTB0 */
  #define AUXPLL_DFT_DTB0CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define AUXPLL_DFT_DTB0CONFIG_EN_Msk (0x1UL << AUXPLL_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define AUXPLL_DFT_DTB0CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_DFT_DTB0CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_DFT_DTB0CONFIG_EN_Disabled (0x0UL)  /*!< Digital test bus is disabled                                         */
  #define AUXPLL_DFT_DTB0CONFIG_EN_Enabled (0x1UL)   /*!< Digital test bus is enabled                                          */


/* AUXPLL_DFT_TCFG: Test mode configuration */
  #define AUXPLL_DFT_TCFG_ResetValue (0x00000000UL)  /*!< Reset value of TCFG register.                                        */

/* BYPASSAUXPLL @Bit 0 : Bypass the reference clock directly to clock output */
  #define AUXPLL_DFT_TCFG_BYPASSAUXPLL_Pos (0UL)     /*!< Position of BYPASSAUXPLL field.                                      */
  #define AUXPLL_DFT_TCFG_BYPASSAUXPLL_Msk (0x1UL << AUXPLL_DFT_TCFG_BYPASSAUXPLL_Pos) /*!< Bit mask of BYPASSAUXPLL field.    */
  #define AUXPLL_DFT_TCFG_BYPASSAUXPLL_Min (0x0UL)   /*!< Min enumerator value of BYPASSAUXPLL field.                          */
  #define AUXPLL_DFT_TCFG_BYPASSAUXPLL_Max (0x1UL)   /*!< Max enumerator value of BYPASSAUXPLL field.                          */
  #define AUXPLL_DFT_TCFG_BYPASSAUXPLL_Disabled (0x0UL) /*!< Normal AUXPLL operation                                           */
  #define AUXPLL_DFT_TCFG_BYPASSAUXPLL_Enabled (0x1UL) /*!< Bypass enabled                                                     */


/* ====================================================== Struct AUXPLL ====================================================== */
/**
  * @brief AUXPLL
  */
  typedef struct {                                   /*!< AUXPLL Structure                                                     */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the AUXPLL                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop the AUXPLL                                       */
    __OM uint32_t TASKS_NEWFINEFREQ;                 /*!< (@ 0x00000008) Change fine frequency                                 */
    __OM uint32_t TASKS_NEWBASEFREQ;                 /*!< (@ 0x0000000C) Change base frequency                                 */
    __OM uint32_t TASKS_FREQINCSTART;                /*!< (@ 0x00000010) Start automated frequency increment                   */
    __OM uint32_t TASKS_FREQINCSTOP;                 /*!< (@ 0x00000014) Stop automated frequency increment                    */
    __IM uint32_t RESERVED[58];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) AUXPLL started                                        */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) AUXPLL stopped                                        */
    __IOM uint32_t EVENTS_LOCKED;                    /*!< (@ 0x00000108) AUXPLL locked                                         */
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Status of AUXPLL                                      */
    __IM uint32_t RESERVED3[3];
    __IOM NRF_AUXPLL_CONFIG_Type CONFIG;             /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[11];
    __IOM NRF_AUXPLL_TRIM_Type TRIM;                 /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[7];
    __IOM NRF_AUXPLL_AUXPLLCTRL_Type AUXPLLCTRL;     /*!< (@ 0x00000460) (unspecified)                                         */
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IM uint32_t RESERVED7[31];
    __IOM NRF_AUXPLL_OVERRIDE_Type OVERRIDE;         /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED8[53];
    __IOM NRF_AUXPLL_DFT_Type DFT;                   /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_AUXPLL_Type;                                 /*!< Size = 1588 (0x634)                                                  */

/* AUXPLL_TASKS_START: Start the AUXPLL */
  #define AUXPLL_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                               */

/* TASKS_START @Bit 0 : Start the AUXPLL */
  #define AUXPLL_TASKS_START_TASKS_START_Pos (0UL)   /*!< Position of TASKS_START field.                                       */
  #define AUXPLL_TASKS_START_TASKS_START_Msk (0x1UL << AUXPLL_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
  #define AUXPLL_TASKS_START_TASKS_START_Min (0x1UL) /*!< Min enumerator value of TASKS_START field.                           */
  #define AUXPLL_TASKS_START_TASKS_START_Max (0x1UL) /*!< Max enumerator value of TASKS_START field.                           */
  #define AUXPLL_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                     */


/* AUXPLL_TASKS_STOP: Stop the AUXPLL */
  #define AUXPLL_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                 */

