adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define AUXPLL_INTPEND_STARTED_Pos (0UL)           /*!< Position of STARTED field.                                           */
  #define AUXPLL_INTPEND_STARTED_Msk (0x1UL << AUXPLL_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define AUXPLL_INTPEND_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define AUXPLL_INTPEND_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define AUXPLL_INTPEND_STARTED_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define AUXPLL_INTPEND_STARTED_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* STOPPED @Bit 1 : Read pending status of interrupt for event STOPPED */
  #define AUXPLL_INTPEND_STOPPED_Pos (1UL)           /*!< Position of STOPPED field.                                           */
  #define AUXPLL_INTPEND_STOPPED_Msk (0x1UL << AUXPLL_INTPEND_STOPPED_Pos) /*!< Bit mask of STOPPED field.                     */
  #define AUXPLL_INTPEND_STOPPED_Min (0x0UL)         /*!< Min enumerator value of STOPPED field.                               */
  #define AUXPLL_INTPEND_STOPPED_Max (0x1UL)         /*!< Max enumerator value of STOPPED field.                               */
  #define AUXPLL_INTPEND_STOPPED_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define AUXPLL_INTPEND_STOPPED_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* LOCKED @Bit 2 : Read pending status of interrupt for event LOCKED */
  #define AUXPLL_INTPEND_LOCKED_Pos (2UL)            /*!< Position of LOCKED field.                                            */
  #define AUXPLL_INTPEND_LOCKED_Msk (0x1UL << AUXPLL_INTPEND_LOCKED_Pos) /*!< Bit mask of LOCKED field.                        */
  #define AUXPLL_INTPEND_LOCKED_Min (0x0UL)          /*!< Min enumerator value of LOCKED field.                                */
  #define AUXPLL_INTPEND_LOCKED_Max (0x1UL)          /*!< Max enumerator value of LOCKED field.                                */
  #define AUXPLL_INTPEND_LOCKED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define AUXPLL_INTPEND_LOCKED_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* AUXPLL_STATUS: Status of AUXPLL */
  #define AUXPLL_STATUS_ResetValue (0x00000000UL)    /*!< Reset value of STATUS register.                                      */

/* MODE @Bit 0 : AUXPLL mode */
  #define AUXPLL_STATUS_MODE_Pos (0UL)               /*!< Position of MODE field.                                              */
  #define AUXPLL_STATUS_MODE_Msk (0x1UL << AUXPLL_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                                */
  #define AUXPLL_STATUS_MODE_Min (0x0UL)             /*!< Min enumerator value of MODE field.                                  */
  #define AUXPLL_STATUS_MODE_Max (0x1UL)             /*!< Max enumerator value of MODE field.                                  */
  #define AUXPLL_STATUS_MODE_Freerunning (0x0UL)     /*!< Freerunning mode                                                     */
  #define AUXPLL_STATUS_MODE_Locked (0x1UL)          /*!< Locked mode                                                          */

/* PLLRUNNING @Bit 1 : AUXPLL running status */
  #define AUXPLL_STATUS_PLLRUNNING_Pos (1UL)         /*!< Position of PLLRUNNING field.                                        */
  #define AUXPLL_STATUS_PLLRUNNING_Msk (0x1UL << AUXPLL_STATUS_PLLRUNNING_Pos) /*!< Bit mask of PLLRUNNING field.              */
  #define AUXPLL_STATUS_PLLRUNNING_Min (0x0UL)       /*!< Min enumerator value of PLLRUNNING field.                            */
  #define AUXPLL_STATUS_PLLRUNNING_Max (0x1UL)       /*!< Max enumerator value of PLLRUNNING field.                            */
  #define AUXPLL_STATUS_PLLRUNNING_Off (0x0UL)       /*!< PLL not running                                                      */
  #define AUXPLL_STATUS_PLLRUNNING_Running (0x1UL)   /*!< PLL running                                                          */

/* FREQUENCYACTUAL @Bits 16..31 : Actual fractional PLL divider ratio */
  #define AUXPLL_STATUS_FREQUENCYACTUAL_Pos (16UL)   /*!< Position of FREQUENCYACTUAL field.                                   */
  #define AUXPLL_STATUS_FREQUENCYACTUAL_Msk (0xFFFFUL << AUXPLL_STATUS_FREQUENCYACTUAL_Pos) /*!< Bit mask of FREQUENCYACTUAL
                                                                            field.*/


/* AUXPLL_MIRROR: Enable LOCK for mirrored registers */
  #define AUXPLL_MIRROR_ResetValue (0x00000000UL)    /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define AUXPLL_MIRROR_LOCK_Pos (0UL)               /*!< Position of LOCK field.                                              */
  #define AUXPLL_MIRROR_LOCK_Msk (0x1UL << AUXPLL_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                */
  #define AUXPLL_MIRROR_LOCK_Min (0x0UL)             /*!< Min enumerator value of LOCK field.                                  */
  #define AUXPLL_MIRROR_LOCK_Max (0x1UL)             /*!< Max enumerator value of LOCK field.                                  */
  #define AUXPLL_MIRROR_LOCK_Disabled (0x0UL)        /*!< Lock disabled                                                        */
  #define AUXPLL_MIRROR_LOCK_Enabled (0x1UL)         /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           AUXPM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct AUXPM_CONFIG =================================================== */
/**
  * @brief CONFIG [AUXPM_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STARTUPTIME;                       /*!< (@ 0x00000000) Time from pwrup to ready signal (0us-3us)             */
  __IOM uint32_t  SHUTDOWNTIME;                      /*!< (@ 0x00000004) Time from shutdown until to ready signal is deasserted
                                                                         (0us-3us)*/
  __IOM uint32_t  BYPASSTIME;                        /*!< (@ 0x00000008) Time from ready until bypass vref turned off
                                                                         (7us-40us)*/
  __IOM uint32_t  SETLTIME;                          /*!< (@ 0x0000000C) Time from bypass turned off to settled (0us-3us)      */
} NRF_AUXPM_CONFIG_Type;                             /*!< Size = 16 (0x010)                                                    */

/* AUXPM_CONFIG_STARTUPTIME: Time from pwrup to ready signal (0us-3us) */
  #define AUXPM_CONFIG_STARTUPTIME_ResetValue (0x00000018UL) /*!< Reset value of STARTUPTIME register.                         */

