adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VAL @Bits 0..5 : Timer value */
  #define AUXPM_CONFIG_STARTUPTIME_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define AUXPM_CONFIG_STARTUPTIME_VAL_Msk (0x3FUL << AUXPM_CONFIG_STARTUPTIME_VAL_Pos) /*!< Bit mask of VAL field.            */
  #define AUXPM_CONFIG_STARTUPTIME_VAL_Min (0x00UL)  /*!< 0 us                                                                 */
  #define AUXPM_CONFIG_STARTUPTIME_VAL_Default (0x18UL) /*!< 1.5 us                                                            */
  #define AUXPM_CONFIG_STARTUPTIME_VAL_Max (0x30UL)  /*!< 3 us                                                                 */


/* AUXPM_CONFIG_SHUTDOWNTIME: Time from shutdown until to ready signal is deasserted (0us-3us) */
  #define AUXPM_CONFIG_SHUTDOWNTIME_ResetValue (0x00000018UL) /*!< Reset value of SHUTDOWNTIME register.                       */

/* VAL @Bits 0..5 : Timer value */
  #define AUXPM_CONFIG_SHUTDOWNTIME_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define AUXPM_CONFIG_SHUTDOWNTIME_VAL_Msk (0x3FUL << AUXPM_CONFIG_SHUTDOWNTIME_VAL_Pos) /*!< Bit mask of VAL field.          */
  #define AUXPM_CONFIG_SHUTDOWNTIME_VAL_Min (0x00UL) /*!< 0 us                                                                 */
  #define AUXPM_CONFIG_SHUTDOWNTIME_VAL_Default (0x18UL) /*!< 1.5 us                                                           */
  #define AUXPM_CONFIG_SHUTDOWNTIME_VAL_Max (0x30UL) /*!< 3 us                                                                 */


/* AUXPM_CONFIG_BYPASSTIME: Time from ready until bypass vref turned off (7us-40us) */
  #define AUXPM_CONFIG_BYPASSTIME_ResetValue (0x00000070UL) /*!< Reset value of BYPASSTIME register.                           */

/* VAL @Bits 0..9 : Timer value */
  #define AUXPM_CONFIG_BYPASSTIME_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define AUXPM_CONFIG_BYPASSTIME_VAL_Msk (0x3FFUL << AUXPM_CONFIG_BYPASSTIME_VAL_Pos) /*!< Bit mask of VAL field.             */
  #define AUXPM_CONFIG_BYPASSTIME_VAL_Min (0x070UL)  /*!< 7 us                                                                 */
  #define AUXPM_CONFIG_BYPASSTIME_VAL_Default (0x070UL) /*!< 7 us                                                              */
  #define AUXPM_CONFIG_BYPASSTIME_VAL_Max (0x280UL)  /*!< 40 us                                                                */


/* AUXPM_CONFIG_SETLTIME: Time from bypass turned off to settled (0us-3us) */
  #define AUXPM_CONFIG_SETLTIME_ResetValue (0x00000018UL) /*!< Reset value of SETLTIME register.                               */

/* VAL @Bits 0..5 : Timer value */
  #define AUXPM_CONFIG_SETLTIME_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define AUXPM_CONFIG_SETLTIME_VAL_Msk (0x3FUL << AUXPM_CONFIG_SETLTIME_VAL_Pos) /*!< Bit mask of VAL field.                  */
  #define AUXPM_CONFIG_SETLTIME_VAL_Min (0x00UL)     /*!< 0 us                                                                 */
  #define AUXPM_CONFIG_SETLTIME_VAL_Default (0x18UL) /*!< 1.5 us                                                               */
  #define AUXPM_CONFIG_SETLTIME_VAL_Max (0x30UL)     /*!< 3 us                                                                 */



/* ==================================================== Struct AUXPM_TRIM ==================================================== */
/**
  * @brief TRIM [AUXPM_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VREFPM;                            /*!< (@ 0x00000000) Reference voltage trimming. Equals output voltage     */
} NRF_AUXPM_TRIM_Type;                               /*!< Size = 4 (0x004)                                                     */

/* AUXPM_TRIM_VREFPM: Reference voltage trimming. Equals output voltage */
  #define AUXPM_TRIM_VREFPM_ResetValue (0x00000000UL) /*!< Reset value of VREFPM register.                                     */

/* VAL @Bits 0..2 : Voltage trimming value. */
  #define AUXPM_TRIM_VREFPM_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define AUXPM_TRIM_VREFPM_VAL_Msk (0x7UL << AUXPM_TRIM_VREFPM_VAL_Pos) /*!< Bit mask of VAL field.                           */
  #define AUXPM_TRIM_VREFPM_VAL_Min (0x0UL)          /*!< Min enumerator value of VAL field.                                   */
  #define AUXPM_TRIM_VREFPM_VAL_Max (0x7UL)          /*!< Max enumerator value of VAL field.                                   */
  #define AUXPM_TRIM_VREFPM_VAL_Val800mV (0x0UL)     /*!< 800 mV                                                               */
  #define AUXPM_TRIM_VREFPM_VAL_Val825mV (0x1UL)     /*!< 825 mV                                                               */
  #define AUXPM_TRIM_VREFPM_VAL_Val850mV (0x2UL)     /*!< 850 mV                                                               */
  #define AUXPM_TRIM_VREFPM_VAL_Val900mV (0x3UL)     /*!< 900 mV                                                               */
  #define AUXPM_TRIM_VREFPM_VAL_Val600mV (0x4UL)     /*!< 600 mV                                                               */
  #define AUXPM_TRIM_VREFPM_VAL_Val650mV (0x5UL)     /*!< 650 mV                                                               */
  #define AUXPM_TRIM_VREFPM_VAL_Val700mV (0x6UL)     /*!< 700 mV                                                               */
  #define AUXPM_TRIM_VREFPM_VAL_Val750mV (0x7UL)     /*!< 750 mV                                                               */



/* ================================================== Struct AUXPM_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [AUXPM_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the pwrup to the analog module               */
  __IOM uint32_t  LDOENABLE;                         /*!< (@ 0x00000004) Override the LDO enable to the analog module          */
  __IOM uint32_t  BLEEDENABLE;                       /*!< (@ 0x00000008) Override the bleed enable to the analog module        */
  __IOM uint32_t  PUPVREFFILT;                       /*!< (@ 0x0000000C) Override the vref filter enable to the analog module  */
  __IOM uint32_t  BYPASSVREFFILT;                    /*!< (@ 0x00000010) Override the vref bypass to the analog module         */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000014) Override the SETTLED from the digital part            */
} NRF_AUXPM_OVERRIDE_Type;                           /*!< Size = 24 (0x018)                                                    */

/* AUXPM_OVERRIDE_PWRUP: Override the pwrup to the analog module */
  #define AUXPM_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                   */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPM_OVERRIDE_PWRUP_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define AUXPM_OVERRIDE_PWRUP_VAL_Msk (0x1UL << AUXPM_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define AUXPM_OVERRIDE_PWRUP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define AUXPM_OVERRIDE_PWRUP_EN_Msk (0x1UL << AUXPM_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define AUXPM_OVERRIDE_PWRUP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_PWRUP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_PWRUP_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define AUXPM_OVERRIDE_PWRUP_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


