adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* AUXPM_OVERRIDE_LDOENABLE: Override the LDO enable to the analog module */
  #define AUXPM_OVERRIDE_LDOENABLE_ResetValue (0x00000000UL) /*!< Reset value of LDOENABLE register.                           */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPM_OVERRIDE_LDOENABLE_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define AUXPM_OVERRIDE_LDOENABLE_VAL_Msk (0x1UL << AUXPM_OVERRIDE_LDOENABLE_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define AUXPM_OVERRIDE_LDOENABLE_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define AUXPM_OVERRIDE_LDOENABLE_EN_Msk (0x1UL << AUXPM_OVERRIDE_LDOENABLE_EN_Pos) /*!< Bit mask of EN field.                */
  #define AUXPM_OVERRIDE_LDOENABLE_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_LDOENABLE_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_LDOENABLE_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define AUXPM_OVERRIDE_LDOENABLE_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* AUXPM_OVERRIDE_BLEEDENABLE: Override the bleed enable to the analog module */
  #define AUXPM_OVERRIDE_BLEEDENABLE_ResetValue (0x00000000UL) /*!< Reset value of BLEEDENABLE register.                       */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPM_OVERRIDE_BLEEDENABLE_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define AUXPM_OVERRIDE_BLEEDENABLE_VAL_Msk (0x1UL << AUXPM_OVERRIDE_BLEEDENABLE_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define AUXPM_OVERRIDE_BLEEDENABLE_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define AUXPM_OVERRIDE_BLEEDENABLE_EN_Msk (0x1UL << AUXPM_OVERRIDE_BLEEDENABLE_EN_Pos) /*!< Bit mask of EN field.            */
  #define AUXPM_OVERRIDE_BLEEDENABLE_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_BLEEDENABLE_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_BLEEDENABLE_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define AUXPM_OVERRIDE_BLEEDENABLE_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* AUXPM_OVERRIDE_PUPVREFFILT: Override the vref filter enable to the analog module */
  #define AUXPM_OVERRIDE_PUPVREFFILT_ResetValue (0x00000000UL) /*!< Reset value of PUPVREFFILT register.                       */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPM_OVERRIDE_PUPVREFFILT_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define AUXPM_OVERRIDE_PUPVREFFILT_VAL_Msk (0x1UL << AUXPM_OVERRIDE_PUPVREFFILT_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define AUXPM_OVERRIDE_PUPVREFFILT_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define AUXPM_OVERRIDE_PUPVREFFILT_EN_Msk (0x1UL << AUXPM_OVERRIDE_PUPVREFFILT_EN_Pos) /*!< Bit mask of EN field.            */
  #define AUXPM_OVERRIDE_PUPVREFFILT_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_PUPVREFFILT_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_PUPVREFFILT_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define AUXPM_OVERRIDE_PUPVREFFILT_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* AUXPM_OVERRIDE_BYPASSVREFFILT: Override the vref bypass to the analog module */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_ResetValue (0x00000000UL) /*!< Reset value of BYPASSVREFFILT register.                 */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_VAL_Msk (0x1UL << AUXPM_OVERRIDE_BYPASSVREFFILT_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_EN_Msk (0x1UL << AUXPM_OVERRIDE_BYPASSVREFFILT_EN_Pos) /*!< Bit mask of EN field.      */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define AUXPM_OVERRIDE_BYPASSVREFFILT_EN_Enabled (0x1UL) /*!< Override is enabled                                            */


/* AUXPM_OVERRIDE_SETTLED: Override the SETTLED from the digital part */
  #define AUXPM_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPM_OVERRIDE_SETTLED_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define AUXPM_OVERRIDE_SETTLED_VAL_Msk (0x1UL << AUXPM_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define AUXPM_OVERRIDE_SETTLED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define AUXPM_OVERRIDE_SETTLED_EN_Msk (0x1UL << AUXPM_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define AUXPM_OVERRIDE_SETTLED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_SETTLED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define AUXPM_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define AUXPM_OVERRIDE_SETTLED_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */



/* ==================================================== Struct AUXPM_DFT ===================================================== */
/**
  * @brief DFT [AUXPM_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
} NRF_AUXPM_DFT_Type;                                /*!< Size = 8 (0x008)                                                     */

/* AUXPM_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define AUXPM_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                              */

/* EN @Bit 31 : (unspecified) */
  #define AUXPM_DFT_ATB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define AUXPM_DFT_ATB0CONFIG_EN_Msk (0x1UL << AUXPM_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define AUXPM_DFT_ATB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define AUXPM_DFT_ATB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define AUXPM_DFT_ATB0CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define AUXPM_DFT_ATB0CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


