adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TRIGGERED16 @Bit 16 : Write '1' to disable interrupt for event TRIGGERED[16] */
  #define BELLBOARD_INTENCLR2_TRIGGERED16_Pos (16UL) /*!< Position of TRIGGERED16 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED16_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED16_Min (0x0UL) /*!< Min enumerator value of TRIGGERED16 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED16_Max (0x1UL) /*!< Max enumerator value of TRIGGERED16 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED16_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED16_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED16_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED17 @Bit 17 : Write '1' to disable interrupt for event TRIGGERED[17] */
  #define BELLBOARD_INTENCLR2_TRIGGERED17_Pos (17UL) /*!< Position of TRIGGERED17 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED17_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED17_Min (0x0UL) /*!< Min enumerator value of TRIGGERED17 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED17_Max (0x1UL) /*!< Max enumerator value of TRIGGERED17 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED17_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED17_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED17_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED18 @Bit 18 : Write '1' to disable interrupt for event TRIGGERED[18] */
  #define BELLBOARD_INTENCLR2_TRIGGERED18_Pos (18UL) /*!< Position of TRIGGERED18 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED18_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED18_Min (0x0UL) /*!< Min enumerator value of TRIGGERED18 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED18_Max (0x1UL) /*!< Max enumerator value of TRIGGERED18 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED18_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED18_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED18_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED19 @Bit 19 : Write '1' to disable interrupt for event TRIGGERED[19] */
  #define BELLBOARD_INTENCLR2_TRIGGERED19_Pos (19UL) /*!< Position of TRIGGERED19 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED19_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED19_Min (0x0UL) /*!< Min enumerator value of TRIGGERED19 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED19_Max (0x1UL) /*!< Max enumerator value of TRIGGERED19 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED19_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED19_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED19_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED20 @Bit 20 : Write '1' to disable interrupt for event TRIGGERED[20] */
  #define BELLBOARD_INTENCLR2_TRIGGERED20_Pos (20UL) /*!< Position of TRIGGERED20 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED20_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED20_Min (0x0UL) /*!< Min enumerator value of TRIGGERED20 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED20_Max (0x1UL) /*!< Max enumerator value of TRIGGERED20 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED20_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED20_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED20_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED21 @Bit 21 : Write '1' to disable interrupt for event TRIGGERED[21] */
  #define BELLBOARD_INTENCLR2_TRIGGERED21_Pos (21UL) /*!< Position of TRIGGERED21 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED21_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED21_Min (0x0UL) /*!< Min enumerator value of TRIGGERED21 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED21_Max (0x1UL) /*!< Max enumerator value of TRIGGERED21 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED21_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED21_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED21_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED22 @Bit 22 : Write '1' to disable interrupt for event TRIGGERED[22] */
  #define BELLBOARD_INTENCLR2_TRIGGERED22_Pos (22UL) /*!< Position of TRIGGERED22 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED22_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED22_Min (0x0UL) /*!< Min enumerator value of TRIGGERED22 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED22_Max (0x1UL) /*!< Max enumerator value of TRIGGERED22 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED22_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED22_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED22_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED23 @Bit 23 : Write '1' to disable interrupt for event TRIGGERED[23] */
  #define BELLBOARD_INTENCLR2_TRIGGERED23_Pos (23UL) /*!< Position of TRIGGERED23 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED23_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED23_Pos) /*!< Bit mask of TRIGGERED23
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED23_Min (0x0UL) /*!< Min enumerator value of TRIGGERED23 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED23_Max (0x1UL) /*!< Max enumerator value of TRIGGERED23 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED23_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED23_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED23_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED24 @Bit 24 : Write '1' to disable interrupt for event TRIGGERED[24] */
  #define BELLBOARD_INTENCLR2_TRIGGERED24_Pos (24UL) /*!< Position of TRIGGERED24 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED24_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED24_Pos) /*!< Bit mask of TRIGGERED24
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED24_Min (0x0UL) /*!< Min enumerator value of TRIGGERED24 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED24_Max (0x1UL) /*!< Max enumerator value of TRIGGERED24 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED24_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED24_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED24_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED25 @Bit 25 : Write '1' to disable interrupt for event TRIGGERED[25] */
  #define BELLBOARD_INTENCLR2_TRIGGERED25_Pos (25UL) /*!< Position of TRIGGERED25 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED25_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED25_Pos) /*!< Bit mask of TRIGGERED25
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED25_Min (0x0UL) /*!< Min enumerator value of TRIGGERED25 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED25_Max (0x1UL) /*!< Max enumerator value of TRIGGERED25 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED25_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED25_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED25_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED26 @Bit 26 : Write '1' to disable interrupt for event TRIGGERED[26] */
  #define BELLBOARD_INTENCLR2_TRIGGERED26_Pos (26UL) /*!< Position of TRIGGERED26 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED26_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED26_Pos) /*!< Bit mask of TRIGGERED26
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED26_Min (0x0UL) /*!< Min enumerator value of TRIGGERED26 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED26_Max (0x1UL) /*!< Max enumerator value of TRIGGERED26 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED26_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED26_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED26_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED27 @Bit 27 : Write '1' to disable interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTENCLR2_TRIGGERED27_Pos (27UL) /*!< Position of TRIGGERED27 field.                                       */
  #define BELLBOARD_INTENCLR2_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTENCLR2_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27
                                                                            field.*/
  #define BELLBOARD_INTENCLR2_TRIGGERED27_Min (0x0UL) /*!< Min enumerator value of TRIGGERED27 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED27_Max (0x1UL) /*!< Max enumerator value of TRIGGERED27 field.                          */
  #define BELLBOARD_INTENCLR2_TRIGGERED27_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR2_TRIGGERED27_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR2_TRIGGERED27_Enabled (0x1UL) /*!< Read: Enabled                                                   */

