adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TRIGGERED24 @Bit 24 : Read pending status of interrupt for event TRIGGERED[24] */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Pos (24UL)  /*!< Position of TRIGGERED24 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED24_Pos) /*!< Bit mask of TRIGGERED24 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Min (0x0UL) /*!< Min enumerator value of TRIGGERED24 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Max (0x1UL) /*!< Max enumerator value of TRIGGERED24 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED24_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED25 @Bit 25 : Read pending status of interrupt for event TRIGGERED[25] */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Pos (25UL)  /*!< Position of TRIGGERED25 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED25_Pos) /*!< Bit mask of TRIGGERED25 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Min (0x0UL) /*!< Min enumerator value of TRIGGERED25 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Max (0x1UL) /*!< Max enumerator value of TRIGGERED25 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED25_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED26 @Bit 26 : Read pending status of interrupt for event TRIGGERED[26] */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Pos (26UL)  /*!< Position of TRIGGERED26 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED26_Pos) /*!< Bit mask of TRIGGERED26 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Min (0x0UL) /*!< Min enumerator value of TRIGGERED26 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Max (0x1UL) /*!< Max enumerator value of TRIGGERED26 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED26_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED27 @Bit 27 : Read pending status of interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Pos (27UL)  /*!< Position of TRIGGERED27 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Min (0x0UL) /*!< Min enumerator value of TRIGGERED27 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Max (0x1UL) /*!< Max enumerator value of TRIGGERED27 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED27_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED28 @Bit 28 : Read pending status of interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Pos (28UL)  /*!< Position of TRIGGERED28 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED28_Pos) /*!< Bit mask of TRIGGERED28 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Min (0x0UL) /*!< Min enumerator value of TRIGGERED28 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Max (0x1UL) /*!< Max enumerator value of TRIGGERED28 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED28_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED29 @Bit 29 : Read pending status of interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Pos (29UL)  /*!< Position of TRIGGERED29 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED29_Pos) /*!< Bit mask of TRIGGERED29 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Min (0x0UL) /*!< Min enumerator value of TRIGGERED29 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Max (0x1UL) /*!< Max enumerator value of TRIGGERED29 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED29_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED30 @Bit 30 : Read pending status of interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Pos (30UL)  /*!< Position of TRIGGERED30 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED30_Pos) /*!< Bit mask of TRIGGERED30 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Min (0x0UL) /*!< Min enumerator value of TRIGGERED30 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Max (0x1UL) /*!< Max enumerator value of TRIGGERED30 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED30_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED31 @Bit 31 : Read pending status of interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Pos (31UL)  /*!< Position of TRIGGERED31 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED31_Pos) /*!< Bit mask of TRIGGERED31 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Min (0x0UL) /*!< Min enumerator value of TRIGGERED31 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Max (0x1UL) /*!< Max enumerator value of TRIGGERED31 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED31_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Pending (0x1UL) /*!< Read: Pending                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                      BELLBOARDPUBLIC                                      ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================= Struct BELLBOARDPUBLIC ================================================== */
/**
  * @brief BELLBOARD public registers
  */
  typedef struct {                                   /*!< BELLBOARDPUBLIC Structure                                            */
    __OM uint32_t TASKS_TRIGGER[32];                 /*!< (@ 0x00000000) Task TRIGGER[n]                                       */
  } NRF_BELLBOARDPUBLIC_Type;                        /*!< Size = 128 (0x080)                                                   */

/* BELLBOARDPUBLIC_TASKS_TRIGGER: Task TRIGGER[n] */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_MaxCount (32UL) /*!< Max size of TASKS_TRIGGER[32] array.                              */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_MaxIndex (31UL) /*!< Max index of TASKS_TRIGGER[32] array.                             */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_MinIndex (0UL) /*!< Min index of TASKS_TRIGGER[32] array.                              */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGGER[32] register.              */

/* TASKS_TRIGGER @Bit 0 : Task TRIGGER[n] */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL) /*!< Position of TASKS_TRIGGER field.                          */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit
                                                                            mask of TASKS_TRIGGER field.*/
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGGER field.            */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGGER field.            */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL) /*!< Trigger task                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           BICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct BICR_POWER ==================================================== */
/**
  * @brief POWER [BICR_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Power configuration of power rails.                   */
} NRF_BICR_POWER_Type;                               /*!< Size = 4 (0x004)                                                     */

/* BICR_POWER_CONFIG: Power configuration of power rails. */
  #define BICR_POWER_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                     */

/* VDDAO5V0 @Bits 0..1 : VDD_AO_5V0 power configuration. */
  #define BICR_POWER_CONFIG_VDDAO5V0_Pos (0UL)       /*!< Position of VDDAO5V0 field.                                          */
  #define BICR_POWER_CONFIG_VDDAO5V0_Msk (0x3UL << BICR_POWER_CONFIG_VDDAO5V0_Pos) /*!< Bit mask of VDDAO5V0 field.            */
  #define BICR_POWER_CONFIG_VDDAO5V0_Min (0x1UL)     /*!< Min enumerator value of VDDAO5V0 field.                              */
  #define BICR_POWER_CONFIG_VDDAO5V0_Max (0x3UL)     /*!< Max enumerator value of VDDAO5V0 field.                              */
  #define BICR_POWER_CONFIG_VDDAO5V0_Unconfigured (0x3UL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDAO5V0_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */
  #define BICR_POWER_CONFIG_VDDAO5V0_Shorted (0x2UL) /*!< Power rail is shorted to VDD_AO_1V8. Can only be used if VDDAO1V8
                                                          field is External.*/

/* VDDAO1V8 @Bits 2..3 : VDD_AO_1V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDAO1V8_Pos (2UL)       /*!< Position of VDDAO1V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDAO1V8_Msk (0x3UL << BICR_POWER_CONFIG_VDDAO1V8_Pos) /*!< Bit mask of VDDAO1V8 field.            */
  #define BICR_POWER_CONFIG_VDDAO1V8_Min (0x0UL)     /*!< Min enumerator value of VDDAO1V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO1V8_Max (0x3UL)     /*!< Max enumerator value of VDDAO1V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO1V8_Unconfigured (0x3UL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDAO1V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDAO1V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

/* VDD1V0 @Bits 4..5 : VDD_1V0 power configuration. */
  #define BICR_POWER_CONFIG_VDD1V0_Pos (4UL)         /*!< Position of VDD1V0 field.                                            */
  #define BICR_POWER_CONFIG_VDD1V0_Msk (0x3UL << BICR_POWER_CONFIG_VDD1V0_Pos) /*!< Bit mask of VDD1V0 field.                  */
  #define BICR_POWER_CONFIG_VDD1V0_Min (0x0UL)       /*!< Min enumerator value of VDD1V0 field.                                */
  #define BICR_POWER_CONFIG_VDD1V0_Max (0x3UL)       /*!< Max enumerator value of VDD1V0 field.                                */
  #define BICR_POWER_CONFIG_VDD1V0_Unconfigured (0x3UL) /*!< Power rail is unconfigured.                                       */
  #define BICR_POWER_CONFIG_VDD1V0_Internal (0x0UL)  /*!< Power rail is configured to use the internal regulator.              */
  #define BICR_POWER_CONFIG_VDD1V0_External (0x1UL)  /*!< Power rail is configured to be externally powered.                   */

/* VDDRF1V0 @Bits 6..7 : VDD_RF_1V0 power configuration. */
  #define BICR_POWER_CONFIG_VDDRF1V0_Pos (6UL)       /*!< Position of VDDRF1V0 field.                                          */
  #define BICR_POWER_CONFIG_VDDRF1V0_Msk (0x3UL << BICR_POWER_CONFIG_VDDRF1V0_Pos) /*!< Bit mask of VDDRF1V0 field.            */
  #define BICR_POWER_CONFIG_VDDRF1V0_Min (0x1UL)     /*!< Min enumerator value of VDDRF1V0 field.                              */
  #define BICR_POWER_CONFIG_VDDRF1V0_Max (0x3UL)     /*!< Max enumerator value of VDDRF1V0 field.                              */
  #define BICR_POWER_CONFIG_VDDRF1V0_Unconfigured (0x3UL) /*!< Power rail is unconfigured or disconnected.                     */
  #define BICR_POWER_CONFIG_VDDRF1V0_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */
  #define BICR_POWER_CONFIG_VDDRF1V0_Shorted (0x2UL) /*!< Power rail is shorted to VDD_1V0.                                    */

/* VDDAO0V8 @Bits 8..9 : VDD_AO_0V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDAO0V8_Pos (8UL)       /*!< Position of VDDAO0V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDAO0V8_Msk (0x3UL << BICR_POWER_CONFIG_VDDAO0V8_Pos) /*!< Bit mask of VDDAO0V8 field.            */
  #define BICR_POWER_CONFIG_VDDAO0V8_Min (0x0UL)     /*!< Min enumerator value of VDDAO0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO0V8_Max (0x3UL)     /*!< Max enumerator value of VDDAO0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO0V8_Unconfigured (0x3UL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDAO0V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDAO0V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

