adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VDDVS0V8 @Bits 10..11 : VDD_VS_0V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDVS0V8_Pos (10UL)      /*!< Position of VDDVS0V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDVS0V8_Msk (0x3UL << BICR_POWER_CONFIG_VDDVS0V8_Pos) /*!< Bit mask of VDDVS0V8 field.            */
  #define BICR_POWER_CONFIG_VDDVS0V8_Min (0x0UL)     /*!< Min enumerator value of VDDVS0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDVS0V8_Max (0x3UL)     /*!< Max enumerator value of VDDVS0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDVS0V8_Unconfigured (0x3UL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDVS0V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDVS0V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

/* INDUCTOR @Bit 31 : DC/DC inductor presence. */
  #define BICR_POWER_CONFIG_INDUCTOR_Pos (31UL)      /*!< Position of INDUCTOR field.                                          */
  #define BICR_POWER_CONFIG_INDUCTOR_Msk (0x1UL << BICR_POWER_CONFIG_INDUCTOR_Pos) /*!< Bit mask of INDUCTOR field.            */
  #define BICR_POWER_CONFIG_INDUCTOR_Min (0x0UL)     /*!< Min enumerator value of INDUCTOR field.                              */
  #define BICR_POWER_CONFIG_INDUCTOR_Max (0x1UL)     /*!< Max enumerator value of INDUCTOR field.                              */
  #define BICR_POWER_CONFIG_INDUCTOR_NotPresent (0x1UL) /*!< DC/DC inductor is not present.                                    */
  #define BICR_POWER_CONFIG_INDUCTOR_Present (0x0UL) /*!< DC/DC inductor is present.                                           */



/* =================================================== Struct BICR_IOPORT ==================================================== */
/**
  * @brief IOPORT [BICR_IOPORT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER0;                            /*!< (@ 0x00000000) Power configuration for P0 to P7 IO ports. Note: P0 is
                                                                         not included in the fields of this register because it
                                                                         is always internally supplied and therefore considered
                                                                         'Shorted'.*/
  __IOM uint32_t  POWER1;                            /*!< (@ 0x00000004) Power configuration for P8 to P15 IO ports.           */
  __IOM uint32_t  DRIVECTRL0;                        /*!< (@ 0x00000008) Drive control configuration for P0 to P7 IO ports.    */
} NRF_BICR_IOPORT_Type;                              /*!< Size = 12 (0x00C)                                                    */

/* BICR_IOPORT_POWER0: Power configuration for P0 to P7 IO ports. Note: P0 is not included in the fields of this register
                        because it is always internally supplied and therefore considered 'Shorted'. */

  #define BICR_IOPORT_POWER0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of POWER0 register.                                    */

/* P1 @Bits 4..7 : P1 power configuration. */
  #define BICR_IOPORT_POWER0_P1_Pos (4UL)            /*!< Position of P1 field.                                                */
  #define BICR_IOPORT_POWER0_P1_Msk (0xFUL << BICR_IOPORT_POWER0_P1_Pos) /*!< Bit mask of P1 field.                            */
  #define BICR_IOPORT_POWER0_P1_Min (0x0UL)          /*!< Min enumerator value of P1 field.                                    */
  #define BICR_IOPORT_POWER0_P1_Max (0xFUL)          /*!< Max enumerator value of P1 field.                                    */
  #define BICR_IOPORT_POWER0_P1_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P1_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P1_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P1_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V. Use this option if the
                                                          port is supplied through SWEXT.*/

/* P2 @Bits 8..11 : P2 power configuration. */
  #define BICR_IOPORT_POWER0_P2_Pos (8UL)            /*!< Position of P2 field.                                                */
  #define BICR_IOPORT_POWER0_P2_Msk (0xFUL << BICR_IOPORT_POWER0_P2_Pos) /*!< Bit mask of P2 field.                            */
  #define BICR_IOPORT_POWER0_P2_Min (0x0UL)          /*!< Min enumerator value of P2 field.                                    */
  #define BICR_IOPORT_POWER0_P2_Max (0xFUL)          /*!< Max enumerator value of P2 field.                                    */
  #define BICR_IOPORT_POWER0_P2_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P2_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P2_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P2_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V. Use this option if the
                                                          port is supplied through SWEXT.*/

/* P6 @Bits 24..27 : P6 power configuration. */
  #define BICR_IOPORT_POWER0_P6_Pos (24UL)           /*!< Position of P6 field.                                                */
  #define BICR_IOPORT_POWER0_P6_Msk (0xFUL << BICR_IOPORT_POWER0_P6_Pos) /*!< Bit mask of P6 field.                            */
  #define BICR_IOPORT_POWER0_P6_Min (0x0UL)          /*!< Min enumerator value of P6 field.                                    */
  #define BICR_IOPORT_POWER0_P6_Max (0xFUL)          /*!< Max enumerator value of P6 field.                                    */
  #define BICR_IOPORT_POWER0_P6_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P6_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P6_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P6_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V. Use this option if the
                                                          port is supplied through SWEXT.*/

/* P7 @Bits 28..31 : P7 power configuration. */
  #define BICR_IOPORT_POWER0_P7_Pos (28UL)           /*!< Position of P7 field.                                                */
  #define BICR_IOPORT_POWER0_P7_Msk (0xFUL << BICR_IOPORT_POWER0_P7_Pos) /*!< Bit mask of P7 field.                            */
  #define BICR_IOPORT_POWER0_P7_Min (0x0UL)          /*!< Min enumerator value of P7 field.                                    */
  #define BICR_IOPORT_POWER0_P7_Max (0xFUL)          /*!< Max enumerator value of P7 field.                                    */
  #define BICR_IOPORT_POWER0_P7_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P7_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P7_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P7_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V. Use this option if the
                                                          port is supplied through SWEXT.*/


