adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BICR_LFOSC_LFXOCAL: LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit,
                        load capacitance, or crystal swap. */

  #define BICR_LFOSC_LFXOCAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFXOCAL register.                                   */

/* LFXOCAL @Bits 0..31 : LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board
                         circuit, load capacitance, or crystal swap. */

  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Pos (0UL)       /*!< Position of LFXOCAL field.                                           */
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Msk (0xFFFFFFFFUL << BICR_LFOSC_LFXOCAL_LFXOCAL_Pos) /*!< Bit mask of LFXOCAL field.      */
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Min (0xFFFFFFFFUL) /*!< Min enumerator value of LFXOCAL field.                            */
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Max (0xFFFFFFFFUL) /*!< Max enumerator value of LFXOCAL field.                            */
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Calibrate (0xFFFFFFFFUL) /*!< Calibrate the LFXO at startup.                              */


/* BICR_LFOSC_LFRCAUTOCALCONFIG: LFRC autocalibration configuration. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFRCAUTOCALCONFIG register.               */

/* TEMPINTERVAL @Bits 0..6 : Temperature measurement interval in 0.25 s steps. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Pos (0UL) /*!< Position of TEMPINTERVAL field.                             */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Msk (0x7FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Pos) /*!< Bit mask
                                                                            of TEMPINTERVAL field.*/

/* TEMPDELTA @Bits 8..13 : Temperature delta that should trigger a calibration in 0.25 degrees steps. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Pos (8UL) /*!< Position of TEMPDELTA field.                                   */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Msk (0x3FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Pos) /*!< Bit mask of
                                                                            TEMPDELTA field.*/

/* INTERVALMAXNO @Bits 16..20 : Maximum number of TEMPINTERVAL periods in between calibrations, independent of temperature
                                changes. */

  #define BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Pos (16UL) /*!< Position of INTERVALMAXNO field.                          */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Msk (0x1FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Pos) /*!< Bit
                                                                            mask of INTERVALMAXNO field.*/

/* ENABLE @Bit 31 : LFRC.AUTOCALCONFIG register enable. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Pos (31UL) /*!< Position of ENABLE field.                                        */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Msk (0x1UL << BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                           */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                           */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Enabled (0x0UL) /*!< LFRC.AUTOCALCONFIG register has been configured and can be
                                                                   used.*/
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Disabled (0x1UL) /*!< LFRC.AUTOCALCONFIG register has not been configured and
                                                                    cannot be used.*/



/* ==================================================== Struct BICR_HFXO ===================================================== */
/**
  * @brief HFXO [BICR_HFXO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) HFXO configuration.                                   */
  __IOM uint32_t  STARTUPTIME;                       /*!< (@ 0x00000004) HFXO startup time in us.                              */
} NRF_BICR_HFXO_Type;                                /*!< Size = 8 (0x008)                                                     */

/* BICR_HFXO_CONFIG: HFXO configuration. */
  #define BICR_HFXO_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                      */

/* MODE @Bits 8..10 : HFXO mode. */
  #define BICR_HFXO_CONFIG_MODE_Pos (8UL)            /*!< Position of MODE field.                                              */
  #define BICR_HFXO_CONFIG_MODE_Msk (0x7UL << BICR_HFXO_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define BICR_HFXO_CONFIG_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define BICR_HFXO_CONFIG_MODE_Max (0x7UL)          /*!< Max enumerator value of MODE field.                                  */
  #define BICR_HFXO_CONFIG_MODE_Unconfigured (0x7UL) /*!< The mode is unconfigured.                                            */
  #define BICR_HFXO_CONFIG_MODE_Crystal (0x0UL)      /*!< HFXO in external crystal oscillator mode.                            */
  #define BICR_HFXO_CONFIG_MODE_ExtSquare (0x3UL)    /*!< HFXO in external square wave mode.                                   */

/* LOADCAP @Bits 12..19 : Built-in load capacitors selection in 0.25 pF steps. Max. value 25.75 pF. */
  #define BICR_HFXO_CONFIG_LOADCAP_Pos (12UL)        /*!< Position of LOADCAP field.                                           */
  #define BICR_HFXO_CONFIG_LOADCAP_Msk (0xFFUL << BICR_HFXO_CONFIG_LOADCAP_Pos) /*!< Bit mask of LOADCAP field.                */
  #define BICR_HFXO_CONFIG_LOADCAP_Min (0x0UL)       /*!< Min enumerator value of LOADCAP field.                               */
  #define BICR_HFXO_CONFIG_LOADCAP_Max (0xFFUL)      /*!< Max enumerator value of LOADCAP field.                               */
  #define BICR_HFXO_CONFIG_LOADCAP_Unconfigured (0xFFUL) /*!< The built-in load capacitors is unconfigured. HFXO will not start
                                                              unless LOADCAP is configured.*/
  #define BICR_HFXO_CONFIG_LOADCAP_External (0x00UL) /*!< Do not use the built-in load capacitors, only external capacitors will
                                                          be used.*/


