adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BICR_HFXO_STARTUPTIME: HFXO startup time in us. */
  #define BICR_HFXO_STARTUPTIME_ResetValue (0xFFFFFFFFUL) /*!< Reset value of STARTUPTIME register.                            */

/* TIME @Bits 0..31 : HFXO startup time in us. */
  #define BICR_HFXO_STARTUPTIME_TIME_Pos (0UL)       /*!< Position of TIME field.                                              */
  #define BICR_HFXO_STARTUPTIME_TIME_Msk (0xFFFFFFFFUL << BICR_HFXO_STARTUPTIME_TIME_Pos) /*!< Bit mask of TIME field.         */
  #define BICR_HFXO_STARTUPTIME_TIME_Min (0xFFFFFFFFUL) /*!< Min enumerator value of TIME field.                               */
  #define BICR_HFXO_STARTUPTIME_TIME_Max (0xFFFFFFFFUL) /*!< Max enumerator value of TIME field.                               */
  #define BICR_HFXO_STARTUPTIME_TIME_Unconfigured (0xFFFFFFFFUL) /*!< Startup time has not been configured.                    */



/* ==================================================== Struct BICR_TAMPC ==================================================== */
/**
  * @brief TAMPC [BICR_TAMPC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TAMPERSWITCH;                      /*!< (@ 0x00000000) Configuration for external tamper switch detector.    */
  __IOM uint32_t  ACTIVESHIELD;                      /*!< (@ 0x00000004) Configuration for active shield channels.             */
} NRF_BICR_TAMPC_Type;                               /*!< Size = 8 (0x008)                                                     */

/* BICR_TAMPC_TAMPERSWITCH: Configuration for external tamper switch detector. */
  #define BICR_TAMPC_TAMPERSWITCH_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TAMPERSWITCH register.                         */

/* TAMPERSWITCH @Bits 0..3 : Tamper switch enable. */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Pos (0UL) /*!< Position of TAMPERSWITCH field.                                  */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Msk (0xFUL << BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Pos) /*!< Bit mask of
                                                                            TAMPERSWITCH field.*/
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Min (0x0UL) /*!< Min enumerator value of TAMPERSWITCH field.                    */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Max (0xFUL) /*!< Max enumerator value of TAMPERSWITCH field.                    */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Disabled (0xFUL) /*!< Tamper switch is disabled.                                */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Enabled (0x0UL) /*!< Tamper switch is enabled. Any value but 0xF is to be
                                                                    considered Enabled.*/


/* BICR_TAMPC_ACTIVESHIELD: Configuration for active shield channels. */
  #define BICR_TAMPC_ACTIVESHIELD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ACTIVESHIELD register.                         */

/* CHEN0 @Bits 0..3 : Active shield enable for channel 0. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Pos (0UL)    /*!< Position of CHEN0 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN0_Pos) /*!< Bit mask of CHEN0 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Min (0x0UL)  /*!< Min enumerator value of CHEN0 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Max (0xFUL)  /*!< Max enumerator value of CHEN0 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Disabled (0xFUL) /*!< Active shield channel 0 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Enabled (0x0UL) /*!< Active shield channel 0 is enabled. Any value but 0xF is to be
                                                             considered Enabled. If any channel is Enabled, the feature should
                                                             be Enabled.*/

/* CHEN1 @Bits 4..7 : Active shield enable for channel 1. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Pos (4UL)    /*!< Position of CHEN1 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN1_Pos) /*!< Bit mask of CHEN1 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Min (0x0UL)  /*!< Min enumerator value of CHEN1 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Max (0xFUL)  /*!< Max enumerator value of CHEN1 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Disabled (0xFUL) /*!< Active shield channel 1 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Enabled (0x0UL) /*!< Active shield channel 1 is enabled. Any value but 0xF is to be
                                                             considered Enabled. If any channel is Enabled, the feature should
                                                             be Enabled.*/

/* CHEN2 @Bits 8..11 : Active shield enable for channel 2. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Pos (8UL)    /*!< Position of CHEN2 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN2_Pos) /*!< Bit mask of CHEN2 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Min (0x0UL)  /*!< Min enumerator value of CHEN2 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Max (0xFUL)  /*!< Max enumerator value of CHEN2 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Disabled (0xFUL) /*!< Active shield channel 2 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Enabled (0x0UL) /*!< Active shield channel 2 is enabled. Any value but 0xF is to be
                                                             considered Enabled. If any channel is Enabled, the feature should
                                                             be Enabled.*/

/* CHEN3 @Bits 12..15 : Active shield enable for channel 3. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Pos (12UL)   /*!< Position of CHEN3 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN3_Pos) /*!< Bit mask of CHEN3 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Min (0x0UL)  /*!< Min enumerator value of CHEN3 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Max (0xFUL)  /*!< Max enumerator value of CHEN3 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Disabled (0xFUL) /*!< Active shield channel 3 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Enabled (0x0UL) /*!< Active shield channel 3 is enabled. Any value but 0xF is to be
                                                             considered Enabled. If any channel is Enabled, the feature should
                                                             be Enabled.*/



/* =================================================== Struct BICR_MISPROT =================================================== */
/**
  * @brief MISPROT [BICR_MISPROT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  POWERCONFIG;                       /*!< (@ 0x00000000) Misconfiguration report for POWER.CONFIG register.    */
  __IOM uint32_t  IOPORTPOWER;                       /*!< (@ 0x00000004) Misconfiguration report for IOPORT.POWER0 and
                                                                         IOPORT.POWER1 registers.*/
  __IOM uint32_t  IOPORTDRIVECTRL;                   /*!< (@ 0x00000008) Misconfiguration report for IOPORT.DRIVECTRL0 and
                                                                         IOPORT.DRIVECTRL1 registers.*/
} NRF_BICR_MISPROT_Type;                             /*!< Size = 12 (0x00C)                                                    */

/* BICR_MISPROT_POWERCONFIG: Misconfiguration report for POWER.CONFIG register. */
  #define BICR_MISPROT_POWERCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of POWERCONFIG register.                         */

/* POWERCONFIG @Bits 0..31 : Misconfiguration report configuration for POWER.CONFIG register. */
  #define BICR_MISPROT_POWERCONFIG_POWERCONFIG_Pos (0UL) /*!< Position of POWERCONFIG field.                                   */
  #define BICR_MISPROT_POWERCONFIG_POWERCONFIG_Msk (0xFFFFFFFFUL << BICR_MISPROT_POWERCONFIG_POWERCONFIG_Pos) /*!< Bit mask of
                                                                            POWERCONFIG field.*/
  #define BICR_MISPROT_POWERCONFIG_POWERCONFIG_Min (0x471B4B2AUL) /*!< Min enumerator value of POWERCONFIG field.              */
  #define BICR_MISPROT_POWERCONFIG_POWERCONFIG_Max (0xAA95E6D8UL) /*!< Max enumerator value of POWERCONFIG field.              */
  #define BICR_MISPROT_POWERCONFIG_POWERCONFIG_Correct (0x471B4B2AUL) /*!< POWER.CONFIG register does not have an invalid
                                                                           field.*/
  #define BICR_MISPROT_POWERCONFIG_POWERCONFIG_Incorrect (0xAA95E6D8UL) /*!< POWER.CONFIG register has at least an invalid
                                                                            field. POWER.CONFIG register is not used and should
                                                                            be corrected.*/


/* BICR_MISPROT_IOPORTPOWER: Misconfiguration report for IOPORT.POWER0 and IOPORT.POWER1 registers. */
  #define BICR_MISPROT_IOPORTPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IOPORTPOWER register.                         */

/* IOPORTPOWER @Bits 0..31 : Misconfiguration report configuration for IOPORT.POWER0 and IOPORT.POWER1 registers. */
  #define BICR_MISPROT_IOPORTPOWER_IOPORTPOWER_Pos (0UL) /*!< Position of IOPORTPOWER field.                                   */
  #define BICR_MISPROT_IOPORTPOWER_IOPORTPOWER_Msk (0xFFFFFFFFUL << BICR_MISPROT_IOPORTPOWER_IOPORTPOWER_Pos) /*!< Bit mask of
                                                                            IOPORTPOWER field.*/
  #define BICR_MISPROT_IOPORTPOWER_IOPORTPOWER_Min (0x471B4B2AUL) /*!< Min enumerator value of IOPORTPOWER field.              */
  #define BICR_MISPROT_IOPORTPOWER_IOPORTPOWER_Max (0xAA95E6D8UL) /*!< Max enumerator value of IOPORTPOWER field.              */
  #define BICR_MISPROT_IOPORTPOWER_IOPORTPOWER_Correct (0x471B4B2AUL) /*!< IOPORT.POWER0 and IOPORT.POWER1 registers do not have
                                                                           an invalid field.*/
  #define BICR_MISPROT_IOPORTPOWER_IOPORTPOWER_Incorrect (0xAA95E6D8UL) /*!< IOPORT.POWER0 and/or IOPORT.POWER1 registers have
                                                                            at least an invalid field. Invalid field is not used
                                                                            and should be corrected.*/


/* BICR_MISPROT_IOPORTDRIVECTRL: Misconfiguration report for IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1 registers. */
  #define BICR_MISPROT_IOPORTDRIVECTRL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IOPORTDRIVECTRL register.                 */

/* IOPORTDRIVECTRL0 @Bits 0..31 : Misconfiguration report for IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1 registers. */
  #define BICR_MISPROT_IOPORTDRIVECTRL_IOPORTDRIVECTRL0_Pos (0UL) /*!< Position of IOPORTDRIVECTRL0 field.                     */
  #define BICR_MISPROT_IOPORTDRIVECTRL_IOPORTDRIVECTRL0_Msk (0xFFFFFFFFUL << BICR_MISPROT_IOPORTDRIVECTRL_IOPORTDRIVECTRL0_Pos)
                                                                            /*!< Bit mask of IOPORTDRIVECTRL0 field.*/
  #define BICR_MISPROT_IOPORTDRIVECTRL_IOPORTDRIVECTRL0_Min (0x471B4B2AUL) /*!< Min enumerator value of IOPORTDRIVECTRL0 field.*/
  #define BICR_MISPROT_IOPORTDRIVECTRL_IOPORTDRIVECTRL0_Max (0xAA95E6D8UL) /*!< Max enumerator value of IOPORTDRIVECTRL0 field.*/
  #define BICR_MISPROT_IOPORTDRIVECTRL_IOPORTDRIVECTRL0_Correct (0x471B4B2AUL) /*!< IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1
                                                                            register does not have an invalid field.*/
  #define BICR_MISPROT_IOPORTDRIVECTRL_IOPORTDRIVECTRL0_Incorrect (0xAA95E6D8UL) /*!< IOPORT.DRIVECTRL0 and/or and
                                                                            IOPORT.DRIVECTRL1 registers have at least an invalid
                                                                            field. Invalid field is not used and should be
                                                                            corrected.*/


