adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENABLE @Bit 0 : Enable the profiling counters */
  #define CACHE_PROFILING_ENABLE_ENABLE_Pos (0UL)    /*!< Position of ENABLE field.                                            */
  #define CACHE_PROFILING_ENABLE_ENABLE_Msk (0x1UL << CACHE_PROFILING_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.        */
  #define CACHE_PROFILING_ENABLE_ENABLE_Min (0x0UL)  /*!< Min enumerator value of ENABLE field.                                */
  #define CACHE_PROFILING_ENABLE_ENABLE_Max (0x1UL)  /*!< Max enumerator value of ENABLE field.                                */
  #define CACHE_PROFILING_ENABLE_ENABLE_Disable (0x0UL) /*!< Disable profiling                                                 */
  #define CACHE_PROFILING_ENABLE_ENABLE_Enable (0x1UL) /*!< Enable profiling                                                   */


/* CACHE_PROFILING_CLEAR: Clear the profiling counters. */
  #define CACHE_PROFILING_CLEAR_ResetValue (0x00000000UL) /*!< Reset value of CLEAR register.                                  */

/* CLEAR @Bit 0 : Clearing the profiling counters */
  #define CACHE_PROFILING_CLEAR_CLEAR_Pos (0UL)      /*!< Position of CLEAR field.                                             */
  #define CACHE_PROFILING_CLEAR_CLEAR_Msk (0x1UL << CACHE_PROFILING_CLEAR_CLEAR_Pos) /*!< Bit mask of CLEAR field.             */
  #define CACHE_PROFILING_CLEAR_CLEAR_Min (0x1UL)    /*!< Min enumerator value of CLEAR field.                                 */
  #define CACHE_PROFILING_CLEAR_CLEAR_Max (0x1UL)    /*!< Max enumerator value of CLEAR field.                                 */
  #define CACHE_PROFILING_CLEAR_CLEAR_Clear (0x1UL)  /*!< Clear the profiling counters                                         */


/* CACHE_PROFILING_HIT: The cache hit counter for cache region. */
  #define CACHE_PROFILING_HIT_ResetValue (0x00000000UL) /*!< Reset value of HIT register.                                      */

/* HITS @Bits 0..31 : Number of cache hits */
  #define CACHE_PROFILING_HIT_HITS_Pos (0UL)         /*!< Position of HITS field.                                              */
  #define CACHE_PROFILING_HIT_HITS_Msk (0xFFFFFFFFUL << CACHE_PROFILING_HIT_HITS_Pos) /*!< Bit mask of HITS field.             */


/* CACHE_PROFILING_MISS: The cache miss counter for cache region. */
  #define CACHE_PROFILING_MISS_ResetValue (0x00000000UL) /*!< Reset value of MISS register.                                    */

/* MISSES @Bits 0..31 : Number of cache misses */
  #define CACHE_PROFILING_MISS_MISSES_Pos (0UL)      /*!< Position of MISSES field.                                            */
  #define CACHE_PROFILING_MISS_MISSES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_MISS_MISSES_Pos) /*!< Bit mask of MISSES field.     */


/* CACHE_PROFILING_LMISS: The cache line miss counter for cache region. */
  #define CACHE_PROFILING_LMISS_ResetValue (0x00000000UL) /*!< Reset value of LMISS register.                                  */

/* LMISSES @Bits 0..31 : Number of cache line misses */
  #define CACHE_PROFILING_LMISS_LMISSES_Pos (0UL)    /*!< Position of LMISSES field.                                           */
  #define CACHE_PROFILING_LMISS_LMISSES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_LMISS_LMISSES_Pos) /*!< Bit mask of LMISSES field.*/


/* CACHE_PROFILING_READS: Number of reads for cache region. */
  #define CACHE_PROFILING_READS_ResetValue (0x00000000UL) /*!< Reset value of READS register.                                  */

/* READS @Bits 0..31 : Number of reads for cache region. */
  #define CACHE_PROFILING_READS_READS_Pos (0UL)      /*!< Position of READS field.                                             */
  #define CACHE_PROFILING_READS_READS_Msk (0xFFFFFFFFUL << CACHE_PROFILING_READS_READS_Pos) /*!< Bit mask of READS field.      */


/* CACHE_PROFILING_WRITES: Number of writes for cache region. */
  #define CACHE_PROFILING_WRITES_ResetValue (0x00000000UL) /*!< Reset value of WRITES register.                                */

/* WRITES @Bits 0..31 : Number of writes for cache region. */
  #define CACHE_PROFILING_WRITES_WRITES_Pos (0UL)    /*!< Position of WRITES field.                                            */
  #define CACHE_PROFILING_WRITES_WRITES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_WRITES_WRITES_Pos) /*!< Bit mask of WRITES field. */



/* ============================================== Struct CACHE_COHERENCYSTATUS =============================================== */
/**
  * @brief COHERENCYSTATUS [CACHE_COHERENCYSTATUS] (unspecified)
  */
typedef struct {
  __IM  uint32_t  INVALIDATELINE;                    /*!< (@ 0x00000000) Performs an atomic read of the STATUS registers and
                                                                         triggering the Invalidate operation; accessible for
                                                                         non-secure access as well.*/
  __IM  uint32_t  CLEANLINE;                         /*!< (@ 0x00000004) Performs an atomic read of the STATUS registers and
                                                                         triggering the Clean operation; accessible for
                                                                         non-secure access as well.*/
  __IM  uint32_t  FLUSHLINE;                         /*!< (@ 0x00000008) Performs an atomic read of the STATUS registers and
                                                                         triggering the Flush operation; accessible for
                                                                         non-secure access as well.*/
} NRF_CACHE_COHERENCYSTATUS_Type;                    /*!< Size = 12 (0x00C)                                                    */

/* CACHE_COHERENCYSTATUS_INVALIDATELINE: Performs an atomic read of the STATUS registers and triggering the Invalidate
                                          operation; accessible for non-secure access as well. */

  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_ResetValue (0x00000000UL) /*!< Reset value of INVALIDATELINE register.          */

/* BUSY @Bit 0 : Status */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Pos (0UL) /*!< Position of BUSY field.                                     */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Msk (0x1UL << CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Pos) /*!< Bit mask
                                                                            of BUSY field.*/
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                       */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                       */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Ready (0x0UL) /*!< STATUS.READY was ready                                  */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Busy (0x1UL) /*!< STATUS.READY was busy                                    */


/* CACHE_COHERENCYSTATUS_CLEANLINE: Performs an atomic read of the STATUS registers and triggering the Clean operation;
                                     accessible for non-secure access as well. */

  #define CACHE_COHERENCYSTATUS_CLEANLINE_ResetValue (0x00000000UL) /*!< Reset value of CLEANLINE register.                    */

/* BUSY @Bit 0 : Status */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Pos (0UL) /*!< Position of BUSY field.                                          */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Msk (0x1UL << CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Pos) /*!< Bit mask of BUSY
                                                                            field.*/
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                            */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                            */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Ready (0x0UL) /*!< STATUS.READY was ready                                       */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Busy (0x1UL) /*!< STATUS.READY was busy                                         */


