adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_ERASE @Bit 0 : Erase the cache. */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Pos (0UL)    /*!< Position of TASKS_ERASE field.                                       */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Msk (0x1UL << CACHE_TASKS_ERASE_TASKS_ERASE_Pos) /*!< Bit mask of TASKS_ERASE field.   */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Min (0x1UL)  /*!< Min enumerator value of TASKS_ERASE field.                           */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Max (0x1UL)  /*!< Max enumerator value of TASKS_ERASE field.                           */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Trigger (0x1UL) /*!< Trigger task                                                      */


/* CACHE_EVENTS_DONE: Save or Restore task is done. */
  #define CACHE_EVENTS_DONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DONE register.                                */

/* EVENTS_DONE @Bit 0 : Save or Restore task is done. */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Pos (0UL)    /*!< Position of EVENTS_DONE field.                                       */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Msk (0x1UL << CACHE_EVENTS_DONE_EVENTS_DONE_Pos) /*!< Bit mask of EVENTS_DONE field.   */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Min (0x0UL)  /*!< Min enumerator value of EVENTS_DONE field.                           */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Max (0x1UL)  /*!< Max enumerator value of EVENTS_DONE field.                           */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Generated (0x1UL) /*!< Event generated                                                 */


/* CACHE_INTEN: Enable or disable interrupt */
  #define CACHE_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* DONE @Bit 0 : Enable or disable interrupt for event DONE */
  #define CACHE_INTEN_DONE_Pos (0UL)                 /*!< Position of DONE field.                                              */
  #define CACHE_INTEN_DONE_Msk (0x1UL << CACHE_INTEN_DONE_Pos) /*!< Bit mask of DONE field.                                    */
  #define CACHE_INTEN_DONE_Min (0x0UL)               /*!< Min enumerator value of DONE field.                                  */
  #define CACHE_INTEN_DONE_Max (0x1UL)               /*!< Max enumerator value of DONE field.                                  */
  #define CACHE_INTEN_DONE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define CACHE_INTEN_DONE_Enabled (0x1UL)           /*!< Enable                                                               */


/* CACHE_INTENSET: Enable interrupt */
  #define CACHE_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* DONE @Bit 0 : Write '1' to enable interrupt for event DONE */
  #define CACHE_INTENSET_DONE_Pos (0UL)              /*!< Position of DONE field.                                              */
  #define CACHE_INTENSET_DONE_Msk (0x1UL << CACHE_INTENSET_DONE_Pos) /*!< Bit mask of DONE field.                              */
  #define CACHE_INTENSET_DONE_Min (0x0UL)            /*!< Min enumerator value of DONE field.                                  */
  #define CACHE_INTENSET_DONE_Max (0x1UL)            /*!< Max enumerator value of DONE field.                                  */
  #define CACHE_INTENSET_DONE_Set (0x1UL)            /*!< Enable                                                               */
  #define CACHE_INTENSET_DONE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CACHE_INTENSET_DONE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* CACHE_INTENCLR: Disable interrupt */
  #define CACHE_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* DONE @Bit 0 : Write '1' to disable interrupt for event DONE */
  #define CACHE_INTENCLR_DONE_Pos (0UL)              /*!< Position of DONE field.                                              */
  #define CACHE_INTENCLR_DONE_Msk (0x1UL << CACHE_INTENCLR_DONE_Pos) /*!< Bit mask of DONE field.                              */
  #define CACHE_INTENCLR_DONE_Min (0x0UL)            /*!< Min enumerator value of DONE field.                                  */
  #define CACHE_INTENCLR_DONE_Max (0x1UL)            /*!< Max enumerator value of DONE field.                                  */
  #define CACHE_INTENCLR_DONE_Clear (0x1UL)          /*!< Disable                                                              */
  #define CACHE_INTENCLR_DONE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CACHE_INTENCLR_DONE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* CACHE_INTPEND: Pending interrupts */
  #define CACHE_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* DONE @Bit 0 : Read pending status of interrupt for event DONE */
  #define CACHE_INTPEND_DONE_Pos (0UL)               /*!< Position of DONE field.                                              */
  #define CACHE_INTPEND_DONE_Msk (0x1UL << CACHE_INTPEND_DONE_Pos) /*!< Bit mask of DONE field.                                */
  #define CACHE_INTPEND_DONE_Min (0x0UL)             /*!< Min enumerator value of DONE field.                                  */
  #define CACHE_INTPEND_DONE_Max (0x1UL)             /*!< Max enumerator value of DONE field.                                  */
  #define CACHE_INTPEND_DONE_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define CACHE_INTPEND_DONE_Pending (0x1UL)         /*!< Read: Pending                                                        */


/* CACHE_STATUS: Status of the cache activities. */
  #define CACHE_STATUS_ResetValue (0x00000000UL)     /*!< Reset value of STATUS register.                                      */

/* BUSY @Bit 0 : Busy status. */
  #define CACHE_STATUS_BUSY_Pos (0UL)                /*!< Position of BUSY field.                                              */
  #define CACHE_STATUS_BUSY_Msk (0x1UL << CACHE_STATUS_BUSY_Pos) /*!< Bit mask of BUSY field.                                  */
  #define CACHE_STATUS_BUSY_Min (0x0UL)              /*!< Min enumerator value of BUSY field.                                  */
  #define CACHE_STATUS_BUSY_Max (0x1UL)              /*!< Max enumerator value of BUSY field.                                  */
  #define CACHE_STATUS_BUSY_Ready (0x0UL)            /*!< Activity is done and ready for the next activity.                    */
  #define CACHE_STATUS_BUSY_Busy (0x1UL)             /*!< Activity is in progress.                                             */


/* CACHE_ENABLE: Enable cache. */
  #define CACHE_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable cache */
  #define CACHE_ENABLE_ENABLE_Pos (0UL)              /*!< Position of ENABLE field.                                            */
  #define CACHE_ENABLE_ENABLE_Msk (0x1UL << CACHE_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                            */
  #define CACHE_ENABLE_ENABLE_Min (0x0UL)            /*!< Min enumerator value of ENABLE field.                                */
  #define CACHE_ENABLE_ENABLE_Max (0x1UL)            /*!< Max enumerator value of ENABLE field.                                */
  #define CACHE_ENABLE_ENABLE_Disabled (0x0UL)       /*!< Disable cache                                                        */
  #define CACHE_ENABLE_ENABLE_Enabled (0x1UL)        /*!< Enable cache                                                         */


/* CACHE_MODE: Cache mode. */
  #define CACHE_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bit 0 : Cache mode */
  #define CACHE_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define CACHE_MODE_MODE_Msk (0x1UL << CACHE_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define CACHE_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define CACHE_MODE_MODE_Max (0x1UL)                /*!< Max enumerator value of MODE field.                                  */
  #define CACHE_MODE_MODE_Cache (0x0UL)              /*!< Cache mode                                                           */
  #define CACHE_MODE_MODE_Ram (0x1UL)                /*!< RAM mode                                                             */

/* NONCACHEABLE @Bit 1 : Enable non-cacheable cache miss feature */
  #define CACHE_MODE_NONCACHEABLE_Pos (1UL)          /*!< Position of NONCACHEABLE field.                                      */
  #define CACHE_MODE_NONCACHEABLE_Msk (0x1UL << CACHE_MODE_NONCACHEABLE_Pos) /*!< Bit mask of NONCACHEABLE field.              */
  #define CACHE_MODE_NONCACHEABLE_Min (0x0UL)        /*!< Min enumerator value of NONCACHEABLE field.                          */
  #define CACHE_MODE_NONCACHEABLE_Max (0x1UL)        /*!< Max enumerator value of NONCACHEABLE field.                          */
  #define CACHE_MODE_NONCACHEABLE_Disabled (0x0UL)   /*!< Non-cacheable cache miss feature is disabled                         */
  #define CACHE_MODE_NONCACHEABLE_Enabled (0x1UL)    /*!< Non-cacheable cache miss feature is enabled                          */

/* RAMSIZE @Bits 4..5 : RAM size */
  #define CACHE_MODE_RAMSIZE_Pos (4UL)               /*!< Position of RAMSIZE field.                                           */
  #define CACHE_MODE_RAMSIZE_Msk (0x3UL << CACHE_MODE_RAMSIZE_Pos) /*!< Bit mask of RAMSIZE field.                             */
  #define CACHE_MODE_RAMSIZE_Min (0x0UL)             /*!< Min enumerator value of RAMSIZE field.                               */
  #define CACHE_MODE_RAMSIZE_Max (0x3UL)             /*!< Max enumerator value of RAMSIZE field.                               */
  #define CACHE_MODE_RAMSIZE_All (0x0UL)             /*!< All RAM is used for cache memory                                     */
  #define CACHE_MODE_RAMSIZE_Half (0x1UL)            /*!< Half of the RAM is used for cache memory                             */
  #define CACHE_MODE_RAMSIZE_Quarter (0x2UL)         /*!< Quarter of the RAM is used for cache memory                          */
  #define CACHE_MODE_RAMSIZE_None (0x3UL)            /*!< None of the RAM is used for cache memory                             */

/* VCACHENUM @Bits 8..9 : Number of virtual cache regions. */
  #define CACHE_MODE_VCACHENUM_Pos (8UL)             /*!< Position of VCACHENUM field.                                         */
  #define CACHE_MODE_VCACHENUM_Msk (0x3UL << CACHE_MODE_VCACHENUM_Pos) /*!< Bit mask of VCACHENUM field.                       */
  #define CACHE_MODE_VCACHENUM_Min (0x0UL)           /*!< Min enumerator value of VCACHENUM field.                             */
  #define CACHE_MODE_VCACHENUM_Max (0x3UL)           /*!< Max enumerator value of VCACHENUM field.                             */
  #define CACHE_MODE_VCACHENUM_One (0x0UL)           /*!< Whole cache is one region.                                           */
  #define CACHE_MODE_VCACHENUM_Two (0x1UL)           /*!< Whole cache is divided into two equal virtual regions.               */
  #define CACHE_MODE_VCACHENUM_Four (0x2UL)          /*!< Whole cache is divided into four equal virtual regions.              */
  #define CACHE_MODE_VCACHENUM_Eight (0x3UL)         /*!< Whole cache is divided into eight equal virtual regions.             */


