adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* NMBITS @Bits 5..6 : Interrupt privilege mode. */
  #define CLIC_CLIC_CLICCFG_NMBITS_Pos (5UL)         /*!< Position of NMBITS field.                                            */
  #define CLIC_CLIC_CLICCFG_NMBITS_Msk (0x3UL << CLIC_CLIC_CLICCFG_NMBITS_Pos) /*!< Bit mask of NMBITS field.                  */
  #define CLIC_CLIC_CLICCFG_NMBITS_Min (0x0UL)       /*!< Min enumerator value of NMBITS field.                                */
  #define CLIC_CLIC_CLICCFG_NMBITS_Max (0x0UL)       /*!< Max enumerator value of NMBITS field.                                */
  #define CLIC_CLIC_CLICCFG_NMBITS_ModeM (0x0UL)     /*!< All interrupts are M-mode only                                       */


/* CLIC_CLIC_CLICINFO: CLIC information. */
  #define CLIC_CLIC_CLICINFO_ResetValue (0x00401FFFUL) /*!< Reset value of CLICINFO register.                                  */

/* NUMINTERRUPTS @Bits 0..12 : Maximum number of interrupts supported. */
  #define CLIC_CLIC_CLICINFO_NUMINTERRUPTS_Pos (0UL) /*!< Position of NUMINTERRUPTS field.                                     */
  #define CLIC_CLIC_CLICINFO_NUMINTERRUPTS_Msk (0x1FFFUL << CLIC_CLIC_CLICINFO_NUMINTERRUPTS_Pos) /*!< Bit mask of NUMINTERRUPTS
                                                                            field.*/

/* VERSION @Bits 13..20 : Version */
  #define CLIC_CLIC_CLICINFO_VERSION_Pos (13UL)      /*!< Position of VERSION field.                                           */
  #define CLIC_CLIC_CLICINFO_VERSION_Msk (0xFFUL << CLIC_CLIC_CLICINFO_VERSION_Pos) /*!< Bit mask of VERSION field.            */

/* NUMTRIGGER @Bits 25..30 : Number of maximum interrupt triggers supported */
  #define CLIC_CLIC_CLICINFO_NUMTRIGGER_Pos (25UL)   /*!< Position of NUMTRIGGER field.                                        */
  #define CLIC_CLIC_CLICINFO_NUMTRIGGER_Msk (0x3FUL << CLIC_CLIC_CLICINFO_NUMTRIGGER_Pos) /*!< Bit mask of NUMTRIGGER field.   */


/* CLIC_CLIC_CLICINT: Interrupt control register for IRQ number [n]. */
  #define CLIC_CLIC_CLICINT_MaxCount (480UL)         /*!< Max size of CLICINT[480] array.                                      */
  #define CLIC_CLIC_CLICINT_MaxIndex (479UL)         /*!< Max index of CLICINT[480] array.                                     */
  #define CLIC_CLIC_CLICINT_MinIndex (0UL)           /*!< Min index of CLICINT[480] array.                                     */
  #define CLIC_CLIC_CLICINT_ResetValue (0x3FC30000UL) /*!< Reset value of CLICINT[480] register.                               */

/* IP @Bit 0 : Interrupt Pending bit. */
  #define CLIC_CLIC_CLICINT_IP_Pos (0UL)             /*!< Position of IP field.                                                */
  #define CLIC_CLIC_CLICINT_IP_Msk (0x1UL << CLIC_CLIC_CLICINT_IP_Pos) /*!< Bit mask of IP field.                              */
  #define CLIC_CLIC_CLICINT_IP_Min (0x0UL)           /*!< Min enumerator value of IP field.                                    */
  #define CLIC_CLIC_CLICINT_IP_Max (0x1UL)           /*!< Max enumerator value of IP field.                                    */
  #define CLIC_CLIC_CLICINT_IP_NotPending (0x0UL)    /*!< Interrupt not pending                                                */
  #define CLIC_CLIC_CLICINT_IP_Pending (0x1UL)       /*!< Interrupt pending                                                    */

/* READ1 @Bits 1..7 : Read as 0, write ignored. */
  #define CLIC_CLIC_CLICINT_READ1_Pos (1UL)          /*!< Position of READ1 field.                                             */
  #define CLIC_CLIC_CLICINT_READ1_Msk (0x7FUL << CLIC_CLIC_CLICINT_READ1_Pos) /*!< Bit mask of READ1 field.                    */

/* IE @Bit 8 : Interrupt enable bit. */
  #define CLIC_CLIC_CLICINT_IE_Pos (8UL)             /*!< Position of IE field.                                                */
  #define CLIC_CLIC_CLICINT_IE_Msk (0x1UL << CLIC_CLIC_CLICINT_IE_Pos) /*!< Bit mask of IE field.                              */
  #define CLIC_CLIC_CLICINT_IE_Min (0x0UL)           /*!< Min enumerator value of IE field.                                    */
  #define CLIC_CLIC_CLICINT_IE_Max (0x1UL)           /*!< Max enumerator value of IE field.                                    */
  #define CLIC_CLIC_CLICINT_IE_Disabled (0x0UL)      /*!< Interrupt disabled                                                   */
  #define CLIC_CLIC_CLICINT_IE_Enabled (0x1UL)       /*!< Interrupt enabled                                                    */

/* READ2 @Bits 9..15 : Read as 0, write ignored. */
  #define CLIC_CLIC_CLICINT_READ2_Pos (9UL)          /*!< Position of READ2 field.                                             */
  #define CLIC_CLIC_CLICINT_READ2_Msk (0x7FUL << CLIC_CLIC_CLICINT_READ2_Pos) /*!< Bit mask of READ2 field.                    */

/* SHV @Bit 16 : Selective Hardware Vectoring. */
  #define CLIC_CLIC_CLICINT_SHV_Pos (16UL)           /*!< Position of SHV field.                                               */
  #define CLIC_CLIC_CLICINT_SHV_Msk (0x1UL << CLIC_CLIC_CLICINT_SHV_Pos) /*!< Bit mask of SHV field.                           */
  #define CLIC_CLIC_CLICINT_SHV_Min (0x1UL)          /*!< Min enumerator value of SHV field.                                   */
  #define CLIC_CLIC_CLICINT_SHV_Max (0x1UL)          /*!< Max enumerator value of SHV field.                                   */
  #define CLIC_CLIC_CLICINT_SHV_Vectored (0x1UL)     /*!< Hardware vectored                                                    */

/* TRIG @Bits 17..18 : Trigger type and polarity for each interrupt input. */
  #define CLIC_CLIC_CLICINT_TRIG_Pos (17UL)          /*!< Position of TRIG field.                                              */
  #define CLIC_CLIC_CLICINT_TRIG_Msk (0x3UL << CLIC_CLIC_CLICINT_TRIG_Pos) /*!< Bit mask of TRIG field.                        */
  #define CLIC_CLIC_CLICINT_TRIG_Min (0x1UL)         /*!< Min enumerator value of TRIG field.                                  */
  #define CLIC_CLIC_CLICINT_TRIG_Max (0x1UL)         /*!< Max enumerator value of TRIG field.                                  */
  #define CLIC_CLIC_CLICINT_TRIG_EdgeTriggered (0x1UL) /*!< Interrupts are edge-triggered                                      */

/* MODE @Bits 22..23 : Privilege mode. */
  #define CLIC_CLIC_CLICINT_MODE_Pos (22UL)          /*!< Position of MODE field.                                              */
  #define CLIC_CLIC_CLICINT_MODE_Msk (0x3UL << CLIC_CLIC_CLICINT_MODE_Pos) /*!< Bit mask of MODE field.                        */
  #define CLIC_CLIC_CLICINT_MODE_Min (0x3UL)         /*!< Min enumerator value of MODE field.                                  */
  #define CLIC_CLIC_CLICINT_MODE_Max (0x3UL)         /*!< Max enumerator value of MODE field.                                  */
  #define CLIC_CLIC_CLICINT_MODE_MachineMode (0x3UL) /*!< Machine mode                                                         */

/* PRIORITY @Bits 24..31 : Interrupt priority level */
  #define CLIC_CLIC_CLICINT_PRIORITY_Pos (24UL)      /*!< Position of PRIORITY field.                                          */
  #define CLIC_CLIC_CLICINT_PRIORITY_Msk (0xFFUL << CLIC_CLIC_CLICINT_PRIORITY_Pos) /*!< Bit mask of PRIORITY field.           */
  #define CLIC_CLIC_CLICINT_PRIORITY_Min (0x3FUL)    /*!< Min enumerator value of PRIORITY field.                              */
  #define CLIC_CLIC_CLICINT_PRIORITY_Max (0xFFUL)    /*!< Max enumerator value of PRIORITY field.                              */
  #define CLIC_CLIC_CLICINT_PRIORITY_PRIOLEVEL0 (0x3FUL) /*!< Priority level 0                                                 */
  #define CLIC_CLIC_CLICINT_PRIORITY_PRIOLEVEL1 (0x7FUL) /*!< Priority level 1                                                 */
  #define CLIC_CLIC_CLICINT_PRIORITY_PRIOLEVEL2 (0xBFUL) /*!< Priority level 2                                                 */
  #define CLIC_CLIC_CLICINT_PRIORITY_PRIOLEVEL3 (0xFFUL) /*!< Priority level 3                                                 */


/* ======================================================= Struct CLIC ======================================================= */
/**
  * @brief VPR CLIC registers
  */
  typedef struct {                                   /*!< CLIC Structure                                                       */
    __IOM NRF_CLIC_CLIC_Type CLIC;                   /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_CLIC_Type;                                   /*!< Size = 6016 (0x1780)                                                 */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          CLKMON                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct CLKMON ====================================================== */
/**
  * @brief CLKMON peripheral
  */
  typedef struct {                                   /*!< CLKMON Structure                                                     */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_LFXOERROR;                 /*!< (@ 0x00000100) LFXO error detected                                   */
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Clock monitor status                                  */
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000404) Enable the clock monitor                              */
  } NRF_CLKMON_Type;                                 /*!< Size = 1032 (0x408)                                                  */

/* CLKMON_EVENTS_LFXOERROR: LFXO error detected */
  #define CLKMON_EVENTS_LFXOERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LFXOERROR register.                     */

