adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EVENTS_LFXOERROR @Bit 0 : LFXO error detected */
  #define CLKMON_EVENTS_LFXOERROR_EVENTS_LFXOERROR_Pos (0UL) /*!< Position of EVENTS_LFXOERROR field.                          */
  #define CLKMON_EVENTS_LFXOERROR_EVENTS_LFXOERROR_Msk (0x1UL << CLKMON_EVENTS_LFXOERROR_EVENTS_LFXOERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_LFXOERROR field.*/
  #define CLKMON_EVENTS_LFXOERROR_EVENTS_LFXOERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_LFXOERROR field.            */
  #define CLKMON_EVENTS_LFXOERROR_EVENTS_LFXOERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_LFXOERROR field.            */
  #define CLKMON_EVENTS_LFXOERROR_EVENTS_LFXOERROR_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define CLKMON_EVENTS_LFXOERROR_EVENTS_LFXOERROR_Generated (0x1UL) /*!< Event generated                                      */


/* CLKMON_INTEN: Enable or disable interrupt */
  #define CLKMON_INTEN_ResetValue (0x00000000UL)     /*!< Reset value of INTEN register.                                       */

/* LFXOERROR @Bit 0 : Enable or disable interrupt for event LFXOERROR */
  #define CLKMON_INTEN_LFXOERROR_Pos (0UL)           /*!< Position of LFXOERROR field.                                         */
  #define CLKMON_INTEN_LFXOERROR_Msk (0x1UL << CLKMON_INTEN_LFXOERROR_Pos) /*!< Bit mask of LFXOERROR field.                   */
  #define CLKMON_INTEN_LFXOERROR_Min (0x0UL)         /*!< Min enumerator value of LFXOERROR field.                             */
  #define CLKMON_INTEN_LFXOERROR_Max (0x1UL)         /*!< Max enumerator value of LFXOERROR field.                             */
  #define CLKMON_INTEN_LFXOERROR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define CLKMON_INTEN_LFXOERROR_Enabled (0x1UL)     /*!< Enable                                                               */


/* CLKMON_INTENSET: Enable interrupt */
  #define CLKMON_INTENSET_ResetValue (0x00000000UL)  /*!< Reset value of INTENSET register.                                    */

/* LFXOERROR @Bit 0 : Write '1' to enable interrupt for event LFXOERROR */
  #define CLKMON_INTENSET_LFXOERROR_Pos (0UL)        /*!< Position of LFXOERROR field.                                         */
  #define CLKMON_INTENSET_LFXOERROR_Msk (0x1UL << CLKMON_INTENSET_LFXOERROR_Pos) /*!< Bit mask of LFXOERROR field.             */
  #define CLKMON_INTENSET_LFXOERROR_Min (0x0UL)      /*!< Min enumerator value of LFXOERROR field.                             */
  #define CLKMON_INTENSET_LFXOERROR_Max (0x1UL)      /*!< Max enumerator value of LFXOERROR field.                             */
  #define CLKMON_INTENSET_LFXOERROR_Set (0x1UL)      /*!< Enable                                                               */
  #define CLKMON_INTENSET_LFXOERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define CLKMON_INTENSET_LFXOERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* CLKMON_INTENCLR: Disable interrupt */
  #define CLKMON_INTENCLR_ResetValue (0x00000000UL)  /*!< Reset value of INTENCLR register.                                    */

/* LFXOERROR @Bit 0 : Write '1' to disable interrupt for event LFXOERROR */
  #define CLKMON_INTENCLR_LFXOERROR_Pos (0UL)        /*!< Position of LFXOERROR field.                                         */
  #define CLKMON_INTENCLR_LFXOERROR_Msk (0x1UL << CLKMON_INTENCLR_LFXOERROR_Pos) /*!< Bit mask of LFXOERROR field.             */
  #define CLKMON_INTENCLR_LFXOERROR_Min (0x0UL)      /*!< Min enumerator value of LFXOERROR field.                             */
  #define CLKMON_INTENCLR_LFXOERROR_Max (0x1UL)      /*!< Max enumerator value of LFXOERROR field.                             */
  #define CLKMON_INTENCLR_LFXOERROR_Clear (0x1UL)    /*!< Disable                                                              */
  #define CLKMON_INTENCLR_LFXOERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define CLKMON_INTENCLR_LFXOERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* CLKMON_INTPEND: Pending interrupts */
  #define CLKMON_INTPEND_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND register.                                     */

/* LFXOERROR @Bit 0 : Read pending status of interrupt for event LFXOERROR */
  #define CLKMON_INTPEND_LFXOERROR_Pos (0UL)         /*!< Position of LFXOERROR field.                                         */
  #define CLKMON_INTPEND_LFXOERROR_Msk (0x1UL << CLKMON_INTPEND_LFXOERROR_Pos) /*!< Bit mask of LFXOERROR field.               */
  #define CLKMON_INTPEND_LFXOERROR_Min (0x0UL)       /*!< Min enumerator value of LFXOERROR field.                             */
  #define CLKMON_INTPEND_LFXOERROR_Max (0x1UL)       /*!< Max enumerator value of LFXOERROR field.                             */
  #define CLKMON_INTPEND_LFXOERROR_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define CLKMON_INTPEND_LFXOERROR_Pending (0x1UL)   /*!< Read: Pending                                                        */


/* CLKMON_STATUS: Clock monitor status */
  #define CLKMON_STATUS_ResetValue (0x00000000UL)    /*!< Reset value of STATUS register.                                      */

/* ERROR @Bit 0 : LFXO error status */
  #define CLKMON_STATUS_ERROR_Pos (0UL)              /*!< Position of ERROR field.                                             */
  #define CLKMON_STATUS_ERROR_Msk (0x1UL << CLKMON_STATUS_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define CLKMON_STATUS_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define CLKMON_STATUS_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define CLKMON_STATUS_ERROR_NotDetected (0x0UL)    /*!< No error detected                                                    */
  #define CLKMON_STATUS_ERROR_Detected (0x1UL)       /*!< Error detected                                                       */


