adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================= Struct CLOCK_LFCLKCTRL ================================================== */
/**
  * @brief LFCLKCTRL [CLOCK_LFCLKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ALWAYSRUN;                         /*!< (@ 0x00000000) Force the LF clock source and tree running always     */
  __IOM uint32_t  SRC;                               /*!< (@ 0x00000004) Select the clock source for LF clock                  */
} NRF_CLOCK_LFCLKCTRL_Type;                          /*!< Size = 8 (0x008)                                                     */

/* CLOCK_LFCLKCTRL_ALWAYSRUN: Force the LF clock source and tree running always */
  #define CLOCK_LFCLKCTRL_ALWAYSRUN_ResetValue (0x00000001UL) /*!< Reset value of ALWAYSRUN register.                          */

/* FORCE @Bit 0 : Force the clock always running */
  #define CLOCK_LFCLKCTRL_ALWAYSRUN_FORCE_Pos (0UL)  /*!< Position of FORCE field.                                             */
  #define CLOCK_LFCLKCTRL_ALWAYSRUN_FORCE_Msk (0x1UL << CLOCK_LFCLKCTRL_ALWAYSRUN_FORCE_Pos) /*!< Bit mask of FORCE field.     */
  #define CLOCK_LFCLKCTRL_ALWAYSRUN_FORCE_Min (0x0UL) /*!< Min enumerator value of FORCE field.                                */
  #define CLOCK_LFCLKCTRL_ALWAYSRUN_FORCE_Max (0x1UL) /*!< Max enumerator value of FORCE field.                                */
  #define CLOCK_LFCLKCTRL_ALWAYSRUN_FORCE_Automatic (0x0UL) /*!< Automatic clock control enabled                               */
  #define CLOCK_LFCLKCTRL_ALWAYSRUN_FORCE_AlwaysRun (0x1UL) /*!< Clock always running                                          */


/* CLOCK_LFCLKCTRL_SRC: Select the clock source for LF clock */
  #define CLOCK_LFCLKCTRL_SRC_ResetValue (0x00000008UL) /*!< Reset value of SRC register.                                      */

/* LFLPRC @Bit 0 : Select LFLPRC as clock source */
  #define CLOCK_LFCLKCTRL_SRC_LFLPRC_Pos (0UL)       /*!< Position of LFLPRC field.                                            */
  #define CLOCK_LFCLKCTRL_SRC_LFLPRC_Msk (0x1UL << CLOCK_LFCLKCTRL_SRC_LFLPRC_Pos) /*!< Bit mask of LFLPRC field.              */
  #define CLOCK_LFCLKCTRL_SRC_LFLPRC_Min (0x0UL)     /*!< Min enumerator value of LFLPRC field.                                */
  #define CLOCK_LFCLKCTRL_SRC_LFLPRC_Max (0x1UL)     /*!< Max enumerator value of LFLPRC field.                                */
  #define CLOCK_LFCLKCTRL_SRC_LFLPRC_UnSelected (0x0UL) /*!< LFLPRC is unselected                                              */
  #define CLOCK_LFCLKCTRL_SRC_LFLPRC_Selected (0x1UL) /*!< LFLPRC is selected                                                  */

/* LFRC @Bit 1 : Select LFRC as clock source */
  #define CLOCK_LFCLKCTRL_SRC_LFRC_Pos (1UL)         /*!< Position of LFRC field.                                              */
  #define CLOCK_LFCLKCTRL_SRC_LFRC_Msk (0x1UL << CLOCK_LFCLKCTRL_SRC_LFRC_Pos) /*!< Bit mask of LFRC field.                    */
  #define CLOCK_LFCLKCTRL_SRC_LFRC_Min (0x0UL)       /*!< Min enumerator value of LFRC field.                                  */
  #define CLOCK_LFCLKCTRL_SRC_LFRC_Max (0x1UL)       /*!< Max enumerator value of LFRC field.                                  */
  #define CLOCK_LFCLKCTRL_SRC_LFRC_UnSelected (0x0UL) /*!< LFRC is unselected                                                  */
  #define CLOCK_LFCLKCTRL_SRC_LFRC_Selected (0x1UL)  /*!< LFRC is selected                                                     */

/* LFXO @Bit 2 : Select LFXO as clock source */
  #define CLOCK_LFCLKCTRL_SRC_LFXO_Pos (2UL)         /*!< Position of LFXO field.                                              */
  #define CLOCK_LFCLKCTRL_SRC_LFXO_Msk (0x1UL << CLOCK_LFCLKCTRL_SRC_LFXO_Pos) /*!< Bit mask of LFXO field.                    */
  #define CLOCK_LFCLKCTRL_SRC_LFXO_Min (0x0UL)       /*!< Min enumerator value of LFXO field.                                  */
  #define CLOCK_LFCLKCTRL_SRC_LFXO_Max (0x1UL)       /*!< Max enumerator value of LFXO field.                                  */
  #define CLOCK_LFCLKCTRL_SRC_LFXO_UnSelected (0x0UL) /*!< LFXO is unselected                                                  */
  #define CLOCK_LFCLKCTRL_SRC_LFXO_Selected (0x1UL)  /*!< LFXO is selected                                                     */

/* SYNTH @Bit 3 : Synthesized LF as clock source */
  #define CLOCK_LFCLKCTRL_SRC_SYNTH_Pos (3UL)        /*!< Position of SYNTH field.                                             */
  #define CLOCK_LFCLKCTRL_SRC_SYNTH_Msk (0x1UL << CLOCK_LFCLKCTRL_SRC_SYNTH_Pos) /*!< Bit mask of SYNTH field.                 */
  #define CLOCK_LFCLKCTRL_SRC_SYNTH_Min (0x0UL)      /*!< Min enumerator value of SYNTH field.                                 */
  #define CLOCK_LFCLKCTRL_SRC_SYNTH_Max (0x1UL)      /*!< Max enumerator value of SYNTH field.                                 */
  #define CLOCK_LFCLKCTRL_SRC_SYNTH_UnSelected (0x0UL) /*!< SYNTH is unselected                                                */
  #define CLOCK_LFCLKCTRL_SRC_SYNTH_Selected (0x1UL) /*!< SYNTH is selected                                                    */



/* =================================================== Struct CLOCK_CONFIG =================================================== */
/**
  * @brief CONFIG [CLOCK_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SETUP;                             /*!< (@ 0x00000000) Peripheral setup                                      */
  __IOM uint32_t  THRESHOLD;                         /*!< (@ 0x00000004) Threshold limit while clock switching                 */
} NRF_CLOCK_CONFIG_Type;                             /*!< Size = 8 (0x008)                                                     */

/* CLOCK_CONFIG_SETUP: Peripheral setup */
  #define CLOCK_CONFIG_SETUP_ResetValue (0x00000000UL) /*!< Reset value of SETUP register.                                     */

/* RESET @Bit 0 : Reset the peripheral */
  #define CLOCK_CONFIG_SETUP_RESET_Pos (0UL)         /*!< Position of RESET field.                                             */
  #define CLOCK_CONFIG_SETUP_RESET_Msk (0x1UL << CLOCK_CONFIG_SETUP_RESET_Pos) /*!< Bit mask of RESET field.                   */
  #define CLOCK_CONFIG_SETUP_RESET_Min (0x0UL)       /*!< Min enumerator value of RESET field.                                 */
  #define CLOCK_CONFIG_SETUP_RESET_Max (0x1UL)       /*!< Max enumerator value of RESET field.                                 */
  #define CLOCK_CONFIG_SETUP_RESET_Disabled (0x0UL)  /*!< Disabled                                                             */
  #define CLOCK_CONFIG_SETUP_RESET_Enabled (0x1UL)   /*!< Enabled                                                              */

/* BYPASSLFLPRC @Bit 4 : Enable bypass LFLPRC */
  #define CLOCK_CONFIG_SETUP_BYPASSLFLPRC_Pos (4UL)  /*!< Position of BYPASSLFLPRC field.                                      */
  #define CLOCK_CONFIG_SETUP_BYPASSLFLPRC_Msk (0x1UL << CLOCK_CONFIG_SETUP_BYPASSLFLPRC_Pos) /*!< Bit mask of BYPASSLFLPRC
                                                                            field.*/
  #define CLOCK_CONFIG_SETUP_BYPASSLFLPRC_Min (0x0UL) /*!< Min enumerator value of BYPASSLFLPRC field.                         */
  #define CLOCK_CONFIG_SETUP_BYPASSLFLPRC_Max (0x1UL) /*!< Max enumerator value of BYPASSLFLPRC field.                         */
  #define CLOCK_CONFIG_SETUP_BYPASSLFLPRC_Disabled (0x0UL) /*!< Disabled                                                       */
  #define CLOCK_CONFIG_SETUP_BYPASSLFLPRC_Enabled (0x1UL) /*!< Enabled                                                         */

/* BYPASSLFRC @Bit 5 : Enable bypass LFRC */
  #define CLOCK_CONFIG_SETUP_BYPASSLFRC_Pos (5UL)    /*!< Position of BYPASSLFRC field.                                        */
  #define CLOCK_CONFIG_SETUP_BYPASSLFRC_Msk (0x1UL << CLOCK_CONFIG_SETUP_BYPASSLFRC_Pos) /*!< Bit mask of BYPASSLFRC field.    */
  #define CLOCK_CONFIG_SETUP_BYPASSLFRC_Min (0x0UL)  /*!< Min enumerator value of BYPASSLFRC field.                            */
  #define CLOCK_CONFIG_SETUP_BYPASSLFRC_Max (0x1UL)  /*!< Max enumerator value of BYPASSLFRC field.                            */
  #define CLOCK_CONFIG_SETUP_BYPASSLFRC_Disabled (0x0UL) /*!< Disabled                                                         */
  #define CLOCK_CONFIG_SETUP_BYPASSLFRC_Enabled (0x1UL) /*!< Enabled                                                           */

/* BYPASSLFXO @Bit 6 : Enable bypass LFXO */
  #define CLOCK_CONFIG_SETUP_BYPASSLFXO_Pos (6UL)    /*!< Position of BYPASSLFXO field.                                        */
  #define CLOCK_CONFIG_SETUP_BYPASSLFXO_Msk (0x1UL << CLOCK_CONFIG_SETUP_BYPASSLFXO_Pos) /*!< Bit mask of BYPASSLFXO field.    */
  #define CLOCK_CONFIG_SETUP_BYPASSLFXO_Min (0x0UL)  /*!< Min enumerator value of BYPASSLFXO field.                            */
  #define CLOCK_CONFIG_SETUP_BYPASSLFXO_Max (0x1UL)  /*!< Max enumerator value of BYPASSLFXO field.                            */
  #define CLOCK_CONFIG_SETUP_BYPASSLFXO_Disabled (0x0UL) /*!< Disabled                                                         */
  #define CLOCK_CONFIG_SETUP_BYPASSLFXO_Enabled (0x1UL) /*!< Enabled                                                           */

/* BYPASSSYNTH @Bit 7 : Enable bypass SYNTH */
  #define CLOCK_CONFIG_SETUP_BYPASSSYNTH_Pos (7UL)   /*!< Position of BYPASSSYNTH field.                                       */
  #define CLOCK_CONFIG_SETUP_BYPASSSYNTH_Msk (0x1UL << CLOCK_CONFIG_SETUP_BYPASSSYNTH_Pos) /*!< Bit mask of BYPASSSYNTH field. */
  #define CLOCK_CONFIG_SETUP_BYPASSSYNTH_Min (0x0UL) /*!< Min enumerator value of BYPASSSYNTH field.                           */
  #define CLOCK_CONFIG_SETUP_BYPASSSYNTH_Max (0x1UL) /*!< Max enumerator value of BYPASSSYNTH field.                           */
  #define CLOCK_CONFIG_SETUP_BYPASSSYNTH_Disabled (0x0UL) /*!< Disabled                                                        */
  #define CLOCK_CONFIG_SETUP_BYPASSSYNTH_Enabled (0x1UL) /*!< Enabled                                                          */

/* TIMEOUT @Bits 8..15 : Timeout for the clock alignment process */
  #define CLOCK_CONFIG_SETUP_TIMEOUT_Pos (8UL)       /*!< Position of TIMEOUT field.                                           */
  #define CLOCK_CONFIG_SETUP_TIMEOUT_Msk (0xFFUL << CLOCK_CONFIG_SETUP_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.            */
  #define CLOCK_CONFIG_SETUP_TIMEOUT_Min (0x00UL)    /*!< Min value of TIMEOUT field.                                          */
  #define CLOCK_CONFIG_SETUP_TIMEOUT_Max (0xFFUL)    /*!< Max size of TIMEOUT field.                                           */


