adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CLOCK_CONFIG_THRESHOLD: Threshold limit while clock switching */
  #define CLOCK_CONFIG_THRESHOLD_ResetValue (0x00043B14UL) /*!< Reset value of THRESHOLD register.                             */

/* LOW @Bits 0..7 : Threshold low limit while clock switching */
  #define CLOCK_CONFIG_THRESHOLD_LOW_Pos (0UL)       /*!< Position of LOW field.                                               */
  #define CLOCK_CONFIG_THRESHOLD_LOW_Msk (0xFFUL << CLOCK_CONFIG_THRESHOLD_LOW_Pos) /*!< Bit mask of LOW field.                */
  #define CLOCK_CONFIG_THRESHOLD_LOW_Min (0x00UL)    /*!< Min value of LOW field.                                              */
  #define CLOCK_CONFIG_THRESHOLD_LOW_Max (0xFFUL)    /*!< Max size of LOW field.                                               */

/* HIGH @Bits 8..15 : Threshold high limit while clock switching */
  #define CLOCK_CONFIG_THRESHOLD_HIGH_Pos (8UL)      /*!< Position of HIGH field.                                              */
  #define CLOCK_CONFIG_THRESHOLD_HIGH_Msk (0xFFUL << CLOCK_CONFIG_THRESHOLD_HIGH_Pos) /*!< Bit mask of HIGH field.             */
  #define CLOCK_CONFIG_THRESHOLD_HIGH_Min (0x00UL)   /*!< Min value of HIGH field.                                             */
  #define CLOCK_CONFIG_THRESHOLD_HIGH_Max (0xFFUL)   /*!< Max size of HIGH field.                                              */

/* DIFF @Bits 16..23 : Threshold difference while clock switching */
  #define CLOCK_CONFIG_THRESHOLD_DIFF_Pos (16UL)     /*!< Position of DIFF field.                                              */
  #define CLOCK_CONFIG_THRESHOLD_DIFF_Msk (0xFFUL << CLOCK_CONFIG_THRESHOLD_DIFF_Pos) /*!< Bit mask of DIFF field.             */
  #define CLOCK_CONFIG_THRESHOLD_DIFF_Min (0x00UL)   /*!< Min value of DIFF field.                                             */
  #define CLOCK_CONFIG_THRESHOLD_DIFF_Max (0xFFUL)   /*!< Max size of DIFF field.                                              */



/* ================================================= Struct CLOCK_BACKDOORS ================================================== */
/**
  * @brief BACKDOORS [CLOCK_BACKDOORS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  REQSERVICECLK;                     /*!< (@ 0x00000000) Backdoor request for service clocks                   */
} NRF_CLOCK_BACKDOORS_Type;                          /*!< Size = 4 (0x004)                                                     */

/* CLOCK_BACKDOORS_REQSERVICECLK: Backdoor request for service clocks */
  #define CLOCK_BACKDOORS_REQSERVICECLK_ResetValue (0x00000000UL) /*!< Reset value of REQSERVICECLK register.                  */

/* CK16M @Bit 0 : Request 16M service clock */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CK16M_Pos (0UL) /*!< Position of CK16M field.                                          */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CK16M_Msk (0x1UL << CLOCK_BACKDOORS_REQSERVICECLK_CK16M_Pos) /*!< Bit mask of CK16M
                                                                            field.*/
  #define CLOCK_BACKDOORS_REQSERVICECLK_CK16M_Min (0x0UL) /*!< Min enumerator value of CK16M field.                            */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CK16M_Max (0x1UL) /*!< Max enumerator value of CK16M field.                            */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CK16M_NotRequested (0x0UL) /*!< (unspecified)                                          */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CK16M_Requested (0x1UL) /*!< (unspecified)                                             */

/* CLKSIMOPWM @Bit 1 : Request SIMO PWM service clock */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CLKSIMOPWM_Pos (1UL) /*!< Position of CLKSIMOPWM field.                                */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CLKSIMOPWM_Msk (0x1UL << CLOCK_BACKDOORS_REQSERVICECLK_CLKSIMOPWM_Pos) /*!< Bit mask of
                                                                            CLKSIMOPWM field.*/
  #define CLOCK_BACKDOORS_REQSERVICECLK_CLKSIMOPWM_Min (0x0UL) /*!< Min enumerator value of CLKSIMOPWM field.                  */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CLKSIMOPWM_Max (0x1UL) /*!< Max enumerator value of CLKSIMOPWM field.                  */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CLKSIMOPWM_NotRequested (0x0UL) /*!< (unspecified)                                     */
  #define CLOCK_BACKDOORS_REQSERVICECLK_CLKSIMOPWM_Requested (0x1UL) /*!< (unspecified)                                        */


/* ====================================================== Struct CLOCK ======================================================= */
/**
  * @brief CLOCK
  */
  typedef struct {                                   /*!< CLOCK Structure                                                      */
    __OM uint32_t TASKS_LFCLKSTART;                  /*!< (@ 0x00000000) Start the LF clock source                             */
    __OM uint32_t TASKS_LFCLKSTOP;                   /*!< (@ 0x00000004) Clear the TASKS_CLKSTART request                      */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_LFCLKSTARTED;              /*!< (@ 0x00000100) LF clock started                                      */
    __IOM uint32_t EVENTS_LFCLKSRCCHANGED;           /*!< (@ 0x00000104) LF clock source changed                               */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM NRF_CLOCK_LFCLKSTAT_Type LFCLKSTAT;        /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[14];
    __IOM NRF_CLOCK_LFCLKCTRL_Type LFCLKCTRL;        /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED4[2];
    __IOM NRF_CLOCK_CONFIG_Type CONFIG;              /*!< (@ 0x00000450) (unspecified)                                         */
    __IM uint32_t RESERVED5[42];
    __IOM NRF_CLOCK_BACKDOORS_Type BACKDOORS;        /*!< (@ 0x00000500) (unspecified)                                         */
  } NRF_CLOCK_Type;                                  /*!< Size = 1284 (0x504)                                                  */

/* CLOCK_TASKS_LFCLKSTART: Start the LF clock source */
  #define CLOCK_TASKS_LFCLKSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_LFCLKSTART register.                      */

/* TASKS_LFCLKSTART @Bit 0 : Start the LF clock source */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos (0UL) /*!< Position of TASKS_LFCLKSTART field.                           */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Msk (0x1UL << CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos) /*!< Bit mask of
                                                                            TASKS_LFCLKSTART field.*/
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_LFCLKSTART field.             */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_LFCLKSTART field.             */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger (0x1UL) /*!< Trigger task                                            */


