adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FPUIDC @Bit 5 : Write '1' to enable interrupt for event FPUIDC */
  #define CM33SS_INTENSET_FPUIDC_Pos (5UL)           /*!< Position of FPUIDC field.                                            */
  #define CM33SS_INTENSET_FPUIDC_Msk (0x1UL << CM33SS_INTENSET_FPUIDC_Pos) /*!< Bit mask of FPUIDC field.                      */
  #define CM33SS_INTENSET_FPUIDC_Min (0x0UL)         /*!< Min enumerator value of FPUIDC field.                                */
  #define CM33SS_INTENSET_FPUIDC_Max (0x1UL)         /*!< Max enumerator value of FPUIDC field.                                */
  #define CM33SS_INTENSET_FPUIDC_Set (0x1UL)         /*!< Enable                                                               */
  #define CM33SS_INTENSET_FPUIDC_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CM33SS_INTENSET_FPUIDC_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* CM33SS_INTENCLR: Disable interrupt */
  #define CM33SS_INTENCLR_ResetValue (0x00000000UL)  /*!< Reset value of INTENCLR register.                                    */

/* FPUIOC @Bit 0 : Write '1' to disable interrupt for event FPUIOC */
  #define CM33SS_INTENCLR_FPUIOC_Pos (0UL)           /*!< Position of FPUIOC field.                                            */
  #define CM33SS_INTENCLR_FPUIOC_Msk (0x1UL << CM33SS_INTENCLR_FPUIOC_Pos) /*!< Bit mask of FPUIOC field.                      */
  #define CM33SS_INTENCLR_FPUIOC_Min (0x0UL)         /*!< Min enumerator value of FPUIOC field.                                */
  #define CM33SS_INTENCLR_FPUIOC_Max (0x1UL)         /*!< Max enumerator value of FPUIOC field.                                */
  #define CM33SS_INTENCLR_FPUIOC_Clear (0x1UL)       /*!< Disable                                                              */
  #define CM33SS_INTENCLR_FPUIOC_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CM33SS_INTENCLR_FPUIOC_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* FPUDZC @Bit 1 : Write '1' to disable interrupt for event FPUDZC */
  #define CM33SS_INTENCLR_FPUDZC_Pos (1UL)           /*!< Position of FPUDZC field.                                            */
  #define CM33SS_INTENCLR_FPUDZC_Msk (0x1UL << CM33SS_INTENCLR_FPUDZC_Pos) /*!< Bit mask of FPUDZC field.                      */
  #define CM33SS_INTENCLR_FPUDZC_Min (0x0UL)         /*!< Min enumerator value of FPUDZC field.                                */
  #define CM33SS_INTENCLR_FPUDZC_Max (0x1UL)         /*!< Max enumerator value of FPUDZC field.                                */
  #define CM33SS_INTENCLR_FPUDZC_Clear (0x1UL)       /*!< Disable                                                              */
  #define CM33SS_INTENCLR_FPUDZC_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CM33SS_INTENCLR_FPUDZC_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* FPUOFC @Bit 2 : Write '1' to disable interrupt for event FPUOFC */
  #define CM33SS_INTENCLR_FPUOFC_Pos (2UL)           /*!< Position of FPUOFC field.                                            */
  #define CM33SS_INTENCLR_FPUOFC_Msk (0x1UL << CM33SS_INTENCLR_FPUOFC_Pos) /*!< Bit mask of FPUOFC field.                      */
  #define CM33SS_INTENCLR_FPUOFC_Min (0x0UL)         /*!< Min enumerator value of FPUOFC field.                                */
  #define CM33SS_INTENCLR_FPUOFC_Max (0x1UL)         /*!< Max enumerator value of FPUOFC field.                                */
  #define CM33SS_INTENCLR_FPUOFC_Clear (0x1UL)       /*!< Disable                                                              */
  #define CM33SS_INTENCLR_FPUOFC_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CM33SS_INTENCLR_FPUOFC_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* FPUUFC @Bit 3 : Write '1' to disable interrupt for event FPUUFC */
  #define CM33SS_INTENCLR_FPUUFC_Pos (3UL)           /*!< Position of FPUUFC field.                                            */
  #define CM33SS_INTENCLR_FPUUFC_Msk (0x1UL << CM33SS_INTENCLR_FPUUFC_Pos) /*!< Bit mask of FPUUFC field.                      */
  #define CM33SS_INTENCLR_FPUUFC_Min (0x0UL)         /*!< Min enumerator value of FPUUFC field.                                */
  #define CM33SS_INTENCLR_FPUUFC_Max (0x1UL)         /*!< Max enumerator value of FPUUFC field.                                */
  #define CM33SS_INTENCLR_FPUUFC_Clear (0x1UL)       /*!< Disable                                                              */
  #define CM33SS_INTENCLR_FPUUFC_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CM33SS_INTENCLR_FPUUFC_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* FPUIXC @Bit 4 : Write '1' to disable interrupt for event FPUIXC */
  #define CM33SS_INTENCLR_FPUIXC_Pos (4UL)           /*!< Position of FPUIXC field.                                            */
  #define CM33SS_INTENCLR_FPUIXC_Msk (0x1UL << CM33SS_INTENCLR_FPUIXC_Pos) /*!< Bit mask of FPUIXC field.                      */
  #define CM33SS_INTENCLR_FPUIXC_Min (0x0UL)         /*!< Min enumerator value of FPUIXC field.                                */
  #define CM33SS_INTENCLR_FPUIXC_Max (0x1UL)         /*!< Max enumerator value of FPUIXC field.                                */
  #define CM33SS_INTENCLR_FPUIXC_Clear (0x1UL)       /*!< Disable                                                              */
  #define CM33SS_INTENCLR_FPUIXC_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CM33SS_INTENCLR_FPUIXC_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

