adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FPUIDC @Bit 5 : Write '1' to disable interrupt for event FPUIDC */
  #define CM33SS_INTENCLR_FPUIDC_Pos (5UL)           /*!< Position of FPUIDC field.                                            */
  #define CM33SS_INTENCLR_FPUIDC_Msk (0x1UL << CM33SS_INTENCLR_FPUIDC_Pos) /*!< Bit mask of FPUIDC field.                      */
  #define CM33SS_INTENCLR_FPUIDC_Min (0x0UL)         /*!< Min enumerator value of FPUIDC field.                                */
  #define CM33SS_INTENCLR_FPUIDC_Max (0x1UL)         /*!< Max enumerator value of FPUIDC field.                                */
  #define CM33SS_INTENCLR_FPUIDC_Clear (0x1UL)       /*!< Disable                                                              */
  #define CM33SS_INTENCLR_FPUIDC_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CM33SS_INTENCLR_FPUIDC_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* CM33SS_LOCK: Register to lock the certain parts of the CPU from being modified. */
  #define CM33SS_LOCK_ResetValue (0x00000000UL)      /*!< Reset value of LOCK register.                                        */

/* LOCKVTORAIRCRS @Bit 0 : Locks both the Vector table Offset Register (VTOR) and Application Interrupt and Reset Control
                           Register (AIRCR) for secure mode. */

  #define CM33SS_LOCK_LOCKVTORAIRCRS_Pos (0UL)       /*!< Position of LOCKVTORAIRCRS field.                                    */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Msk (0x1UL << CM33SS_LOCK_LOCKVTORAIRCRS_Pos) /*!< Bit mask of LOCKVTORAIRCRS field.      */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Min (0x0UL)     /*!< Min enumerator value of LOCKVTORAIRCRS field.                        */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Max (0x1UL)     /*!< Max enumerator value of LOCKVTORAIRCRS field.                        */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_NotLocked (0x0UL) /*!< Both VTOR and AIRCR can be changed.                                */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Locked (0x1UL)  /*!< Prevents changes to both VTOR and AIRCR.                             */

/* LOCKVTORNS @Bit 1 : Locks the Vector table Offset Register (VTOR) for non-secure mode. */
  #define CM33SS_LOCK_LOCKVTORNS_Pos (1UL)           /*!< Position of LOCKVTORNS field.                                        */
  #define CM33SS_LOCK_LOCKVTORNS_Msk (0x1UL << CM33SS_LOCK_LOCKVTORNS_Pos) /*!< Bit mask of LOCKVTORNS field.                  */
  #define CM33SS_LOCK_LOCKVTORNS_Min (0x0UL)         /*!< Min enumerator value of LOCKVTORNS field.                            */
  #define CM33SS_LOCK_LOCKVTORNS_Max (0x1UL)         /*!< Max enumerator value of LOCKVTORNS field.                            */
  #define CM33SS_LOCK_LOCKVTORNS_NotLocked (0x0UL)   /*!< VTOR can be changed.                                                 */
  #define CM33SS_LOCK_LOCKVTORNS_Locked (0x1UL)      /*!< Prevents changes to VTOR.                                            */

/* LOCKMPUS @Bit 2 : Locks the Memory Protection Unit (MPU) for secure mode. */
  #define CM33SS_LOCK_LOCKMPUS_Pos (2UL)             /*!< Position of LOCKMPUS field.                                          */
  #define CM33SS_LOCK_LOCKMPUS_Msk (0x1UL << CM33SS_LOCK_LOCKMPUS_Pos) /*!< Bit mask of LOCKMPUS field.                        */
  #define CM33SS_LOCK_LOCKMPUS_Min (0x0UL)           /*!< Min enumerator value of LOCKMPUS field.                              */
  #define CM33SS_LOCK_LOCKMPUS_Max (0x1UL)           /*!< Max enumerator value of LOCKMPUS field.                              */
  #define CM33SS_LOCK_LOCKMPUS_NotLocked (0x0UL)     /*!< MPU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKMPUS_Locked (0x1UL)        /*!< Prevents changes to MPU registers.                                   */

/* LOCKMPUNS @Bit 3 : Locks the Memory Protection Unit (MPU) for non secure mode. */
  #define CM33SS_LOCK_LOCKMPUNS_Pos (3UL)            /*!< Position of LOCKMPUNS field.                                         */
  #define CM33SS_LOCK_LOCKMPUNS_Msk (0x1UL << CM33SS_LOCK_LOCKMPUNS_Pos) /*!< Bit mask of LOCKMPUNS field.                     */
  #define CM33SS_LOCK_LOCKMPUNS_Min (0x0UL)          /*!< Min enumerator value of LOCKMPUNS field.                             */
  #define CM33SS_LOCK_LOCKMPUNS_Max (0x1UL)          /*!< Max enumerator value of LOCKMPUNS field.                             */
  #define CM33SS_LOCK_LOCKMPUNS_NotLocked (0x0UL)    /*!< MPU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKMPUNS_Locked (0x1UL)       /*!< Prevents changes to MPU registers.                                   */

/* LOCKSAU @Bit 4 : Locks the Security Attribution Unit (SAU) */
  #define CM33SS_LOCK_LOCKSAU_Pos (4UL)              /*!< Position of LOCKSAU field.                                           */
  #define CM33SS_LOCK_LOCKSAU_Msk (0x1UL << CM33SS_LOCK_LOCKSAU_Pos) /*!< Bit mask of LOCKSAU field.                           */
  #define CM33SS_LOCK_LOCKSAU_Min (0x0UL)            /*!< Min enumerator value of LOCKSAU field.                               */
  #define CM33SS_LOCK_LOCKSAU_Max (0x1UL)            /*!< Max enumerator value of LOCKSAU field.                               */
  #define CM33SS_LOCK_LOCKSAU_NotLocked (0x0UL)      /*!< SAU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKSAU_Locked (0x1UL)         /*!< Prevents changes to SAU registers.                                   */


/* CM33SS_CPUID: The identifier for the CPU in this subsystem. */
  #define CM33SS_CPUID_ResetValue (0x00000000UL)     /*!< Reset value of CPUID register.                                       */

/* CPUID @Bits 0..31 : The CPU identifier. */
  #define CM33SS_CPUID_CPUID_Pos (0UL)               /*!< Position of CPUID field.                                             */
  #define CM33SS_CPUID_CPUID_Msk (0xFFFFFFFFUL << CM33SS_CPUID_CPUID_Pos) /*!< Bit mask of CPUID field.                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           COMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct COMP_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [COMP_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signals to the analog modules      */
  __IOM uint32_t  CONFIGVOLTLVL;                     /*!< (@ 0x00000004) Override LPCMP_INSEL_RET_0V8 and GPCMP_CTRL_RET_0V8[0]*/
} NRF_COMP_OVERRIDE_Type;                            /*!< Size = 8 (0x008)                                                     */

/* COMP_OVERRIDE_PWRUP: Override the PWRUP signals to the analog modules */
  #define COMP_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                    */

/* WUCMP @Bit 0 : Override value for PWRUP_LPCMP_AO_0V8 */
  #define COMP_OVERRIDE_PWRUP_WUCMP_Pos (0UL)        /*!< Position of WUCMP field.                                             */
  #define COMP_OVERRIDE_PWRUP_WUCMP_Msk (0x1UL << COMP_OVERRIDE_PWRUP_WUCMP_Pos) /*!< Bit mask of WUCMP field.                 */

