adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GPCMP @Bit 1 : Override value for PWRUP_GPCMP_AO_0V8 */
  #define COMP_OVERRIDE_PWRUP_GPCMP_Pos (1UL)        /*!< Position of GPCMP field.                                             */
  #define COMP_OVERRIDE_PWRUP_GPCMP_Msk (0x1UL << COMP_OVERRIDE_PWRUP_GPCMP_Pos) /*!< Bit mask of GPCMP field.                 */

/* EN @Bit 31 : Enable the overrides */
  #define COMP_OVERRIDE_PWRUP_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define COMP_OVERRIDE_PWRUP_EN_Msk (0x1UL << COMP_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                          */
  #define COMP_OVERRIDE_PWRUP_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define COMP_OVERRIDE_PWRUP_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define COMP_OVERRIDE_PWRUP_EN_Disabled (0x0UL)    /*!< Overrides are disabled                                               */
  #define COMP_OVERRIDE_PWRUP_EN_Enabled (0x1UL)     /*!< Overrides are enabled                                                */


/* COMP_OVERRIDE_CONFIGVOLTLVL: Override LPCMP_INSEL_RET_0V8 and GPCMP_CTRL_RET_0V8[0] */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_ResetValue (0x00000000UL) /*!< Reset value of CONFIGVOLTLVL register.                    */

/* VAL @Bit 0 : Override value for the signal */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_VAL_Msk (0x1UL << COMP_OVERRIDE_CONFIGVOLTLVL_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Msk (0x1UL << COMP_OVERRIDE_CONFIGVOLTLVL_EN_Pos) /*!< Bit mask of EN field.          */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Enabled (0x1UL) /*!< Override is enabled                                              */



/* ===================================================== Struct COMP_DFT ===================================================== */
/**
  * @brief DFT [COMP_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) (unspecified)                                         */
  __IOM uint32_t  ATB2CONFIG;                        /*!< (@ 0x00000008) (unspecified)                                         */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus (DTB0-3) configuration               */
  __IM  uint32_t  RESERVED1[3];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000020) Test configuration                                    */
  __IOM uint32_t  RCALTRIM;                          /*!< (@ 0x00000024) Trimming values for RCAL                              */
} NRF_COMP_DFT_Type;                                 /*!< Size = 40 (0x028)                                                    */

/* COMP_DFT_ATB0CONFIG: (unspecified) */
  #define COMP_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                               */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define COMP_DFT_ATB0CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define COMP_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << COMP_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define COMP_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define COMP_DFT_ATB0CONFIG_SELMUX_Max (0x3UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define COMP_DFT_ATB0CONFIG_SELMUX_Config0 (0x0UL) /*!< Configuration 0 selected                                             */
  #define COMP_DFT_ATB0CONFIG_SELMUX_Config1 (0x1UL) /*!< Configuration 1 selected                                             */
  #define COMP_DFT_ATB0CONFIG_SELMUX_Config2 (0x2UL) /*!< Configuration 2 selected                                             */
  #define COMP_DFT_ATB0CONFIG_SELMUX_Config3 (0x3UL) /*!< Configuration 3 selected                                             */

/* EN @Bit 31 : (unspecified) */
  #define COMP_DFT_ATB0CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define COMP_DFT_ATB0CONFIG_EN_Msk (0x1UL << COMP_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */


/* COMP_DFT_ATB1CONFIG: (unspecified) */
  #define COMP_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                               */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define COMP_DFT_ATB1CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define COMP_DFT_ATB1CONFIG_SELMUX_Msk (0x3UL << COMP_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define COMP_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define COMP_DFT_ATB1CONFIG_SELMUX_Max (0x3UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define COMP_DFT_ATB1CONFIG_SELMUX_Config0 (0x0UL) /*!< Configuration 0 selected                                             */
  #define COMP_DFT_ATB1CONFIG_SELMUX_Config1 (0x1UL) /*!< Configuration 1 selected                                             */
  #define COMP_DFT_ATB1CONFIG_SELMUX_Config2 (0x2UL) /*!< Configuration 2 selected                                             */
  #define COMP_DFT_ATB1CONFIG_SELMUX_Config3 (0x3UL) /*!< Configuration 3 selected                                             */

/* EN @Bit 31 : (unspecified) */
  #define COMP_DFT_ATB1CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define COMP_DFT_ATB1CONFIG_EN_Msk (0x1UL << COMP_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */


/* COMP_DFT_ATB2CONFIG: (unspecified) */
  #define COMP_DFT_ATB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB2CONFIG register.                               */

/* EN @Bit 31 : (unspecified) */
  #define COMP_DFT_ATB2CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define COMP_DFT_ATB2CONFIG_EN_Msk (0x1UL << COMP_DFT_ATB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define COMP_DFT_ATB2CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define COMP_DFT_ATB2CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define COMP_DFT_ATB2CONFIG_EN_Config0 (0x0UL)     /*!< Configuration 0 selected                                             */
  #define COMP_DFT_ATB2CONFIG_EN_Config1 (0x1UL)     /*!< Configuration 1 selected                                             */


