adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* COMP_DFT_DTBCONFIG: Digital Test Bus (DTB0-3) configuration */
  #define COMP_DFT_DTBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTBCONFIG register.                                 */

/* SELMUX @Bit 0 : Select multiplexer for DTB0 */
  #define COMP_DFT_DTBCONFIG_SELMUX_Pos (0UL)        /*!< Position of SELMUX field.                                            */
  #define COMP_DFT_DTBCONFIG_SELMUX_Msk (0x1UL << COMP_DFT_DTBCONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.                */
  #define COMP_DFT_DTBCONFIG_SELMUX_Min (0x0UL)      /*!< Min enumerator value of SELMUX field.                                */
  #define COMP_DFT_DTBCONFIG_SELMUX_Max (0x0UL)      /*!< Max enumerator value of SELMUX field.                                */
  #define COMP_DFT_DTBCONFIG_SELMUX_Config0 (0x0UL)  /*!< Configuration 0 selected                                             */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit on DTB3 */
  #define COMP_DFT_DTBCONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                      */
  #define COMP_DFT_DTBCONFIG_PWRUPDELTEST_Msk (0x1UL << COMP_DFT_DTBCONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define COMP_DFT_DTBCONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                         */
  #define COMP_DFT_DTBCONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                         */
  #define COMP_DFT_DTBCONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                           */
  #define COMP_DFT_DTBCONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                             */

/* ENABLEDTB0 @Bit 28 : Enable the digital test bus 0 (DTB0) */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB0_Pos (28UL)   /*!< Position of ENABLEDTB0 field.                                        */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB0_Msk (0x1UL << COMP_DFT_DTBCONFIG_ENABLEDTB0_Pos) /*!< Bit mask of ENABLEDTB0 field.    */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB0_Min (0x0UL)  /*!< Min enumerator value of ENABLEDTB0 field.                            */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB0_Max (0x1UL)  /*!< Max enumerator value of ENABLEDTB0 field.                            */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB0_Disabled (0x0UL) /*!< Digital test bus is disabled                                     */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB0_Enabled (0x1UL) /*!< Digital test bus is enabled                                       */

/* ENABLEDTB1 @Bit 29 : Enable the digital test bus */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB1_Pos (29UL)   /*!< Position of ENABLEDTB1 field.                                        */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB1_Msk (0x1UL << COMP_DFT_DTBCONFIG_ENABLEDTB1_Pos) /*!< Bit mask of ENABLEDTB1 field.    */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB1_Min (0x0UL)  /*!< Min enumerator value of ENABLEDTB1 field.                            */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB1_Max (0x1UL)  /*!< Max enumerator value of ENABLEDTB1 field.                            */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB1_Disabled (0x0UL) /*!< Digital test bus is disabled                                     */
  #define COMP_DFT_DTBCONFIG_ENABLEDTB1_Enabled (0x1UL) /*!< Digital test bus is enabled                                       */


/* COMP_DFT_TCFG: Test configuration */
  #define COMP_DFT_TCFG_ResetValue (0x00000000UL)    /*!< Reset value of TCFG register.                                        */

/* RCALSINK @Bit 0 : (unspecified) */
  #define COMP_DFT_TCFG_RCALSINK_Pos (0UL)           /*!< Position of RCALSINK field.                                          */
  #define COMP_DFT_TCFG_RCALSINK_Msk (0x1UL << COMP_DFT_TCFG_RCALSINK_Pos) /*!< Bit mask of RCALSINK field.                    */
  #define COMP_DFT_TCFG_RCALSINK_Min (0x0UL)         /*!< Min enumerator value of RCALSINK field.                              */
  #define COMP_DFT_TCFG_RCALSINK_Max (0x1UL)         /*!< Max enumerator value of RCALSINK field.                              */
  #define COMP_DFT_TCFG_RCALSINK_Vip (0x0UL)         /*!< Output voltage to inverting input (VIP)                              */
  #define COMP_DFT_TCFG_RCALSINK_Vin (0x1UL)         /*!< Output voltage to non-inverting input (VIN)                          */

/* RCALSOURCE @Bit 1 : (unspecified) */
  #define COMP_DFT_TCFG_RCALSOURCE_Pos (1UL)         /*!< Position of RCALSOURCE field.                                        */
  #define COMP_DFT_TCFG_RCALSOURCE_Msk (0x1UL << COMP_DFT_TCFG_RCALSOURCE_Pos) /*!< Bit mask of RCALSOURCE field.              */
  #define COMP_DFT_TCFG_RCALSOURCE_Min (0x0UL)       /*!< Min enumerator value of RCALSOURCE field.                            */
  #define COMP_DFT_TCFG_RCALSOURCE_Max (0x1UL)       /*!< Max enumerator value of RCALSOURCE field.                            */
  #define COMP_DFT_TCFG_RCALSOURCE_Top (0x0UL)       /*!< Tap voltage from top of resistor                                     */
  #define COMP_DFT_TCFG_RCALSOURCE_Bottom (0x1UL)    /*!< Tap voltage from bottom of resistor                                  */

/* RCALRES @Bit 2 : (unspecified) */
  #define COMP_DFT_TCFG_RCALRES_Pos (2UL)            /*!< Position of RCALRES field.                                           */
  #define COMP_DFT_TCFG_RCALRES_Msk (0x1UL << COMP_DFT_TCFG_RCALRES_Pos) /*!< Bit mask of RCALRES field.                       */
  #define COMP_DFT_TCFG_RCALRES_Min (0x0UL)          /*!< Min enumerator value of RCALRES field.                               */
  #define COMP_DFT_TCFG_RCALRES_Max (0x1UL)          /*!< Max enumerator value of RCALRES field.                               */
  #define COMP_DFT_TCFG_RCALRES_Res80K (0x0UL)       /*!< Select 80k resistor                                                  */
  #define COMP_DFT_TCFG_RCALRES_Res6M4 (0x1UL)       /*!< Select 6.4M resistor                                                 */

/* RCALEN @Bit 3 : (unspecified) */
  #define COMP_DFT_TCFG_RCALEN_Pos (3UL)             /*!< Position of RCALEN field.                                            */
  #define COMP_DFT_TCFG_RCALEN_Msk (0x1UL << COMP_DFT_TCFG_RCALEN_Pos) /*!< Bit mask of RCALEN field.                          */
  #define COMP_DFT_TCFG_RCALEN_Min (0x0UL)           /*!< Min enumerator value of RCALEN field.                                */
  #define COMP_DFT_TCFG_RCALEN_Max (0x1UL)           /*!< Max enumerator value of RCALEN field.                                */
  #define COMP_DFT_TCFG_RCALEN_Disabled (0x0UL)      /*!< Resistor calibration disabled                                        */
  #define COMP_DFT_TCFG_RCALEN_Enabled (0x1UL)       /*!< Resistor calibration enabled                                         */

/* ATB01SELMUXGROUP @Bit 4 : Select multiplexer group for ATB0-1 */
  #define COMP_DFT_TCFG_ATB01SELMUXGROUP_Pos (4UL)   /*!< Position of ATB01SELMUXGROUP field.                                  */
  #define COMP_DFT_TCFG_ATB01SELMUXGROUP_Msk (0x1UL << COMP_DFT_TCFG_ATB01SELMUXGROUP_Pos) /*!< Bit mask of ATB01SELMUXGROUP
                                                                            field.*/
  #define COMP_DFT_TCFG_ATB01SELMUXGROUP_Min (0x0UL) /*!< Min enumerator value of ATB01SELMUXGROUP field.                      */
  #define COMP_DFT_TCFG_ATB01SELMUXGROUP_Max (0x1UL) /*!< Max enumerator value of ATB01SELMUXGROUP field.                      */
  #define COMP_DFT_TCFG_ATB01SELMUXGROUP_Group0 (0x0UL) /*!< Multiplexer group 0                                               */
  #define COMP_DFT_TCFG_ATB01SELMUXGROUP_Group1 (0x1UL) /*!< Multiplexer group 1                                               */


/* COMP_DFT_RCALTRIM: Trimming values for RCAL */
  #define COMP_DFT_RCALTRIM_ResetValue (0x00800100UL) /*!< Reset value of RCALTRIM register.                                   */

/* R80KFINE @Bits 0..3 : Fine trim of 80k resistor, max stepsize less than 0.67 percent (not 2's complement) */
  #define COMP_DFT_RCALTRIM_R80KFINE_Pos (0UL)       /*!< Position of R80KFINE field.                                          */
  #define COMP_DFT_RCALTRIM_R80KFINE_Msk (0xFUL << COMP_DFT_RCALTRIM_R80KFINE_Pos) /*!< Bit mask of R80KFINE field.            */

/* R80KCOARSE @Bits 4..8 : Coarse trim of 80k resistor (2's complement) */
  #define COMP_DFT_RCALTRIM_R80KCOARSE_Pos (4UL)     /*!< Position of R80KCOARSE field.                                        */
  #define COMP_DFT_RCALTRIM_R80KCOARSE_Msk (0x1FUL << COMP_DFT_RCALTRIM_R80KCOARSE_Pos) /*!< Bit mask of R80KCOARSE field.     */

