adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* R6M4FINE @Bits 16..18 : Fine trim of 6.4M resistor, max stepsize less than 2.5 percent (not 2's complement) */
  #define COMP_DFT_RCALTRIM_R6M4FINE_Pos (16UL)      /*!< Position of R6M4FINE field.                                          */
  #define COMP_DFT_RCALTRIM_R6M4FINE_Msk (0x7UL << COMP_DFT_RCALTRIM_R6M4FINE_Pos) /*!< Bit mask of R6M4FINE field.            */

/* R6M4COARSE @Bits 19..23 : Coarse trim of 6.4M resistor (2's complement) */
  #define COMP_DFT_RCALTRIM_R6M4COARSE_Pos (19UL)    /*!< Position of R6M4COARSE field.                                        */
  #define COMP_DFT_RCALTRIM_R6M4COARSE_Msk (0x1FUL << COMP_DFT_RCALTRIM_R6M4COARSE_Pos) /*!< Bit mask of R6M4COARSE field.     */


/* ======================================================= Struct COMP ======================================================= */
/**
  * @brief Comparator
  */
  typedef struct {                                   /*!< COMP Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start comparator                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop comparator                                       */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000008) Sample comparator value. This task requires that COMP
                                                                         has been started by the START Task.*/
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000088) Subscribe configuration for task SAMPLE               */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) COMP is ready and output is valid                     */
    __IOM uint32_t EVENTS_DOWN;                      /*!< (@ 0x00000104) Downward crossing                                     */
    __IOM uint32_t EVENTS_UP;                        /*!< (@ 0x00000108) Upward crossing                                       */
    __IOM uint32_t EVENTS_CROSS;                     /*!< (@ 0x0000010C) Downward or upward crossing                           */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_DOWN;                     /*!< (@ 0x00000184) Publish configuration for event DOWN                  */
    __IOM uint32_t PUBLISH_UP;                       /*!< (@ 0x00000188) Publish configuration for event UP                    */
    __IOM uint32_t PUBLISH_CROSS;                    /*!< (@ 0x0000018C) Publish configuration for event CROSS                 */
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED5[60];
    __IM uint32_t RESULT;                            /*!< (@ 0x00000400) Compare result                                        */
    __IM uint32_t BGREADY;                           /*!< (@ 0x00000404) COMP module is ready                                  */
    __IM uint32_t RESERVED6[62];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) COMP enable                                           */
    __IOM uint32_t PSEL;                             /*!< (@ 0x00000504) Pin select                                            */
    __IOM uint32_t REFSEL;                           /*!< (@ 0x00000508) Reference source select for single-ended mode         */
    __IOM uint32_t EXTREFSEL;                        /*!< (@ 0x0000050C) External reference select                             */
    __IOM uint32_t REFTEMPC;                         /*!< (@ 0x00000510) Trim for temperature coefficient                      */
    __IOM uint32_t BUFFER;                           /*!< (@ 0x00000514) Enable unity gain buffer                              */
    __IM uint32_t RESERVED7[3];
    __IOM uint32_t RETAIN;                           /*!< (@ 0x00000524) Retain signal                                         */
    __IM uint32_t RESERVED8[2];
    __IOM uint32_t TH;                               /*!< (@ 0x00000530) Threshold configuration for hysteresis unit           */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000534) Mode configuration                                    */
    __IOM uint32_t HYST;                             /*!< (@ 0x00000538) Comparator hysteresis enable                          */
    __IOM uint32_t ISOURCE;                          /*!< (@ 0x0000053C) Current source select on analog input                 */
    __IOM uint32_t REFTRIM;                          /*!< (@ 0x00000540) Trim internal band gap reference                      */
    __IM uint32_t RESERVED9[15];
    __IOM NRF_COMP_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000580) (unspecified)                                         */
    __IM uint32_t RESERVED10[30];
    __IOM NRF_COMP_DFT_Type DFT;                     /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_COMP_Type;                                   /*!< Size = 1576 (0x628)                                                  */

/* COMP_TASKS_START: Start comparator */
  #define COMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

