adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PORT @Bits 8..11 : GPIO Port selection */
  #define COMP_PSEL_PORT_Pos (8UL)                   /*!< Position of PORT field.                                              */
  #define COMP_PSEL_PORT_Msk (0xFUL << COMP_PSEL_PORT_Pos) /*!< Bit mask of PORT field.                                        */


/* COMP_REFSEL: Reference source select for single-ended mode */
  #define COMP_REFSEL_ResetValue (0x00000004UL)      /*!< Reset value of REFSEL register.                                      */

/* REFSEL @Bits 0..2 : Reference select */
  #define COMP_REFSEL_REFSEL_Pos (0UL)               /*!< Position of REFSEL field.                                            */
  #define COMP_REFSEL_REFSEL_Msk (0x7UL << COMP_REFSEL_REFSEL_Pos) /*!< Bit mask of REFSEL field.                              */
  #define COMP_REFSEL_REFSEL_Min (0x0UL)             /*!< Min enumerator value of REFSEL field.                                */
  #define COMP_REFSEL_REFSEL_Max (0x7UL)             /*!< Max enumerator value of REFSEL field.                                */
  #define COMP_REFSEL_REFSEL_Int1V2 (0x0UL)          /*!< VREF = internal 1.2 V reference                                      */
  #define COMP_REFSEL_REFSEL_Int1V8 (0x1UL)          /*!< VREF = internal 1.8 V reference (VDD >= VREF + 0.2 V)                */
  #define COMP_REFSEL_REFSEL_Int2V4 (0x2UL)          /*!< VREF = internal 2.4 V reference (VDD >= VREF + 0.2 V)                */
  #define COMP_REFSEL_REFSEL_AVDDAO1V8 (0x4UL)       /*!< VREF = internal 1.8 V reference                                      */
  #define COMP_REFSEL_REFSEL_ARef (0x5UL)            /*!< VREF = AREF                                                          */
  #define COMP_REFSEL_REFSEL_Diff (0x7UL)            /*!< VREF = Differential mode (power down built-in reference and disconnect
                                                          resistor ladder)*/


/* COMP_EXTREFSEL: External reference select */
  #define COMP_EXTREFSEL_ResetValue (0x00000000UL)   /*!< Reset value of EXTREFSEL register.                                   */

/* PIN @Bits 0..4 : External analog reference pin select */
  #define COMP_EXTREFSEL_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define COMP_EXTREFSEL_PIN_Msk (0x1FUL << COMP_EXTREFSEL_PIN_Pos) /*!< Bit mask of PIN field.                                */

/* PORT @Bits 8..11 : GPIO Port selection */
  #define COMP_EXTREFSEL_PORT_Pos (8UL)              /*!< Position of PORT field.                                              */
  #define COMP_EXTREFSEL_PORT_Msk (0xFUL << COMP_EXTREFSEL_PORT_Pos) /*!< Bit mask of PORT field.                              */


/* COMP_REFTEMPC: Trim for temperature coefficient */
  #define COMP_REFTEMPC_ResetValue (0x00000000UL)    /*!< Reset value of REFTEMPC register.                                    */

/* REFTEMPC @Bits 0..3 : Trim for temperature coefficient in 2's complement. Used to compensate between simulation and
                         measurement */

  #define COMP_REFTEMPC_REFTEMPC_Pos (0UL)           /*!< Position of REFTEMPC field.                                          */
  #define COMP_REFTEMPC_REFTEMPC_Msk (0xFUL << COMP_REFTEMPC_REFTEMPC_Pos) /*!< Bit mask of REFTEMPC field.                    */


/* COMP_BUFFER: Enable unity gain buffer */
  #define COMP_BUFFER_ResetValue (0x00000000UL)      /*!< Reset value of BUFFER register.                                      */

/* BUFFER @Bit 0 : Enable unity gain buffer */
  #define COMP_BUFFER_BUFFER_Pos (0UL)               /*!< Position of BUFFER field.                                            */
  #define COMP_BUFFER_BUFFER_Msk (0x1UL << COMP_BUFFER_BUFFER_Pos) /*!< Bit mask of BUFFER field.                              */
  #define COMP_BUFFER_BUFFER_Min (0x0UL)             /*!< Min enumerator value of BUFFER field.                                */
  #define COMP_BUFFER_BUFFER_Max (0x1UL)             /*!< Max enumerator value of BUFFER field.                                */
  #define COMP_BUFFER_BUFFER_Disable (0x0UL)         /*!< VOUT is high impedance                                               */
  #define COMP_BUFFER_BUFFER_Enable (0x1UL)          /*!< VOUT equals VIN                                                      */


/* COMP_RETAIN: Retain signal */
  #define COMP_RETAIN_ResetValue (0x00000000UL)      /*!< Reset value of RETAIN register.                                      */

/* RETAIN @Bit 0 : Retain signal, shared for both COMP and LPCOMP */
  #define COMP_RETAIN_RETAIN_Pos (0UL)               /*!< Position of RETAIN field.                                            */
  #define COMP_RETAIN_RETAIN_Msk (0x1UL << COMP_RETAIN_RETAIN_Pos) /*!< Bit mask of RETAIN field.                              */
  #define COMP_RETAIN_RETAIN_Min (0x0UL)             /*!< Min enumerator value of RETAIN field.                                */
  #define COMP_RETAIN_RETAIN_Max (0x1UL)             /*!< Max enumerator value of RETAIN field.                                */
  #define COMP_RETAIN_RETAIN_Disable (0x0UL)         /*!< No retain                                                            */
  #define COMP_RETAIN_RETAIN_Enable (0x1UL)          /*!< Retain is active                                                     */


/* COMP_TH: Threshold configuration for hysteresis unit */
  #define COMP_TH_ResetValue (0x00002020UL)          /*!< Reset value of TH register.                                          */

/* THDOWN @Bits 0..5 : VDOWN = (THDOWN+1)/64*VREF */
  #define COMP_TH_THDOWN_Pos (0UL)                   /*!< Position of THDOWN field.                                            */
  #define COMP_TH_THDOWN_Msk (0x3FUL << COMP_TH_THDOWN_Pos) /*!< Bit mask of THDOWN field.                                     */
  #define COMP_TH_THDOWN_Min (0x00UL)                /*!< Min value of THDOWN field.                                           */
  #define COMP_TH_THDOWN_Max (0x3FUL)                /*!< Max size of THDOWN field.                                            */

/* THUP @Bits 8..13 : VUP = (THUP+1)/64*VREF */
  #define COMP_TH_THUP_Pos (8UL)                     /*!< Position of THUP field.                                              */
  #define COMP_TH_THUP_Msk (0x3FUL << COMP_TH_THUP_Pos) /*!< Bit mask of THUP field.                                           */
  #define COMP_TH_THUP_Min (0x00UL)                  /*!< Min value of THUP field.                                             */
  #define COMP_TH_THUP_Max (0x3FUL)                  /*!< Max size of THUP field.                                              */


