adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* INITSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define CPUCONF_INITSVTOR_INITSVTOR_Pos (0UL)      /*!< Position of INITSVTOR field.                                         */
  #define CPUCONF_INITSVTOR_INITSVTOR_Msk (0xFFFFFFFFUL << CPUCONF_INITSVTOR_INITSVTOR_Pos) /*!< Bit mask of INITSVTOR field.  */


/* CPUCONF_INITNSVTOR: Initial value of the non-secure VTOR (Vector Table Offset Register). */
  #define CPUCONF_INITNSVTOR_ResetValue (0x00000000UL) /*!< Reset value of INITNSVTOR register.                                */

/* INITNSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define CPUCONF_INITNSVTOR_INITNSVTOR_Pos (0UL)    /*!< Position of INITNSVTOR field.                                        */
  #define CPUCONF_INITNSVTOR_INITNSVTOR_Msk (0xFFFFFFFFUL << CPUCONF_INITNSVTOR_INITNSVTOR_Pos) /*!< Bit mask of INITNSVTOR
                                                                            field.*/


/* CPUCONF_CPUSTART: Enable for starting the CPU */
  #define CPUCONF_CPUSTART_ResetValue (0x00000000UL) /*!< Reset value of CPUSTART register.                                    */

/* EN @Bit 0 : Enable to start the CPU. */
  #define CPUCONF_CPUSTART_EN_Pos (0UL)              /*!< Position of EN field.                                                */
  #define CPUCONF_CPUSTART_EN_Msk (0x1UL << CPUCONF_CPUSTART_EN_Pos) /*!< Bit mask of EN field.                                */
  #define CPUCONF_CPUSTART_EN_Min (0x0UL)            /*!< Min enumerator value of EN field.                                    */
  #define CPUCONF_CPUSTART_EN_Max (0x1UL)            /*!< Max enumerator value of EN field.                                    */
  #define CPUCONF_CPUSTART_EN_Stopped (0x0UL)        /*!< CPU stopped.                                                         */
  #define CPUCONF_CPUSTART_EN_Started (0x1UL)        /*!< CPU started.                                                         */


/* CPUCONF_CPUWAIT: Enable for the CPU wait. */
  #define CPUCONF_CPUWAIT_ResetValue (0x00000000UL)  /*!< Reset value of CPUWAIT register.                                     */

/* EN @Bit 0 : Enable to the CPU wait. */
  #define CPUCONF_CPUWAIT_EN_Pos (0UL)               /*!< Position of EN field.                                                */
  #define CPUCONF_CPUWAIT_EN_Msk (0x1UL << CPUCONF_CPUWAIT_EN_Pos) /*!< Bit mask of EN field.                                  */
  #define CPUCONF_CPUWAIT_EN_Min (0x0UL)             /*!< Min enumerator value of EN field.                                    */
  #define CPUCONF_CPUWAIT_EN_Max (0x1UL)             /*!< Max enumerator value of EN field.                                    */
  #define CPUCONF_CPUWAIT_EN_Disabled (0x0UL)        /*!< CPU is not waiting.                                                  */
  #define CPUCONF_CPUWAIT_EN_Enabled (0x1UL)         /*!< CPU is waiting.                                                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          CRACEN                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct CRACEN ====================================================== */
/**
  * @brief CRACEN
  */
  typedef struct {                                   /*!< CRACEN Structure                                                     */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_CRYPTOMASTER;              /*!< (@ 0x00000100) Event indicating that interrupt triggered at
                                                                         Cryptomaster*/
    __IOM uint32_t EVENTS_RNG;                       /*!< (@ 0x00000104) Event indicating that interrupt triggered at RNG      */
    __IOM uint32_t EVENTS_PKEIKG;                    /*!< (@ 0x00000108) Event indicating that interrupt triggered at PKE or
                                                                         IKG*/
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable CRACEN peripheral modules.                     */
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM uint32_t PROTECTEDRAMLOCK;               /*!< (@ 0x00000404) Lock the access to the protected RAM.                 */
      __IOM uint32_t SEEDRAMLOCK;                    /*!< (@ 0x00000404) Lock the access to the RAM used for the seed.         */
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __OM uint32_t SEED[12];                          /*!< (@ 0x00000408) Seed word [n] for symmetric and asymmetric key
                                                                         generation.*/
  } NRF_CRACEN_Type;                                 /*!< Size = 1080 (0x438)                                                  */

/* CRACEN_EVENTS_CRYPTOMASTER: Event indicating that interrupt triggered at Cryptomaster */
  #define CRACEN_EVENTS_CRYPTOMASTER_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CRYPTOMASTER register.               */

/* EVENTS_CRYPTOMASTER @Bit 0 : Event indicating that interrupt triggered at Cryptomaster */
  #define CRACEN_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Pos (0UL) /*!< Position of EVENTS_CRYPTOMASTER field.                 */
  #define CRACEN_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Msk (0x1UL << CRACEN_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Pos) /*!<
                                                                            Bit mask of EVENTS_CRYPTOMASTER field.*/
  #define CRACEN_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Min (0x0UL) /*!< Min enumerator value of EVENTS_CRYPTOMASTER field.   */
  #define CRACEN_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Max (0x1UL) /*!< Max enumerator value of EVENTS_CRYPTOMASTER field.   */
  #define CRACEN_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define CRACEN_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Generated (0x1UL) /*!< Event generated                                */


/* CRACEN_EVENTS_RNG: Event indicating that interrupt triggered at RNG */
  #define CRACEN_EVENTS_RNG_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RNG register.                                 */

/* EVENTS_RNG @Bit 0 : Event indicating that interrupt triggered at RNG */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Pos (0UL)     /*!< Position of EVENTS_RNG field.                                        */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Msk (0x1UL << CRACEN_EVENTS_RNG_EVENTS_RNG_Pos) /*!< Bit mask of EVENTS_RNG field.      */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Min (0x0UL)   /*!< Min enumerator value of EVENTS_RNG field.                            */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Max (0x1UL)   /*!< Max enumerator value of EVENTS_RNG field.                            */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_NotGenerated (0x0UL) /*!< Event not generated                                           */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Generated (0x1UL) /*!< Event generated                                                  */


/* CRACEN_EVENTS_PKEIKG: Event indicating that interrupt triggered at PKE or IKG */
  #define CRACEN_EVENTS_PKEIKG_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PKEIKG register.                           */

