adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CRACENCORE_PK_MICROCODEOFFSET: MicroCode offset register. */
  #define CRACENCORE_PK_MICROCODEOFFSET_ResetValue (0x00000000UL) /*!< Reset value of MICROCODEOFFSET register.                */

/* MICROCODEOFFSET @Bits 0..31 : MicroCode offset for AHB Master */
  #define CRACENCORE_PK_MICROCODEOFFSET_MICROCODEOFFSET_Pos (0UL) /*!< Position of MICROCODEOFFSET field.                      */
  #define CRACENCORE_PK_MICROCODEOFFSET_MICROCODEOFFSET_Msk (0xFFFFFFFFUL << CRACENCORE_PK_MICROCODEOFFSET_MICROCODEOFFSET_Pos)
                                                                            /*!< Bit mask of MICROCODEOFFSET field.*/


/* CRACENCORE_PK_RAMERRORINJECT: RAM error injection register. */
  #define CRACENCORE_PK_RAMERRORINJECT_ResetValue (0x03FF03FFUL) /*!< Reset value of RAMERRORINJECT register.                  */

/* BITERROR1 @Bits 0..9 : Bit position of first error */
  #define CRACENCORE_PK_RAMERRORINJECT_BITERROR1_Pos (0UL) /*!< Position of BITERROR1 field.                                   */
  #define CRACENCORE_PK_RAMERRORINJECT_BITERROR1_Msk (0x3FFUL << CRACENCORE_PK_RAMERRORINJECT_BITERROR1_Pos) /*!< Bit mask of
                                                                            BITERROR1 field.*/

/* BITERROR2 @Bits 16..25 : Bit position of second error */
  #define CRACENCORE_PK_RAMERRORINJECT_BITERROR2_Pos (16UL) /*!< Position of BITERROR2 field.                                  */
  #define CRACENCORE_PK_RAMERRORINJECT_BITERROR2_Msk (0x3FFUL << CRACENCORE_PK_RAMERRORINJECT_BITERROR2_Pos) /*!< Bit mask of
                                                                            BITERROR2 field.*/


/* CRACENCORE_PK_RAMERRORSTATUS: RAM error status register. */
  #define CRACENCORE_PK_RAMERRORSTATUS_ResetValue (0x00000000UL) /*!< Reset value of RAMERRORSTATUS register.                  */

/* RAMCORRECTION @Bit 0 : This bit indicates that a 1-bit error has been detected and corrected on RAM interface */
  #define CRACENCORE_PK_RAMERRORSTATUS_RAMCORRECTION_Pos (0UL) /*!< Position of RAMCORRECTION field.                           */
  #define CRACENCORE_PK_RAMERRORSTATUS_RAMCORRECTION_Msk (0x1UL << CRACENCORE_PK_RAMERRORSTATUS_RAMCORRECTION_Pos) /*!< Bit mask
                                                                            of RAMCORRECTION field.*/

/* RAMFAILURE @Bit 1 : This bit indicates that an uncorrectable error has been detected on the data RAM interface */
  #define CRACENCORE_PK_RAMERRORSTATUS_RAMFAILURE_Pos (1UL) /*!< Position of RAMFAILURE field.                                 */
  #define CRACENCORE_PK_RAMERRORSTATUS_RAMFAILURE_Msk (0x1UL << CRACENCORE_PK_RAMERRORSTATUS_RAMFAILURE_Pos) /*!< Bit mask of
                                                                            RAMFAILURE field.*/



/* ================================================== Struct CRACENCORE_IKG ================================================== */
/**
  * @brief IKG [CRACENCORE_IKG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start register.                                       */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register.                                      */
  __IOM uint32_t  INITDATA;                          /*!< (@ 0x00000008) InitData register.                                    */
  __IOM uint32_t  NONCE;                             /*!< (@ 0x0000000C) Nonce register.                                       */
  __IOM uint32_t  PERSONALISATIONSTRING;             /*!< (@ 0x00000010) Personalisation String register.                      */
  __IOM uint32_t  RESEEDINTERVALLSB;                 /*!< (@ 0x00000014) Reseed Interval LSB register.                         */
  __IOM uint32_t  RESEEDINTERVALMSB;                 /*!< (@ 0x00000018) Reseed Interval MSB register.                         */
  __IOM uint32_t  PKECONTROL;                        /*!< (@ 0x0000001C) PKE Control register.                                 */
  __IOM uint32_t  PKECOMMAND;                        /*!< (@ 0x00000020) PKE Command register.                                 */
  __IOM uint32_t  PKESTATUS;                         /*!< (@ 0x00000024) PKE Status register.                                  */
  __IOM uint32_t  SOFTRST;                           /*!< (@ 0x00000028) SoftRst register.                                     */
  __IOM uint32_t  HWCONFIG;                          /*!< (@ 0x0000002C) HwConfig register.                                    */
} NRF_CRACENCORE_IKG_Type;                           /*!< Size = 48 (0x030)                                                    */

/* CRACENCORE_IKG_START: Start register. */
  #define CRACENCORE_IKG_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                   */

/* START @Bit 0 : Start the Isolated Key Generation. */
  #define CRACENCORE_IKG_START_START_Pos (0UL)       /*!< Position of START field.                                             */
  #define CRACENCORE_IKG_START_START_Msk (0x1UL << CRACENCORE_IKG_START_START_Pos) /*!< Bit mask of START field.               */


/* CRACENCORE_IKG_STATUS: Status register. */
  #define CRACENCORE_IKG_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                 */

/* SEEDERROR @Bit 0 : Seed Error during Isolated Key Generation. */
  #define CRACENCORE_IKG_STATUS_SEEDERROR_Pos (0UL)  /*!< Position of SEEDERROR field.                                         */
  #define CRACENCORE_IKG_STATUS_SEEDERROR_Msk (0x1UL << CRACENCORE_IKG_STATUS_SEEDERROR_Pos) /*!< Bit mask of SEEDERROR field. */

/* ENTROPYERROR @Bit 1 : Entropy Error during Isolated Key Generation. */
  #define CRACENCORE_IKG_STATUS_ENTROPYERROR_Pos (1UL) /*!< Position of ENTROPYERROR field.                                    */
  #define CRACENCORE_IKG_STATUS_ENTROPYERROR_Msk (0x1UL << CRACENCORE_IKG_STATUS_ENTROPYERROR_Pos) /*!< Bit mask of ENTROPYERROR
                                                                            field.*/

/* OKAY @Bit 2 : Isolated Key Generation is okay. */
  #define CRACENCORE_IKG_STATUS_OKAY_Pos (2UL)       /*!< Position of OKAY field.                                              */
  #define CRACENCORE_IKG_STATUS_OKAY_Msk (0x1UL << CRACENCORE_IKG_STATUS_OKAY_Pos) /*!< Bit mask of OKAY field.                */

/* CTRDRBGBUSY @Bit 4 : CTR_DRBG health test is busy (only when g_hw_health_test = true). */
  #define CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Pos (4UL) /*!< Position of CTRDRBGBUSY field.                                      */
  #define CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Msk (0x1UL << CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Pos) /*!< Bit mask of CTRDRBGBUSY
                                                                            field.*/

/* CATASTROPHICERROR @Bit 5 : Catastrophic error during CTR_DRBG health test (only when g_hw_health_test = true). */
  #define CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Pos (5UL) /*!< Position of CATASTROPHICERROR field.                          */
  #define CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Msk (0x1UL << CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Pos) /*!< Bit mask of
                                                                            CATASTROPHICERROR field.*/

/* SYMKEYSTORED @Bit 6 : Symmetric Keys are stored. */
  #define CRACENCORE_IKG_STATUS_SYMKEYSTORED_Pos (6UL) /*!< Position of SYMKEYSTORED field.                                    */
  #define CRACENCORE_IKG_STATUS_SYMKEYSTORED_Msk (0x1UL << CRACENCORE_IKG_STATUS_SYMKEYSTORED_Pos) /*!< Bit mask of SYMKEYSTORED
                                                                            field.*/

/* PRIVKEYSTORED @Bit 7 : Private Keys are stored. */
  #define CRACENCORE_IKG_STATUS_PRIVKEYSTORED_Pos (7UL) /*!< Position of PRIVKEYSTORED field.                                  */
  #define CRACENCORE_IKG_STATUS_PRIVKEYSTORED_Msk (0x1UL << CRACENCORE_IKG_STATUS_PRIVKEYSTORED_Pos) /*!< Bit mask of
                                                                            PRIVKEYSTORED field.*/


