adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ERROR @Bit 0 : Error because either Private Keys are not stored or the operation is not defined. */
  #define CRACENCORE_IKG_PKESTATUS_ERROR_Pos (0UL)   /*!< Position of ERROR field.                                             */
  #define CRACENCORE_IKG_PKESTATUS_ERROR_Msk (0x1UL << CRACENCORE_IKG_PKESTATUS_ERROR_Pos) /*!< Bit mask of ERROR field.       */

/* STARTERROR @Bit 1 : Error because a new operation is started while the previous one is still busy. */
  #define CRACENCORE_IKG_PKESTATUS_STARTERROR_Pos (1UL) /*!< Position of STARTERROR field.                                     */
  #define CRACENCORE_IKG_PKESTATUS_STARTERROR_Msk (0x1UL << CRACENCORE_IKG_PKESTATUS_STARTERROR_Pos) /*!< Bit mask of STARTERROR
                                                                            field.*/

/* IKGPKBUSY @Bit 16 : Busy, set when the operation starts and cleared when the operation is finished. */
  #define CRACENCORE_IKG_PKESTATUS_IKGPKBUSY_Pos (16UL) /*!< Position of IKGPKBUSY field.                                      */
  #define CRACENCORE_IKG_PKESTATUS_IKGPKBUSY_Msk (0x1UL << CRACENCORE_IKG_PKESTATUS_IKGPKBUSY_Pos) /*!< Bit mask of IKGPKBUSY
                                                                            field.*/

/* IRQSTATUS @Bit 17 : IRQ, set when the operation is finished and cleared when the CPU writes the bit 1 of PKE_Control Register
                       or a new operation is started. */

  #define CRACENCORE_IKG_PKESTATUS_IRQSTATUS_Pos (17UL) /*!< Position of IRQSTATUS field.                                      */
  #define CRACENCORE_IKG_PKESTATUS_IRQSTATUS_Msk (0x1UL << CRACENCORE_IKG_PKESTATUS_IRQSTATUS_Pos) /*!< Bit mask of IRQSTATUS
                                                                            field.*/

/* ERASEBUSY @Bit 18 : The PKE Data RAM is being erased. */
  #define CRACENCORE_IKG_PKESTATUS_ERASEBUSY_Pos (18UL) /*!< Position of ERASEBUSY field.                                      */
  #define CRACENCORE_IKG_PKESTATUS_ERASEBUSY_Msk (0x1UL << CRACENCORE_IKG_PKESTATUS_ERASEBUSY_Pos) /*!< Bit mask of ERASEBUSY
                                                                            field.*/


/* CRACENCORE_IKG_SOFTRST: SoftRst register. */
  #define CRACENCORE_IKG_SOFTRST_ResetValue (0x00000000UL) /*!< Reset value of SOFTRST register.                               */

/* SOFTRST @Bit 0 : Software reset: */
  #define CRACENCORE_IKG_SOFTRST_SOFTRST_Pos (0UL)   /*!< Position of SOFTRST field.                                           */
  #define CRACENCORE_IKG_SOFTRST_SOFTRST_Msk (0x1UL << CRACENCORE_IKG_SOFTRST_SOFTRST_Pos) /*!< Bit mask of SOFTRST field.     */
  #define CRACENCORE_IKG_SOFTRST_SOFTRST_Min (0x0UL) /*!< Min enumerator value of SOFTRST field.                               */
  #define CRACENCORE_IKG_SOFTRST_SOFTRST_Max (0x1UL) /*!< Max enumerator value of SOFTRST field.                               */
  #define CRACENCORE_IKG_SOFTRST_SOFTRST_NORMAL (0x0UL) /*!< Normal mode.                                                      */
  #define CRACENCORE_IKG_SOFTRST_SOFTRST_KEY (0x1UL) /*!< The Isolated Key Generation logic and the keys are reset.            */


/* CRACENCORE_IKG_HWCONFIG: HwConfig register. */
  #define CRACENCORE_IKG_HWCONFIG_ResetValue (0xCC4C8312UL) /*!< Reset value of HWCONFIG register.                             */

/* NBSYMKEYS @Bits 0..3 : Number of Symmetric Keys generated. */
  #define CRACENCORE_IKG_HWCONFIG_NBSYMKEYS_Pos (0UL) /*!< Position of NBSYMKEYS field.                                        */
  #define CRACENCORE_IKG_HWCONFIG_NBSYMKEYS_Msk (0xFUL << CRACENCORE_IKG_HWCONFIG_NBSYMKEYS_Pos) /*!< Bit mask of NBSYMKEYS
                                                                            field.*/

/* NBPRIVKEYS @Bits 4..7 : Number of Private Keys generated. */
  #define CRACENCORE_IKG_HWCONFIG_NBPRIVKEYS_Pos (4UL) /*!< Position of NBPRIVKEYS field.                                      */
  #define CRACENCORE_IKG_HWCONFIG_NBPRIVKEYS_Msk (0xFUL << CRACENCORE_IKG_HWCONFIG_NBPRIVKEYS_Pos) /*!< Bit mask of NBPRIVKEYS
                                                                            field.*/

/* IKGCM @Bit 8 : Countermeasures for IKG operations are implemented when 1. */
  #define CRACENCORE_IKG_HWCONFIG_IKGCM_Pos (8UL)    /*!< Position of IKGCM field.                                             */
  #define CRACENCORE_IKG_HWCONFIG_IKGCM_Msk (0x1UL << CRACENCORE_IKG_HWCONFIG_IKGCM_Pos) /*!< Bit mask of IKGCM field.         */

/* HWHEALTHTEST @Bit 9 : CTR_DRBG health test is implemented when 1. */
  #define CRACENCORE_IKG_HWCONFIG_HWHEALTHTEST_Pos (9UL) /*!< Position of HWHEALTHTEST field.                                  */
  #define CRACENCORE_IKG_HWCONFIG_HWHEALTHTEST_Msk (0x1UL << CRACENCORE_IKG_HWCONFIG_HWHEALTHTEST_Pos) /*!< Bit mask of
                                                                            HWHEALTHTEST field.*/

/* CURVE @Bits 10..11 : ECC curve for IKG (input). */
  #define CRACENCORE_IKG_HWCONFIG_CURVE_Pos (10UL)   /*!< Position of CURVE field.                                             */
  #define CRACENCORE_IKG_HWCONFIG_CURVE_Msk (0x3UL << CRACENCORE_IKG_HWCONFIG_CURVE_Pos) /*!< Bit mask of CURVE field.         */
  #define CRACENCORE_IKG_HWCONFIG_CURVE_Min (0x0UL)  /*!< Min enumerator value of CURVE field.                                 */
  #define CRACENCORE_IKG_HWCONFIG_CURVE_Max (0x2UL)  /*!< Max enumerator value of CURVE field.                                 */
  #define CRACENCORE_IKG_HWCONFIG_CURVE_P256 (0x0UL) /*!< P256.                                                                */
  #define CRACENCORE_IKG_HWCONFIG_CURVE_P384 (0x1UL) /*!< P384.                                                                */
  #define CRACENCORE_IKG_HWCONFIG_CURVE_P521 (0x2UL) /*!< P521.                                                                */

/* DF @Bit 12 : Derivation function is implemented in the CTR_DRBG when 1. */
  #define CRACENCORE_IKG_HWCONFIG_DF_Pos (12UL)      /*!< Position of DF field.                                                */
  #define CRACENCORE_IKG_HWCONFIG_DF_Msk (0x1UL << CRACENCORE_IKG_HWCONFIG_DF_Pos) /*!< Bit mask of DF field.                  */

/* KEYSIZE @Bits 13..15 : AES Key Size support for the AES Core embedded in the CTR_DRBG. */
  #define CRACENCORE_IKG_HWCONFIG_KEYSIZE_Pos (13UL) /*!< Position of KEYSIZE field.                                           */
  #define CRACENCORE_IKG_HWCONFIG_KEYSIZE_Msk (0x7UL << CRACENCORE_IKG_HWCONFIG_KEYSIZE_Pos) /*!< Bit mask of KEYSIZE field.   */
  #define CRACENCORE_IKG_HWCONFIG_KEYSIZE_Min (0x1UL) /*!< Min enumerator value of KEYSIZE field.                              */
  #define CRACENCORE_IKG_HWCONFIG_KEYSIZE_Max (0x4UL) /*!< Max enumerator value of KEYSIZE field.                              */
  #define CRACENCORE_IKG_HWCONFIG_KEYSIZE_AES128 (0x1UL) /*!< supports AES128                                                  */
  #define CRACENCORE_IKG_HWCONFIG_KEYSIZE_AES192 (0x2UL) /*!< supports AES192                                                  */
  #define CRACENCORE_IKG_HWCONFIG_KEYSIZE_AES256 (0x4UL) /*!< supports AES256                                                  */

/* ENTROPYINPUTLENGTH @Bits 16..19 : Value of g_entropy_input_length/32. */
  #define CRACENCORE_IKG_HWCONFIG_ENTROPYINPUTLENGTH_Pos (16UL) /*!< Position of ENTROPYINPUTLENGTH field.                     */
  #define CRACENCORE_IKG_HWCONFIG_ENTROPYINPUTLENGTH_Msk (0xFUL << CRACENCORE_IKG_HWCONFIG_ENTROPYINPUTLENGTH_Pos) /*!< Bit mask
                                                                            of ENTROPYINPUTLENGTH field.*/

/* NONCELENGTH @Bits 20..23 : Value of g_nonce_length/32. */
  #define CRACENCORE_IKG_HWCONFIG_NONCELENGTH_Pos (20UL) /*!< Position of NONCELENGTH field.                                   */
  #define CRACENCORE_IKG_HWCONFIG_NONCELENGTH_Msk (0xFUL << CRACENCORE_IKG_HWCONFIG_NONCELENGTH_Pos) /*!< Bit mask of
                                                                            NONCELENGTH field.*/

/* PERSONALIZATIONSTRINGLENGTH @Bits 24..27 : Value of g_personalization_string_length/32. */
  #define CRACENCORE_IKG_HWCONFIG_PERSONALIZATIONSTRINGLENGTH_Pos (24UL) /*!< Position of PERSONALIZATIONSTRINGLENGTH field.   */
  #define CRACENCORE_IKG_HWCONFIG_PERSONALIZATIONSTRINGLENGTH_Msk (0xFUL << CRACENCORE_IKG_HWCONFIG_PERSONALIZATIONSTRINGLENGTH_Pos)
                                                                            /*!< Bit mask of PERSONALIZATIONSTRINGLENGTH field.*/

/* ADDITIONALINPUTLENGTH @Bits 28..31 : Value of g_additional_input_length/32. */
  #define CRACENCORE_IKG_HWCONFIG_ADDITIONALINPUTLENGTH_Pos (28UL) /*!< Position of ADDITIONALINPUTLENGTH field.               */
  #define CRACENCORE_IKG_HWCONFIG_ADDITIONALINPUTLENGTH_Msk (0xFUL << CRACENCORE_IKG_HWCONFIG_ADDITIONALINPUTLENGTH_Pos) /*!<
                                                                            Bit mask of ADDITIONALINPUTLENGTH field.*/


/* ==================================================== Struct CRACENCORE ==================================================== */
/**
  * @brief CRACENCORE
  */
  typedef struct {                                   /*!< CRACENCORE Structure                                                 */
    __IOM NRF_CRACENCORE_CRYPTMSTRDMA_Type CRYPTMSTRDMA; /*!< (@ 0x00000000) (unspecified)                                     */
    __IM uint32_t RESERVED[240];
    __IOM NRF_CRACENCORE_CRYPTMSTRHW_Type CRYPTMSTRHW; /*!< (@ 0x00000400) (unspecified)                                       */
    __IM uint32_t RESERVED1[761];
    __IOM NRF_CRACENCORE_RNGCONTROL_Type RNGCONTROL; /*!< (@ 0x00001000) (unspecified)                                         */
    __IM uint32_t RESERVED2[976];
    __IOM NRF_CRACENCORE_PK_Type PK;                 /*!< (@ 0x00002000) (unspecified)                                         */
    __IM uint32_t RESERVED3[1006];
    __IOM NRF_CRACENCORE_IKG_Type IKG;               /*!< (@ 0x00003000) (unspecified)                                         */
  } NRF_CRACENCORE_Type;                             /*!< Size = 12336 (0x3030)                                                */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CTI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CTI ======================================================== */
/**
  * @brief Cross-Trigger Interface control
  */
  typedef struct {                                   /*!< CTI Structure                                                        */
    __IOM uint32_t CTICONTROL;                       /*!< (@ 0x00000000) CTI Control register                                  */
    __IM uint32_t RESERVED[3];
    __OM uint32_t CTIINTACK;                         /*!< (@ 0x00000010) CTI Interrupt Acknowledge register                    */
    __IOM uint32_t CTIAPPSET;                        /*!< (@ 0x00000014) CTI Application Trigger Set register                  */
    __OM uint32_t CTIAPPCLEAR;                       /*!< (@ 0x00000018) CTI Application Trigger Clear register                */
    __OM uint32_t CTIAPPPULSE;                       /*!< (@ 0x0000001C) CTI Application Pulse register                        */
    __IOM uint32_t CTIINEN[8];                       /*!< (@ 0x00000020) CTI Trigger to Channel Enable register                */
    __IM uint32_t RESERVED1[24];
    __IOM uint32_t CTIOUTEN[8];                      /*!< (@ 0x000000A0) CTI Channel to Trigger Enable register                */
    __IM uint32_t RESERVED2[28];
    __IM uint32_t CTITRIGINSTATUS;                   /*!< (@ 0x00000130) CTI Trigger In Status register Because the register
                                                                         provides a view of the raw ctitrigin inputs, the reset
                                                                         value is UNKNOWN.*/
    __IM uint32_t CTITRIGOUTSTATUS;                  /*!< (@ 0x00000134) CTI Trigger Out Status register                       */
    __IM uint32_t CTICHINSTATUS;                     /*!< (@ 0x00000138) CTI Channel In Status register Because the register
                                                                         provides a view of the raw ctichin inputs, the reset
                                                                         value is UNKNOWN.*/
    __IM uint32_t CTICHOUTSTATUS;                    /*!< (@ 0x0000013C) CTI Channel Out Status register                       */
    __IOM uint32_t CTIGATE;                          /*!< (@ 0x00000140) Enable CTI Channel Gate register                      */
    __IOM uint32_t ASICCTL;                          /*!< (@ 0x00000144) External Multiplexer Control register                 */
    __IM uint32_t RESERVED3[869];
    __OM uint32_t ITCHINACK;                         /*!< (@ 0x00000EDC) Integration Test Channel Input Acknowledge register   */
    __OM uint32_t ITTRIGINACK;                       /*!< (@ 0x00000EE0) Integration Test Trigger Input Acknowledge register   */
    __OM uint32_t ITCHOUT;                           /*!< (@ 0x00000EE4) Integration Test Channel Output register              */
    __OM uint32_t ITTRIGOUT;                         /*!< (@ 0x00000EE8) Integration Test Trigger Output register              */
    __IM uint32_t ITCHOUTACK;                        /*!< (@ 0x00000EEC) Integration Test Channel Output Acknowledge register  */
    __IM uint32_t ITTRIGOUTACK;                      /*!< (@ 0x00000EF0) Integration Test Trigger Output Acknowledge register  */
    __IM uint32_t ITCHIN;                            /*!< (@ 0x00000EF4) Integration Test Channel Input register               */
    __IM uint32_t ITTRIGIN;                          /*!< (@ 0x00000EF8) Integration Test Trigger input register               */
    __IM uint32_t RESERVED4;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) Integration Mode Control register                     */
    __IM uint32_t RESERVED5[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Claim Tag Set register                                */
    __IOM uint32_t CLAIMCLR;                         /*!< (@ 0x00000FA4) Claim Tag Clear register                              */
    __IM uint32_t RESERVED6[2];
    __OM uint32_t LAR;                               /*!< (@ 0x00000FB0) Lock Address Register                                 */
    __IM uint32_t LSR;                               /*!< (@ 0x00000FB4) Lock Status Register                                  */
    __IM uint32_t AUTHSTATUS;                        /*!< (@ 0x00000FB8) Authentication Status Register                        */
    __IM uint32_t DEVARCH;                           /*!< (@ 0x00000FBC) Device Architecture register                          */
    __IM uint32_t RESERVED7[2];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Device Configuration register                         */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) Device Type Identifier register                       */
    __IM uint32_t PIDR4;                             /*!< (@ 0x00000FD0) Peripheral ID4 Register                               */
    __IM uint32_t PIDR5;                             /*!< (@ 0x00000FD4) Peripheral ID5 register                               */
    __IM uint32_t PIDR6;                             /*!< (@ 0x00000FD8) Peripheral ID6 register                               */
    __IM uint32_t PIDR7;                             /*!< (@ 0x00000FDC) Peripheral ID7 register                               */
    __IM uint32_t PIDR0;                             /*!< (@ 0x00000FE0) Peripheral ID0 Register                               */
    __IM uint32_t PIDR1;                             /*!< (@ 0x00000FE4) Peripheral ID1 Register                               */
    __IM uint32_t PIDR2;                             /*!< (@ 0x00000FE8) Peripheral ID2 Register                               */
    __IM uint32_t PIDR3;                             /*!< (@ 0x00000FEC) Peripheral ID3 Register                               */
    __IM uint32_t CIDR0;                             /*!< (@ 0x00000FF0) Component ID0 Register                                */
    __IM uint32_t CIDR1;                             /*!< (@ 0x00000FF4) Component ID1 Register                                */
    __IM uint32_t CIDR2;                             /*!< (@ 0x00000FF8) Component ID2 Register                                */
    __IM uint32_t CIDR3;                             /*!< (@ 0x00000FFC) Component ID3 Register                                */
  } NRF_CTI_Type;                                    /*!< Size = 4096 (0x1000)                                                 */

/* CTI_CTICONTROL: CTI Control register */
  #define CTI_CTICONTROL_ResetValue (0x00000000UL)   /*!< Reset value of CTICONTROL register.                                  */

/* GLBEN @Bit 0 : Enables or disables the CTI. */
  #define CTI_CTICONTROL_GLBEN_Pos (0UL)             /*!< Position of GLBEN field.                                             */
  #define CTI_CTICONTROL_GLBEN_Msk (0x1UL << CTI_CTICONTROL_GLBEN_Pos) /*!< Bit mask of GLBEN field.                           */
  #define CTI_CTICONTROL_GLBEN_Min (0x0UL)           /*!< Min enumerator value of GLBEN field.                                 */
  #define CTI_CTICONTROL_GLBEN_Max (0x1UL)           /*!< Max enumerator value of GLBEN field.                                 */
  #define CTI_CTICONTROL_GLBEN_Disabled (0x0UL)      /*!< All cross-triggering mapping logic functionality is disabled.        */
  #define CTI_CTICONTROL_GLBEN_Enabled (0x1UL)       /*!< Cross-triggering mapping logic functionality is enabled.             */


/* CTI_CTIINTACK: CTI Interrupt Acknowledge register */
  #define CTI_CTIINTACK_ResetValue (0x00000000UL)    /*!< Reset value of CTIINTACK register.                                   */

