adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CTI_ITCHOUTACK: Integration Test Channel Output Acknowledge register */
  #define CTI_ITCHOUTACK_ResetValue (0x00000000UL)   /*!< Reset value of ITCHOUTACK register.                                  */

/* CTCHOUTACK0 @Bit 0 : Reads the value of the ctichoutack 0 input */
  #define CTI_ITCHOUTACK_CTCHOUTACK0_Pos (0UL)       /*!< Position of CTCHOUTACK0 field.                                       */
  #define CTI_ITCHOUTACK_CTCHOUTACK0_Msk (0x1UL << CTI_ITCHOUTACK_CTCHOUTACK0_Pos) /*!< Bit mask of CTCHOUTACK0 field.         */

/* CTCHOUTACK1 @Bit 1 : Reads the value of the ctichoutack 1 input */
  #define CTI_ITCHOUTACK_CTCHOUTACK1_Pos (1UL)       /*!< Position of CTCHOUTACK1 field.                                       */
  #define CTI_ITCHOUTACK_CTCHOUTACK1_Msk (0x1UL << CTI_ITCHOUTACK_CTCHOUTACK1_Pos) /*!< Bit mask of CTCHOUTACK1 field.         */

/* CTCHOUTACK2 @Bit 2 : Reads the value of the ctichoutack 2 input */
  #define CTI_ITCHOUTACK_CTCHOUTACK2_Pos (2UL)       /*!< Position of CTCHOUTACK2 field.                                       */
  #define CTI_ITCHOUTACK_CTCHOUTACK2_Msk (0x1UL << CTI_ITCHOUTACK_CTCHOUTACK2_Pos) /*!< Bit mask of CTCHOUTACK2 field.         */

/* CTCHOUTACK3 @Bit 3 : Reads the value of the ctichoutack 3 input */
  #define CTI_ITCHOUTACK_CTCHOUTACK3_Pos (3UL)       /*!< Position of CTCHOUTACK3 field.                                       */
  #define CTI_ITCHOUTACK_CTCHOUTACK3_Msk (0x1UL << CTI_ITCHOUTACK_CTCHOUTACK3_Pos) /*!< Bit mask of CTCHOUTACK3 field.         */


/* CTI_ITTRIGOUTACK: Integration Test Trigger Output Acknowledge register */
  #define CTI_ITTRIGOUTACK_ResetValue (0x00000000UL) /*!< Reset value of ITTRIGOUTACK register.                                */

/* CTTRIGOUT0 @Bit 0 : Reads the value of the ctitrigoutack 0 input */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT0_Pos (0UL)      /*!< Position of CTTRIGOUT0 field.                                        */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT0_Msk (0x1UL << CTI_ITTRIGOUTACK_CTTRIGOUT0_Pos) /*!< Bit mask of CTTRIGOUT0 field.        */

/* CTTRIGOUT1 @Bit 1 : Reads the value of the ctitrigoutack 1 input */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT1_Pos (1UL)      /*!< Position of CTTRIGOUT1 field.                                        */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT1_Msk (0x1UL << CTI_ITTRIGOUTACK_CTTRIGOUT1_Pos) /*!< Bit mask of CTTRIGOUT1 field.        */

/* CTTRIGOUT2 @Bit 2 : Reads the value of the ctitrigoutack 2 input */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT2_Pos (2UL)      /*!< Position of CTTRIGOUT2 field.                                        */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT2_Msk (0x1UL << CTI_ITTRIGOUTACK_CTTRIGOUT2_Pos) /*!< Bit mask of CTTRIGOUT2 field.        */

/* CTTRIGOUT3 @Bit 3 : Reads the value of the ctitrigoutack 3 input */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT3_Pos (3UL)      /*!< Position of CTTRIGOUT3 field.                                        */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT3_Msk (0x1UL << CTI_ITTRIGOUTACK_CTTRIGOUT3_Pos) /*!< Bit mask of CTTRIGOUT3 field.        */

/* CTTRIGOUT4 @Bit 4 : Reads the value of the ctitrigoutack 4 input */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT4_Pos (4UL)      /*!< Position of CTTRIGOUT4 field.                                        */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT4_Msk (0x1UL << CTI_ITTRIGOUTACK_CTTRIGOUT4_Pos) /*!< Bit mask of CTTRIGOUT4 field.        */

/* CTTRIGOUT5 @Bit 5 : Reads the value of the ctitrigoutack 5 input */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT5_Pos (5UL)      /*!< Position of CTTRIGOUT5 field.                                        */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT5_Msk (0x1UL << CTI_ITTRIGOUTACK_CTTRIGOUT5_Pos) /*!< Bit mask of CTTRIGOUT5 field.        */

/* CTTRIGOUT6 @Bit 6 : Reads the value of the ctitrigoutack 6 input */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT6_Pos (6UL)      /*!< Position of CTTRIGOUT6 field.                                        */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT6_Msk (0x1UL << CTI_ITTRIGOUTACK_CTTRIGOUT6_Pos) /*!< Bit mask of CTTRIGOUT6 field.        */

/* CTTRIGOUT7 @Bit 7 : Reads the value of the ctitrigoutack 7 input */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT7_Pos (7UL)      /*!< Position of CTTRIGOUT7 field.                                        */
  #define CTI_ITTRIGOUTACK_CTTRIGOUT7_Msk (0x1UL << CTI_ITTRIGOUTACK_CTTRIGOUT7_Pos) /*!< Bit mask of CTTRIGOUT7 field.        */


/* CTI_ITCHIN: Integration Test Channel Input register */
  #define CTI_ITCHIN_ResetValue (0x00000000UL)       /*!< Reset value of ITCHIN register.                                      */

/* CTCHIN0 @Bit 0 : Reads the value of the ctichin 0 input */
  #define CTI_ITCHIN_CTCHIN0_Pos (0UL)               /*!< Position of CTCHIN0 field.                                           */
  #define CTI_ITCHIN_CTCHIN0_Msk (0x1UL << CTI_ITCHIN_CTCHIN0_Pos) /*!< Bit mask of CTCHIN0 field.                             */

/* CTCHIN1 @Bit 1 : Reads the value of the ctichin 1 input */
  #define CTI_ITCHIN_CTCHIN1_Pos (1UL)               /*!< Position of CTCHIN1 field.                                           */
  #define CTI_ITCHIN_CTCHIN1_Msk (0x1UL << CTI_ITCHIN_CTCHIN1_Pos) /*!< Bit mask of CTCHIN1 field.                             */

/* CTCHIN2 @Bit 2 : Reads the value of the ctichin 2 input */
  #define CTI_ITCHIN_CTCHIN2_Pos (2UL)               /*!< Position of CTCHIN2 field.                                           */
  #define CTI_ITCHIN_CTCHIN2_Msk (0x1UL << CTI_ITCHIN_CTCHIN2_Pos) /*!< Bit mask of CTCHIN2 field.                             */

/* CTCHIN3 @Bit 3 : Reads the value of the ctichin 3 input */
  #define CTI_ITCHIN_CTCHIN3_Pos (3UL)               /*!< Position of CTCHIN3 field.                                           */
  #define CTI_ITCHIN_CTCHIN3_Msk (0x1UL << CTI_ITCHIN_CTCHIN3_Pos) /*!< Bit mask of CTCHIN3 field.                             */


/* CTI_ITTRIGIN: Integration Test Trigger input register */
  #define CTI_ITTRIGIN_ResetValue (0x00000000UL)     /*!< Reset value of ITTRIGIN register.                                    */

/* CTTRIGIN0 @Bit 0 : Reads the value of the ctitrigin 0 input */
  #define CTI_ITTRIGIN_CTTRIGIN0_Pos (0UL)           /*!< Position of CTTRIGIN0 field.                                         */
  #define CTI_ITTRIGIN_CTTRIGIN0_Msk (0x1UL << CTI_ITTRIGIN_CTTRIGIN0_Pos) /*!< Bit mask of CTTRIGIN0 field.                   */

