adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CTTRIGIN1 @Bit 1 : Reads the value of the ctitrigin 1 input */
  #define CTI_ITTRIGIN_CTTRIGIN1_Pos (1UL)           /*!< Position of CTTRIGIN1 field.                                         */
  #define CTI_ITTRIGIN_CTTRIGIN1_Msk (0x1UL << CTI_ITTRIGIN_CTTRIGIN1_Pos) /*!< Bit mask of CTTRIGIN1 field.                   */

/* CTTRIGIN2 @Bit 2 : Reads the value of the ctitrigin 2 input */
  #define CTI_ITTRIGIN_CTTRIGIN2_Pos (2UL)           /*!< Position of CTTRIGIN2 field.                                         */
  #define CTI_ITTRIGIN_CTTRIGIN2_Msk (0x1UL << CTI_ITTRIGIN_CTTRIGIN2_Pos) /*!< Bit mask of CTTRIGIN2 field.                   */

/* CTTRIGIN3 @Bit 3 : Reads the value of the ctitrigin 3 input */
  #define CTI_ITTRIGIN_CTTRIGIN3_Pos (3UL)           /*!< Position of CTTRIGIN3 field.                                         */
  #define CTI_ITTRIGIN_CTTRIGIN3_Msk (0x1UL << CTI_ITTRIGIN_CTTRIGIN3_Pos) /*!< Bit mask of CTTRIGIN3 field.                   */

/* CTTRIGIN4 @Bit 4 : Reads the value of the ctitrigin 4 input */
  #define CTI_ITTRIGIN_CTTRIGIN4_Pos (4UL)           /*!< Position of CTTRIGIN4 field.                                         */
  #define CTI_ITTRIGIN_CTTRIGIN4_Msk (0x1UL << CTI_ITTRIGIN_CTTRIGIN4_Pos) /*!< Bit mask of CTTRIGIN4 field.                   */

/* CTTRIGIN5 @Bit 5 : Reads the value of the ctitrigin 5 input */
  #define CTI_ITTRIGIN_CTTRIGIN5_Pos (5UL)           /*!< Position of CTTRIGIN5 field.                                         */
  #define CTI_ITTRIGIN_CTTRIGIN5_Msk (0x1UL << CTI_ITTRIGIN_CTTRIGIN5_Pos) /*!< Bit mask of CTTRIGIN5 field.                   */

/* CTTRIGIN6 @Bit 6 : Reads the value of the ctitrigin 6 input */
  #define CTI_ITTRIGIN_CTTRIGIN6_Pos (6UL)           /*!< Position of CTTRIGIN6 field.                                         */
  #define CTI_ITTRIGIN_CTTRIGIN6_Msk (0x1UL << CTI_ITTRIGIN_CTTRIGIN6_Pos) /*!< Bit mask of CTTRIGIN6 field.                   */

/* CTTRIGIN7 @Bit 7 : Reads the value of the ctitrigin 7 input */
  #define CTI_ITTRIGIN_CTTRIGIN7_Pos (7UL)           /*!< Position of CTTRIGIN7 field.                                         */
  #define CTI_ITTRIGIN_CTTRIGIN7_Msk (0x1UL << CTI_ITTRIGIN_CTTRIGIN7_Pos) /*!< Bit mask of CTTRIGIN7 field.                   */


/* CTI_ITCTRL: Integration Mode Control register */
  #define CTI_ITCTRL_ResetValue (0x00000000UL)       /*!< Reset value of ITCTRL register.                                      */

/* IME @Bit 0 : Integration Mode Enable */
  #define CTI_ITCTRL_IME_Pos (0UL)                   /*!< Position of IME field.                                               */
  #define CTI_ITCTRL_IME_Msk (0x1UL << CTI_ITCTRL_IME_Pos) /*!< Bit mask of IME field.                                         */
  #define CTI_ITCTRL_IME_Min (0x0UL)                 /*!< Min enumerator value of IME field.                                   */
  #define CTI_ITCTRL_IME_Max (0x1UL)                 /*!< Max enumerator value of IME field.                                   */
  #define CTI_ITCTRL_IME_Enable (0x1UL)              /*!< Enable integration mode                                              */
  #define CTI_ITCTRL_IME_Disable (0x0UL)             /*!< Disable integration mode                                             */


/* CTI_CLAIMSET: Claim Tag Set register */
  #define CTI_CLAIMSET_ResetValue (0x0000000FUL)     /*!< Reset value of CLAIMSET register.                                    */

/* SET0 @Bit 0 : Determines whether claim bit 0 is implemented */
  #define CTI_CLAIMSET_SET0_Pos (0UL)                /*!< Position of SET0 field.                                              */
  #define CTI_CLAIMSET_SET0_Msk (0x1UL << CTI_CLAIMSET_SET0_Pos) /*!< Bit mask of SET0 field.                                  */
  #define CTI_CLAIMSET_SET0_Min (0x1UL)              /*!< Min enumerator value of SET0 field.                                  */
  #define CTI_CLAIMSET_SET0_Max (0x1UL)              /*!< Max enumerator value of SET0 field.                                  */
  #define CTI_CLAIMSET_SET0_Implemented (0x1UL)      /*!< Claim tag bit 0 is implemented                                       */
  #define CTI_CLAIMSET_SET0_Claim (0x1UL)            /*!< Set claim bit 0                                                      */

/* SET1 @Bit 1 : Determines whether claim bit 1 is implemented */
  #define CTI_CLAIMSET_SET1_Pos (1UL)                /*!< Position of SET1 field.                                              */
  #define CTI_CLAIMSET_SET1_Msk (0x1UL << CTI_CLAIMSET_SET1_Pos) /*!< Bit mask of SET1 field.                                  */
  #define CTI_CLAIMSET_SET1_Min (0x1UL)              /*!< Min enumerator value of SET1 field.                                  */
  #define CTI_CLAIMSET_SET1_Max (0x1UL)              /*!< Max enumerator value of SET1 field.                                  */
  #define CTI_CLAIMSET_SET1_Implemented (0x1UL)      /*!< Claim tag bit 1 is implemented                                       */
  #define CTI_CLAIMSET_SET1_Claim (0x1UL)            /*!< Set claim bit 1                                                      */

/* SET2 @Bit 2 : Determines whether claim bit 2 is implemented */
  #define CTI_CLAIMSET_SET2_Pos (2UL)                /*!< Position of SET2 field.                                              */
  #define CTI_CLAIMSET_SET2_Msk (0x1UL << CTI_CLAIMSET_SET2_Pos) /*!< Bit mask of SET2 field.                                  */
  #define CTI_CLAIMSET_SET2_Min (0x1UL)              /*!< Min enumerator value of SET2 field.                                  */
  #define CTI_CLAIMSET_SET2_Max (0x1UL)              /*!< Max enumerator value of SET2 field.                                  */
  #define CTI_CLAIMSET_SET2_Implemented (0x1UL)      /*!< Claim tag bit 2 is implemented                                       */
  #define CTI_CLAIMSET_SET2_Claim (0x1UL)            /*!< Set claim bit 2                                                      */

