adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* NUMCH @Bits 16..19 : Number of ECT channels available. */
  #define CTI_DEVID_NUMCH_Pos (16UL)                 /*!< Position of NUMCH field.                                             */
  #define CTI_DEVID_NUMCH_Msk (0xFUL << CTI_DEVID_NUMCH_Pos) /*!< Bit mask of NUMCH field.                                     */


/* CTI_DEVTYPE: Device Type Identifier register */
  #define CTI_DEVTYPE_ResetValue (0x00000014UL)      /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR @Bits 0..3 : Major classification of the type of the debug component as specified in the Arm Architecture Specification
                      for this debug and trace component. */

  #define CTI_DEVTYPE_MAJOR_Pos (0UL)                /*!< Position of MAJOR field.                                             */
  #define CTI_DEVTYPE_MAJOR_Msk (0xFUL << CTI_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                                 */
  #define CTI_DEVTYPE_MAJOR_Min (0x4UL)              /*!< Min enumerator value of MAJOR field.                                 */
  #define CTI_DEVTYPE_MAJOR_Max (0x4UL)              /*!< Max enumerator value of MAJOR field.                                 */
  #define CTI_DEVTYPE_MAJOR_Controller (0x4UL)       /*!< Indicates that this component allows a debugger to control other
                                                          components in an Arm CoreSight SoC-400 system.*/

/* SUB @Bits 4..7 : Sub-classification of the type of the debug component as specified in the Arm Architecture Specification
                    within the major classification as specified in the MAJOR field. */

  #define CTI_DEVTYPE_SUB_Pos (4UL)                  /*!< Position of SUB field.                                               */
  #define CTI_DEVTYPE_SUB_Msk (0xFUL << CTI_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                       */
  #define CTI_DEVTYPE_SUB_Min (0x1UL)                /*!< Min enumerator value of SUB field.                                   */
  #define CTI_DEVTYPE_SUB_Max (0x1UL)                /*!< Max enumerator value of SUB field.                                   */
  #define CTI_DEVTYPE_SUB_Crosstrigger (0x1UL)       /*!< Indicates that this component is a sub-triggering component.         */


/* CTI_PIDR4: Peripheral ID4 Register */
  #define CTI_PIDR4_ResetValue (0x00000004UL)        /*!< Reset value of PIDR4 register.                                       */

/* DES_2 @Bits 0..3 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
  #define CTI_PIDR4_DES_2_Pos (0UL)                  /*!< Position of DES_2 field.                                             */
  #define CTI_PIDR4_DES_2_Msk (0xFUL << CTI_PIDR4_DES_2_Pos) /*!< Bit mask of DES_2 field.                                     */
  #define CTI_PIDR4_DES_2_Min (0x4UL)                /*!< Min enumerator value of DES_2 field.                                 */
  #define CTI_PIDR4_DES_2_Max (0x4UL)                /*!< Max enumerator value of DES_2 field.                                 */
  #define CTI_PIDR4_DES_2_Code (0x4UL)               /*!< JEDEC continuation code.                                             */

/* SIZE @Bits 4..7 : Always 0b0000. Indicates that the device only occupies 4KB of memory. */
  #define CTI_PIDR4_SIZE_Pos (4UL)                   /*!< Position of SIZE field.                                              */
  #define CTI_PIDR4_SIZE_Msk (0xFUL << CTI_PIDR4_SIZE_Pos) /*!< Bit mask of SIZE field.                                        */


/* CTI_PIDR0: Peripheral ID0 Register */
  #define CTI_PIDR0_ResetValue (0x00000021UL)        /*!< Reset value of PIDR0 register.                                       */

/* PART_0 @Bits 0..7 : Bits[7:0] of the 12-bit part number of the component. The designer of the component assigns this part
                       number. */

  #define CTI_PIDR0_PART_0_Pos (0UL)                 /*!< Position of PART_0 field.                                            */
  #define CTI_PIDR0_PART_0_Msk (0xFFUL << CTI_PIDR0_PART_0_Pos) /*!< Bit mask of PART_0 field.                                 */
  #define CTI_PIDR0_PART_0_Min (0x21UL)              /*!< Min enumerator value of PART_0 field.                                */
  #define CTI_PIDR0_PART_0_Max (0x21UL)              /*!< Max enumerator value of PART_0 field.                                */
  #define CTI_PIDR0_PART_0_PartnumberL (0x21UL)      /*!< Indicates bits[7:0] of the part number of the component.             */


/* CTI_PIDR1: Peripheral ID1 Register */
  #define CTI_PIDR1_ResetValue (0x000000BDUL)        /*!< Reset value of PIDR1 register.                                       */

/* PART_1 @Bits 0..3 : Bits[11:8] of the 12-bit part number of the component. The designer of the component assigns this part
                       number. */

  #define CTI_PIDR1_PART_1_Pos (0UL)                 /*!< Position of PART_1 field.                                            */
  #define CTI_PIDR1_PART_1_Msk (0xFUL << CTI_PIDR1_PART_1_Pos) /*!< Bit mask of PART_1 field.                                  */
  #define CTI_PIDR1_PART_1_Min (0xDUL)               /*!< Min enumerator value of PART_1 field.                                */
  #define CTI_PIDR1_PART_1_Max (0xDUL)               /*!< Max enumerator value of PART_1 field.                                */
  #define CTI_PIDR1_PART_1_PartnumberH (0xDUL)       /*!< Indicates bits[11:8] of the part number of the component.            */

/* DES_0 @Bits 4..7 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
  #define CTI_PIDR1_DES_0_Pos (4UL)                  /*!< Position of DES_0 field.                                             */
  #define CTI_PIDR1_DES_0_Msk (0xFUL << CTI_PIDR1_DES_0_Pos) /*!< Bit mask of DES_0 field.                                     */
  #define CTI_PIDR1_DES_0_Min (0xBUL)                /*!< Min enumerator value of DES_0 field.                                 */
  #define CTI_PIDR1_DES_0_Max (0xBUL)                /*!< Max enumerator value of DES_0 field.                                 */
  #define CTI_PIDR1_DES_0_Arm (0xBUL)                /*!< Arm. Bits[3:0] of the JEDEC JEP106 Identity Code                     */


/* CTI_PIDR2: Peripheral ID2 Register */
  #define CTI_PIDR2_ResetValue (0x0000000BUL)        /*!< Reset value of PIDR2 register.                                       */

/* DES_1 @Bits 0..2 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
  #define CTI_PIDR2_DES_1_Pos (0UL)                  /*!< Position of DES_1 field.                                             */
  #define CTI_PIDR2_DES_1_Msk (0x7UL << CTI_PIDR2_DES_1_Pos) /*!< Bit mask of DES_1 field.                                     */
  #define CTI_PIDR2_DES_1_Min (0x3UL)                /*!< Min enumerator value of DES_1 field.                                 */
  #define CTI_PIDR2_DES_1_Max (0x3UL)                /*!< Max enumerator value of DES_1 field.                                 */
  #define CTI_PIDR2_DES_1_Arm (0x3UL)                /*!< Arm. Bits[6:4] of the JEDEC JEP106 Identity Code                     */

