adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* JEDEC @Bit 3 : Always 1. Indicates that the JEDEC-assigned designer ID is used. */
  #define CTI_PIDR2_JEDEC_Pos (3UL)                  /*!< Position of JEDEC field.                                             */
  #define CTI_PIDR2_JEDEC_Msk (0x1UL << CTI_PIDR2_JEDEC_Pos) /*!< Bit mask of JEDEC field.                                     */

/* REVISION @Bits 4..7 : Peripheral revision */
  #define CTI_PIDR2_REVISION_Pos (4UL)               /*!< Position of REVISION field.                                          */
  #define CTI_PIDR2_REVISION_Msk (0xFUL << CTI_PIDR2_REVISION_Pos) /*!< Bit mask of REVISION field.                            */
  #define CTI_PIDR2_REVISION_Min (0x0UL)             /*!< Min enumerator value of REVISION field.                              */
  #define CTI_PIDR2_REVISION_Max (0x0UL)             /*!< Max enumerator value of REVISION field.                              */
  #define CTI_PIDR2_REVISION_Rev0p0 (0x0UL)          /*!< This device is at r0p0                                               */


/* CTI_PIDR3: Peripheral ID3 Register */
  #define CTI_PIDR3_ResetValue (0x00000000UL)        /*!< Reset value of PIDR3 register.                                       */

/* CMOD @Bits 0..3 : Customer Modified. Indicates whether the customer has modified the behavior of the component. In most
                     cases, this field is 0b0000. Customers change this value when they make authorized modifications to this
                     component. */

  #define CTI_PIDR3_CMOD_Pos (0UL)                   /*!< Position of CMOD field.                                              */
  #define CTI_PIDR3_CMOD_Msk (0xFUL << CTI_PIDR3_CMOD_Pos) /*!< Bit mask of CMOD field.                                        */
  #define CTI_PIDR3_CMOD_Min (0x0UL)                 /*!< Min enumerator value of CMOD field.                                  */
  #define CTI_PIDR3_CMOD_Max (0x0UL)                 /*!< Max enumerator value of CMOD field.                                  */
  #define CTI_PIDR3_CMOD_Unmodified (0x0UL)          /*!< Indicates that the customer has not modified this component.         */

/* REVAND @Bits 4..7 : Indicates minor errata fixes specific to the revision of the component being used, for example metal
                       fixes after implementation. In most cases, this field is 0b0000. Arm recommends that the component
                       designers ensure that a metal fix can change this field if required, for example, by driving it from
                       registers that reset to 0b0000. */

  #define CTI_PIDR3_REVAND_Pos (4UL)                 /*!< Position of REVAND field.                                            */
  #define CTI_PIDR3_REVAND_Msk (0xFUL << CTI_PIDR3_REVAND_Pos) /*!< Bit mask of REVAND field.                                  */
  #define CTI_PIDR3_REVAND_Min (0x0UL)               /*!< Min enumerator value of REVAND field.                                */
  #define CTI_PIDR3_REVAND_Max (0x0UL)               /*!< Max enumerator value of REVAND field.                                */
  #define CTI_PIDR3_REVAND_NoErrata (0x0UL)          /*!< Indicates that there are no errata fixes to this component.          */


/* CTI_CIDR0: Component ID0 Register */
  #define CTI_CIDR0_ResetValue (0x0000000DUL)        /*!< Reset value of CIDR0 register.                                       */

/* PRMBL_0 @Bits 0..7 : Preamble[0]. Contains bits[7:0] of the component identification code. */
  #define CTI_CIDR0_PRMBL_0_Pos (0UL)                /*!< Position of PRMBL_0 field.                                           */
  #define CTI_CIDR0_PRMBL_0_Msk (0xFFUL << CTI_CIDR0_PRMBL_0_Pos) /*!< Bit mask of PRMBL_0 field.                              */
  #define CTI_CIDR0_PRMBL_0_Min (0xDUL)              /*!< Min enumerator value of PRMBL_0 field.                               */
  #define CTI_CIDR0_PRMBL_0_Max (0xDUL)              /*!< Max enumerator value of PRMBL_0 field.                               */
  #define CTI_CIDR0_PRMBL_0_Value (0x0DUL)           /*!< Bits[7:0] of the identification code.                                */


/* CTI_CIDR1: Component ID1 Register */
  #define CTI_CIDR1_ResetValue (0x00000090UL)        /*!< Reset value of CIDR1 register.                                       */

/* PRMBL_1 @Bits 0..3 : Preamble[1]. Contains bits[11:8] of the component identification code. */
  #define CTI_CIDR1_PRMBL_1_Pos (0UL)                /*!< Position of PRMBL_1 field.                                           */
  #define CTI_CIDR1_PRMBL_1_Msk (0xFUL << CTI_CIDR1_PRMBL_1_Pos) /*!< Bit mask of PRMBL_1 field.                               */
  #define CTI_CIDR1_PRMBL_1_Min (0x0UL)              /*!< Min enumerator value of PRMBL_1 field.                               */
  #define CTI_CIDR1_PRMBL_1_Max (0x0UL)              /*!< Max enumerator value of PRMBL_1 field.                               */
  #define CTI_CIDR1_PRMBL_1_Value (0x0UL)            /*!< Bits[11:8] of the identification code.                               */

/* CLASS @Bits 4..7 : Class of the component, for example, whether the component is a ROM table or a generic CoreSight
                      component. Contains bits[15:12] of the component identification code */

  #define CTI_CIDR1_CLASS_Pos (4UL)                  /*!< Position of CLASS field.                                             */
  #define CTI_CIDR1_CLASS_Msk (0xFUL << CTI_CIDR1_CLASS_Pos) /*!< Bit mask of CLASS field.                                     */
  #define CTI_CIDR1_CLASS_Min (0x9UL)                /*!< Min enumerator value of CLASS field.                                 */
  #define CTI_CIDR1_CLASS_Max (0x9UL)                /*!< Max enumerator value of CLASS field.                                 */
  #define CTI_CIDR1_CLASS_Coresight (0x9UL)          /*!< Indicates that the component is a CoreSight component.               */


/* CTI_CIDR2: Component ID2 Register */
  #define CTI_CIDR2_ResetValue (0x00000005UL)        /*!< Reset value of CIDR2 register.                                       */

/* PRMBL_2 @Bits 0..7 : Preamble[2]. Contains bits[23:16] of the component identification code. */
  #define CTI_CIDR2_PRMBL_2_Pos (0UL)                /*!< Position of PRMBL_2 field.                                           */
  #define CTI_CIDR2_PRMBL_2_Msk (0xFFUL << CTI_CIDR2_PRMBL_2_Pos) /*!< Bit mask of PRMBL_2 field.                              */
  #define CTI_CIDR2_PRMBL_2_Min (0x5UL)              /*!< Min enumerator value of PRMBL_2 field.                               */
  #define CTI_CIDR2_PRMBL_2_Max (0x5UL)              /*!< Max enumerator value of PRMBL_2 field.                               */
  #define CTI_CIDR2_PRMBL_2_Value (0x05UL)           /*!< Bits[23:16] of the identification code.                              */


/* CTI_CIDR3: Component ID3 Register */
  #define CTI_CIDR3_ResetValue (0x000000B1UL)        /*!< Reset value of CIDR3 register.                                       */

/* PRMBL_3 @Bits 0..7 : Preamble[3]. Contains bits[31:24] of the component identification code. */
  #define CTI_CIDR3_PRMBL_3_Pos (0UL)                /*!< Position of PRMBL_3 field.                                           */
  #define CTI_CIDR3_PRMBL_3_Msk (0xFFUL << CTI_CIDR3_PRMBL_3_Pos) /*!< Bit mask of PRMBL_3 field.                              */
  #define CTI_CIDR3_PRMBL_3_Min (0xB1UL)             /*!< Min enumerator value of PRMBL_3 field.                               */
  #define CTI_CIDR3_PRMBL_3_Max (0xB1UL)             /*!< Max enumerator value of PRMBL_3 field.                               */
  #define CTI_CIDR3_PRMBL_3_Value (0xB1UL)           /*!< Bits[31:24] of the identification code.                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        CTRLAPPERI                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct CTRLAPPERI_MAILBOX ================================================ */
/**
  * @brief MAILBOX [CTRLAPPERI_MAILBOX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RXDATA;                            /*!< (@ 0x00000000) Data sent from the debugger to the CPU                */
  __IM  uint32_t  RXSTATUS;                          /*!< (@ 0x00000004) Status to indicate if data sent from the debugger to
                                                                         the CPU has been read*/
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  TXDATA;                            /*!< (@ 0x00000080) Data sent from the CPU to the debugger                */
  __IM  uint32_t  TXSTATUS;                          /*!< (@ 0x00000084) Status to indicate if data sent from the CPU to the
                                                                         debugger has been read*/
  __IM  uint32_t  BOOTMODE;                          /*!< (@ 0x00000088) Secure domain boot mode.                              */
} NRF_CTRLAPPERI_MAILBOX_Type;                       /*!< Size = 140 (0x08C)                                                   */

/* CTRLAPPERI_MAILBOX_RXDATA: Data sent from the debugger to the CPU */
  #define CTRLAPPERI_MAILBOX_RXDATA_ResetValue (0x00000000UL) /*!< Reset value of RXDATA register.                             */

/* RXDATA @Bits 0..31 : Data received from debugger */
  #define CTRLAPPERI_MAILBOX_RXDATA_RXDATA_Pos (0UL) /*!< Position of RXDATA field.                                            */
  #define CTRLAPPERI_MAILBOX_RXDATA_RXDATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_MAILBOX_RXDATA_RXDATA_Pos) /*!< Bit mask of RXDATA
                                                                            field.*/


