adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CTRLAPPERI_MAILBOX_RXSTATUS: Status to indicate if data sent from the debugger to the CPU has been read */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_ResetValue (0x00000000UL) /*!< Reset value of RXSTATUS register.                         */

/* RXSTATUS @Bit 0 : Status of data in register RXDATA */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Pos (0UL) /*!< Position of RXSTATUS field.                                      */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Msk (0x1UL << CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Pos) /*!< Bit mask of RXSTATUS
                                                                            field.*/
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Min (0x0UL) /*!< Min enumerator value of RXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Max (0x1UL) /*!< Max enumerator value of RXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_NoDataPending (0x0UL) /*!< No data pending in register RXDATA                   */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_DataPending (0x1UL) /*!< Data pending in register RXDATA                        */


/* CTRLAPPERI_MAILBOX_TXDATA: Data sent from the CPU to the debugger */
  #define CTRLAPPERI_MAILBOX_TXDATA_ResetValue (0x00000000UL) /*!< Reset value of TXDATA register.                             */

/* TXDATA @Bits 0..31 : Data sent to debugger */
  #define CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Pos (0UL) /*!< Position of TXDATA field.                                            */
  #define CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Pos) /*!< Bit mask of TXDATA
                                                                            field.*/


/* CTRLAPPERI_MAILBOX_TXSTATUS: Status to indicate if data sent from the CPU to the debugger has been read */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_ResetValue (0x00000000UL) /*!< Reset value of TXSTATUS register.                         */

/* TXSTATUS @Bit 0 : Status of data in register TXDATA */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Pos (0UL) /*!< Position of TXSTATUS field.                                      */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Msk (0x1UL << CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Pos) /*!< Bit mask of TXSTATUS
                                                                            field.*/
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Min (0x0UL) /*!< Min enumerator value of TXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Max (0x1UL) /*!< Max enumerator value of TXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_NoDataPending (0x0UL) /*!< No data pending in register TXDATA                   */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_DataPending (0x1UL) /*!< Data pending in register TXDATA                        */


/* CTRLAPPERI_MAILBOX_BOOTMODE: Secure domain boot mode. */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_ResetValue (0x00000000UL) /*!< Reset value of BOOTMODE register.                         */

/* MODE @Bit 0 : Mode */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Pos (0UL) /*!< Position of MODE field.                                              */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Msk (0x1UL << CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Pos) /*!< Bit mask of MODE field.    */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                                */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Max (0x1UL) /*!< Max enumerator value of MODE field.                                */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Normal (0x0UL) /*!< Normal mode of operation                                        */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_ROMOperation (0x1UL) /*!< ROM operation mode                                        */

/* SAFEMODE @Bit 4 : Secure domain safe boot mode */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Pos (4UL) /*!< Position of SAFEMODE field.                                      */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Msk (0x1UL << CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Pos) /*!< Bit mask of SAFEMODE
                                                                            field.*/
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Min (0x0UL) /*!< Min enumerator value of SAFEMODE field.                        */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Max (0x1UL) /*!< Max enumerator value of SAFEMODE field.                        */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Normal (0x0UL) /*!< Normal mode of operation                                    */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_SafeOperation (0x1UL) /*!< Safe operation mode                                  */



/* ================================================= Struct CTRLAPPERI_INFO ================================================== */
/**
  * @brief INFO [CTRLAPPERI_INFO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PARTNO;                            /*!< (@ 0x00000000) Part number of the device                             */
  __IOM uint32_t  HWREVISION;                        /*!< (@ 0x00000004) Hardware Revision of the device                       */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) Ready status.                                         */
} NRF_CTRLAPPERI_INFO_Type;                          /*!< Size = 12 (0x00C)                                                    */

/* CTRLAPPERI_INFO_PARTNO: Part number of the device */
  #define CTRLAPPERI_INFO_PARTNO_ResetValue (0x00000000UL) /*!< Reset value of PARTNO register.                                */

/* PARTNO @Bits 0..11 : Part number */
  #define CTRLAPPERI_INFO_PARTNO_PARTNO_Pos (0UL)    /*!< Position of PARTNO field.                                            */
  #define CTRLAPPERI_INFO_PARTNO_PARTNO_Msk (0xFFFUL << CTRLAPPERI_INFO_PARTNO_PARTNO_Pos) /*!< Bit mask of PARTNO field.      */


/* CTRLAPPERI_INFO_HWREVISION: Hardware Revision of the device */
  #define CTRLAPPERI_INFO_HWREVISION_ResetValue (0x00000000UL) /*!< Reset value of HWREVISION register.                        */

