adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DUVEXT2 @Bit 26 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Pos (26UL) /*!< Position of DUVEXT2 field.                                        */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Pos) /*!< Bit mask of DUVEXT2
                                                                            field.*/
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Min (0x0UL) /*!< Min enumerator value of DUVEXT2 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Max (0x1UL) /*!< Max enumerator value of DUVEXT2 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Invalid (0x0UL) /*!< Invalid data unit                                            */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Valid (0x1UL) /*!< Valid data unit                                                */

/* DUVEXT3 @Bit 27 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Pos (27UL) /*!< Position of DUVEXT3 field.                                        */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Pos) /*!< Bit mask of DUVEXT3
                                                                            field.*/
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Min (0x0UL) /*!< Min enumerator value of DUVEXT3 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Max (0x1UL) /*!< Max enumerator value of DUVEXT3 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Invalid (0x0UL) /*!< Invalid data unit                                            */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Valid (0x1UL) /*!< Valid data unit                                                */



/* ================================================== Struct DCACHEINFO_SET ================================================== */
/**
  * @brief SET [DCACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_DCACHEINFO_SET_WAY_Type WAY[2];          /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_DCACHEINFO_SET_Type;                           /*!< Size = 16 (0x010)                                                    */
  #define DCACHEINFO_SET_MaxCount (256UL)            /*!< Size of SET[256] array.                                              */
  #define DCACHEINFO_SET_MaxIndex (255UL)            /*!< Max index of SET[256] array.                                         */
  #define DCACHEINFO_SET_MinIndex (0UL)              /*!< Min index of SET[256] array.                                         */

/* ==================================================== Struct DCACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {                                   /*!< DCACHEINFO Structure                                                 */
    __IOM NRF_DCACHEINFO_SET_Type SET[256];          /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_DCACHEINFO_Type;                             /*!< Size = 4096 (0x1000)                                                 */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            DMU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct DMU ======================================================== */
/**
  * @brief DMU
  */
  typedef struct {                                   /*!< DMU Structure                                                        */
    __IM uint32_t RESERVED[240];
    __IM uint32_t DMUCR;                             /*!< (@ 0x000003C0) DMU Core Release                                      */
    __IOM uint32_t DMUI;                             /*!< (@ 0x000003C4) DMU Internals                                         */
    __IOM uint32_t DMUQC;                            /*!< (@ 0x000003C8) DMU Queueing Counter                                  */
    __IOM uint32_t DMUIR;                            /*!< (@ 0x000003CC) DMU Interrupt Register                                */
    __IOM uint32_t DMUIE;                            /*!< (@ 0x000003D0) DMU Interrupt Enable                                  */
    __IOM uint32_t DMUC;                             /*!< (@ 0x000003D4) DMU Configuration                                     */
  } NRF_DMU_Type;                                    /*!< Size = 984 (0x3D8)                                                   */

/* DMU_DMUCR: DMU Core Release */
  #define DMU_DMUCR_ResetValue (0x00000000UL)        /*!< Reset value of DMUCR register.                                       */

/* REL @Bit 1 : Core Release */
  #define DMU_DMUCR_REL_Pos (1UL)                    /*!< Position of REL field.                                               */
  #define DMU_DMUCR_REL_Msk (0x1UL << DMU_DMUCR_REL_Pos) /*!< Bit mask of REL field.                                           */

/* STEP @Bit 2 : Step of Core Release */
  #define DMU_DMUCR_STEP_Pos (2UL)                   /*!< Position of STEP field.                                              */
  #define DMU_DMUCR_STEP_Msk (0x1UL << DMU_DMUCR_STEP_Pos) /*!< Bit mask of STEP field.                                        */

/* SUBSTEP @Bit 3 : Sub-step of Core Release */
  #define DMU_DMUCR_SUBSTEP_Pos (3UL)                /*!< Position of SUBSTEP field.                                           */
  #define DMU_DMUCR_SUBSTEP_Msk (0x1UL << DMU_DMUCR_SUBSTEP_Pos) /*!< Bit mask of SUBSTEP field.                               */

/* YEAR @Bit 4 : Time Stamp Year */
  #define DMU_DMUCR_YEAR_Pos (4UL)                   /*!< Position of YEAR field.                                              */
  #define DMU_DMUCR_YEAR_Msk (0x1UL << DMU_DMUCR_YEAR_Pos) /*!< Bit mask of YEAR field.                                        */

/* MON @Bit 6 : Time Stamp Month */
  #define DMU_DMUCR_MON_Pos (6UL)                    /*!< Position of MON field.                                               */
  #define DMU_DMUCR_MON_Msk (0x1UL << DMU_DMUCR_MON_Pos) /*!< Bit mask of MON field.                                           */

