adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DTXE @Bit 23 : Detect DMU Element Service */
  #define DMU_DMUI_DTXE_Pos (23UL)                   /*!< Position of DTXE field.                                              */
  #define DMU_DMUI_DTXE_Msk (0x1UL << DMU_DMUI_DTXE_Pos) /*!< Bit mask of DTXE field.                                          */
  #define DMU_DMUI_DTXE_Min (0x0UL)                  /*!< Min enumerator value of DTXE field.                                  */
  #define DMU_DMUI_DTXE_Max (0x1UL)                  /*!< Max enumerator value of DTXE field.                                  */
  #define DMU_DMUI_DTXE_Disabled (0x0UL)             /*!< Queueing of DMU Element does not activate interrupt flag             */
  #define DMU_DMUI_DTXE_Enabled (0x1UL)              /*!< Queueing of DMU Element will activate interrupt flag when DMUI.EHS =
                                                          DMUI.DEHS*/

/* EHS @Bits 24..26 : Element Handler State */
  #define DMU_DMUI_EHS_Pos (24UL)                    /*!< Position of EHS field.                                               */
  #define DMU_DMUI_EHS_Msk (0x7UL << DMU_DMUI_EHS_Pos) /*!< Bit mask of EHS field.                                             */
  #define DMU_DMUI_EHS_Min (0x0UL)                   /*!< Min enumerator value of EHS field.                                   */
  #define DMU_DMUI_EHS_Max (0x5UL)                   /*!< Max enumerator value of EHS field.                                   */
  #define DMU_DMUI_EHS_wait4cce (0x0UL)              /*!< wait for bit MCAN:CCCR.CCE getting zero                              */
  #define DMU_DMUI_EHS_wait4sa (0x1UL)               /*!< wait for Start Address                                               */
  #define DMU_DMUI_EHS_wait4ta (0x2UL)               /*!< wait for Trigger Address                                             */
  #define DMU_DMUI_EHS_transfer (0x3UL)              /*!< wait for transfer of Element word                                    */
  #define DMU_DMUI_EHS_ack2mcan (0x4UL)              /*!< acknowledge to MCAN                                                  */
  #define DMU_DMUI_EHS_recovery (0x5UL)              /*!< exception recovery                                                   */

/* TX @Bit 28 : Actual DMU Element Service */
  #define DMU_DMUI_TX_Pos (28UL)                     /*!< Position of TX field.                                                */
  #define DMU_DMUI_TX_Msk (0x1UL << DMU_DMUI_TX_Pos) /*!< Bit mask of TX field.                                                */
  #define DMU_DMUI_TX_Min (0x0UL)                    /*!< Min enumerator value of TX field.                                    */
  #define DMU_DMUI_TX_Max (0x1UL)                    /*!< Max enumerator value of TX field.                                    */
  #define DMU_DMUI_TX_NotServed (0x0UL)              /*!< DMU Virtual Buffer is currently not served                           */
  #define DMU_DMUI_TX_Served (0x1UL)                 /*!< DMU Virtual Buffer is currently served                               */

/* RX0 @Bit 29 : Actual DMU Element Service */
  #define DMU_DMUI_RX0_Pos (29UL)                    /*!< Position of RX0 field.                                               */
  #define DMU_DMUI_RX0_Msk (0x1UL << DMU_DMUI_RX0_Pos) /*!< Bit mask of RX0 field.                                             */
  #define DMU_DMUI_RX0_Min (0x0UL)                   /*!< Min enumerator value of RX0 field.                                   */
  #define DMU_DMUI_RX0_Max (0x1UL)                   /*!< Max enumerator value of RX0 field.                                   */
  #define DMU_DMUI_RX0_NotServed (0x0UL)             /*!< DMU Virtual Buffer is currently not served                           */
  #define DMU_DMUI_RX0_Served (0x1UL)                /*!< DMU Virtual Buffer is currently served                               */

/* RX1 @Bit 30 : Actual DMU Element Service */
  #define DMU_DMUI_RX1_Pos (30UL)                    /*!< Position of RX1 field.                                               */
  #define DMU_DMUI_RX1_Msk (0x1UL << DMU_DMUI_RX1_Pos) /*!< Bit mask of RX1 field.                                             */
  #define DMU_DMUI_RX1_Min (0x0UL)                   /*!< Min enumerator value of RX1 field.                                   */
  #define DMU_DMUI_RX1_Max (0x1UL)                   /*!< Max enumerator value of RX1 field.                                   */
  #define DMU_DMUI_RX1_NotServed (0x0UL)             /*!< DMU Virtual Buffer is currently not served                           */
  #define DMU_DMUI_RX1_Served (0x1UL)                /*!< DMU Virtual Buffer is currently served                               */

/* TXE @Bit 31 : Actual DMU Element Service */
  #define DMU_DMUI_TXE_Pos (31UL)                    /*!< Position of TXE field.                                               */
  #define DMU_DMUI_TXE_Msk (0x1UL << DMU_DMUI_TXE_Pos) /*!< Bit mask of TXE field.                                             */
  #define DMU_DMUI_TXE_Min (0x0UL)                   /*!< Min enumerator value of TXE field.                                   */
  #define DMU_DMUI_TXE_Max (0x1UL)                   /*!< Max enumerator value of TXE field.                                   */
  #define DMU_DMUI_TXE_NotServed (0x0UL)             /*!< DMU Virtual Buffer is currently not served                           */
  #define DMU_DMUI_TXE_Served (0x1UL)                /*!< DMU Virtual Buffer is currently served                               */


/* DMU_DMUQC: DMU Queueing Counter */
  #define DMU_DMUQC_ResetValue (0x00000000UL)        /*!< Reset value of DMUQC register.                                       */

/* TXEEC @Bits 0..7 : TX Element Enqueueing Counter */
  #define DMU_DMUQC_TXEEC_Pos (0UL)                  /*!< Position of TXEEC field.                                             */
  #define DMU_DMUQC_TXEEC_Msk (0xFFUL << DMU_DMUQC_TXEEC_Pos) /*!< Bit mask of TXEEC field.                                    */

/* RX0EDC @Bits 8..15 : RX0 Element Dequeueing Counter */
  #define DMU_DMUQC_RX0EDC_Pos (8UL)                 /*!< Position of RX0EDC field.                                            */
  #define DMU_DMUQC_RX0EDC_Msk (0xFFUL << DMU_DMUQC_RX0EDC_Pos) /*!< Bit mask of RX0EDC field.                                 */

/* RX1EDC @Bits 16..23 : RX1 Element Dequeueing Counter */
  #define DMU_DMUQC_RX1EDC_Pos (16UL)                /*!< Position of RX1EDC field.                                            */
  #define DMU_DMUQC_RX1EDC_Msk (0xFFUL << DMU_DMUQC_RX1EDC_Pos) /*!< Bit mask of RX1EDC field.                                 */

/* TXEEDC @Bits 24..31 : TX Event Element Dequeueing Counter */
  #define DMU_DMUQC_TXEEDC_Pos (24UL)                /*!< Position of TXEEDC field.                                            */
  #define DMU_DMUQC_TXEEDC_Msk (0xFFUL << DMU_DMUQC_TXEEDC_Pos) /*!< Bit mask of TXEEDC field.                                 */


/* DMU_DMUIR: DMU Interrupt Register */
  #define DMU_DMUIR_ResetValue (0x00000000UL)        /*!< Reset value of DMUIR register.                                       */

/* TXENSA @Bit 0 : TX Element Not Start Address */
  #define DMU_DMUIR_TXENSA_Pos (0UL)                 /*!< Position of TXENSA field.                                            */
  #define DMU_DMUIR_TXENSA_Msk (0x1UL << DMU_DMUIR_TXENSA_Pos) /*!< Bit mask of TXENSA field.                                  */
  #define DMU_DMUIR_TXENSA_Min (0x0UL)               /*!< Min enumerator value of TXENSA field.                                */
  #define DMU_DMUIR_TXENSA_Max (0x1UL)               /*!< Max enumerator value of TXENSA field.                                */
  #define DMU_DMUIR_TXENSA_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXENSA_NotGenerated (0x0UL)      /*!< No illegal write access                                              */
  #define DMU_DMUIR_TXENSA_Generated (0x1UL)         /*!< Write to TX Element begins without using start address, exception
                                                          recovery started.*/

/* TXEIE @Bit 1 : TX Element Illegal Enqueueing */
  #define DMU_DMUIR_TXEIE_Pos (1UL)                  /*!< Position of TXEIE field.                                             */
  #define DMU_DMUIR_TXEIE_Msk (0x1UL << DMU_DMUIR_TXEIE_Pos) /*!< Bit mask of TXEIE field.                                     */
  #define DMU_DMUIR_TXEIE_Min (0x0UL)                /*!< Min enumerator value of TXEIE field.                                 */
  #define DMU_DMUIR_TXEIE_Max (0x1UL)                /*!< Max enumerator value of TXEIE field.                                 */
  #define DMU_DMUIR_TXEIE_Clear (0x1UL)              /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEIE_NotGenerated (0x0UL)       /*!< No illegal enqueueing                                                */
  #define DMU_DMUIR_TXEIE_Generated (0x1UL)          /*!< Start of enqueueing without request detected, exception recovery
                                                          started.*/

