adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BEC @Bit 14 : Bit Error Corrected */
  #define DMU_DMUIR_BEC_Pos (14UL)                   /*!< Position of BEC field.                                               */
  #define DMU_DMUIR_BEC_Msk (0x1UL << DMU_DMUIR_BEC_Pos) /*!< Bit mask of BEC field.                                           */
  #define DMU_DMUIR_BEC_Min (0x0UL)                  /*!< Min enumerator value of BEC field.                                   */
  #define DMU_DMUIR_BEC_Max (0x1UL)                  /*!< Max enumerator value of BEC field.                                   */
  #define DMU_DMUIR_BEC_Clear (0x1UL)                /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_BEC_NotGenerated (0x0UL)         /*!< No bit error detected when reading from Message RAM                  */
  #define DMU_DMUIR_BEC_Generated (0x1UL)            /*!< Bit error detected and corrected                                     */

/* BEU @Bit 15 : Bus Error Uncorrected */
  #define DMU_DMUIR_BEU_Pos (15UL)                   /*!< Position of BEU field.                                               */
  #define DMU_DMUIR_BEU_Msk (0x1UL << DMU_DMUIR_BEU_Pos) /*!< Bit mask of BEU field.                                           */
  #define DMU_DMUIR_BEU_Min (0x0UL)                  /*!< Min enumerator value of BEU field.                                   */
  #define DMU_DMUIR_BEU_Max (0x1UL)                  /*!< Max enumerator value of BEU field.                                   */
  #define DMU_DMUIR_BEU_Clear (0x1UL)                /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_BEU_NotGenerated (0x0UL)         /*!< No read slave error detected when reading from Message RAM           */
  #define DMU_DMUIR_BEU_Generated (0x1UL)            /*!< Read slave error detected                                            */

/* RX1ENSA @Bit 16 : RX1 Element Not Start Address */
  #define DMU_DMUIR_RX1ENSA_Pos (16UL)               /*!< Position of RX1ENSA field.                                           */
  #define DMU_DMUIR_RX1ENSA_Msk (0x1UL << DMU_DMUIR_RX1ENSA_Pos) /*!< Bit mask of RX1ENSA field.                               */
  #define DMU_DMUIR_RX1ENSA_Min (0x0UL)              /*!< Min enumerator value of RX1ENSA field.                               */
  #define DMU_DMUIR_RX1ENSA_Max (0x1UL)              /*!< Max enumerator value of RX1ENSA field.                               */
  #define DMU_DMUIR_RX1ENSA_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1ENSA_NotGenerated (0x0UL)     /*!< No illegal read access                                               */
  #define DMU_DMUIR_RX1ENSA_Generated (0x1UL)        /*!< Read from RX1 Element begins without using start address, exception
                                                          recovery started.*/

/* RX1EID @Bit 17 : RX1 Element Illegal Dequeueing */
  #define DMU_DMUIR_RX1EID_Pos (17UL)                /*!< Position of RX1EID field.                                            */
  #define DMU_DMUIR_RX1EID_Msk (0x1UL << DMU_DMUIR_RX1EID_Pos) /*!< Bit mask of RX1EID field.                                  */
  #define DMU_DMUIR_RX1EID_Min (0x0UL)               /*!< Min enumerator value of RX1EID field.                                */
  #define DMU_DMUIR_RX1EID_Max (0x1UL)               /*!< Max enumerator value of RX1EID field.                                */
  #define DMU_DMUIR_RX1EID_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1EID_NotGenerated (0x0UL)      /*!< No illegal dequeueing                                                */
  #define DMU_DMUIR_RX1EID_Generated (0x1UL)         /*!< Start of dequeueing without request detected, exception recovery
                                                          started,*/

/* RX1EIAS @Bit 18 : RX0 Element Illegal Access Sequence */
  #define DMU_DMUIR_RX1EIAS_Pos (18UL)               /*!< Position of RX1EIAS field.                                           */
  #define DMU_DMUIR_RX1EIAS_Msk (0x1UL << DMU_DMUIR_RX1EIAS_Pos) /*!< Bit mask of RX1EIAS field.                               */
  #define DMU_DMUIR_RX1EIAS_Min (0x0UL)              /*!< Min enumerator value of RX1EIAS field.                               */
  #define DMU_DMUIR_RX1EIAS_Max (0x1UL)              /*!< Max enumerator value of RX1EIAS field.                               */
  #define DMU_DMUIR_RX1EIAS_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1EIAS_NotGenerated (0x0UL)     /*!< No illegal addressing sequence detected                              */
  #define DMU_DMUIR_RX1EIAS_Generated (0x1UL)        /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* RX1EIW @Bit 19 : RX1 Element Illegal Write */
  #define DMU_DMUIR_RX1EIW_Pos (19UL)                /*!< Position of RX1EIW field.                                            */
  #define DMU_DMUIR_RX1EIW_Msk (0x1UL << DMU_DMUIR_RX1EIW_Pos) /*!< Bit mask of RX1EIW field.                                  */
  #define DMU_DMUIR_RX1EIW_Min (0x0UL)               /*!< Min enumerator value of RX1EIW field.                                */
  #define DMU_DMUIR_RX1EIW_Max (0x1UL)               /*!< Max enumerator value of RX1EIW field.                                */
  #define DMU_DMUIR_RX1EIW_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1EIW_NotGenerated (0x0UL)      /*!< No write access detected                                             */
  #define DMU_DMUIR_RX1EIW_Generated (0x1UL)         /*!< Illegal write access to DMU RX1 Element detected, exception recovery
                                                          started.*/

