adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH28 @Bit 28 : Include or exclude channel 28 */
  #define DPPIC_CHG_CH28_Pos (28UL)                  /*!< Position of CH28 field.                                              */
  #define DPPIC_CHG_CH28_Msk (0x1UL << DPPIC_CHG_CH28_Pos) /*!< Bit mask of CH28 field.                                        */
  #define DPPIC_CHG_CH28_Min (0x0UL)                 /*!< Min enumerator value of CH28 field.                                  */
  #define DPPIC_CHG_CH28_Max (0x1UL)                 /*!< Max enumerator value of CH28 field.                                  */
  #define DPPIC_CHG_CH28_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH28_Included (0x1UL)            /*!< Include                                                              */

/* CH29 @Bit 29 : Include or exclude channel 29 */
  #define DPPIC_CHG_CH29_Pos (29UL)                  /*!< Position of CH29 field.                                              */
  #define DPPIC_CHG_CH29_Msk (0x1UL << DPPIC_CHG_CH29_Pos) /*!< Bit mask of CH29 field.                                        */
  #define DPPIC_CHG_CH29_Min (0x0UL)                 /*!< Min enumerator value of CH29 field.                                  */
  #define DPPIC_CHG_CH29_Max (0x1UL)                 /*!< Max enumerator value of CH29 field.                                  */
  #define DPPIC_CHG_CH29_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH29_Included (0x1UL)            /*!< Include                                                              */

/* CH30 @Bit 30 : Include or exclude channel 30 */
  #define DPPIC_CHG_CH30_Pos (30UL)                  /*!< Position of CH30 field.                                              */
  #define DPPIC_CHG_CH30_Msk (0x1UL << DPPIC_CHG_CH30_Pos) /*!< Bit mask of CH30 field.                                        */
  #define DPPIC_CHG_CH30_Min (0x0UL)                 /*!< Min enumerator value of CH30 field.                                  */
  #define DPPIC_CHG_CH30_Max (0x1UL)                 /*!< Max enumerator value of CH30 field.                                  */
  #define DPPIC_CHG_CH30_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH30_Included (0x1UL)            /*!< Include                                                              */

/* CH31 @Bit 31 : Include or exclude channel 31 */
  #define DPPIC_CHG_CH31_Pos (31UL)                  /*!< Position of CH31 field.                                              */
  #define DPPIC_CHG_CH31_Msk (0x1UL << DPPIC_CHG_CH31_Pos) /*!< Bit mask of CH31 field.                                        */
  #define DPPIC_CHG_CH31_Min (0x0UL)                 /*!< Min enumerator value of CH31 field.                                  */
  #define DPPIC_CHG_CH31_Max (0x1UL)                 /*!< Max enumerator value of CH31 field.                                  */
  #define DPPIC_CHG_CH31_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH31_Included (0x1UL)            /*!< Include                                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         EASYVDMA                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct EASYVDMA_EVENTS_DONE =============================================== */
/**
  * @brief EVENTS_DONE [EASYVDMA_EVENTS_DONE] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  LIST;                              /*!< (@ 0x00000000) Descriptor list is complete.                          */
  __IOM uint32_t  LISTPART;                          /*!< (@ 0x00000004) Descriptor list is partially complete. Threshold in
                                                                         CONFIG.LISTPARTTHRESH register has been passed.*/
  __IOM uint32_t  SELECTJOB;                         /*!< (@ 0x00000008) Selected job is completed. Selection is done via
                                                                         CONFIG.SELECTJOBENABLE.*/
  __IOM uint32_t  DATA;                              /*!< (@ 0x0000000C) A job has been completed, i.e. the job's data has been
                                                                         completely transferred either to AXI or DMA bus,
                                                                         depending on direction.*/
  __IOM uint32_t  JOB;                               /*!< (@ 0x00000010) A job has been fetched from the joblist.              */
} NRF_EASYVDMA_EVENTS_DONE_Type;                     /*!< Size = 20 (0x014)                                                    */

/* EASYVDMA_EVENTS_DONE_LIST: Descriptor list is complete. */
  #define EASYVDMA_EVENTS_DONE_LIST_ResetValue (0x00000000UL) /*!< Reset value of LIST register.                               */

/* LIST @Bit 0 : Descriptor list is complete. */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Pos (0UL)   /*!< Position of LIST field.                                              */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Msk (0x1UL << EASYVDMA_EVENTS_DONE_LIST_LIST_Pos) /*!< Bit mask of LIST field.        */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Min (0x0UL) /*!< Min enumerator value of LIST field.                                  */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Max (0x1UL) /*!< Max enumerator value of LIST field.                                  */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Generated (0x1UL) /*!< Event generated                                                */


