adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EASYVDMA_EVENTS_DONE_LISTPART: Descriptor list is partially complete. Threshold in CONFIG.LISTPARTTHRESH register has been
                                   passed. */

  #define EASYVDMA_EVENTS_DONE_LISTPART_ResetValue (0x00000000UL) /*!< Reset value of LISTPART register.                       */

/* LISTPART @Bit 0 : Descriptor list is partially complete. Threshold in CONFIG.LISTPARTTHRESH register has been passed. */
  #define EASYVDMA_EVENTS_DONE_LISTPART_LISTPART_Pos (0UL) /*!< Position of LISTPART field.                                    */
  #define EASYVDMA_EVENTS_DONE_LISTPART_LISTPART_Msk (0x1UL << EASYVDMA_EVENTS_DONE_LISTPART_LISTPART_Pos) /*!< Bit mask of
                                                                            LISTPART field.*/
  #define EASYVDMA_EVENTS_DONE_LISTPART_LISTPART_Min (0x0UL) /*!< Min enumerator value of LISTPART field.                      */
  #define EASYVDMA_EVENTS_DONE_LISTPART_LISTPART_Max (0x1UL) /*!< Max enumerator value of LISTPART field.                      */
  #define EASYVDMA_EVENTS_DONE_LISTPART_LISTPART_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define EASYVDMA_EVENTS_DONE_LISTPART_LISTPART_Generated (0x1UL) /*!< Event generated                                        */


/* EASYVDMA_EVENTS_DONE_SELECTJOB: Selected job is completed. Selection is done via CONFIG.SELECTJOBENABLE. */
  #define EASYVDMA_EVENTS_DONE_SELECTJOB_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOB register.                     */

/* SELECTJOB @Bit 0 : Selected job is completed. Selection is done via CONFIG.SELECTJOBENABLE. */
  #define EASYVDMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Pos (0UL) /*!< Position of SELECTJOB field.                                 */
  #define EASYVDMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Msk (0x1UL << EASYVDMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Pos) /*!< Bit mask of
                                                                            SELECTJOB field.*/
  #define EASYVDMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Min (0x0UL) /*!< Min enumerator value of SELECTJOB field.                   */
  #define EASYVDMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Max (0x1UL) /*!< Max enumerator value of SELECTJOB field.                   */
  #define EASYVDMA_EVENTS_DONE_SELECTJOB_SELECTJOB_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define EASYVDMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Generated (0x1UL) /*!< Event generated                                      */


/* EASYVDMA_EVENTS_DONE_DATA: A job has been completed, i.e. the job's data has been completely transferred either to AXI or DMA
                               bus, depending on direction. */

  #define EASYVDMA_EVENTS_DONE_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA register.                               */

/* DATA @Bit 0 : A job has been completed, i.e. the job's data has been completely transferred either to AXI or DMA bus,
                 depending on direction. */

  #define EASYVDMA_EVENTS_DONE_DATA_DATA_Pos (0UL)   /*!< Position of DATA field.                                              */
  #define EASYVDMA_EVENTS_DONE_DATA_DATA_Msk (0x1UL << EASYVDMA_EVENTS_DONE_DATA_DATA_Pos) /*!< Bit mask of DATA field.        */
  #define EASYVDMA_EVENTS_DONE_DATA_DATA_Min (0x0UL) /*!< Min enumerator value of DATA field.                                  */
  #define EASYVDMA_EVENTS_DONE_DATA_DATA_Max (0x1UL) /*!< Max enumerator value of DATA field.                                  */
  #define EASYVDMA_EVENTS_DONE_DATA_DATA_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define EASYVDMA_EVENTS_DONE_DATA_DATA_Generated (0x1UL) /*!< Event generated                                                */


/* EASYVDMA_EVENTS_DONE_JOB: A job has been fetched from the joblist. */
  #define EASYVDMA_EVENTS_DONE_JOB_ResetValue (0x00000000UL) /*!< Reset value of JOB register.                                 */

/* JOB @Bit 0 : A job has been fetched from the joblist. */
  #define EASYVDMA_EVENTS_DONE_JOB_JOB_Pos (0UL)     /*!< Position of JOB field.                                               */
  #define EASYVDMA_EVENTS_DONE_JOB_JOB_Msk (0x1UL << EASYVDMA_EVENTS_DONE_JOB_JOB_Pos) /*!< Bit mask of JOB field.             */
  #define EASYVDMA_EVENTS_DONE_JOB_JOB_Min (0x0UL)   /*!< Min enumerator value of JOB field.                                   */
  #define EASYVDMA_EVENTS_DONE_JOB_JOB_Max (0x1UL)   /*!< Max enumerator value of JOB field.                                   */
  #define EASYVDMA_EVENTS_DONE_JOB_JOB_NotGenerated (0x0UL) /*!< Event not generated                                           */
  #define EASYVDMA_EVENTS_DONE_JOB_JOB_Generated (0x1UL) /*!< Event generated                                                  */



/* ================================================= Struct EASYVDMA_STATUS ================================================== */
/**
  * @brief STATUS [EASYVDMA_STATUS] EasyVDMA status registers.
  */
typedef struct {
  __IM  uint32_t  BYTECOUNT;                         /*!< (@ 0x00000000) Number of bytes sent or received during processing of
                                                                         current descriptor list*/
  __IM  uint32_t  ATTRIBUTE;                         /*!< (@ 0x00000004) Latest job attribute being processed.                 */
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000008) Latest address being accessed.                        */
  __IM  uint32_t  JOBCOUNT;                          /*!< (@ 0x0000000C) Number of completed jobs in current descriptor list.  */
  __IM  uint32_t  BUSERROR;                          /*!< (@ 0x00000010) AXI bus error status.                                 */
  __IM  uint32_t  FIFO;                              /*!< (@ 0x00000014) Data fifo status.                                     */
  __IM  uint32_t  ACTIVE;                            /*!< (@ 0x00000018) DMA activity state.                                   */
} NRF_EASYVDMA_STATUS_Type;                          /*!< Size = 28 (0x01C)                                                    */

/* EASYVDMA_STATUS_BYTECOUNT: Number of bytes sent or received during processing of current descriptor list */
  #define EASYVDMA_STATUS_BYTECOUNT_ResetValue (0x00000000UL) /*!< Reset value of BYTECOUNT register.                          */

/* BYTECOUNT @Bits 0..31 : Number of bytes sent or received during processing of current descriptor list */
  #define EASYVDMA_STATUS_BYTECOUNT_BYTECOUNT_Pos (0UL) /*!< Position of BYTECOUNT field.                                      */
  #define EASYVDMA_STATUS_BYTECOUNT_BYTECOUNT_Msk (0xFFFFFFFFUL << EASYVDMA_STATUS_BYTECOUNT_BYTECOUNT_Pos) /*!< Bit mask of
                                                                            BYTECOUNT field.*/


/* EASYVDMA_STATUS_ATTRIBUTE: Latest job attribute being processed. */
  #define EASYVDMA_STATUS_ATTRIBUTE_ResetValue (0x00000000UL) /*!< Reset value of ATTRIBUTE register.                          */

/* ATTRIBUTE @Bits 0..5 : Latest job attribute being processed. */
  #define EASYVDMA_STATUS_ATTRIBUTE_ATTRIBUTE_Pos (0UL) /*!< Position of ATTRIBUTE field.                                      */
  #define EASYVDMA_STATUS_ATTRIBUTE_ATTRIBUTE_Msk (0x3FUL << EASYVDMA_STATUS_ATTRIBUTE_ATTRIBUTE_Pos) /*!< Bit mask of ATTRIBUTE
                                                                            field.*/


/* EASYVDMA_STATUS_ADDRESS: Latest address being accessed. */
  #define EASYVDMA_STATUS_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                              */

/* ADDRESS @Bits 0..31 : Latest address being accessed. */
  #define EASYVDMA_STATUS_ADDRESS_ADDRESS_Pos (0UL)  /*!< Position of ADDRESS field.                                           */
  #define EASYVDMA_STATUS_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << EASYVDMA_STATUS_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


