adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EVENTS_PAUSED @Bit 0 : DMA paused with task TASKS_PAUSE. */
  #define EASYVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Pos (0UL) /*!< Position of EVENTS_PAUSED field.                                 */
  #define EASYVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Msk (0x1UL << EASYVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Pos) /*!< Bit mask of
                                                                            EVENTS_PAUSED field.*/
  #define EASYVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PAUSED field.                   */
  #define EASYVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PAUSED field.                   */
  #define EASYVDMA_EVENTS_PAUSED_EVENTS_PAUSED_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define EASYVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Generated (0x1UL) /*!< Event generated                                          */


/* EASYVDMA_EVENTS_RESET: DMA reset with task TASKS_RESET. */
  #define EASYVDMA_EVENTS_RESET_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RESET register.                           */

/* EVENTS_RESET @Bit 0 : DMA reset with task TASKS_RESET. */
  #define EASYVDMA_EVENTS_RESET_EVENTS_RESET_Pos (0UL) /*!< Position of EVENTS_RESET field.                                    */
  #define EASYVDMA_EVENTS_RESET_EVENTS_RESET_Msk (0x1UL << EASYVDMA_EVENTS_RESET_EVENTS_RESET_Pos) /*!< Bit mask of EVENTS_RESET
                                                                            field.*/
  #define EASYVDMA_EVENTS_RESET_EVENTS_RESET_Min (0x0UL) /*!< Min enumerator value of EVENTS_RESET field.                      */
  #define EASYVDMA_EVENTS_RESET_EVENTS_RESET_Max (0x1UL) /*!< Max enumerator value of EVENTS_RESET field.                      */
  #define EASYVDMA_EVENTS_RESET_EVENTS_RESET_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define EASYVDMA_EVENTS_RESET_EVENTS_RESET_Generated (0x1UL) /*!< Event generated                                            */


/* EASYVDMA_SHORTS: Shortcuts between local events and tasks */
  #define EASYVDMA_SHORTS_ResetValue (0x00000000UL)  /*!< Reset value of SHORTS register.                                      */

/* DONE_LIST_START @Bit 0 : Shortcut between event DONE.LIST and task START */
  #define EASYVDMA_SHORTS_DONE_LIST_START_Pos (0UL)  /*!< Position of DONE_LIST_START field.                                   */
  #define EASYVDMA_SHORTS_DONE_LIST_START_Msk (0x1UL << EASYVDMA_SHORTS_DONE_LIST_START_Pos) /*!< Bit mask of DONE_LIST_START
                                                                            field.*/
  #define EASYVDMA_SHORTS_DONE_LIST_START_Min (0x0UL) /*!< Min enumerator value of DONE_LIST_START field.                      */
  #define EASYVDMA_SHORTS_DONE_LIST_START_Max (0x1UL) /*!< Max enumerator value of DONE_LIST_START field.                      */
  #define EASYVDMA_SHORTS_DONE_LIST_START_Disabled (0x0UL) /*!< Disable shortcut                                               */
  #define EASYVDMA_SHORTS_DONE_LIST_START_Enabled (0x1UL) /*!< Enable shortcut                                                 */

/* DONE_LIST_RESET @Bit 1 : Shortcut between event DONE.LIST and task RESET */
  #define EASYVDMA_SHORTS_DONE_LIST_RESET_Pos (1UL)  /*!< Position of DONE_LIST_RESET field.                                   */
  #define EASYVDMA_SHORTS_DONE_LIST_RESET_Msk (0x1UL << EASYVDMA_SHORTS_DONE_LIST_RESET_Pos) /*!< Bit mask of DONE_LIST_RESET
                                                                            field.*/
  #define EASYVDMA_SHORTS_DONE_LIST_RESET_Min (0x0UL) /*!< Min enumerator value of DONE_LIST_RESET field.                      */
  #define EASYVDMA_SHORTS_DONE_LIST_RESET_Max (0x1UL) /*!< Max enumerator value of DONE_LIST_RESET field.                      */
  #define EASYVDMA_SHORTS_DONE_LIST_RESET_Disabled (0x0UL) /*!< Disable shortcut                                               */
  #define EASYVDMA_SHORTS_DONE_LIST_RESET_Enabled (0x1UL) /*!< Enable shortcut                                                 */

/* ERROR_PAUSE @Bit 2 : Shortcut between event ERROR and task PAUSE */
  #define EASYVDMA_SHORTS_ERROR_PAUSE_Pos (2UL)      /*!< Position of ERROR_PAUSE field.                                       */
  #define EASYVDMA_SHORTS_ERROR_PAUSE_Msk (0x1UL << EASYVDMA_SHORTS_ERROR_PAUSE_Pos) /*!< Bit mask of ERROR_PAUSE field.       */
  #define EASYVDMA_SHORTS_ERROR_PAUSE_Min (0x0UL)    /*!< Min enumerator value of ERROR_PAUSE field.                           */
  #define EASYVDMA_SHORTS_ERROR_PAUSE_Max (0x1UL)    /*!< Max enumerator value of ERROR_PAUSE field.                           */
  #define EASYVDMA_SHORTS_ERROR_PAUSE_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define EASYVDMA_SHORTS_ERROR_PAUSE_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* ERROR_RESET @Bit 3 : Shortcut between event ERROR and task RESET */
  #define EASYVDMA_SHORTS_ERROR_RESET_Pos (3UL)      /*!< Position of ERROR_RESET field.                                       */
  #define EASYVDMA_SHORTS_ERROR_RESET_Msk (0x1UL << EASYVDMA_SHORTS_ERROR_RESET_Pos) /*!< Bit mask of ERROR_RESET field.       */
  #define EASYVDMA_SHORTS_ERROR_RESET_Min (0x0UL)    /*!< Min enumerator value of ERROR_RESET field.                           */
  #define EASYVDMA_SHORTS_ERROR_RESET_Max (0x1UL)    /*!< Max enumerator value of ERROR_RESET field.                           */
  #define EASYVDMA_SHORTS_ERROR_RESET_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define EASYVDMA_SHORTS_ERROR_RESET_Enabled (0x1UL) /*!< Enable shortcut                                                     */


/* EASYVDMA_INTEN: Enable or disable interrupt */
  #define EASYVDMA_INTEN_ResetValue (0x00000000UL)   /*!< Reset value of INTEN register.                                       */

/* DONELIST @Bit 0 : Enable or disable interrupt for event DONELIST */
  #define EASYVDMA_INTEN_DONELIST_Pos (0UL)          /*!< Position of DONELIST field.                                          */
  #define EASYVDMA_INTEN_DONELIST_Msk (0x1UL << EASYVDMA_INTEN_DONELIST_Pos) /*!< Bit mask of DONELIST field.                  */
  #define EASYVDMA_INTEN_DONELIST_Min (0x0UL)        /*!< Min enumerator value of DONELIST field.                              */
  #define EASYVDMA_INTEN_DONELIST_Max (0x1UL)        /*!< Max enumerator value of DONELIST field.                              */
  #define EASYVDMA_INTEN_DONELIST_Disabled (0x0UL)   /*!< Disable                                                              */
  #define EASYVDMA_INTEN_DONELIST_Enabled (0x1UL)    /*!< Enable                                                               */

/* DONELISTPART @Bit 1 : Enable or disable interrupt for event DONELISTPART */
  #define EASYVDMA_INTEN_DONELISTPART_Pos (1UL)      /*!< Position of DONELISTPART field.                                      */
  #define EASYVDMA_INTEN_DONELISTPART_Msk (0x1UL << EASYVDMA_INTEN_DONELISTPART_Pos) /*!< Bit mask of DONELISTPART field.      */
  #define EASYVDMA_INTEN_DONELISTPART_Min (0x0UL)    /*!< Min enumerator value of DONELISTPART field.                          */
  #define EASYVDMA_INTEN_DONELISTPART_Max (0x1UL)    /*!< Max enumerator value of DONELISTPART field.                          */
  #define EASYVDMA_INTEN_DONELISTPART_Disabled (0x0UL) /*!< Disable                                                            */
  #define EASYVDMA_INTEN_DONELISTPART_Enabled (0x1UL) /*!< Enable                                                              */

