adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DONELISTPART @Bit 1 : Write '1' to enable interrupt for event DONELISTPART */
  #define EASYVDMA_INTENSET_DONELISTPART_Pos (1UL)   /*!< Position of DONELISTPART field.                                      */
  #define EASYVDMA_INTENSET_DONELISTPART_Msk (0x1UL << EASYVDMA_INTENSET_DONELISTPART_Pos) /*!< Bit mask of DONELISTPART field.*/
  #define EASYVDMA_INTENSET_DONELISTPART_Min (0x0UL) /*!< Min enumerator value of DONELISTPART field.                          */
  #define EASYVDMA_INTENSET_DONELISTPART_Max (0x1UL) /*!< Max enumerator value of DONELISTPART field.                          */
  #define EASYVDMA_INTENSET_DONELISTPART_Set (0x1UL) /*!< Enable                                                               */
  #define EASYVDMA_INTENSET_DONELISTPART_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define EASYVDMA_INTENSET_DONELISTPART_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DONESELECTJOB @Bit 2 : Write '1' to enable interrupt for event DONESELECTJOB */
  #define EASYVDMA_INTENSET_DONESELECTJOB_Pos (2UL)  /*!< Position of DONESELECTJOB field.                                     */
  #define EASYVDMA_INTENSET_DONESELECTJOB_Msk (0x1UL << EASYVDMA_INTENSET_DONESELECTJOB_Pos) /*!< Bit mask of DONESELECTJOB
                                                                            field.*/
  #define EASYVDMA_INTENSET_DONESELECTJOB_Min (0x0UL) /*!< Min enumerator value of DONESELECTJOB field.                        */
  #define EASYVDMA_INTENSET_DONESELECTJOB_Max (0x1UL) /*!< Max enumerator value of DONESELECTJOB field.                        */
  #define EASYVDMA_INTENSET_DONESELECTJOB_Set (0x1UL) /*!< Enable                                                              */
  #define EASYVDMA_INTENSET_DONESELECTJOB_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define EASYVDMA_INTENSET_DONESELECTJOB_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DONEDATA @Bit 3 : Write '1' to enable interrupt for event DONEDATA */
  #define EASYVDMA_INTENSET_DONEDATA_Pos (3UL)       /*!< Position of DONEDATA field.                                          */
  #define EASYVDMA_INTENSET_DONEDATA_Msk (0x1UL << EASYVDMA_INTENSET_DONEDATA_Pos) /*!< Bit mask of DONEDATA field.            */
  #define EASYVDMA_INTENSET_DONEDATA_Min (0x0UL)     /*!< Min enumerator value of DONEDATA field.                              */
  #define EASYVDMA_INTENSET_DONEDATA_Max (0x1UL)     /*!< Max enumerator value of DONEDATA field.                              */
  #define EASYVDMA_INTENSET_DONEDATA_Set (0x1UL)     /*!< Enable                                                               */
  #define EASYVDMA_INTENSET_DONEDATA_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define EASYVDMA_INTENSET_DONEDATA_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DONEJOB @Bit 4 : Write '1' to enable interrupt for event DONEJOB */
  #define EASYVDMA_INTENSET_DONEJOB_Pos (4UL)        /*!< Position of DONEJOB field.                                           */
  #define EASYVDMA_INTENSET_DONEJOB_Msk (0x1UL << EASYVDMA_INTENSET_DONEJOB_Pos) /*!< Bit mask of DONEJOB field.               */
  #define EASYVDMA_INTENSET_DONEJOB_Min (0x0UL)      /*!< Min enumerator value of DONEJOB field.                               */
  #define EASYVDMA_INTENSET_DONEJOB_Max (0x1UL)      /*!< Max enumerator value of DONEJOB field.                               */
  #define EASYVDMA_INTENSET_DONEJOB_Set (0x1UL)      /*!< Enable                                                               */
  #define EASYVDMA_INTENSET_DONEJOB_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define EASYVDMA_INTENSET_DONEJOB_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ERROR @Bit 5 : Write '1' to enable interrupt for event ERROR */
  #define EASYVDMA_INTENSET_ERROR_Pos (5UL)          /*!< Position of ERROR field.                                             */
  #define EASYVDMA_INTENSET_ERROR_Msk (0x1UL << EASYVDMA_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                     */
  #define EASYVDMA_INTENSET_ERROR_Min (0x0UL)        /*!< Min enumerator value of ERROR field.                                 */
  #define EASYVDMA_INTENSET_ERROR_Max (0x1UL)        /*!< Max enumerator value of ERROR field.                                 */
  #define EASYVDMA_INTENSET_ERROR_Set (0x1UL)        /*!< Enable                                                               */
  #define EASYVDMA_INTENSET_ERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define EASYVDMA_INTENSET_ERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PAUSED @Bit 6 : Write '1' to enable interrupt for event PAUSED */
  #define EASYVDMA_INTENSET_PAUSED_Pos (6UL)         /*!< Position of PAUSED field.                                            */
  #define EASYVDMA_INTENSET_PAUSED_Msk (0x1UL << EASYVDMA_INTENSET_PAUSED_Pos) /*!< Bit mask of PAUSED field.                  */
  #define EASYVDMA_INTENSET_PAUSED_Min (0x0UL)       /*!< Min enumerator value of PAUSED field.                                */
  #define EASYVDMA_INTENSET_PAUSED_Max (0x1UL)       /*!< Max enumerator value of PAUSED field.                                */
  #define EASYVDMA_INTENSET_PAUSED_Set (0x1UL)       /*!< Enable                                                               */
  #define EASYVDMA_INTENSET_PAUSED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define EASYVDMA_INTENSET_PAUSED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RESET @Bit 7 : Write '1' to enable interrupt for event RESET */
  #define EASYVDMA_INTENSET_RESET_Pos (7UL)          /*!< Position of RESET field.                                             */
  #define EASYVDMA_INTENSET_RESET_Msk (0x1UL << EASYVDMA_INTENSET_RESET_Pos) /*!< Bit mask of RESET field.                     */
  #define EASYVDMA_INTENSET_RESET_Min (0x0UL)        /*!< Min enumerator value of RESET field.                                 */
  #define EASYVDMA_INTENSET_RESET_Max (0x1UL)        /*!< Max enumerator value of RESET field.                                 */
  #define EASYVDMA_INTENSET_RESET_Set (0x1UL)        /*!< Enable                                                               */
  #define EASYVDMA_INTENSET_RESET_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define EASYVDMA_INTENSET_RESET_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* EASYVDMA_INTENCLR: Disable interrupt */
  #define EASYVDMA_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                   */

/* DONELIST @Bit 0 : Write '1' to disable interrupt for event DONELIST */
  #define EASYVDMA_INTENCLR_DONELIST_Pos (0UL)       /*!< Position of DONELIST field.                                          */
  #define EASYVDMA_INTENCLR_DONELIST_Msk (0x1UL << EASYVDMA_INTENCLR_DONELIST_Pos) /*!< Bit mask of DONELIST field.            */
  #define EASYVDMA_INTENCLR_DONELIST_Min (0x0UL)     /*!< Min enumerator value of DONELIST field.                              */
  #define EASYVDMA_INTENCLR_DONELIST_Max (0x1UL)     /*!< Max enumerator value of DONELIST field.                              */
  #define EASYVDMA_INTENCLR_DONELIST_Clear (0x1UL)   /*!< Disable                                                              */
  #define EASYVDMA_INTENCLR_DONELIST_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define EASYVDMA_INTENCLR_DONELIST_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DONELISTPART @Bit 1 : Write '1' to disable interrupt for event DONELISTPART */
  #define EASYVDMA_INTENCLR_DONELISTPART_Pos (1UL)   /*!< Position of DONELISTPART field.                                      */
  #define EASYVDMA_INTENCLR_DONELISTPART_Msk (0x1UL << EASYVDMA_INTENCLR_DONELISTPART_Pos) /*!< Bit mask of DONELISTPART field.*/
  #define EASYVDMA_INTENCLR_DONELISTPART_Min (0x0UL) /*!< Min enumerator value of DONELISTPART field.                          */
  #define EASYVDMA_INTENCLR_DONELISTPART_Max (0x1UL) /*!< Max enumerator value of DONELISTPART field.                          */
  #define EASYVDMA_INTENCLR_DONELISTPART_Clear (0x1UL) /*!< Disable                                                            */
  #define EASYVDMA_INTENCLR_DONELISTPART_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define EASYVDMA_INTENCLR_DONELISTPART_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DONESELECTJOB @Bit 2 : Write '1' to disable interrupt for event DONESELECTJOB */
  #define EASYVDMA_INTENCLR_DONESELECTJOB_Pos (2UL)  /*!< Position of DONESELECTJOB field.                                     */
  #define EASYVDMA_INTENCLR_DONESELECTJOB_Msk (0x1UL << EASYVDMA_INTENCLR_DONESELECTJOB_Pos) /*!< Bit mask of DONESELECTJOB
                                                                            field.*/
  #define EASYVDMA_INTENCLR_DONESELECTJOB_Min (0x0UL) /*!< Min enumerator value of DONESELECTJOB field.                        */
  #define EASYVDMA_INTENCLR_DONESELECTJOB_Max (0x1UL) /*!< Max enumerator value of DONESELECTJOB field.                        */
  #define EASYVDMA_INTENCLR_DONESELECTJOB_Clear (0x1UL) /*!< Disable                                                           */
  #define EASYVDMA_INTENCLR_DONESELECTJOB_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define EASYVDMA_INTENCLR_DONESELECTJOB_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DONEDATA @Bit 3 : Write '1' to disable interrupt for event DONEDATA */
  #define EASYVDMA_INTENCLR_DONEDATA_Pos (3UL)       /*!< Position of DONEDATA field.                                          */
  #define EASYVDMA_INTENCLR_DONEDATA_Msk (0x1UL << EASYVDMA_INTENCLR_DONEDATA_Pos) /*!< Bit mask of DONEDATA field.            */
  #define EASYVDMA_INTENCLR_DONEDATA_Min (0x0UL)     /*!< Min enumerator value of DONEDATA field.                              */
  #define EASYVDMA_INTENCLR_DONEDATA_Max (0x1UL)     /*!< Max enumerator value of DONEDATA field.                              */
  #define EASYVDMA_INTENCLR_DONEDATA_Clear (0x1UL)   /*!< Disable                                                              */
  #define EASYVDMA_INTENCLR_DONEDATA_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define EASYVDMA_INTENCLR_DONEDATA_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DONEJOB @Bit 4 : Write '1' to disable interrupt for event DONEJOB */
  #define EASYVDMA_INTENCLR_DONEJOB_Pos (4UL)        /*!< Position of DONEJOB field.                                           */
  #define EASYVDMA_INTENCLR_DONEJOB_Msk (0x1UL << EASYVDMA_INTENCLR_DONEJOB_Pos) /*!< Bit mask of DONEJOB field.               */
  #define EASYVDMA_INTENCLR_DONEJOB_Min (0x0UL)      /*!< Min enumerator value of DONEJOB field.                               */
  #define EASYVDMA_INTENCLR_DONEJOB_Max (0x1UL)      /*!< Max enumerator value of DONEJOB field.                               */
  #define EASYVDMA_INTENCLR_DONEJOB_Clear (0x1UL)    /*!< Disable                                                              */
  #define EASYVDMA_INTENCLR_DONEJOB_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define EASYVDMA_INTENCLR_DONEJOB_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ERROR @Bit 5 : Write '1' to disable interrupt for event ERROR */
  #define EASYVDMA_INTENCLR_ERROR_Pos (5UL)          /*!< Position of ERROR field.                                             */
  #define EASYVDMA_INTENCLR_ERROR_Msk (0x1UL << EASYVDMA_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                     */
  #define EASYVDMA_INTENCLR_ERROR_Min (0x0UL)        /*!< Min enumerator value of ERROR field.                                 */
  #define EASYVDMA_INTENCLR_ERROR_Max (0x1UL)        /*!< Max enumerator value of ERROR field.                                 */
  #define EASYVDMA_INTENCLR_ERROR_Clear (0x1UL)      /*!< Disable                                                              */
  #define EASYVDMA_INTENCLR_ERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define EASYVDMA_INTENCLR_ERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PAUSED @Bit 6 : Write '1' to disable interrupt for event PAUSED */
  #define EASYVDMA_INTENCLR_PAUSED_Pos (6UL)         /*!< Position of PAUSED field.                                            */
  #define EASYVDMA_INTENCLR_PAUSED_Msk (0x1UL << EASYVDMA_INTENCLR_PAUSED_Pos) /*!< Bit mask of PAUSED field.                  */
  #define EASYVDMA_INTENCLR_PAUSED_Min (0x0UL)       /*!< Min enumerator value of PAUSED field.                                */
  #define EASYVDMA_INTENCLR_PAUSED_Max (0x1UL)       /*!< Max enumerator value of PAUSED field.                                */
  #define EASYVDMA_INTENCLR_PAUSED_Clear (0x1UL)     /*!< Disable                                                              */
  #define EASYVDMA_INTENCLR_PAUSED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define EASYVDMA_INTENCLR_PAUSED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RESET @Bit 7 : Write '1' to disable interrupt for event RESET */
  #define EASYVDMA_INTENCLR_RESET_Pos (7UL)          /*!< Position of RESET field.                                             */
  #define EASYVDMA_INTENCLR_RESET_Msk (0x1UL << EASYVDMA_INTENCLR_RESET_Pos) /*!< Bit mask of RESET field.                     */
  #define EASYVDMA_INTENCLR_RESET_Min (0x0UL)        /*!< Min enumerator value of RESET field.                                 */
  #define EASYVDMA_INTENCLR_RESET_Max (0x1UL)        /*!< Max enumerator value of RESET field.                                 */
  #define EASYVDMA_INTENCLR_RESET_Clear (0x1UL)      /*!< Disable                                                              */
  #define EASYVDMA_INTENCLR_RESET_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define EASYVDMA_INTENCLR_RESET_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* EASYVDMA_INTPEND: Pending interrupts */
  #define EASYVDMA_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                     */

/* DONELIST @Bit 0 : Read pending status of interrupt for event DONELIST */
  #define EASYVDMA_INTPEND_DONELIST_Pos (0UL)        /*!< Position of DONELIST field.                                          */
  #define EASYVDMA_INTPEND_DONELIST_Msk (0x1UL << EASYVDMA_INTPEND_DONELIST_Pos) /*!< Bit mask of DONELIST field.              */
  #define EASYVDMA_INTPEND_DONELIST_Min (0x0UL)      /*!< Min enumerator value of DONELIST field.                              */
  #define EASYVDMA_INTPEND_DONELIST_Max (0x1UL)      /*!< Max enumerator value of DONELIST field.                              */
  #define EASYVDMA_INTPEND_DONELIST_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define EASYVDMA_INTPEND_DONELIST_Pending (0x1UL)  /*!< Read: Pending                                                        */

