adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ===================================================== Struct ECB_KEY ====================================================== */
/**
  * @brief KEY [ECB_KEY] (unspecified)
  */
typedef struct {
  __OM  uint32_t  VALUE[4];                          /*!< (@ 0x00000000) 128-bit AES key                                       */
} NRF_ECB_KEY_Type;                                  /*!< Size = 16 (0x010)                                                    */

/* ECB_KEY_VALUE: 128-bit AES key */
  #define ECB_KEY_VALUE_MaxCount (4UL)               /*!< Max size of VALUE[4] array.                                          */
  #define ECB_KEY_VALUE_MaxIndex (3UL)               /*!< Max index of VALUE[4] array.                                         */
  #define ECB_KEY_VALUE_MinIndex (0UL)               /*!< Min index of VALUE[4] array.                                         */
  #define ECB_KEY_VALUE_ResetValue (0x00000000UL)    /*!< Reset value of VALUE[4] register.                                    */

/* VALUE @Bits 0..31 : AES 128-bit key value, bits (32*(n+1))-1 : (32*n) */
  #define ECB_KEY_VALUE_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define ECB_KEY_VALUE_VALUE_Msk (0xFFFFFFFFUL << ECB_KEY_VALUE_VALUE_Pos) /*!< Bit mask of VALUE field.                      */



/* ====================================================== Struct ECB_IN ====================================================== */
/**
  * @brief IN [ECB_IN] IN EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Input pointer                                         */
} NRF_ECB_IN_Type;                                   /*!< Size = 4 (0x004)                                                     */

/* ECB_IN_PTR: Input pointer */
  #define ECB_IN_PTR_ResetValue (0x00000000UL)       /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Points to a job list containing unencrypted ECB data structure */
  #define ECB_IN_PTR_PTR_Pos (0UL)                   /*!< Position of PTR field.                                               */
  #define ECB_IN_PTR_PTR_Msk (0xFFFFFFFFUL << ECB_IN_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                  */



/* ===================================================== Struct ECB_OUT ====================================================== */
/**
  * @brief OUT [ECB_OUT] OUT EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Output pointer Points to a job list containing
                                                                         encrypted ECB data structure*/
} NRF_ECB_OUT_Type;                                  /*!< Size = 4 (0x004)                                                     */

/* ECB_OUT_PTR: Output pointer Points to a job list containing encrypted ECB data structure */
  #define ECB_OUT_PTR_ResetValue (0x00000000UL)      /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Output pointer */
  #define ECB_OUT_PTR_PTR_Pos (0UL)                  /*!< Position of PTR field.                                               */
  #define ECB_OUT_PTR_PTR_Msk (0xFFFFFFFFUL << ECB_OUT_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                */



/* ===================================================== Struct ECB_CSAA ===================================================== */
/**
  * @brief CSAA [ECB_CSAA] Channel sounding access address scoring algorithm
  */
typedef struct {
  __IM  uint32_t  INITIATOR;                         /*!< (@ 0x00000000) Selected initiator for Channel Sounding Access Address*/
  __IM  uint32_t  REFLECTOR;                         /*!< (@ 0x00000004) Selected initiator for Channel Sounding Access Address*/
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000008) Operation modes                                       */
} NRF_ECB_CSAA_Type;                                 /*!< Size = 12 (0x00C)                                                    */

/* ECB_CSAA_INITIATOR: Selected initiator for Channel Sounding Access Address */
  #define ECB_CSAA_INITIATOR_ResetValue (0x00000000UL) /*!< Reset value of INITIATOR register.                                 */

/* PN @Bits 0..31 : (unspecified) */
  #define ECB_CSAA_INITIATOR_PN_Pos (0UL)            /*!< Position of PN field.                                                */
  #define ECB_CSAA_INITIATOR_PN_Msk (0xFFFFFFFFUL << ECB_CSAA_INITIATOR_PN_Pos) /*!< Bit mask of PN field.                     */


/* ECB_CSAA_REFLECTOR: Selected initiator for Channel Sounding Access Address */
  #define ECB_CSAA_REFLECTOR_ResetValue (0x00000000UL) /*!< Reset value of REFLECTOR register.                                 */

/* PN @Bits 0..31 : (unspecified) */
  #define ECB_CSAA_REFLECTOR_PN_Pos (0UL)            /*!< Position of PN field.                                                */
  #define ECB_CSAA_REFLECTOR_PN_Msk (0xFFFFFFFFUL << ECB_CSAA_REFLECTOR_PN_Pos) /*!< Bit mask of PN field.                     */


/* ECB_CSAA_MODE: Operation modes */
  #define ECB_CSAA_MODE_ResetValue (0x00000000UL)    /*!< Reset value of MODE register.                                        */

/* BITREVERSE @Bit 0 : Reverse the endianness on bit level for the ECB output, INITIATOR, and REFLECTOR registers */
  #define ECB_CSAA_MODE_BITREVERSE_Pos (0UL)         /*!< Position of BITREVERSE field.                                        */
  #define ECB_CSAA_MODE_BITREVERSE_Msk (0x1UL << ECB_CSAA_MODE_BITREVERSE_Pos) /*!< Bit mask of BITREVERSE field.              */
  #define ECB_CSAA_MODE_BITREVERSE_Min (0x0UL)       /*!< Min enumerator value of BITREVERSE field.                            */
  #define ECB_CSAA_MODE_BITREVERSE_Max (0x1UL)       /*!< Max enumerator value of BITREVERSE field.                            */
  #define ECB_CSAA_MODE_BITREVERSE_Default (0x0UL)   /*!< Default endianness                                                   */
  #define ECB_CSAA_MODE_BITREVERSE_Reversed (0x1UL)  /*!< Reversed endianness                                                  */


/* ======================================================= Struct ECB ======================================================== */
/**
  * @brief AES ECB Mode Encryption
  */
  typedef struct {                                   /*!< ECB Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start ECB block encrypt                               */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Abort a possible executing ECB operation              */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000100) ECB block encrypt complete                            */
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000104) ECB block encrypt aborted because of a STOP task or due
                                                                         to an error*/
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000180) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x00000184) Publish configuration for event ERROR                 */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[129];
    __IOM NRF_ECB_KEY_Type KEY;                      /*!< (@ 0x00000510) (unspecified)                                         */
    __IM uint32_t RESERVED5[4];
    __IOM NRF_ECB_IN_Type IN;                        /*!< (@ 0x00000530) IN EasyDMA channel                                    */
    __IM uint32_t RESERVED6;
    __IOM NRF_ECB_OUT_Type OUT;                      /*!< (@ 0x00000538) OUT EasyDMA channel                                   */
    __IOM NRF_ECB_CSAA_Type CSAA;                    /*!< (@ 0x0000053C) Channel sounding access address scoring algorithm     */
  } NRF_ECB_Type;                                    /*!< Size = 1352 (0x548)                                                  */

