adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TRIGGERED4 @Bit 4 : Read pending status of interrupt for event TRIGGERED[4] */
  #define EGU_INTPEND_TRIGGERED4_Pos (4UL)           /*!< Position of TRIGGERED4 field.                                        */
  #define EGU_INTPEND_TRIGGERED4_Msk (0x1UL << EGU_INTPEND_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field.                  */
  #define EGU_INTPEND_TRIGGERED4_Min (0x0UL)         /*!< Min enumerator value of TRIGGERED4 field.                            */
  #define EGU_INTPEND_TRIGGERED4_Max (0x1UL)         /*!< Max enumerator value of TRIGGERED4 field.                            */
  #define EGU_INTPEND_TRIGGERED4_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED4_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* TRIGGERED5 @Bit 5 : Read pending status of interrupt for event TRIGGERED[5] */
  #define EGU_INTPEND_TRIGGERED5_Pos (5UL)           /*!< Position of TRIGGERED5 field.                                        */
  #define EGU_INTPEND_TRIGGERED5_Msk (0x1UL << EGU_INTPEND_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field.                  */
  #define EGU_INTPEND_TRIGGERED5_Min (0x0UL)         /*!< Min enumerator value of TRIGGERED5 field.                            */
  #define EGU_INTPEND_TRIGGERED5_Max (0x1UL)         /*!< Max enumerator value of TRIGGERED5 field.                            */
  #define EGU_INTPEND_TRIGGERED5_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED5_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* TRIGGERED6 @Bit 6 : Read pending status of interrupt for event TRIGGERED[6] */
  #define EGU_INTPEND_TRIGGERED6_Pos (6UL)           /*!< Position of TRIGGERED6 field.                                        */
  #define EGU_INTPEND_TRIGGERED6_Msk (0x1UL << EGU_INTPEND_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field.                  */
  #define EGU_INTPEND_TRIGGERED6_Min (0x0UL)         /*!< Min enumerator value of TRIGGERED6 field.                            */
  #define EGU_INTPEND_TRIGGERED6_Max (0x1UL)         /*!< Max enumerator value of TRIGGERED6 field.                            */
  #define EGU_INTPEND_TRIGGERED6_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED6_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* TRIGGERED7 @Bit 7 : Read pending status of interrupt for event TRIGGERED[7] */
  #define EGU_INTPEND_TRIGGERED7_Pos (7UL)           /*!< Position of TRIGGERED7 field.                                        */
  #define EGU_INTPEND_TRIGGERED7_Msk (0x1UL << EGU_INTPEND_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field.                  */
  #define EGU_INTPEND_TRIGGERED7_Min (0x0UL)         /*!< Min enumerator value of TRIGGERED7 field.                            */
  #define EGU_INTPEND_TRIGGERED7_Max (0x1UL)         /*!< Max enumerator value of TRIGGERED7 field.                            */
  #define EGU_INTPEND_TRIGGERED7_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED7_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* TRIGGERED8 @Bit 8 : Read pending status of interrupt for event TRIGGERED[8] */
  #define EGU_INTPEND_TRIGGERED8_Pos (8UL)           /*!< Position of TRIGGERED8 field.                                        */
  #define EGU_INTPEND_TRIGGERED8_Msk (0x1UL << EGU_INTPEND_TRIGGERED8_Pos) /*!< Bit mask of TRIGGERED8 field.                  */
  #define EGU_INTPEND_TRIGGERED8_Min (0x0UL)         /*!< Min enumerator value of TRIGGERED8 field.                            */
  #define EGU_INTPEND_TRIGGERED8_Max (0x1UL)         /*!< Max enumerator value of TRIGGERED8 field.                            */
  #define EGU_INTPEND_TRIGGERED8_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED8_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* TRIGGERED9 @Bit 9 : Read pending status of interrupt for event TRIGGERED[9] */
  #define EGU_INTPEND_TRIGGERED9_Pos (9UL)           /*!< Position of TRIGGERED9 field.                                        */
  #define EGU_INTPEND_TRIGGERED9_Msk (0x1UL << EGU_INTPEND_TRIGGERED9_Pos) /*!< Bit mask of TRIGGERED9 field.                  */
  #define EGU_INTPEND_TRIGGERED9_Min (0x0UL)         /*!< Min enumerator value of TRIGGERED9 field.                            */
  #define EGU_INTPEND_TRIGGERED9_Max (0x1UL)         /*!< Max enumerator value of TRIGGERED9 field.                            */
  #define EGU_INTPEND_TRIGGERED9_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED9_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* TRIGGERED10 @Bit 10 : Read pending status of interrupt for event TRIGGERED[10] */
  #define EGU_INTPEND_TRIGGERED10_Pos (10UL)         /*!< Position of TRIGGERED10 field.                                       */
  #define EGU_INTPEND_TRIGGERED10_Msk (0x1UL << EGU_INTPEND_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10 field.               */
  #define EGU_INTPEND_TRIGGERED10_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED10 field.                           */
  #define EGU_INTPEND_TRIGGERED10_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED10 field.                           */
  #define EGU_INTPEND_TRIGGERED10_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED10_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED11 @Bit 11 : Read pending status of interrupt for event TRIGGERED[11] */
  #define EGU_INTPEND_TRIGGERED11_Pos (11UL)         /*!< Position of TRIGGERED11 field.                                       */
  #define EGU_INTPEND_TRIGGERED11_Msk (0x1UL << EGU_INTPEND_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11 field.               */
  #define EGU_INTPEND_TRIGGERED11_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED11 field.                           */
  #define EGU_INTPEND_TRIGGERED11_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED11 field.                           */
  #define EGU_INTPEND_TRIGGERED11_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED11_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED12 @Bit 12 : Read pending status of interrupt for event TRIGGERED[12] */
  #define EGU_INTPEND_TRIGGERED12_Pos (12UL)         /*!< Position of TRIGGERED12 field.                                       */
  #define EGU_INTPEND_TRIGGERED12_Msk (0x1UL << EGU_INTPEND_TRIGGERED12_Pos) /*!< Bit mask of TRIGGERED12 field.               */
  #define EGU_INTPEND_TRIGGERED12_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED12 field.                           */
  #define EGU_INTPEND_TRIGGERED12_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED12 field.                           */
  #define EGU_INTPEND_TRIGGERED12_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED12_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED13 @Bit 13 : Read pending status of interrupt for event TRIGGERED[13] */
  #define EGU_INTPEND_TRIGGERED13_Pos (13UL)         /*!< Position of TRIGGERED13 field.                                       */
  #define EGU_INTPEND_TRIGGERED13_Msk (0x1UL << EGU_INTPEND_TRIGGERED13_Pos) /*!< Bit mask of TRIGGERED13 field.               */
  #define EGU_INTPEND_TRIGGERED13_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED13 field.                           */
  #define EGU_INTPEND_TRIGGERED13_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED13 field.                           */
  #define EGU_INTPEND_TRIGGERED13_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED13_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED14 @Bit 14 : Read pending status of interrupt for event TRIGGERED[14] */
  #define EGU_INTPEND_TRIGGERED14_Pos (14UL)         /*!< Position of TRIGGERED14 field.                                       */
  #define EGU_INTPEND_TRIGGERED14_Msk (0x1UL << EGU_INTPEND_TRIGGERED14_Pos) /*!< Bit mask of TRIGGERED14 field.               */
  #define EGU_INTPEND_TRIGGERED14_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED14 field.                           */
  #define EGU_INTPEND_TRIGGERED14_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED14 field.                           */
  #define EGU_INTPEND_TRIGGERED14_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED14_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED15 @Bit 15 : Read pending status of interrupt for event TRIGGERED[15] */
  #define EGU_INTPEND_TRIGGERED15_Pos (15UL)         /*!< Position of TRIGGERED15 field.                                       */
  #define EGU_INTPEND_TRIGGERED15_Msk (0x1UL << EGU_INTPEND_TRIGGERED15_Pos) /*!< Bit mask of TRIGGERED15 field.               */
  #define EGU_INTPEND_TRIGGERED15_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED15 field.                           */
  #define EGU_INTPEND_TRIGGERED15_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED15 field.                           */
  #define EGU_INTPEND_TRIGGERED15_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define EGU_INTPEND_TRIGGERED15_Pending (0x1UL)    /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ETB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct ETB ======================================================== */
/**
  * @brief Embedded Trace Buffer
  */
  typedef struct {                                   /*!< ETB Structure                                                        */
    __IM uint32_t RESERVED;
    __IM uint32_t RDP;                               /*!< (@ 0x00000004) ETB RAM Depth Register                                */
    __IM uint32_t RESERVED1;
    __IM uint32_t STS;                               /*!< (@ 0x0000000C) ETB Status Register                                   */
    __IM uint32_t RRD;                               /*!< (@ 0x00000010) ETB RAM Read Data Register                            */
    __IOM uint32_t RRP;                              /*!< (@ 0x00000014) ETB RAM Read Pointer Register                         */
    __IOM uint32_t RWP;                              /*!< (@ 0x00000018) ETB RAM Write Pointer Register                        */
    __IOM uint32_t TRG;                              /*!< (@ 0x0000001C) ETB Trigger Counter Register                          */
    __IOM uint32_t CTL;                              /*!< (@ 0x00000020) ETB Control Register                                  */
    __IOM uint32_t RWD;                              /*!< (@ 0x00000024) ETB RAM Write Data Register                           */
    __IM uint32_t RESERVED2[182];
    __IM uint32_t FFSR;                              /*!< (@ 0x00000300) ETB Formatter and Flush Status Register               */
    __IOM uint32_t FFCR;                             /*!< (@ 0x00000304) ETB Formatter and Flush Control Register              */
    __IM uint32_t RESERVED3[758];
    __OM uint32_t ITMISCOP0;                         /*!< (@ 0x00000EE0) Integration Test Miscellaneous Output Register 0      */
    __OM uint32_t ITTRFLINACK;                       /*!< (@ 0x00000EE4) Integration Test Trigger In and Flush In Acknowledge
                                                                         Register*/
    __IM uint32_t ITTRFLIN;                          /*!< (@ 0x00000EE8) Integration Test Trigger In and Flush In Register     */
    __IM uint32_t ITATBDATA0;                        /*!< (@ 0x00000EEC) Integration Test ATB Data Register 0                  */
    __OM uint32_t ITATBCTR2;                         /*!< (@ 0x00000EF0) Integration Test ATB Control Register 2               */
    __IM uint32_t ITATBCTR1;                         /*!< (@ 0x00000EF4) Integration Test ATB Control Register 1               */
    __IM uint32_t ITATBCTR0;                         /*!< (@ 0x00000EF8) Integration Test ATB Control Register 0               */
    __IM uint32_t RESERVED4;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) Integration Mode Control Register                     */
    __IM uint32_t RESERVED5[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Claim Tag Set Register                                */
    __IOM uint32_t CLAIMCLR;                         /*!< (@ 0x00000FA4) Claim Tag Clear Register                              */
    __IM uint32_t RESERVED6[2];
    __OM uint32_t LAR;                               /*!< (@ 0x00000FB0) Lock Access Register                                  */
    __IM uint32_t LSR;                               /*!< (@ 0x00000FB4) Lock Status Register                                  */
    __IM uint32_t AUTHSTATUS;                        /*!< (@ 0x00000FB8) Authentication Status Register                        */
    __IM uint32_t RESERVED7[3];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Device Configuration Register                         */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) Device Type Identifier Register                       */
    __IM uint32_t PERIPHID4;                         /*!< (@ 0x00000FD0) Peripheral ID4 Register                               */
    __IM uint32_t RESERVED8[3];
    __IM uint32_t PERIPHID0;                         /*!< (@ 0x00000FE0) Peripheral ID0 Register                               */
    __IM uint32_t PERIPHID1;                         /*!< (@ 0x00000FE4) Peripheral ID1 Register                               */
    __IM uint32_t PERIPHID2;                         /*!< (@ 0x00000FE8) Peripheral ID2 Register                               */
    __IM uint32_t PERIPHID3;                         /*!< (@ 0x00000FEC) Peripheral ID3 Register                               */
    __IM uint32_t COMPID0;                           /*!< (@ 0x00000FF0) Component ID0 Register                                */
    __IM uint32_t COMPID1;                           /*!< (@ 0x00000FF4) Component ID1 Register                                */
    __IM uint32_t COMPID2;                           /*!< (@ 0x00000FF8) Component ID2 Register                                */
    __IM uint32_t COMPID3;                           /*!< (@ 0x00000FFC) Component ID3 Register                                */
  } NRF_ETB_Type;                                    /*!< Size = 4096 (0x1000)                                                 */

/* ETB_RDP: ETB RAM Depth Register */
  #define ETB_RDP_ResetValue (0x00000000UL)          /*!< Reset value of RDP register.                                         */

/* ETB_RAM_DEPTH @Bits 0..31 : Defines the depth, in words, of the trace RAM. */
  #define ETB_RDP_ETB_RAM_DEPTH_Pos (0UL)            /*!< Position of ETB_RAM_DEPTH field.                                     */
  #define ETB_RDP_ETB_RAM_DEPTH_Msk (0xFFFFFFFFUL << ETB_RDP_ETB_RAM_DEPTH_Pos) /*!< Bit mask of ETB_RAM_DEPTH field.          */


/* ETB_STS: ETB Status Register */
  #define ETB_STS_ResetValue (0x00000008UL)          /*!< Reset value of STS register.                                         */

/* FULL @Bit 0 : RAM Full. The flag indicates when the RAM write pointer has wrapped around. */
  #define ETB_STS_FULL_Pos (0UL)                     /*!< Position of FULL field.                                              */
  #define ETB_STS_FULL_Msk (0x1UL << ETB_STS_FULL_Pos) /*!< Bit mask of FULL field.                                            */

/* TRIGGERED @Bit 1 : The Triggered bit is set when a trigger has been observed. This does not indicate that a trigger has been
                      embedded in the trace data by the formatter, but is determined by the programming of the Formatter and
                      Flush Control Register. */

  #define ETB_STS_TRIGGERED_Pos (1UL)                /*!< Position of TRIGGERED field.                                         */
  #define ETB_STS_TRIGGERED_Msk (0x1UL << ETB_STS_TRIGGERED_Pos) /*!< Bit mask of TRIGGERED field.                             */

/* ACQCOMP @Bit 2 : The acquisition complete flag indicates that capture has been completed when the formatter stops because of
                    any of the methods defined in the Formatter and Flush Control Register, or TraceCaptEn = 0. This also
                    results in FtStopped in the Formatter and Flush Status Register going HIGH. */

  #define ETB_STS_ACQCOMP_Pos (2UL)                  /*!< Position of ACQCOMP field.                                           */
  #define ETB_STS_ACQCOMP_Msk (0x1UL << ETB_STS_ACQCOMP_Pos) /*!< Bit mask of ACQCOMP field.                                   */

/* FTEMPTY @Bit 3 : Formatter pipeline empty. All data stored to RAM. */
  #define ETB_STS_FTEMPTY_Pos (3UL)                  /*!< Position of FTEMPTY field.                                           */
  #define ETB_STS_FTEMPTY_Msk (0x1UL << ETB_STS_FTEMPTY_Pos) /*!< Bit mask of FTEMPTY field.                                   */


/* ETB_RRD: ETB RAM Read Data Register */
  #define ETB_RRD_ResetValue (0x00000000UL)          /*!< Reset value of RRD register.                                         */

/* RAM_READ_DATA @Bits 0..31 : Data read from the ETB Trace RAM. */
  #define ETB_RRD_RAM_READ_DATA_Pos (0UL)            /*!< Position of RAM_READ_DATA field.                                     */
  #define ETB_RRD_RAM_READ_DATA_Msk (0xFFFFFFFFUL << ETB_RRD_RAM_READ_DATA_Pos) /*!< Bit mask of RAM_READ_DATA field.          */


