adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENFCONT @Bit 1 : Continuous mode in the ETB corresponds to normal mode with the embedding of triggers. Can only be changed
                    when FtStopped is HIGH. This bit is clear on reset. */

  #define ETB_FFCR_ENFCONT_Pos (1UL)                 /*!< Position of ENFCONT field.                                           */
  #define ETB_FFCR_ENFCONT_Msk (0x1UL << ETB_FFCR_ENFCONT_Pos) /*!< Bit mask of ENFCONT field.                                 */

/* FONFLIN @Bit 4 : Set this bit to enable use of the flushin connection. This is clear on reset. */
  #define ETB_FFCR_FONFLIN_Pos (4UL)                 /*!< Position of FONFLIN field.                                           */
  #define ETB_FFCR_FONFLIN_Msk (0x1UL << ETB_FFCR_FONFLIN_Pos) /*!< Bit mask of FONFLIN field.                                 */

/* FONTRIG @Bit 5 : Generate flush using Trigger event. Set this bit to cause a flush of data in the system when a Trigger Event
                    occurs. This bit is clear on reset. A Trigger Event is defined as when the Trigger counter reaches zero
                    (where fitted) or, in the case of the trigger counter being zero (or not fitted), when trigin is HIGH. */

  #define ETB_FFCR_FONTRIG_Pos (5UL)                 /*!< Position of FONTRIG field.                                           */
  #define ETB_FFCR_FONTRIG_Msk (0x1UL << ETB_FFCR_FONTRIG_Pos) /*!< Bit mask of FONTRIG field.                                 */

/* FONMAN @Bit 6 : Setting this bit causes a flush to be generated. This is cleared when this flush has been serviced. This bit
                   is clear on reset. */

  #define ETB_FFCR_FONMAN_Pos (6UL)                  /*!< Position of FONMAN field.                                            */
  #define ETB_FFCR_FONMAN_Msk (0x1UL << ETB_FFCR_FONMAN_Pos) /*!< Bit mask of FONMAN field.                                    */

/* TRIGIN @Bit 8 : Indicate a trigger on trigin being asserted. */
  #define ETB_FFCR_TRIGIN_Pos (8UL)                  /*!< Position of TRIGIN field.                                            */
  #define ETB_FFCR_TRIGIN_Msk (0x1UL << ETB_FFCR_TRIGIN_Pos) /*!< Bit mask of TRIGIN field.                                    */

/* TRIGEVT @Bit 9 : Indicate a trigger on a Trigger Event. */
  #define ETB_FFCR_TRIGEVT_Pos (9UL)                 /*!< Position of TRIGEVT field.                                           */
  #define ETB_FFCR_TRIGEVT_Msk (0x1UL << ETB_FFCR_TRIGEVT_Pos) /*!< Bit mask of TRIGEVT field.                                 */

/* TRIGFL @Bit 10 : Indicates a trigger on Flush completion (afreadys being returned). */
  #define ETB_FFCR_TRIGFL_Pos (10UL)                 /*!< Position of TRIGFL field.                                            */
  #define ETB_FFCR_TRIGFL_Msk (0x1UL << ETB_FFCR_TRIGFL_Pos) /*!< Bit mask of TRIGFL field.                                    */

/* STOPFL @Bit 12 : This forces the FIFO to drain off any part-completed packets. Setting this bit enables this function but
                    this is clear on reset (disabled). */

  #define ETB_FFCR_STOPFL_Pos (12UL)                 /*!< Position of STOPFL field.                                            */
  #define ETB_FFCR_STOPFL_Msk (0x1UL << ETB_FFCR_STOPFL_Pos) /*!< Bit mask of STOPFL field.                                    */

/* STOPTRIG @Bit 13 : Stop the formatter after a Trigger Event is observed. Reset to disabled (zero). */
  #define ETB_FFCR_STOPTRIG_Pos (13UL)               /*!< Position of STOPTRIG field.                                          */
  #define ETB_FFCR_STOPTRIG_Msk (0x1UL << ETB_FFCR_STOPTRIG_Pos) /*!< Bit mask of STOPTRIG field.                              */


/* ETB_ITMISCOP0: Integration Test Miscellaneous Output Register 0 */
  #define ETB_ITMISCOP0_ResetValue (0x00000000UL)    /*!< Reset value of ITMISCOP0 register.                                   */

/* ACQCOMP @Bit 0 : Set the value of acqcomp. */
  #define ETB_ITMISCOP0_ACQCOMP_Pos (0UL)            /*!< Position of ACQCOMP field.                                           */
  #define ETB_ITMISCOP0_ACQCOMP_Msk (0x1UL << ETB_ITMISCOP0_ACQCOMP_Pos) /*!< Bit mask of ACQCOMP field.                       */

/* FULL @Bit 1 : Set the value of full output port. */
  #define ETB_ITMISCOP0_FULL_Pos (1UL)               /*!< Position of FULL field.                                              */
  #define ETB_ITMISCOP0_FULL_Msk (0x1UL << ETB_ITMISCOP0_FULL_Pos) /*!< Bit mask of FULL field.                                */


/* ETB_ITTRFLINACK: Integration Test Trigger In and Flush In Acknowledge Register */
  #define ETB_ITTRFLINACK_ResetValue (0x00000000UL)  /*!< Reset value of ITTRFLINACK register.                                 */

/* TRIGINACK @Bit 0 : Set the value of triginack. */
  #define ETB_ITTRFLINACK_TRIGINACK_Pos (0UL)        /*!< Position of TRIGINACK field.                                         */
  #define ETB_ITTRFLINACK_TRIGINACK_Msk (0x1UL << ETB_ITTRFLINACK_TRIGINACK_Pos) /*!< Bit mask of TRIGINACK field.             */

/* FLUSHINACK @Bit 1 : Set the value of flushinack. */
  #define ETB_ITTRFLINACK_FLUSHINACK_Pos (1UL)       /*!< Position of FLUSHINACK field.                                        */
  #define ETB_ITTRFLINACK_FLUSHINACK_Msk (0x1UL << ETB_ITTRFLINACK_FLUSHINACK_Pos) /*!< Bit mask of FLUSHINACK field.          */


/* ETB_ITTRFLIN: Integration Test Trigger In and Flush In Register */
  #define ETB_ITTRFLIN_ResetValue (0x00000000UL)     /*!< Reset value of ITTRFLIN register.                                    */

/* TRIGIN @Bit 0 : Read the value of trigin. */
  #define ETB_ITTRFLIN_TRIGIN_Pos (0UL)              /*!< Position of TRIGIN field.                                            */
  #define ETB_ITTRFLIN_TRIGIN_Msk (0x1UL << ETB_ITTRFLIN_TRIGIN_Pos) /*!< Bit mask of TRIGIN field.                            */

/* FLUSHIN @Bit 1 : Read the value of flushin. */
  #define ETB_ITTRFLIN_FLUSHIN_Pos (1UL)             /*!< Position of FLUSHIN field.                                           */
  #define ETB_ITTRFLIN_FLUSHIN_Msk (0x1UL << ETB_ITTRFLIN_FLUSHIN_Pos) /*!< Bit mask of FLUSHIN field.                         */


