adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCKGRANT @Bit 1 : Returns the current status of the Lock. This bit reads as 0 when read from an external debugger
                      (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers. */

  #define ETB_LSR_LOCKGRANT_Pos (1UL)                /*!< Position of LOCKGRANT field.                                         */
  #define ETB_LSR_LOCKGRANT_Msk (0x1UL << ETB_LSR_LOCKGRANT_Pos) /*!< Bit mask of LOCKGRANT field.                             */

/* LOCKTYPE @Bit 2 : Indicates if the Lock Access Register (0xFB0) is implemented as 8-bit or 32-bit */
  #define ETB_LSR_LOCKTYPE_Pos (2UL)                 /*!< Position of LOCKTYPE field.                                          */
  #define ETB_LSR_LOCKTYPE_Msk (0x1UL << ETB_LSR_LOCKTYPE_Pos) /*!< Bit mask of LOCKTYPE field.                                */


/* ETB_AUTHSTATUS: Authentication Status Register */
  #define ETB_AUTHSTATUS_ResetValue (0x00000000UL)   /*!< Reset value of AUTHSTATUS register.                                  */

/* NSID @Bits 0..1 : Indicates the security level for non-secure invasive debug */
  #define ETB_AUTHSTATUS_NSID_Pos (0UL)              /*!< Position of NSID field.                                              */
  #define ETB_AUTHSTATUS_NSID_Msk (0x3UL << ETB_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                              */

/* NSNID @Bits 2..3 : Indicates the security level for non-secure non-invasive debug */
  #define ETB_AUTHSTATUS_NSNID_Pos (2UL)             /*!< Position of NSNID field.                                             */
  #define ETB_AUTHSTATUS_NSNID_Msk (0x3UL << ETB_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                           */

/* SID @Bits 4..5 : Indicates the security level for secure invasive debug */
  #define ETB_AUTHSTATUS_SID_Pos (4UL)               /*!< Position of SID field.                                               */
  #define ETB_AUTHSTATUS_SID_Msk (0x3UL << ETB_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                                 */

/* SNID @Bits 6..7 : Indicates the security level for secure non-invasive debug */
  #define ETB_AUTHSTATUS_SNID_Pos (6UL)              /*!< Position of SNID field.                                              */
  #define ETB_AUTHSTATUS_SNID_Msk (0x3UL << ETB_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                              */


/* ETB_DEVID: Device Configuration Register */
  #define ETB_DEVID_ResetValue (0x00000000UL)        /*!< Reset value of DEVID register.                                       */

/* EXTMUXNUM @Bits 0..4 : When non-zero this value indicates the type/number of ATB multiplexing present on the input to the
                          ATB. */

  #define ETB_DEVID_EXTMUXNUM_Pos (0UL)              /*!< Position of EXTMUXNUM field.                                         */
  #define ETB_DEVID_EXTMUXNUM_Msk (0x1FUL << ETB_DEVID_EXTMUXNUM_Pos) /*!< Bit mask of EXTMUXNUM field.                        */

/* RAMCLK @Bit 5 : This bit returns 0 on reads indicating that the ETB RAM operates synchronously to atclk. */
  #define ETB_DEVID_RAMCLK_Pos (5UL)                 /*!< Position of RAMCLK field.                                            */
  #define ETB_DEVID_RAMCLK_Msk (0x1UL << ETB_DEVID_RAMCLK_Pos) /*!< Bit mask of RAMCLK field.                                  */


/* ETB_DEVTYPE: Device Type Identifier Register */
  #define ETB_DEVTYPE_ResetValue (0x00000021UL)      /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR_TYPE @Bits 0..3 : Major classification grouping for this debug/trace component */
  #define ETB_DEVTYPE_MAJOR_TYPE_Pos (0UL)           /*!< Position of MAJOR_TYPE field.                                        */
  #define ETB_DEVTYPE_MAJOR_TYPE_Msk (0xFUL << ETB_DEVTYPE_MAJOR_TYPE_Pos) /*!< Bit mask of MAJOR_TYPE field.                  */

/* SUB_TYPE @Bits 4..7 : Sub-classification within the major category */
  #define ETB_DEVTYPE_SUB_TYPE_Pos (4UL)             /*!< Position of SUB_TYPE field.                                          */
  #define ETB_DEVTYPE_SUB_TYPE_Msk (0xFUL << ETB_DEVTYPE_SUB_TYPE_Pos) /*!< Bit mask of SUB_TYPE field.                        */


/* ETB_PERIPHID4: Peripheral ID4 Register */
  #define ETB_PERIPHID4_ResetValue (0x00000004UL)    /*!< Reset value of PERIPHID4 register.                                   */

/* DES_2 @Bits 0..3 : JEDEC continuation code indicating the designer of the component (along with the identity code) */
  #define ETB_PERIPHID4_DES_2_Pos (0UL)              /*!< Position of DES_2 field.                                             */
  #define ETB_PERIPHID4_DES_2_Msk (0xFUL << ETB_PERIPHID4_DES_2_Pos) /*!< Bit mask of DES_2 field.                             */

/* SIZE @Bits 4..7 : This is a 4-bit value that indicates the total contiguous size of the memory window used by this component
                     in powers of 2 from the standard 4KB. If a component only requires the standard 4KB then this should read
                     as 0x0, 4KB only, for 8KB set to 0x1, 16KB == 0x2, 32KB == 0x3, and so on. */

  #define ETB_PERIPHID4_SIZE_Pos (4UL)               /*!< Position of SIZE field.                                              */
  #define ETB_PERIPHID4_SIZE_Msk (0xFUL << ETB_PERIPHID4_SIZE_Pos) /*!< Bit mask of SIZE field.                                */


/* ETB_PERIPHID0: Peripheral ID0 Register */
  #define ETB_PERIPHID0_ResetValue (0x00000007UL)    /*!< Reset value of PERIPHID0 register.                                   */

/* PART_0 @Bits 0..7 : Bits [7:0] of the component's part number. This is selected by the designer of the component. */
  #define ETB_PERIPHID0_PART_0_Pos (0UL)             /*!< Position of PART_0 field.                                            */
  #define ETB_PERIPHID0_PART_0_Msk (0xFFUL << ETB_PERIPHID0_PART_0_Pos) /*!< Bit mask of PART_0 field.                         */


/* ETB_PERIPHID1: Peripheral ID1 Register */
  #define ETB_PERIPHID1_ResetValue (0x000000B9UL)    /*!< Reset value of PERIPHID1 register.                                   */

/* PART_1 @Bits 0..3 : Bits [11:8] of the component's part number. This is selected by the designer of the component. */
  #define ETB_PERIPHID1_PART_1_Pos (0UL)             /*!< Position of PART_1 field.                                            */
  #define ETB_PERIPHID1_PART_1_Msk (0xFUL << ETB_PERIPHID1_PART_1_Pos) /*!< Bit mask of PART_1 field.                          */

/* DES_0 @Bits 4..7 : Bits 3:0 of the JEDEC identity code indicating the designer of the component (along with the continuation
                      code) */

  #define ETB_PERIPHID1_DES_0_Pos (4UL)              /*!< Position of DES_0 field.                                             */
  #define ETB_PERIPHID1_DES_0_Msk (0xFUL << ETB_PERIPHID1_DES_0_Pos) /*!< Bit mask of DES_0 field.                             */


/* ETB_PERIPHID2: Peripheral ID2 Register */
  #define ETB_PERIPHID2_ResetValue (0x0000004BUL)    /*!< Reset value of PERIPHID2 register.                                   */

/* DES_1 @Bits 0..2 : Bits 6:4 of the JEDEC identity code indicating the designer of the component (along with the continuation
                      code) */

  #define ETB_PERIPHID2_DES_1_Pos (0UL)              /*!< Position of DES_1 field.                                             */
  #define ETB_PERIPHID2_DES_1_Msk (0x7UL << ETB_PERIPHID2_DES_1_Pos) /*!< Bit mask of DES_1 field.                             */

/* JEDEC @Bit 3 : Always set. Indicates that a JEDEC assigned value is used */
  #define ETB_PERIPHID2_JEDEC_Pos (3UL)              /*!< Position of JEDEC field.                                             */
  #define ETB_PERIPHID2_JEDEC_Msk (0x1UL << ETB_PERIPHID2_JEDEC_Pos) /*!< Bit mask of JEDEC field.                             */

/* REVISION @Bits 4..7 : The Revision field is an incremental value starting at 0x0 for the first design of this component. This
                         only increases by 1 for both major and minor revisions and is simply used as a look-up to establish the
                         exact major/minor revision. */

