adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ETM_TRCDEVARCH: The TRCDEVARCH identifies ETM-M33 as an ETMv4.2 component */
  #define ETM_TRCDEVARCH_ResetValue (0x00000000UL)   /*!< Reset value of TRCDEVARCH register.                                  */

/* ARCHID @Bits 0..15 : Architecture ID */
  #define ETM_TRCDEVARCH_ARCHID_Pos (0UL)            /*!< Position of ARCHID field.                                            */
  #define ETM_TRCDEVARCH_ARCHID_Msk (0xFFFFUL << ETM_TRCDEVARCH_ARCHID_Pos) /*!< Bit mask of ARCHID field.                     */
  #define ETM_TRCDEVARCH_ARCHID_Min (0x4A13UL)       /*!< Min enumerator value of ARCHID field.                                */
  #define ETM_TRCDEVARCH_ARCHID_Max (0x4A13UL)       /*!< Max enumerator value of ARCHID field.                                */
  #define ETM_TRCDEVARCH_ARCHID_ETMv42 (0x4A13UL)    /*!< Component is an ETMv4 component                                      */

/* REVISION @Bits 16..19 : Architecture revision */
  #define ETM_TRCDEVARCH_REVISION_Pos (16UL)         /*!< Position of REVISION field.                                          */
  #define ETM_TRCDEVARCH_REVISION_Msk (0xFUL << ETM_TRCDEVARCH_REVISION_Pos) /*!< Bit mask of REVISION field.                  */
  #define ETM_TRCDEVARCH_REVISION_Min (0x2UL)        /*!< Min enumerator value of REVISION field.                              */
  #define ETM_TRCDEVARCH_REVISION_Max (0x2UL)        /*!< Max enumerator value of REVISION field.                              */
  #define ETM_TRCDEVARCH_REVISION_v2 (0x2UL)         /*!< Component is part of architecture 4.2                                */

/* PRESENT @Bit 20 : This register is implemented */
  #define ETM_TRCDEVARCH_PRESENT_Pos (20UL)          /*!< Position of PRESENT field.                                           */
  #define ETM_TRCDEVARCH_PRESENT_Msk (0x1UL << ETM_TRCDEVARCH_PRESENT_Pos) /*!< Bit mask of PRESENT field.                     */
  #define ETM_TRCDEVARCH_PRESENT_Min (0x0UL)         /*!< Min enumerator value of PRESENT field.                               */
  #define ETM_TRCDEVARCH_PRESENT_Max (0x1UL)         /*!< Max enumerator value of PRESENT field.                               */
  #define ETM_TRCDEVARCH_PRESENT_Absent (0x0UL)      /*!< The register is not implemented.                                     */
  #define ETM_TRCDEVARCH_PRESENT_Present (0x1UL)     /*!< The register is implemented.                                         */

/* ARCHITECT @Bits 21..31 : Defines the architect of the component */
  #define ETM_TRCDEVARCH_ARCHITECT_Pos (21UL)        /*!< Position of ARCHITECT field.                                         */
  #define ETM_TRCDEVARCH_ARCHITECT_Msk (0x7FFUL << ETM_TRCDEVARCH_ARCHITECT_Pos) /*!< Bit mask of ARCHITECT field.             */
  #define ETM_TRCDEVARCH_ARCHITECT_Min (0x23BUL)     /*!< Min enumerator value of ARCHITECT field.                             */
  #define ETM_TRCDEVARCH_ARCHITECT_Max (0x23BUL)     /*!< Max enumerator value of ARCHITECT field.                             */
  #define ETM_TRCDEVARCH_ARCHITECT_Arm (0x23BUL)     /*!< This peripheral was architected by Arm.                              */


/* ETM_TRCDEVTYPE: Controls the single-shot comparator. */
  #define ETM_TRCDEVTYPE_ResetValue (0x00000000UL)   /*!< Reset value of TRCDEVTYPE register.                                  */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define ETM_TRCDEVTYPE_MAJOR_Pos (0UL)             /*!< Position of MAJOR field.                                             */
  #define ETM_TRCDEVTYPE_MAJOR_Msk (0xFUL << ETM_TRCDEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                           */
  #define ETM_TRCDEVTYPE_MAJOR_Min (0x3UL)           /*!< Min enumerator value of MAJOR field.                                 */
  #define ETM_TRCDEVTYPE_MAJOR_Max (0x3UL)           /*!< Max enumerator value of MAJOR field.                                 */
  #define ETM_TRCDEVTYPE_MAJOR_TraceSource (0x3UL)   /*!< Peripheral is a trace source.                                        */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define ETM_TRCDEVTYPE_SUB_Pos (4UL)               /*!< Position of SUB field.                                               */
  #define ETM_TRCDEVTYPE_SUB_Msk (0xFUL << ETM_TRCDEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                 */
  #define ETM_TRCDEVTYPE_SUB_Min (0x1UL)             /*!< Min enumerator value of SUB field.                                   */
  #define ETM_TRCDEVTYPE_SUB_Max (0x1UL)             /*!< Max enumerator value of SUB field.                                   */
  #define ETM_TRCDEVTYPE_SUB_ProcessorTrace (0x1UL)  /*!< Peripheral is a processor trace source.                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ETR                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct ETR ======================================================== */
/**
  * @brief Embedded Trace Router
  */
  typedef struct {                                   /*!< ETR Structure                                                        */
    __IM uint32_t RESERVED;
    __IOM uint32_t RSZ;                              /*!< (@ 0x00000004) RAM Size register                                     */
    __IM uint32_t RESERVED1;
    __IM uint32_t STS;                               /*!< (@ 0x0000000C) Status Register                                       */
    __IM uint32_t RRD;                               /*!< (@ 0x00000010) RAM Read Data Register                                */
    __IOM uint32_t RRP;                              /*!< (@ 0x00000014) RAM Read Pointer Register                             */
    __IOM uint32_t RWP;                              /*!< (@ 0x00000018) RAM Write Pointer Register                            */
    __IOM uint32_t TRG;                              /*!< (@ 0x0000001C) Trigger Counter Register                              */
    __IOM uint32_t CTL;                              /*!< (@ 0x00000020) Control Register                                      */
    __OM uint32_t RWD;                               /*!< (@ 0x00000024) RAM Write Data Register                               */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000028) Mode Register                                         */
    __IM uint32_t LBUFLEVEL;                         /*!< (@ 0x0000002C) Latched Buffer Fill Level                             */
    __IM uint32_t CBUFLEVEL;                         /*!< (@ 0x00000030) Current Buffer Fill Level                             */
    __IOM uint32_t BUFWM;                            /*!< (@ 0x00000034) Buffer Level Water Mark                               */
    __IOM uint32_t RRPHI;                            /*!< (@ 0x00000038) RAM Read Pointer High Register                        */
    __IOM uint32_t RWPHI;                            /*!< (@ 0x0000003C) RAM Write Pointer High Register                       */
    __IM uint32_t RESERVED2[52];
    __IOM uint32_t AXICTL;                           /*!< (@ 0x00000110) AXI Control Register                                  */
    __IM uint32_t RESERVED3;
    __IOM uint32_t DBALO;                            /*!< (@ 0x00000118) Data Buffer Address Low Register                      */
    __IOM uint32_t DBAHI;                            /*!< (@ 0x0000011C) Data Buffer Address High Register                     */
    __IM uint32_t RESERVED4[120];
    __IM uint32_t FFSR;                              /*!< (@ 0x00000300) Formatter and Flush Status Register                   */
    __IOM uint32_t FFCR;                             /*!< (@ 0x00000304) Formatter and Flush Control Register                  */
    __IOM uint32_t PSCR;                             /*!< (@ 0x00000308) Periodic Synchronization Counter Register             */
    __IM uint32_t RESERVED5[756];
    __OM uint32_t ITATBMCTR0;                        /*!< (@ 0x00000EDC) Integration Test ATB Master Interface Control 0
                                                                         Register*/
    __OM uint32_t ITMISCOP0;                         /*!< (@ 0x00000EE0) Integration Test Miscellaneous Output Register 0      */
    __IM uint32_t RESERVED6;
    __IM uint32_t ITTRFLIN;                          /*!< (@ 0x00000EE8) Integration Test Trigger In and Flush In Register     */
    __IM uint32_t ITATBDATA0;                        /*!< (@ 0x00000EEC) Integration Test ATB Data Register 0                  */
    __OM uint32_t ITATBCTR2;                         /*!< (@ 0x00000EF0) Integration Test ATB Control 2 Register               */
    __IM uint32_t ITATBCTR1;                         /*!< (@ 0x00000EF4) Integration Test ATB Control 1 Register               */
    __IM uint32_t ITATBCTR0;                         /*!< (@ 0x00000EF8) Integration Test ATB Control 0 Register               */
    __IM uint32_t RESERVED7;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) Integration Mode Control Register                     */
    __IM uint32_t RESERVED8[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Claim Tag Set Register                                */
    __IOM uint32_t CLAIMCLR;                         /*!< (@ 0x00000FA4) Claim Tag Clear Register                              */
    __IM uint32_t RESERVED9[2];
    __OM uint32_t LAR;                               /*!< (@ 0x00000FB0) Lock Access Register                                  */
    __IM uint32_t LSR;                               /*!< (@ 0x00000FB4) Lock Status Register                                  */
    __IM uint32_t AUTHSTATUS;                        /*!< (@ 0x00000FB8) Authentication Status Register                        */
    __IM uint32_t RESERVED10[3];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Device Configuration Register                         */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) Device Type Identifier Register                       */
    __IM uint32_t PERIPHID4;                         /*!< (@ 0x00000FD0) Peripheral ID4 Register                               */
    __IM uint32_t RESERVED11[3];
    __IM uint32_t PERIPHID0;                         /*!< (@ 0x00000FE0) Peripheral ID0 Register                               */
    __IM uint32_t PERIPHID1;                         /*!< (@ 0x00000FE4) Peripheral ID1 Register                               */
    __IM uint32_t PERIPHID2;                         /*!< (@ 0x00000FE8) Peripheral ID2 Register                               */
    __IM uint32_t PERIPHID3;                         /*!< (@ 0x00000FEC) Peripheral ID3 Register                               */
    __IM uint32_t COMPID0;                           /*!< (@ 0x00000FF0) Component ID0 Register                                */
    __IM uint32_t COMPID1;                           /*!< (@ 0x00000FF4) Component ID1 Register                                */
    __IM uint32_t COMPID2;                           /*!< (@ 0x00000FF8) Component ID2 Register                                */
    __IM uint32_t COMPID3;                           /*!< (@ 0x00000FFC) Component ID3 Register                                */
  } NRF_ETR_Type;                                    /*!< Size = 4096 (0x1000)                                                 */

/* ETR_RSZ: RAM Size register */
  #define ETR_RSZ_ResetValue (0x00000000UL)          /*!< Reset value of RSZ register.                                         */

/* RSZ @Bits 0..30 : Size of the RAM in 32-bit words. */
  #define ETR_RSZ_RSZ_Pos (0UL)                      /*!< Position of RSZ field.                                               */
  #define ETR_RSZ_RSZ_Msk (0x7FFFFFFFUL << ETR_RSZ_RSZ_Pos) /*!< Bit mask of RSZ field.                                        */


