adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ETR_STS: Status Register */
  #define ETR_STS_ResetValue (0x0000000CUL)          /*!< Reset value of STS register.                                         */

/* FULL @Bit 0 : This bit can be used to help determine how much of the trace buffer contains valid data. */
  #define ETR_STS_FULL_Pos (0UL)                     /*!< Position of FULL field.                                              */
  #define ETR_STS_FULL_Msk (0x1UL << ETR_STS_FULL_Pos) /*!< Bit mask of FULL field.                                            */

/* TRIGGERED @Bit 1 : The Triggered bit is set when trace capture is in progress and the TMC has detected a trigger event. */
  #define ETR_STS_TRIGGERED_Pos (1UL)                /*!< Position of TRIGGERED field.                                         */
  #define ETR_STS_TRIGGERED_Msk (0x1UL << ETR_STS_TRIGGERED_Pos) /*!< Bit mask of TRIGGERED field.                             */

/* TMCREADY @Bit 2 : TMC ready */
  #define ETR_STS_TMCREADY_Pos (2UL)                 /*!< Position of TMCREADY field.                                          */
  #define ETR_STS_TMCREADY_Msk (0x1UL << ETR_STS_TMCREADY_Pos) /*!< Bit mask of TMCREADY field.                                */

/* FTEMPTY @Bit 3 : This bit is set when trace capture has stopped, and all internal pipelines and buffers have drained. */
  #define ETR_STS_FTEMPTY_Pos (3UL)                  /*!< Position of FTEMPTY field.                                           */
  #define ETR_STS_FTEMPTY_Msk (0x1UL << ETR_STS_FTEMPTY_Pos) /*!< Bit mask of FTEMPTY field.                                   */

/* EMPTY @Bit 4 : If set, this bit indicates that the TMC does not contain any valid trace data in the trace memory. */
  #define ETR_STS_EMPTY_Pos (4UL)                    /*!< Position of EMPTY field.                                             */
  #define ETR_STS_EMPTY_Msk (0x1UL << ETR_STS_EMPTY_Pos) /*!< Bit mask of EMPTY field.                                         */

/* MEMERR @Bit 5 : This bit indicates that an error has occurred on the AXI master interface. */
  #define ETR_STS_MEMERR_Pos (5UL)                   /*!< Position of MEMERR field.                                            */
  #define ETR_STS_MEMERR_Msk (0x1UL << ETR_STS_MEMERR_Pos) /*!< Bit mask of MEMERR field.                                      */


/* ETR_RRD: RAM Read Data Register */
  #define ETR_RRD_ResetValue (0x00000000UL)          /*!< Reset value of RRD register.                                         */

/* RRD @Bits 0..31 : Reads return data from Trace RAM */
  #define ETR_RRD_RRD_Pos (0UL)                      /*!< Position of RRD field.                                               */
  #define ETR_RRD_RRD_Msk (0xFFFFFFFFUL << ETR_RRD_RRD_Pos) /*!< Bit mask of RRD field.                                        */


/* ETR_RRP: RAM Read Pointer Register */
  #define ETR_RRP_ResetValue (0x00000000UL)          /*!< Reset value of RRP register.                                         */

/* RRP @Bits 0..8 : This value represents the location in trace memory that will be accessed on a subsequent RRD read. */
  #define ETR_RRP_RRP_Pos (0UL)                      /*!< Position of RRP field.                                               */
  #define ETR_RRP_RRP_Msk (0x1FFUL << ETR_RRP_RRP_Pos) /*!< Bit mask of RRP field.                                             */


/* ETR_RWP: RAM Write Pointer Register */
  #define ETR_RWP_ResetValue (0x00000000UL)          /*!< Reset value of RWP register.                                         */

/* RWP @Bits 0..31 : This value represents the location in trace memory that will be accessed on a subsequent write to the trace
                     memory. */

  #define ETR_RWP_RWP_Pos (0UL)                      /*!< Position of RWP field.                                               */
  #define ETR_RWP_RWP_Msk (0xFFFFFFFFUL << ETR_RWP_RWP_Pos) /*!< Bit mask of RWP field.                                        */


/* ETR_TRG: Trigger Counter Register */
  #define ETR_TRG_ResetValue (0x00000000UL)          /*!< Reset value of TRG register.                                         */

/* TRG @Bits 0..31 : This count represents the number of 32-bit words between a TRIGIN/trigger packet and a trigger event. */
  #define ETR_TRG_TRG_Pos (0UL)                      /*!< Position of TRG field.                                               */
  #define ETR_TRG_TRG_Msk (0xFFFFFFFFUL << ETR_TRG_TRG_Pos) /*!< Bit mask of TRG field.                                        */


/* ETR_CTL: Control Register */
  #define ETR_CTL_ResetValue (0x00000000UL)          /*!< Reset value of CTL register.                                         */

/* TRACECAPTEN @Bit 0 : Setting this bit to 1 enables the TMC to capture trace data. */
  #define ETR_CTL_TRACECAPTEN_Pos (0UL)              /*!< Position of TRACECAPTEN field.                                       */
  #define ETR_CTL_TRACECAPTEN_Msk (0x1UL << ETR_CTL_TRACECAPTEN_Pos) /*!< Bit mask of TRACECAPTEN field.                       */


/* ETR_RWD: RAM Write Data Register */
  #define ETR_RWD_ResetValue (0x00000000UL)          /*!< Reset value of RWD register.                                         */

/* RWD @Bits 0..31 : Data written to this register is placed in the Trace RAM. */
  #define ETR_RWD_RWD_Pos (0UL)                      /*!< Position of RWD field.                                               */
  #define ETR_RWD_RWD_Msk (0xFFFFFFFFUL << ETR_RWD_RWD_Pos) /*!< Bit mask of RWD field.                                        */


/* ETR_MODE: Mode Register */
  #define ETR_MODE_ResetValue (0x00000000UL)         /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Selects the operating mode. */
  #define ETR_MODE_MODE_Pos (0UL)                    /*!< Position of MODE field.                                              */
  #define ETR_MODE_MODE_Msk (0x3UL << ETR_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                          */
  #define ETR_MODE_MODE_Min (0x0UL)                  /*!< Min enumerator value of MODE field.                                  */
  #define ETR_MODE_MODE_Max (0x1UL)                  /*!< Max enumerator value of MODE field.                                  */
  #define ETR_MODE_MODE_CIRCULARBUF (0x0UL)          /*!< Circular Buffer mode                                                 */
  #define ETR_MODE_MODE_FIFO (0x1UL)                 /*!< Software FIFO mode                                                   */


