adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ETR_LBUFLEVEL: Latched Buffer Fill Level */
  #define ETR_LBUFLEVEL_ResetValue (0x00000000UL)    /*!< Reset value of LBUFLEVEL register.                                   */

/* LBUFLEVEL @Bits 0..30 : Indicates the maximum fill level of the trace memory in 32-bit words since this register was last
                           read. */

  #define ETR_LBUFLEVEL_LBUFLEVEL_Pos (0UL)          /*!< Position of LBUFLEVEL field.                                         */
  #define ETR_LBUFLEVEL_LBUFLEVEL_Msk (0x7FFFFFFFUL << ETR_LBUFLEVEL_LBUFLEVEL_Pos) /*!< Bit mask of LBUFLEVEL field.          */


/* ETR_CBUFLEVEL: Current Buffer Fill Level */
  #define ETR_CBUFLEVEL_ResetValue (0x00000000UL)    /*!< Reset value of CBUFLEVEL register.                                   */

/* CBUFLEVEL @Bits 0..7 : Indicates the current fill level of the trace memory in 32-bit words. */
  #define ETR_CBUFLEVEL_CBUFLEVEL_Pos (0UL)          /*!< Position of CBUFLEVEL field.                                         */
  #define ETR_CBUFLEVEL_CBUFLEVEL_Msk (0xFFUL << ETR_CBUFLEVEL_CBUFLEVEL_Pos) /*!< Bit mask of CBUFLEVEL field.                */


/* ETR_BUFWM: Buffer Level Water Mark */
  #define ETR_BUFWM_ResetValue (0x00000000UL)        /*!< Reset value of BUFWM register.                                       */

/* BUFWM @Bits 0..6 : Indicates the desired threshold vacancy level in 32-bit words in the trace memory. */
  #define ETR_BUFWM_BUFWM_Pos (0UL)                  /*!< Position of BUFWM field.                                             */
  #define ETR_BUFWM_BUFWM_Msk (0x7FUL << ETR_BUFWM_BUFWM_Pos) /*!< Bit mask of BUFWM field.                                    */


/* ETR_RRPHI: RAM Read Pointer High Register */
  #define ETR_RRPHI_ResetValue (0x00000000UL)        /*!< Reset value of RRPHI register.                                       */

/* RRPHI @Bits 0..7 : Bits[39:32] of the read pointer */
  #define ETR_RRPHI_RRPHI_Pos (0UL)                  /*!< Position of RRPHI field.                                             */
  #define ETR_RRPHI_RRPHI_Msk (0xFFUL << ETR_RRPHI_RRPHI_Pos) /*!< Bit mask of RRPHI field.                                    */


/* ETR_RWPHI: RAM Write Pointer High Register */
  #define ETR_RWPHI_ResetValue (0x00000000UL)        /*!< Reset value of RWPHI register.                                       */

/* RWPHI @Bits 0..7 : Bits[39:32] of the write pointer */
  #define ETR_RWPHI_RWPHI_Pos (0UL)                  /*!< Position of RWPHI field.                                             */
  #define ETR_RWPHI_RWPHI_Msk (0xFFUL << ETR_RWPHI_RWPHI_Pos) /*!< Bit mask of RWPHI field.                                    */


/* ETR_AXICTL: AXI Control Register */
  #define ETR_AXICTL_ResetValue (0x00000000UL)       /*!< Reset value of AXICTL register.                                      */

/* PROTCTRLBIT0 @Bit 0 : This bit controls the value driven on ARPROTM[0]/AWPROTM[0] on the AXI interface when performing AXI
                         transfers. */

  #define ETR_AXICTL_PROTCTRLBIT0_Pos (0UL)          /*!< Position of PROTCTRLBIT0 field.                                      */
  #define ETR_AXICTL_PROTCTRLBIT0_Msk (0x1UL << ETR_AXICTL_PROTCTRLBIT0_Pos) /*!< Bit mask of PROTCTRLBIT0 field.              */

/* PROTCTRLBIT1 @Bit 1 : This bit controls the value driven on ARPROTM[1]/AWPROTM[1] on the AXI interface when performing AXI
                         transfers. */

  #define ETR_AXICTL_PROTCTRLBIT1_Pos (1UL)          /*!< Position of PROTCTRLBIT1 field.                                      */
  #define ETR_AXICTL_PROTCTRLBIT1_Msk (0x1UL << ETR_AXICTL_PROTCTRLBIT1_Pos) /*!< Bit mask of PROTCTRLBIT1 field.              */

/* CACHECTRLBIT0 @Bit 2 : This bit controls the value driven on the ARCACHEM[0]/AWCACHEM[0] signal on the AXI interface when
                          performing AXI transfers. */

  #define ETR_AXICTL_CACHECTRLBIT0_Pos (2UL)         /*!< Position of CACHECTRLBIT0 field.                                     */
  #define ETR_AXICTL_CACHECTRLBIT0_Msk (0x1UL << ETR_AXICTL_CACHECTRLBIT0_Pos) /*!< Bit mask of CACHECTRLBIT0 field.           */

/* CACHECTRLBIT1 @Bit 3 : This bit controls the value driven on the ARCACHEM[1]/AWCACHEM[1] signal on the AXI interface when
                          performing AXI transfers. */

  #define ETR_AXICTL_CACHECTRLBIT1_Pos (3UL)         /*!< Position of CACHECTRLBIT1 field.                                     */
  #define ETR_AXICTL_CACHECTRLBIT1_Msk (0x1UL << ETR_AXICTL_CACHECTRLBIT1_Pos) /*!< Bit mask of CACHECTRLBIT1 field.           */

/* CACHECTRLBIT2 @Bit 4 : This bit controls the value driven on the ARCACHEM[2]/AWCACHEM[2] signal on the AXI interface when
                          performing AXI transfers. */

  #define ETR_AXICTL_CACHECTRLBIT2_Pos (4UL)         /*!< Position of CACHECTRLBIT2 field.                                     */
  #define ETR_AXICTL_CACHECTRLBIT2_Msk (0x1UL << ETR_AXICTL_CACHECTRLBIT2_Pos) /*!< Bit mask of CACHECTRLBIT2 field.           */

/* CACHECTRLBIT3 @Bit 5 : This bit controls the value driven on the ARCACHEM[3]/AWCACHEM[3] signal on the AXI interface when
                          performing AXI transfers. */

  #define ETR_AXICTL_CACHECTRLBIT3_Pos (5UL)         /*!< Position of CACHECTRLBIT3 field.                                     */
  #define ETR_AXICTL_CACHECTRLBIT3_Msk (0x1UL << ETR_AXICTL_CACHECTRLBIT3_Pos) /*!< Bit mask of CACHECTRLBIT3 field.           */

/* SCATTERGATHERMODE @Bit 7 : This bit indicates whether trace memory is accessed as a single buffer in system memory or as a
                              linked-list based scatter-gather memory. */

  #define ETR_AXICTL_SCATTERGATHERMODE_Pos (7UL)     /*!< Position of SCATTERGATHERMODE field.                                 */
  #define ETR_AXICTL_SCATTERGATHERMODE_Msk (0x1UL << ETR_AXICTL_SCATTERGATHERMODE_Pos) /*!< Bit mask of SCATTERGATHERMODE
                                                                            field.*/

/* WRBURSTLEN @Bits 8..11 : This field indicates the maximum number of data transfers that can occur within each burst initiated
                            by the TMC on the AXI interface. */

  #define ETR_AXICTL_WRBURSTLEN_Pos (8UL)            /*!< Position of WRBURSTLEN field.                                        */
  #define ETR_AXICTL_WRBURSTLEN_Msk (0xFUL << ETR_AXICTL_WRBURSTLEN_Pos) /*!< Bit mask of WRBURSTLEN field.                    */


