adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ATDATASBIT127 @Bit 16 : Read the value of ATDATAS[127] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT127_Pos (16UL)    /*!< Position of ATDATASBIT127 field.                                     */
  #define ETR_ITATBDATA0_ATDATASBIT127_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT127_Pos) /*!< Bit mask of ATDATASBIT127 field.   */


/* ETR_ITATBCTR2: Integration Test ATB Control 2 Register */
  #define ETR_ITATBCTR2_ResetValue (0x00000000UL)    /*!< Reset value of ITATBCTR2 register.                                   */

/* ATREADYS @Bit 0 : Set the value of ATREADYS output */
  #define ETR_ITATBCTR2_ATREADYS_Pos (0UL)           /*!< Position of ATREADYS field.                                          */
  #define ETR_ITATBCTR2_ATREADYS_Msk (0x1UL << ETR_ITATBCTR2_ATREADYS_Pos) /*!< Bit mask of ATREADYS field.                    */

/* AFVALIDS @Bit 1 : Set the value of AFVALIDS output */
  #define ETR_ITATBCTR2_AFVALIDS_Pos (1UL)           /*!< Position of AFVALIDS field.                                          */
  #define ETR_ITATBCTR2_AFVALIDS_Msk (0x1UL << ETR_ITATBCTR2_AFVALIDS_Pos) /*!< Bit mask of AFVALIDS field.                    */

/* SYNCREQS @Bit 2 : Set the value of SYNCREQS output */
  #define ETR_ITATBCTR2_SYNCREQS_Pos (2UL)           /*!< Position of SYNCREQS field.                                          */
  #define ETR_ITATBCTR2_SYNCREQS_Msk (0x1UL << ETR_ITATBCTR2_SYNCREQS_Pos) /*!< Bit mask of SYNCREQS field.                    */


/* ETR_ITATBCTR1: Integration Test ATB Control 1 Register */
  #define ETR_ITATBCTR1_ResetValue (0x00000000UL)    /*!< Reset value of ITATBCTR1 register.                                   */

/* ATIDS @Bits 0..6 : Read the value of ATIDS input to TMC */
  #define ETR_ITATBCTR1_ATIDS_Pos (0UL)              /*!< Position of ATIDS field.                                             */
  #define ETR_ITATBCTR1_ATIDS_Msk (0x7FUL << ETR_ITATBCTR1_ATIDS_Pos) /*!< Bit mask of ATIDS field.                            */


/* ETR_ITATBCTR0: Integration Test ATB Control 0 Register */
  #define ETR_ITATBCTR0_ResetValue (0x00000000UL)    /*!< Reset value of ITATBCTR0 register.                                   */

/* ATVALIDS @Bit 0 : Read the value of ATVALIDS input to TMC */
  #define ETR_ITATBCTR0_ATVALIDS_Pos (0UL)           /*!< Position of ATVALIDS field.                                          */
  #define ETR_ITATBCTR0_ATVALIDS_Msk (0x1UL << ETR_ITATBCTR0_ATVALIDS_Pos) /*!< Bit mask of ATVALIDS field.                    */

/* AFREADYS @Bit 1 : Read the value of AFREADYS input to TMC */
  #define ETR_ITATBCTR0_AFREADYS_Pos (1UL)           /*!< Position of AFREADYS field.                                          */
  #define ETR_ITATBCTR0_AFREADYS_Msk (0x1UL << ETR_ITATBCTR0_AFREADYS_Pos) /*!< Bit mask of AFREADYS field.                    */

/* ATBYTESS @Bits 8..9 : Read the value of ATBYTESS input to TMC */
  #define ETR_ITATBCTR0_ATBYTESS_Pos (8UL)           /*!< Position of ATBYTESS field.                                          */
  #define ETR_ITATBCTR0_ATBYTESS_Msk (0x3UL << ETR_ITATBCTR0_ATBYTESS_Pos) /*!< Bit mask of ATBYTESS field.                    */


/* ETR_ITCTRL: Integration Mode Control Register */
  #define ETR_ITCTRL_ResetValue (0x00000000UL)       /*!< Reset value of ITCTRL register.                                      */

/* INTEGRATION_MODE @Bit 0 : Allows the component to switch from functional mode to integration mode or back. */
  #define ETR_ITCTRL_INTEGRATION_MODE_Pos (0UL)      /*!< Position of INTEGRATION_MODE field.                                  */
  #define ETR_ITCTRL_INTEGRATION_MODE_Msk (0x1UL << ETR_ITCTRL_INTEGRATION_MODE_Pos) /*!< Bit mask of INTEGRATION_MODE field.  */


/* ETR_CLAIMSET: Claim Tag Set Register */
  #define ETR_CLAIMSET_ResetValue (0x0000000FUL)     /*!< Reset value of CLAIMSET register.                                    */

/* CLAIMSET @Bits 0..3 : This claim tag bit is implemented */
  #define ETR_CLAIMSET_CLAIMSET_Pos (0UL)            /*!< Position of CLAIMSET field.                                          */
  #define ETR_CLAIMSET_CLAIMSET_Msk (0xFUL << ETR_CLAIMSET_CLAIMSET_Pos) /*!< Bit mask of CLAIMSET field.                      */


/* ETR_CLAIMCLR: Claim Tag Clear Register */
  #define ETR_CLAIMCLR_ResetValue (0x00000000UL)     /*!< Reset value of CLAIMCLR register.                                    */

/* CLAIMCLR @Bits 0..3 : The value present reflects the current setting of the Claim Tag. */
  #define ETR_CLAIMCLR_CLAIMCLR_Pos (0UL)            /*!< Position of CLAIMCLR field.                                          */
  #define ETR_CLAIMCLR_CLAIMCLR_Msk (0xFUL << ETR_CLAIMCLR_CLAIMCLR_Pos) /*!< Bit mask of CLAIMCLR field.                      */


/* ETR_LAR: Lock Access Register */
  #define ETR_LAR_ResetValue (0x00000000UL)          /*!< Reset value of LAR register.                                         */

/* ACCESS_W @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. A write of any value other than
                          0xC5ACCE55 will have the affect of removing write access. */

  #define ETR_LAR_ACCESS_W_Pos (0UL)                 /*!< Position of ACCESS_W field.                                          */
  #define ETR_LAR_ACCESS_W_Msk (0xFFFFFFFFUL << ETR_LAR_ACCESS_W_Pos) /*!< Bit mask of ACCESS_W field.                         */


/* ETR_LSR: Lock Status Register */
  #define ETR_LSR_ResetValue (0x00000003UL)          /*!< Reset value of LSR register.                                         */

/* LOCKEXIST @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define ETR_LSR_LOCKEXIST_Pos (0UL)                /*!< Position of LOCKEXIST field.                                         */
  #define ETR_LSR_LOCKEXIST_Msk (0x1UL << ETR_LSR_LOCKEXIST_Pos) /*!< Bit mask of LOCKEXIST field.                             */

/* LOCKGRANT @Bit 1 : Returns the current status of the Lock. */
  #define ETR_LSR_LOCKGRANT_Pos (1UL)                /*!< Position of LOCKGRANT field.                                         */
  #define ETR_LSR_LOCKGRANT_Msk (0x1UL << ETR_LSR_LOCKGRANT_Pos) /*!< Bit mask of LOCKGRANT field.                             */

/* LOCKTYPE @Bit 2 : Indicates if the Lock Access Register (0xFB0) is implemented as 8-bit or 32-bit */
  #define ETR_LSR_LOCKTYPE_Pos (2UL)                 /*!< Position of LOCKTYPE field.                                          */
  #define ETR_LSR_LOCKTYPE_Msk (0x1UL << ETR_LSR_LOCKTYPE_Pos) /*!< Bit mask of LOCKTYPE field.                                */
  #define ETR_LSR_LOCKTYPE_Min (0x0UL)               /*!< Min enumerator value of LOCKTYPE field.                              */
  #define ETR_LSR_LOCKTYPE_Max (0x0UL)               /*!< Max enumerator value of LOCKTYPE field.                              */
  #define ETR_LSR_LOCKTYPE_32BIT (0x0UL)             /*!< This component implements a 32-bit Lock Access Register              */


/* ETR_AUTHSTATUS: Authentication Status Register */
  #define ETR_AUTHSTATUS_ResetValue (0x00000000UL)   /*!< Reset value of AUTHSTATUS register.                                  */

/* NSID @Bits 0..1 : Indicates the security level for non-secure invasive debug */
  #define ETR_AUTHSTATUS_NSID_Pos (0UL)              /*!< Position of NSID field.                                              */
  #define ETR_AUTHSTATUS_NSID_Msk (0x3UL << ETR_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                              */
  #define ETR_AUTHSTATUS_NSID_Min (0x2UL)            /*!< Min enumerator value of NSID field.                                  */
  #define ETR_AUTHSTATUS_NSID_Max (0x3UL)            /*!< Max enumerator value of NSID field.                                  */
  #define ETR_AUTHSTATUS_NSID_DISABLED (0x2UL)       /*!< Functionality disabled. This return value occurs when DBGEN is LOW.  */
  #define ETR_AUTHSTATUS_NSID_ENABLED (0x3UL)        /*!< Functionality enabled. This return value occurs when DBGEN is HIGH.  */

/* NSNID @Bits 2..3 : Indicates the security level for non-secure non-invasive debug */
  #define ETR_AUTHSTATUS_NSNID_Pos (2UL)             /*!< Position of NSNID field.                                             */
  #define ETR_AUTHSTATUS_NSNID_Msk (0x3UL << ETR_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                           */
  #define ETR_AUTHSTATUS_NSNID_Min (0x0UL)           /*!< Min enumerator value of NSNID field.                                 */
  #define ETR_AUTHSTATUS_NSNID_Max (0x0UL)           /*!< Max enumerator value of NSNID field.                                 */
  #define ETR_AUTHSTATUS_NSNID_NONE (0x0UL)          /*!< Functionality not implemented or controlled elsewhere.               */

/* SID @Bits 4..5 : Indicates the security level for secure invasive debug */
  #define ETR_AUTHSTATUS_SID_Pos (4UL)               /*!< Position of SID field.                                               */
  #define ETR_AUTHSTATUS_SID_Msk (0x3UL << ETR_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                                 */
  #define ETR_AUTHSTATUS_SID_Min (0x2UL)             /*!< Min enumerator value of SID field.                                   */
  #define ETR_AUTHSTATUS_SID_Max (0x3UL)             /*!< Max enumerator value of SID field.                                   */
  #define ETR_AUTHSTATUS_SID_DISABLED (0x2UL)        /*!< Functionality disabled. This return value occurs when DBGEN is LOW or
                                                          SPIDEN is LOW.*/
  #define ETR_AUTHSTATUS_SID_ENABLED (0x3UL)         /*!< Functionality enabled. This return value occurs when DBGEN and SPIDEN
                                                          are HIGH.*/

