adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SNID @Bits 6..7 : Indicates the security level for secure non-invasive debug */
  #define ETR_AUTHSTATUS_SNID_Pos (6UL)              /*!< Position of SNID field.                                              */
  #define ETR_AUTHSTATUS_SNID_Msk (0x3UL << ETR_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                              */
  #define ETR_AUTHSTATUS_SNID_Min (0x0UL)            /*!< Min enumerator value of SNID field.                                  */
  #define ETR_AUTHSTATUS_SNID_Max (0x0UL)            /*!< Max enumerator value of SNID field.                                  */
  #define ETR_AUTHSTATUS_SNID_NONE (0x0UL)           /*!< Functionality not implemented or controlled elsewhere.               */


/* ETR_DEVID: Device Configuration Register */
  #define ETR_DEVID_ResetValue (0x00000300UL)        /*!< Reset value of DEVID register.                                       */

/* ATBINPORTCOUNT @Bits 0..4 : This value indicates the type/number of ATB multiplexing present on the input ATB. */
  #define ETR_DEVID_ATBINPORTCOUNT_Pos (0UL)         /*!< Position of ATBINPORTCOUNT field.                                    */
  #define ETR_DEVID_ATBINPORTCOUNT_Msk (0x1FUL << ETR_DEVID_ATBINPORTCOUNT_Pos) /*!< Bit mask of ATBINPORTCOUNT field.         */

/* CLKSCHEME @Bit 5 : This value indicates the TMC RAM clocking scheme used, ie. whether the TMC RAM operates synchronously or
                      asynchronously to CLK. */

  #define ETR_DEVID_CLKSCHEME_Pos (5UL)              /*!< Position of CLKSCHEME field.                                         */
  #define ETR_DEVID_CLKSCHEME_Msk (0x1UL << ETR_DEVID_CLKSCHEME_Pos) /*!< Bit mask of CLKSCHEME field.                         */
  #define ETR_DEVID_CLKSCHEME_Min (0x0UL)            /*!< Min enumerator value of CLKSCHEME field.                             */
  #define ETR_DEVID_CLKSCHEME_Max (0x0UL)            /*!< Max enumerator value of CLKSCHEME field.                             */
  #define ETR_DEVID_CLKSCHEME_SYNC (0x0UL)           /*!< The TMC RAM operates synchronously to CLK.                           */

/* CONFIGTYPE @Bits 6..7 : This value indicates TMC configuration type. */
  #define ETR_DEVID_CONFIGTYPE_Pos (6UL)             /*!< Position of CONFIGTYPE field.                                        */
  #define ETR_DEVID_CONFIGTYPE_Msk (0x3UL << ETR_DEVID_CONFIGTYPE_Pos) /*!< Bit mask of CONFIGTYPE field.                      */
  #define ETR_DEVID_CONFIGTYPE_Min (0x0UL)           /*!< Min enumerator value of CONFIGTYPE field.                            */
  #define ETR_DEVID_CONFIGTYPE_Max (0x2UL)           /*!< Max enumerator value of CONFIGTYPE field.                            */
  #define ETR_DEVID_CONFIGTYPE_ETB (0x0UL)           /*!< (unspecified)                                                        */
  #define ETR_DEVID_CONFIGTYPE_ETR (0x1UL)           /*!< (unspecified)                                                        */
  #define ETR_DEVID_CONFIGTYPE_ETF (0x2UL)           /*!< (unspecified)                                                        */

/* MEMWIDTH @Bits 8..10 : This value indicates the width of the Memory interface databus. */
  #define ETR_DEVID_MEMWIDTH_Pos (8UL)               /*!< Position of MEMWIDTH field.                                          */
  #define ETR_DEVID_MEMWIDTH_Msk (0x7UL << ETR_DEVID_MEMWIDTH_Pos) /*!< Bit mask of MEMWIDTH field.                            */
  #define ETR_DEVID_MEMWIDTH_Min (0x2UL)             /*!< Min enumerator value of MEMWIDTH field.                              */
  #define ETR_DEVID_MEMWIDTH_Max (0x5UL)             /*!< Max enumerator value of MEMWIDTH field.                              */
  #define ETR_DEVID_MEMWIDTH_32BIT (0x2UL)           /*!< Memory interface databus is 32 bits wide.                            */
  #define ETR_DEVID_MEMWIDTH_64BIT (0x3UL)           /*!< Memory interface databus is 64 bits wide.                            */
  #define ETR_DEVID_MEMWIDTH_128BIT (0x4UL)          /*!< Memory interface databus is 128 bits wide.                           */
  #define ETR_DEVID_MEMWIDTH_256BIT (0x5UL)          /*!< Memory interface databus is 256 bits wide.                           */

/* WBUF_DEPTH @Bits 11..13 : This value indicates, in powers of two, the number of entries in the Write buffer. Each entry is of
                             size ATB_DATA_WIDTH. */

  #define ETR_DEVID_WBUF_DEPTH_Pos (11UL)            /*!< Position of WBUF_DEPTH field.                                        */
  #define ETR_DEVID_WBUF_DEPTH_Msk (0x7UL << ETR_DEVID_WBUF_DEPTH_Pos) /*!< Bit mask of WBUF_DEPTH field.                      */
  #define ETR_DEVID_WBUF_DEPTH_Min (0x2UL)           /*!< Min enumerator value of WBUF_DEPTH field.                            */
  #define ETR_DEVID_WBUF_DEPTH_Max (0x5UL)           /*!< Max enumerator value of WBUF_DEPTH field.                            */
  #define ETR_DEVID_WBUF_DEPTH_4ENTRIES (0x2UL)      /*!< Depth of the Write buffer is 4 entries.                              */
  #define ETR_DEVID_WBUF_DEPTH_8ENTRIES (0x3UL)      /*!< Depth of the Write buffer is 8 entries.                              */
  #define ETR_DEVID_WBUF_DEPTH_16ENTRIES (0x4UL)     /*!< Depth of the Write buffer is 16 entries.                             */
  #define ETR_DEVID_WBUF_DEPTH_32ENTRIES (0x5UL)     /*!< Depth of the Write buffer is 32 entries.                             */


/* ETR_DEVTYPE: Device Type Identifier Register */
  #define ETR_DEVTYPE_ResetValue (0x00000021UL)      /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR_TYPE @Bits 0..3 : Major classification grouping for this debug/trace component */
  #define ETR_DEVTYPE_MAJOR_TYPE_Pos (0UL)           /*!< Position of MAJOR_TYPE field.                                        */
  #define ETR_DEVTYPE_MAJOR_TYPE_Msk (0xFUL << ETR_DEVTYPE_MAJOR_TYPE_Pos) /*!< Bit mask of MAJOR_TYPE field.                  */
  #define ETR_DEVTYPE_MAJOR_TYPE_Min (0x1UL)         /*!< Min enumerator value of MAJOR_TYPE field.                            */
  #define ETR_DEVTYPE_MAJOR_TYPE_Max (0x1UL)         /*!< Max enumerator value of MAJOR_TYPE field.                            */
  #define ETR_DEVTYPE_MAJOR_TYPE_SINK (0x1UL)        /*!< This component is a trace sink.                                      */

/* SUB_TYPE @Bits 4..7 : Sub-classification within the major category */
  #define ETR_DEVTYPE_SUB_TYPE_Pos (4UL)             /*!< Position of SUB_TYPE field.                                          */
  #define ETR_DEVTYPE_SUB_TYPE_Msk (0xFUL << ETR_DEVTYPE_SUB_TYPE_Pos) /*!< Bit mask of SUB_TYPE field.                        */
  #define ETR_DEVTYPE_SUB_TYPE_Min (0x2UL)           /*!< Min enumerator value of SUB_TYPE field.                              */
  #define ETR_DEVTYPE_SUB_TYPE_Max (0x2UL)           /*!< Max enumerator value of SUB_TYPE field.                              */
  #define ETR_DEVTYPE_SUB_TYPE (0x2UL)               /*!< This component captures the trace data into RAM that can be drained
                                                          through APB.*/


/* ETR_PERIPHID4: Peripheral ID4 Register */
  #define ETR_PERIPHID4_ResetValue (0x00000004UL)    /*!< Reset value of PERIPHID4 register.                                   */

/* JEP106_CONT @Bits 0..3 : JEDEC continuation code indicating the designer of the component (along with the identity code) */
  #define ETR_PERIPHID4_JEP106_CONT_Pos (0UL)        /*!< Position of JEP106_CONT field.                                       */
  #define ETR_PERIPHID4_JEP106_CONT_Msk (0xFUL << ETR_PERIPHID4_JEP106_CONT_Pos) /*!< Bit mask of JEP106_CONT field.           */

/* FOURKB_COUNT @Bits 4..7 : This is a 4-bit value that indicates the total contiguous size of the memory window used by this
                             component in powers of 2 from the standard 4KB. If a component only requires the standard 4KB then
                             this should read as 0x0, 4KB only, for 8KB set to 0x1, 16KB == 0x2, 32KB == 0x3, and so on. */

