adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define ETR_COMPID1_CLASS_Pos (4UL)                /*!< Position of CLASS field.                                             */
  #define ETR_COMPID1_CLASS_Msk (0xFUL << ETR_COMPID1_CLASS_Pos) /*!< Bit mask of CLASS field.                                 */


/* ETR_COMPID2: Component ID2 Register */
  #define ETR_COMPID2_ResetValue (0x00000005UL)      /*!< Reset value of COMPID2 register.                                     */

/* PREAMBLE @Bits 0..7 : Contains bits [23:16] of the component identification */
  #define ETR_COMPID2_PREAMBLE_Pos (0UL)             /*!< Position of PREAMBLE field.                                          */
  #define ETR_COMPID2_PREAMBLE_Msk (0xFFUL << ETR_COMPID2_PREAMBLE_Pos) /*!< Bit mask of PREAMBLE field.                       */


/* ETR_COMPID3: Component ID3 Register */
  #define ETR_COMPID3_ResetValue (0x000000B1UL)      /*!< Reset value of COMPID3 register.                                     */

/* PREAMBLE @Bits 0..7 : Contains bits [31:24] of the component identification */
  #define ETR_COMPID3_PREAMBLE_Pos (0UL)             /*!< Position of PREAMBLE field.                                          */
  #define ETR_COMPID3_PREAMBLE_Msk (0xFFUL << ETR_COMPID3_PREAMBLE_Pos) /*!< Bit mask of PREAMBLE field.                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           EXMEE                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct EXMEE_PAGE_UNENCRYPTED ============================================== */
/**
  * @brief UNENCRYPTED [EXMEE_PAGE_UNENCRYPTED] Unencrypted memory access page. This area of memory provides an unencrypted page
            into the secure memory region.

  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start address for input memory page                   */
  __IOM uint32_t  END;                               /*!< (@ 0x00000004) End address for input memory page                     */
} NRF_EXMEE_PAGE_UNENCRYPTED_Type;                   /*!< Size = 8 (0x008)                                                     */

/* EXMEE_PAGE_UNENCRYPTED_START: Start address for input memory page */
  #define EXMEE_PAGE_UNENCRYPTED_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                           */

/* ADDRESS @Bits 0..31 : Start address of page */
  #define EXMEE_PAGE_UNENCRYPTED_START_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define EXMEE_PAGE_UNENCRYPTED_START_ADDRESS_Msk (0xFFFFFFFFUL << EXMEE_PAGE_UNENCRYPTED_START_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/


/* EXMEE_PAGE_UNENCRYPTED_END: End address for input memory page */
  #define EXMEE_PAGE_UNENCRYPTED_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                               */

/* ADDRESS @Bits 0..31 : End address of page */
  #define EXMEE_PAGE_UNENCRYPTED_END_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                         */
  #define EXMEE_PAGE_UNENCRYPTED_END_ADDRESS_Msk (0xFFFFFFFFUL << EXMEE_PAGE_UNENCRYPTED_END_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* =============================================== Struct EXMEE_PAGE_ENCRYPTED =============================================== */
/**
  * @brief ENCRYPTED [EXMEE_PAGE_ENCRYPTED] Secure memory access page. This area of memory stores the encrypted data.
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start address for output memory page                  */
  __IOM uint32_t  END;                               /*!< (@ 0x00000004) End address for output memory page                    */
} NRF_EXMEE_PAGE_ENCRYPTED_Type;                     /*!< Size = 8 (0x008)                                                     */

/* EXMEE_PAGE_ENCRYPTED_START: Start address for output memory page */
  #define EXMEE_PAGE_ENCRYPTED_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                             */

/* ADDRESS @Bits 0..31 : Start address of page */
  #define EXMEE_PAGE_ENCRYPTED_START_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                         */
  #define EXMEE_PAGE_ENCRYPTED_START_ADDRESS_Msk (0xFFFFFFFFUL << EXMEE_PAGE_ENCRYPTED_START_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/


/* EXMEE_PAGE_ENCRYPTED_END: End address for output memory page */
  #define EXMEE_PAGE_ENCRYPTED_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                 */

/* ADDRESS @Bits 0..31 : End address of page */
  #define EXMEE_PAGE_ENCRYPTED_END_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                           */
  #define EXMEE_PAGE_ENCRYPTED_END_ADDRESS_Msk (0xFFFFFFFFUL << EXMEE_PAGE_ENCRYPTED_END_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/



/* ==================================================== Struct EXMEE_PAGE ==================================================== */
/**
  * @brief PAGE [EXMEE_PAGE] Memory pages the EXMEE works on
  */
typedef struct {
  __IOM NRF_EXMEE_PAGE_UNENCRYPTED_Type UNENCRYPTED; /*!< (@ 0x00000000) Unencrypted memory access page. This area of memory
                                                                         provides an unencrypted page into the secure memory
                                                                         region.*/
  __IOM NRF_EXMEE_PAGE_ENCRYPTED_Type ENCRYPTED;     /*!< (@ 0x00000008) Secure memory access page. This area of memory stores
                                                                         the encrypted data.*/
} NRF_EXMEE_PAGE_Type;                               /*!< Size = 16 (0x010)                                                    */


/* ================================================ Struct EXMEE_TRANSACTION ================================================= */
/**
  * @brief TRANSACTION [EXMEE_TRANSACTION] Information about the currently processed transaction
  */
typedef struct {
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Target address in external memory of the currently
                                                                         processed AXI transaction*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  COUNTER[2];                        /*!< (@ 0x00000008) 64 bit write counter                                  */
  __IM  uint32_t  PLAINTEXT[4];                      /*!< (@ 0x00000010) 128 bit plaintext register.                           */
  __IM  uint32_t  CIPHERTEXT[4];                     /*!< (@ 0x00000020) 128 bit ciphertext register.                          */
  __IOM uint32_t  NONCE[4];                          /*!< (@ 0x00000030) 128 bit nonce register.                               */
} NRF_EXMEE_TRANSACTION_Type;                        /*!< Size = 64 (0x040)                                                    */

/* EXMEE_TRANSACTION_ADDRESS: Target address in external memory of the currently processed AXI transaction */
  #define EXMEE_TRANSACTION_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                            */

