adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ADDRESS @Bit 0 : Address in EXMIF */
  #define EXMEE_TRANSACTION_ADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                          */
  #define EXMEE_TRANSACTION_ADDRESS_ADDRESS_Msk (0x1UL << EXMEE_TRANSACTION_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* EXMEE_TRANSACTION_COUNTER: 64 bit write counter */
  #define EXMEE_TRANSACTION_COUNTER_MaxCount (2UL)   /*!< Max size of COUNTER[2] array.                                        */
  #define EXMEE_TRANSACTION_COUNTER_MaxIndex (1UL)   /*!< Max index of COUNTER[2] array.                                       */
  #define EXMEE_TRANSACTION_COUNTER_MinIndex (0UL)   /*!< Min index of COUNTER[2] array.                                       */
  #define EXMEE_TRANSACTION_COUNTER_ResetValue (0x00000000UL) /*!< Reset value of COUNTER[2] register.                         */

/* COUNTER @Bits 0..31 : The n-th word of the 64 bit counter value */
  #define EXMEE_TRANSACTION_COUNTER_COUNTER_Pos (0UL) /*!< Position of COUNTER field.                                          */
  #define EXMEE_TRANSACTION_COUNTER_COUNTER_Msk (0xFFFFFFFFUL << EXMEE_TRANSACTION_COUNTER_COUNTER_Pos) /*!< Bit mask of COUNTER
                                                                            field.*/


/* EXMEE_TRANSACTION_PLAINTEXT: 128 bit plaintext register. */
  #define EXMEE_TRANSACTION_PLAINTEXT_MaxCount (4UL) /*!< Max size of PLAINTEXT[4] array.                                      */
  #define EXMEE_TRANSACTION_PLAINTEXT_MaxIndex (3UL) /*!< Max index of PLAINTEXT[4] array.                                     */
  #define EXMEE_TRANSACTION_PLAINTEXT_MinIndex (0UL) /*!< Min index of PLAINTEXT[4] array.                                     */
  #define EXMEE_TRANSACTION_PLAINTEXT_ResetValue (0x00000000UL) /*!< Reset value of PLAINTEXT[4] register.                     */

/* WORD @Bits 0..31 : The n-th word of the 128 bit plaintext input */
  #define EXMEE_TRANSACTION_PLAINTEXT_WORD_Pos (0UL) /*!< Position of WORD field.                                              */
  #define EXMEE_TRANSACTION_PLAINTEXT_WORD_Msk (0xFFFFFFFFUL << EXMEE_TRANSACTION_PLAINTEXT_WORD_Pos) /*!< Bit mask of WORD
                                                                            field.*/


/* EXMEE_TRANSACTION_CIPHERTEXT: 128 bit ciphertext register. */
  #define EXMEE_TRANSACTION_CIPHERTEXT_MaxCount (4UL) /*!< Max size of CIPHERTEXT[4] array.                                    */
  #define EXMEE_TRANSACTION_CIPHERTEXT_MaxIndex (3UL) /*!< Max index of CIPHERTEXT[4] array.                                   */
  #define EXMEE_TRANSACTION_CIPHERTEXT_MinIndex (0UL) /*!< Min index of CIPHERTEXT[4] array.                                   */
  #define EXMEE_TRANSACTION_CIPHERTEXT_ResetValue (0x00000000UL) /*!< Reset value of CIPHERTEXT[4] register.                   */

/* WORD @Bits 0..31 : The n-th word of the 128 bit ciphertext input */
  #define EXMEE_TRANSACTION_CIPHERTEXT_WORD_Pos (0UL) /*!< Position of WORD field.                                             */
  #define EXMEE_TRANSACTION_CIPHERTEXT_WORD_Msk (0xFFFFFFFFUL << EXMEE_TRANSACTION_CIPHERTEXT_WORD_Pos) /*!< Bit mask of WORD
                                                                            field.*/


/* EXMEE_TRANSACTION_NONCE: 128 bit nonce register. */
  #define EXMEE_TRANSACTION_NONCE_MaxCount (4UL)     /*!< Max size of NONCE[4] array.                                          */
  #define EXMEE_TRANSACTION_NONCE_MaxIndex (3UL)     /*!< Max index of NONCE[4] array.                                         */
  #define EXMEE_TRANSACTION_NONCE_MinIndex (0UL)     /*!< Min index of NONCE[4] array.                                         */
  #define EXMEE_TRANSACTION_NONCE_ResetValue (0x00000000UL) /*!< Reset value of NONCE[4] register.                             */

/* WORD @Bits 0..31 : The n-th word of the 128 bit nonce input */
  #define EXMEE_TRANSACTION_NONCE_WORD_Pos (0UL)     /*!< Position of WORD field.                                              */
  #define EXMEE_TRANSACTION_NONCE_WORD_Msk (0xFFFFFFFFUL << EXMEE_TRANSACTION_NONCE_WORD_Pos) /*!< Bit mask of WORD field.     */



/* =================================================== Struct EXMEE_REGION =================================================== */
/**
  * @brief REGION [EXMEE_REGION] Encryption region n
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start offset relative to memory window for encryption
                                                                         region n*/
  __IOM uint32_t  END;                               /*!< (@ 0x00000004) End offset relative to memory window for encryption
                                                                         region n*/
  __IOM uint32_t  COUNTER;                           /*!< (@ 0x00000008) Address offset where the write counters for encryption
                                                                         region n should be stored*/
  __IOM uint32_t  NONCEMODE;                         /*!< (@ 0x0000000C) Nonce mode for encryption region n                    */
  __OM  uint32_t  KEY[4];                            /*!< (@ 0x00000010) 128b key for encryption region n                      */
} NRF_EXMEE_REGION_Type;                             /*!< Size = 32 (0x020)                                                    */
  #define EXMEE_REGION_MaxCount (16UL)               /*!< Size of REGION[16] array.                                            */
  #define EXMEE_REGION_MaxIndex (15UL)               /*!< Max index of REGION[16] array.                                       */
  #define EXMEE_REGION_MinIndex (0UL)                /*!< Min index of REGION[16] array.                                       */

/* EXMEE_REGION_START: Start offset relative to memory window for encryption region n */
  #define EXMEE_REGION_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                     */

/* OFFSET @Bits 0..31 : Start offset of encryption region */
  #define EXMEE_REGION_START_OFFSET_Pos (0UL)        /*!< Position of OFFSET field.                                            */
  #define EXMEE_REGION_START_OFFSET_Msk (0xFFFFFFFFUL << EXMEE_REGION_START_OFFSET_Pos) /*!< Bit mask of OFFSET field.         */


/* EXMEE_REGION_END: End offset relative to memory window for encryption region n */
  #define EXMEE_REGION_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                         */

/* OFFSET @Bits 0..31 : End offset of encryption region */
  #define EXMEE_REGION_END_OFFSET_Pos (0UL)          /*!< Position of OFFSET field.                                            */
  #define EXMEE_REGION_END_OFFSET_Msk (0xFFFFFFFFUL << EXMEE_REGION_END_OFFSET_Pos) /*!< Bit mask of OFFSET field.             */


