adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EXMEE_TASKS_START: Start EXMEE operations. */
  #define EXMEE_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start EXMEE operations. */
  #define EXMEE_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define EXMEE_TASKS_START_TASKS_START_Msk (0x1UL << EXMEE_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define EXMEE_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define EXMEE_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define EXMEE_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* EXMEE_TASKS_STOP: Stop EXMEE operations. */
  #define EXMEE_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop EXMEE operations. */
  #define EXMEE_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define EXMEE_TASKS_STOP_TASKS_STOP_Msk (0x1UL << EXMEE_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define EXMEE_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define EXMEE_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define EXMEE_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* EXMEE_TASKS_RESET: Reset the EXMEE and its registers. Reset the FSM to default values. */
  #define EXMEE_TASKS_RESET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESET register.                                */

/* TASKS_RESET @Bit 0 : Reset the EXMEE and its registers. Reset the FSM to default values. */
  #define EXMEE_TASKS_RESET_TASKS_RESET_Pos (0UL)    /*!< Position of TASKS_RESET field.                                       */
  #define EXMEE_TASKS_RESET_TASKS_RESET_Msk (0x1UL << EXMEE_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field.   */
  #define EXMEE_TASKS_RESET_TASKS_RESET_Min (0x1UL)  /*!< Min enumerator value of TASKS_RESET field.                           */
  #define EXMEE_TASKS_RESET_TASKS_RESET_Max (0x1UL)  /*!< Max enumerator value of TASKS_RESET field.                           */
  #define EXMEE_TASKS_RESET_TASKS_RESET_Trigger (0x1UL) /*!< Trigger task                                                      */


/* EXMEE_TASKS_COMMIT: Pad data buffer and commit to memory. */
  #define EXMEE_TASKS_COMMIT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_COMMIT register.                              */

/* TASKS_COMMIT @Bit 0 : Pad data buffer and commit to memory. */
  #define EXMEE_TASKS_COMMIT_TASKS_COMMIT_Pos (0UL)  /*!< Position of TASKS_COMMIT field.                                      */
  #define EXMEE_TASKS_COMMIT_TASKS_COMMIT_Msk (0x1UL << EXMEE_TASKS_COMMIT_TASKS_COMMIT_Pos) /*!< Bit mask of TASKS_COMMIT
                                                                            field.*/
  #define EXMEE_TASKS_COMMIT_TASKS_COMMIT_Min (0x1UL) /*!< Min enumerator value of TASKS_COMMIT field.                         */
  #define EXMEE_TASKS_COMMIT_TASKS_COMMIT_Max (0x1UL) /*!< Max enumerator value of TASKS_COMMIT field.                         */
  #define EXMEE_TASKS_COMMIT_TASKS_COMMIT_Trigger (0x1UL) /*!< Trigger task                                                    */


/* EXMEE_SUBSCRIBE_START: Subscribe configuration for task START */
  #define EXMEE_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define EXMEE_SUBSCRIBE_START_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define EXMEE_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << EXMEE_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define EXMEE_SUBSCRIBE_START_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define EXMEE_SUBSCRIBE_START_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_SUBSCRIBE_START_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define EXMEE_SUBSCRIBE_START_EN_Msk (0x1UL << EXMEE_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                      */
  #define EXMEE_SUBSCRIBE_START_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_SUBSCRIBE_START_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_SUBSCRIBE_START_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define EXMEE_SUBSCRIBE_START_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* EXMEE_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define EXMEE_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define EXMEE_SUBSCRIBE_STOP_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define EXMEE_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << EXMEE_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define EXMEE_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define EXMEE_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_SUBSCRIBE_STOP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define EXMEE_SUBSCRIBE_STOP_EN_Msk (0x1UL << EXMEE_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define EXMEE_SUBSCRIBE_STOP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_SUBSCRIBE_STOP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_SUBSCRIBE_STOP_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define EXMEE_SUBSCRIBE_STOP_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* EXMEE_SUBSCRIBE_RESET: Subscribe configuration for task RESET */
  #define EXMEE_SUBSCRIBE_RESET_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RESET register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task RESET will subscribe to */
  #define EXMEE_SUBSCRIBE_RESET_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define EXMEE_SUBSCRIBE_RESET_CHIDX_Msk (0xFFUL << EXMEE_SUBSCRIBE_RESET_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define EXMEE_SUBSCRIBE_RESET_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define EXMEE_SUBSCRIBE_RESET_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_SUBSCRIBE_RESET_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define EXMEE_SUBSCRIBE_RESET_EN_Msk (0x1UL << EXMEE_SUBSCRIBE_RESET_EN_Pos) /*!< Bit mask of EN field.                      */
  #define EXMEE_SUBSCRIBE_RESET_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_SUBSCRIBE_RESET_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_SUBSCRIBE_RESET_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define EXMEE_SUBSCRIBE_RESET_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* EXMEE_SUBSCRIBE_COMMIT: Subscribe configuration for task COMMIT */
  #define EXMEE_SUBSCRIBE_COMMIT_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_COMMIT register.                      */

