adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task COMMIT will subscribe to */
  #define EXMEE_SUBSCRIBE_COMMIT_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define EXMEE_SUBSCRIBE_COMMIT_CHIDX_Msk (0xFFUL << EXMEE_SUBSCRIBE_COMMIT_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define EXMEE_SUBSCRIBE_COMMIT_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define EXMEE_SUBSCRIBE_COMMIT_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_SUBSCRIBE_COMMIT_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define EXMEE_SUBSCRIBE_COMMIT_EN_Msk (0x1UL << EXMEE_SUBSCRIBE_COMMIT_EN_Pos) /*!< Bit mask of EN field.                    */
  #define EXMEE_SUBSCRIBE_COMMIT_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_SUBSCRIBE_COMMIT_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_SUBSCRIBE_COMMIT_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define EXMEE_SUBSCRIBE_COMMIT_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* EXMEE_EVENTS_STOPPED: (unspecified) */
  #define EXMEE_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                          */

/* EVENTS_STOPPED @Bit 0 : (unspecified) */
  #define EXMEE_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                 */
  #define EXMEE_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << EXMEE_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define EXMEE_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                   */
  #define EXMEE_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                   */
  #define EXMEE_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define EXMEE_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                           */


/* EXMEE_EVENTS_READACCESS: The read access event fires when a read access to the decrypted memory window is received */
  #define EXMEE_EVENTS_READACCESS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READACCESS register.                    */

/* EVENTS_READACCESS @Bit 0 : The read access event fires when a read access to the decrypted memory window is received */
  #define EXMEE_EVENTS_READACCESS_EVENTS_READACCESS_Pos (0UL) /*!< Position of EVENTS_READACCESS field.                        */
  #define EXMEE_EVENTS_READACCESS_EVENTS_READACCESS_Msk (0x1UL << EXMEE_EVENTS_READACCESS_EVENTS_READACCESS_Pos) /*!< Bit mask
                                                                            of EVENTS_READACCESS field.*/
  #define EXMEE_EVENTS_READACCESS_EVENTS_READACCESS_Min (0x0UL) /*!< Min enumerator value of EVENTS_READACCESS field.          */
  #define EXMEE_EVENTS_READACCESS_EVENTS_READACCESS_Max (0x1UL) /*!< Max enumerator value of EVENTS_READACCESS field.          */
  #define EXMEE_EVENTS_READACCESS_EVENTS_READACCESS_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define EXMEE_EVENTS_READACCESS_EVENTS_READACCESS_Generated (0x1UL) /*!< Event generated                                     */


/* EXMEE_EVENTS_WRITEACCESS: The write access event fires when a write access to the decrypted memory window is received */
  #define EXMEE_EVENTS_WRITEACCESS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WRITEACCESS register.                  */

/* EVENTS_WRITEACCESS @Bit 0 : The write access event fires when a write access to the decrypted memory window is received */
  #define EXMEE_EVENTS_WRITEACCESS_EVENTS_WRITEACCESS_Pos (0UL) /*!< Position of EVENTS_WRITEACCESS field.                     */
  #define EXMEE_EVENTS_WRITEACCESS_EVENTS_WRITEACCESS_Msk (0x1UL << EXMEE_EVENTS_WRITEACCESS_EVENTS_WRITEACCESS_Pos) /*!< Bit
                                                                            mask of EVENTS_WRITEACCESS field.*/
  #define EXMEE_EVENTS_WRITEACCESS_EVENTS_WRITEACCESS_Min (0x0UL) /*!< Min enumerator value of EVENTS_WRITEACCESS field.       */
  #define EXMEE_EVENTS_WRITEACCESS_EVENTS_WRITEACCESS_Max (0x1UL) /*!< Max enumerator value of EVENTS_WRITEACCESS field.       */
  #define EXMEE_EVENTS_WRITEACCESS_EVENTS_WRITEACCESS_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define EXMEE_EVENTS_WRITEACCESS_EVENTS_WRITEACCESS_Generated (0x1UL) /*!< Event generated                                   */


/* EXMEE_EVENTS_INVALIDKEYREGION: The invalid key region event fires if the address of the AXI transaction does not correspond
                                   with any of the regions there is keys for in the key register */

  #define EXMEE_EVENTS_INVALIDKEYREGION_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_INVALIDKEYREGION register.        */

/* EVENTS_INVALIDKEYREGION @Bit 0 : The invalid key region event fires if the address of the AXI transaction does not correspond
                                    with any of the regions there is keys for in the key register */

  #define EXMEE_EVENTS_INVALIDKEYREGION_EVENTS_INVALIDKEYREGION_Pos (0UL) /*!< Position of EVENTS_INVALIDKEYREGION field.      */
  #define EXMEE_EVENTS_INVALIDKEYREGION_EVENTS_INVALIDKEYREGION_Msk (0x1UL << EXMEE_EVENTS_INVALIDKEYREGION_EVENTS_INVALIDKEYREGION_Pos)
                                                                            /*!< Bit mask of EVENTS_INVALIDKEYREGION field.*/
  #define EXMEE_EVENTS_INVALIDKEYREGION_EVENTS_INVALIDKEYREGION_Min (0x0UL) /*!< Min enumerator value of EVENTS_INVALIDKEYREGION
                                                                            field.*/
  #define EXMEE_EVENTS_INVALIDKEYREGION_EVENTS_INVALIDKEYREGION_Max (0x1UL) /*!< Max enumerator value of EVENTS_INVALIDKEYREGION
                                                                            field.*/
  #define EXMEE_EVENTS_INVALIDKEYREGION_EVENTS_INVALIDKEYREGION_NotGenerated (0x0UL) /*!< Event not generated                  */
  #define EXMEE_EVENTS_INVALIDKEYREGION_EVENTS_INVALIDKEYREGION_Generated (0x1UL) /*!< Event generated                         */


/* EXMEE_EVENTS_INCREMENTCOUNTER: The increment counter event fires when the counter needs to be incremented. Typically when an
                                   encryption operation has completed, before the next encryption operation can start */

