adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define EXMEE_EVENTS_INCREMENTCOUNTER_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_INCREMENTCOUNTER register.        */

/* EVENTS_INCREMENTCOUNTER @Bit 0 : The increment counter event fires when the counter needs to be incremented. Typically when
                                    an encryption operation has completed, before the next encryption operation can start */

  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Pos (0UL) /*!< Position of EVENTS_INCREMENTCOUNTER field.      */
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Msk (0x1UL << EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Pos)
                                                                            /*!< Bit mask of EVENTS_INCREMENTCOUNTER field.*/
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Min (0x0UL) /*!< Min enumerator value of EVENTS_INCREMENTCOUNTER
                                                                            field.*/
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Max (0x1UL) /*!< Max enumerator value of EVENTS_INCREMENTCOUNTER
                                                                            field.*/
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_NotGenerated (0x0UL) /*!< Event not generated                  */
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Generated (0x1UL) /*!< Event generated                         */


/* EXMEE_EVENTS_DATARECEIVED: The data received event fires when an AXI operation happens on the slave port, and the data
                               received is the first data in a new 512b chunk */

  #define EXMEE_EVENTS_DATARECEIVED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DATARECEIVED register.                */

/* EVENTS_DATARECEIVED @Bit 0 : The data received event fires when an AXI operation happens on the slave port, and the data
                                received is the first data in a new 512b chunk */

  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Pos (0UL) /*!< Position of EVENTS_DATARECEIVED field.                  */
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Msk (0x1UL << EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Pos) /*!<
                                                                            Bit mask of EVENTS_DATARECEIVED field.*/
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Min (0x0UL) /*!< Min enumerator value of EVENTS_DATARECEIVED field.    */
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Max (0x1UL) /*!< Max enumerator value of EVENTS_DATARECEIVED field.    */
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Generated (0x1UL) /*!< Event generated                                 */


/* EXMEE_EVENTS_CIPHERTEXTREADY: The ciphertext ready event fires when the data is encrypted and the ciphertext is ready in the
                                  CIPHERTEXT register */

  #define EXMEE_EVENTS_CIPHERTEXTREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CIPHERTEXTREADY register.          */

/* EVENTS_CIPHERTEXTREADY @Bit 0 : The ciphertext ready event fires when the data is encrypted and the ciphertext is ready in
                                   the CIPHERTEXT register */

  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Pos (0UL) /*!< Position of EVENTS_CIPHERTEXTREADY field.         */
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Msk (0x1UL << EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Pos)
                                                                            /*!< Bit mask of EVENTS_CIPHERTEXTREADY field.*/
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_CIPHERTEXTREADY
                                                                            field.*/
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_CIPHERTEXTREADY
                                                                            field.*/
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_NotGenerated (0x0UL) /*!< Event not generated                    */
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Generated (0x1UL) /*!< Event generated                           */


/* EXMEE_EVENTS_NONCEREADY: The nonce ready event fires when the nonce is ready in the NONCE register */
  #define EXMEE_EVENTS_NONCEREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_NONCEREADY register.                    */

/* EVENTS_NONCEREADY @Bit 0 : The nonce ready event fires when the nonce is ready in the NONCE register */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Pos (0UL) /*!< Position of EVENTS_NONCEREADY field.                        */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Msk (0x1UL << EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Pos) /*!< Bit mask
                                                                            of EVENTS_NONCEREADY field.*/
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_NONCEREADY field.          */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_NONCEREADY field.          */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Generated (0x1UL) /*!< Event generated                                     */


/* EXMEE_EVENTS_WRITECOMPLETE: The write complete event fires when the ciphertext and counter has been written to the external
                                memory */

  #define EXMEE_EVENTS_WRITECOMPLETE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WRITECOMPLETE register.              */

/* EVENTS_WRITECOMPLETE @Bit 0 : The write complete event fires when the ciphertext and counter has been written to the external
                                 memory */

  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Pos (0UL) /*!< Position of EVENTS_WRITECOMPLETE field.               */
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Msk (0x1UL << EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Pos)
                                                                            /*!< Bit mask of EVENTS_WRITECOMPLETE field.*/
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Min (0x0UL) /*!< Min enumerator value of EVENTS_WRITECOMPLETE field. */
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Max (0x1UL) /*!< Max enumerator value of EVENTS_WRITECOMPLETE field. */
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Generated (0x1UL) /*!< Event generated                               */


/* EXMEE_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define EXMEE_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define EXMEE_PUBLISH_STOPPED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define EXMEE_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define EXMEE_PUBLISH_STOPPED_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define EXMEE_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_STOPPED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define EXMEE_PUBLISH_STOPPED_EN_Msk (0x1UL << EXMEE_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define EXMEE_PUBLISH_STOPPED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_STOPPED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_STOPPED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define EXMEE_PUBLISH_STOPPED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


