adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* INVALIDKEYREGION @Bit 3 : Write '1' to disable interrupt for event INVALIDKEYREGION */
  #define EXMEE_INTENCLR_INVALIDKEYREGION_Pos (3UL)  /*!< Position of INVALIDKEYREGION field.                                  */
  #define EXMEE_INTENCLR_INVALIDKEYREGION_Msk (0x1UL << EXMEE_INTENCLR_INVALIDKEYREGION_Pos) /*!< Bit mask of INVALIDKEYREGION
                                                                            field.*/
  #define EXMEE_INTENCLR_INVALIDKEYREGION_Min (0x0UL) /*!< Min enumerator value of INVALIDKEYREGION field.                     */
  #define EXMEE_INTENCLR_INVALIDKEYREGION_Max (0x1UL) /*!< Max enumerator value of INVALIDKEYREGION field.                     */
  #define EXMEE_INTENCLR_INVALIDKEYREGION_Clear (0x1UL) /*!< Disable                                                           */
  #define EXMEE_INTENCLR_INVALIDKEYREGION_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define EXMEE_INTENCLR_INVALIDKEYREGION_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* INCREMENTCOUNTER @Bit 4 : Write '1' to disable interrupt for event INCREMENTCOUNTER */
  #define EXMEE_INTENCLR_INCREMENTCOUNTER_Pos (4UL)  /*!< Position of INCREMENTCOUNTER field.                                  */
  #define EXMEE_INTENCLR_INCREMENTCOUNTER_Msk (0x1UL << EXMEE_INTENCLR_INCREMENTCOUNTER_Pos) /*!< Bit mask of INCREMENTCOUNTER
                                                                            field.*/
  #define EXMEE_INTENCLR_INCREMENTCOUNTER_Min (0x0UL) /*!< Min enumerator value of INCREMENTCOUNTER field.                     */
  #define EXMEE_INTENCLR_INCREMENTCOUNTER_Max (0x1UL) /*!< Max enumerator value of INCREMENTCOUNTER field.                     */
  #define EXMEE_INTENCLR_INCREMENTCOUNTER_Clear (0x1UL) /*!< Disable                                                           */
  #define EXMEE_INTENCLR_INCREMENTCOUNTER_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define EXMEE_INTENCLR_INCREMENTCOUNTER_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DATARECEIVED @Bit 5 : Write '1' to disable interrupt for event DATARECEIVED */
  #define EXMEE_INTENCLR_DATARECEIVED_Pos (5UL)      /*!< Position of DATARECEIVED field.                                      */
  #define EXMEE_INTENCLR_DATARECEIVED_Msk (0x1UL << EXMEE_INTENCLR_DATARECEIVED_Pos) /*!< Bit mask of DATARECEIVED field.      */
  #define EXMEE_INTENCLR_DATARECEIVED_Min (0x0UL)    /*!< Min enumerator value of DATARECEIVED field.                          */
  #define EXMEE_INTENCLR_DATARECEIVED_Max (0x1UL)    /*!< Max enumerator value of DATARECEIVED field.                          */
  #define EXMEE_INTENCLR_DATARECEIVED_Clear (0x1UL)  /*!< Disable                                                              */
  #define EXMEE_INTENCLR_DATARECEIVED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define EXMEE_INTENCLR_DATARECEIVED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* CIPHERTEXTREADY @Bit 6 : Write '1' to disable interrupt for event CIPHERTEXTREADY */
  #define EXMEE_INTENCLR_CIPHERTEXTREADY_Pos (6UL)   /*!< Position of CIPHERTEXTREADY field.                                   */
  #define EXMEE_INTENCLR_CIPHERTEXTREADY_Msk (0x1UL << EXMEE_INTENCLR_CIPHERTEXTREADY_Pos) /*!< Bit mask of CIPHERTEXTREADY
                                                                            field.*/
  #define EXMEE_INTENCLR_CIPHERTEXTREADY_Min (0x0UL) /*!< Min enumerator value of CIPHERTEXTREADY field.                       */
  #define EXMEE_INTENCLR_CIPHERTEXTREADY_Max (0x1UL) /*!< Max enumerator value of CIPHERTEXTREADY field.                       */
  #define EXMEE_INTENCLR_CIPHERTEXTREADY_Clear (0x1UL) /*!< Disable                                                            */
  #define EXMEE_INTENCLR_CIPHERTEXTREADY_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define EXMEE_INTENCLR_CIPHERTEXTREADY_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* NONCEREADY @Bit 7 : Write '1' to disable interrupt for event NONCEREADY */
  #define EXMEE_INTENCLR_NONCEREADY_Pos (7UL)        /*!< Position of NONCEREADY field.                                        */
  #define EXMEE_INTENCLR_NONCEREADY_Msk (0x1UL << EXMEE_INTENCLR_NONCEREADY_Pos) /*!< Bit mask of NONCEREADY field.            */
  #define EXMEE_INTENCLR_NONCEREADY_Min (0x0UL)      /*!< Min enumerator value of NONCEREADY field.                            */
  #define EXMEE_INTENCLR_NONCEREADY_Max (0x1UL)      /*!< Max enumerator value of NONCEREADY field.                            */
  #define EXMEE_INTENCLR_NONCEREADY_Clear (0x1UL)    /*!< Disable                                                              */
  #define EXMEE_INTENCLR_NONCEREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define EXMEE_INTENCLR_NONCEREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* WRITECOMPLETE @Bit 8 : Write '1' to disable interrupt for event WRITECOMPLETE */
  #define EXMEE_INTENCLR_WRITECOMPLETE_Pos (8UL)     /*!< Position of WRITECOMPLETE field.                                     */
  #define EXMEE_INTENCLR_WRITECOMPLETE_Msk (0x1UL << EXMEE_INTENCLR_WRITECOMPLETE_Pos) /*!< Bit mask of WRITECOMPLETE field.   */
  #define EXMEE_INTENCLR_WRITECOMPLETE_Min (0x0UL)   /*!< Min enumerator value of WRITECOMPLETE field.                         */
  #define EXMEE_INTENCLR_WRITECOMPLETE_Max (0x1UL)   /*!< Max enumerator value of WRITECOMPLETE field.                         */
  #define EXMEE_INTENCLR_WRITECOMPLETE_Clear (0x1UL) /*!< Disable                                                              */
  #define EXMEE_INTENCLR_WRITECOMPLETE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define EXMEE_INTENCLR_WRITECOMPLETE_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* EXMEE_ENABLE: Enable the EXMEE peripheral. */
  #define EXMEE_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable or disable EXMEE */
  #define EXMEE_ENABLE_ENABLE_Pos (0UL)              /*!< Position of ENABLE field.                                            */
  #define EXMEE_ENABLE_ENABLE_Msk (0x1UL << EXMEE_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                            */
  #define EXMEE_ENABLE_ENABLE_Min (0x0UL)            /*!< Min enumerator value of ENABLE field.                                */
  #define EXMEE_ENABLE_ENABLE_Max (0x1UL)            /*!< Max enumerator value of ENABLE field.                                */
  #define EXMEE_ENABLE_ENABLE_Disabled (0x0UL)       /*!< Disable EXMEE                                                        */
  #define EXMEE_ENABLE_ENABLE_Enabled (0x1UL)        /*!< Enable EXMEE                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           EXMIF                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

