adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EXMIF_CORE_SSICADDRESS_IDR: This register contains the peripherals identification code, which is written into the register at
                                configuration time using coreConsultant. */

  #define EXMIF_CORE_SSICADDRESS_IDR_ResetValue (0x00010003UL) /*!< Reset value of IDR register.                               */

/* IDCODE @Bits 0..31 : Identification code. */
  #define EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Pos (0UL) /*!< Position of IDCODE field.                                           */
  #define EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Pos) /*!< Bit mask of IDCODE
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_SSICVERSIONID: This read-only register stores the specific DWC_ssi component version. */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_ResetValue (0x3130332AUL) /*!< Reset value of SSICVERSIONID register.           */

/* SSICCOMPVERSION @Bits 0..31 : Contains the hex representation of the Synopsys component version. */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Pos (0UL) /*!< Position of SSICCOMPVERSION field.               */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Pos)
                                                                            /*!< Bit mask of SSICCOMPVERSION field.*/


/* EXMIF_CORE_SSICADDRESS_DR: The DWC_ssi data register is a 32-bit read/write buffer for the transmit/receive FIFOs. */
  #define EXMIF_CORE_SSICADDRESS_DR_MaxCount (36UL)  /*!< Max size of DR[36] array.                                            */
  #define EXMIF_CORE_SSICADDRESS_DR_MaxIndex (35UL)  /*!< Max index of DR[36] array.                                           */
  #define EXMIF_CORE_SSICADDRESS_DR_MinIndex (0UL)   /*!< Min index of DR[36] array.                                           */
  #define EXMIF_CORE_SSICADDRESS_DR_ResetValue (0x00000000UL) /*!< Reset value of DR[36] register.                             */

/* DR @Bits 0..31 : Data Register. */
  #define EXMIF_CORE_SSICADDRESS_DR_DR_Pos (0UL)     /*!< Position of DR field.                                                */
  #define EXMIF_CORE_SSICADDRESS_DR_DR_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_DR_DR_Pos) /*!< Bit mask of DR field.       */


/* EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY: This register is only valid when the DWC_ssi is configured with rxd sample delay logic
                                          (SSIC_HAS_RX_SAMPLE_DELAY==1). */

  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_ResetValue (0x00000000UL) /*!< Reset value of RXSAMPLEDELAY register.           */

/* RSD @Bits 0..7 : Receive Data (rxd) Sample Delay. */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Pos (0UL) /*!< Position of RSD field.                                       */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Msk (0xFFUL << EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Pos) /*!< Bit mask of
                                                                            RSD field.*/

/* SE @Bit 16 : Receive Data (rxd) Sampling Edge. */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Pos (16UL) /*!< Position of SE field.                                        */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Pos) /*!< Bit mask of SE
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_SPICTRLR0: This register is used to control the serial data transfer in enhanced SPI mode of
                                      operation. */

  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ResetValue (0x00000A00UL) /*!< Reset value of SPICTRLR0 register.                   */

/* TRANSTYPE @Bits 0..1 : Address and instruction transfer format. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Pos (0UL) /*!< Position of TRANSTYPE field.                               */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Pos) /*!< Bit mask
                                                                            of TRANSTYPE field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Min (0x0UL) /*!< Min enumerator value of TRANSTYPE field.                 */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Max (0x3UL) /*!< Max enumerator value of TRANSTYPE field.                 */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT0 (0x0UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT1 (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT2 (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT3 (0x3UL) /*!< (unspecified)                                            */

/* ADDRL @Bits 2..5 : This bit defines Length of Address to be transmitted. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Pos (2UL) /*!< Position of ADDRL field.                                       */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Msk (0xFUL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Pos) /*!< Bit mask of
                                                                            ADDRL field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Min (0x0UL) /*!< Min enumerator value of ADDRL field.                         */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Max (0xFUL) /*!< Max enumerator value of ADDRL field.                         */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L0 (0x0UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L4 (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L8 (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L12 (0x3UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L16 (0x4UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L20 (0x5UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L24 (0x6UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L28 (0x7UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L32 (0x8UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L36 (0x9UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L40 (0xAUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L44 (0xBUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L48 (0xCUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L52 (0xDUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L56 (0xEUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L60 (0xFUL) /*!< (unspecified)                                           */

