adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_START @Bit 0 : Start operation. */
  #define EXMIF_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define EXMIF_TASKS_START_TASKS_START_Msk (0x1UL << EXMIF_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define EXMIF_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define EXMIF_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define EXMIF_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* EXMIF_TASKS_STOP: Stop operation. */
  #define EXMIF_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop operation. */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Msk (0x1UL << EXMIF_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* EXMIF_LOCKEDACCESS: Enable or disable locked APB access to serial memory controller. */
  #define EXMIF_LOCKEDACCESS_ResetValue (0x00000000UL) /*!< Reset value of LOCKEDACCESS register.                              */

/* ENABLE @Bit 0 : Enable or disable locked APB access to SSI. */
  #define EXMIF_LOCKEDACCESS_ENABLE_Pos (0UL)        /*!< Position of ENABLE field.                                            */
  #define EXMIF_LOCKEDACCESS_ENABLE_Msk (0x1UL << EXMIF_LOCKEDACCESS_ENABLE_Pos) /*!< Bit mask of ENABLE field.                */
  #define EXMIF_LOCKEDACCESS_ENABLE_Min (0x0UL)      /*!< Min enumerator value of ENABLE field.                                */
  #define EXMIF_LOCKEDACCESS_ENABLE_Max (0x1UL)      /*!< Max enumerator value of ENABLE field.                                */
  #define EXMIF_LOCKEDACCESS_ENABLE_Disabled (0x0UL) /*!< Disable locked APB access.                                           */
  #define EXMIF_LOCKEDACCESS_ENABLE_Enabled (0x1UL)  /*!< Enable locked APB access.                                            */


/* EXMIF_PROGDELAY: Configures delay of the incoming data strobe. */
  #define EXMIF_PROGDELAY_ResetValue (0x00000007UL)  /*!< Reset value of PROGDELAY register.                                   */

/* DELAY @Bits 0..3 : Delay value. */
  #define EXMIF_PROGDELAY_DELAY_Pos (0UL)            /*!< Position of DELAY field.                                             */
  #define EXMIF_PROGDELAY_DELAY_Msk (0xFUL << EXMIF_PROGDELAY_DELAY_Pos) /*!< Bit mask of DELAY field.                         */
  #define EXMIF_PROGDELAY_DELAY_Min (0x0UL)          /*!< Min value of DELAY field.                                            */
  #define EXMIF_PROGDELAY_DELAY_Max (0xCUL)          /*!< Max size of DELAY field.                                             */
  #define EXMIF_PROGDELAY_DELAY_NoDelay (0x0UL)      /*!< No delay.                                                            */
  #define EXMIF_PROGDELAY_DELAY_Delay1 (0x1UL)       /*!< 1 delay element.                                                     */
  #define EXMIF_PROGDELAY_DELAY_Delay2 (0x2UL)       /*!< 2 delay elements.                                                    */
  #define EXMIF_PROGDELAY_DELAY_Delay3 (0x3UL)       /*!< 3 delay elements.                                                    */
  #define EXMIF_PROGDELAY_DELAY_Delay4 (0x4UL)       /*!< 4 delay elements.                                                    */
  #define EXMIF_PROGDELAY_DELAY_Delay5 (0x5UL)       /*!< 5 delay elements.                                                    */
  #define EXMIF_PROGDELAY_DELAY_Delay6 (0x6UL)       /*!< 6 delay elements.                                                    */
  #define EXMIF_PROGDELAY_DELAY_Delay7 (0x7UL)       /*!< 7 delay elements.                                                    */
  #define EXMIF_PROGDELAY_DELAY_Delay8 (0x8UL)       /*!< 8 delay elements.                                                    */
  #define EXMIF_PROGDELAY_DELAY_Delay9 (0x9UL)       /*!< 9 delay elements.                                                    */
  #define EXMIF_PROGDELAY_DELAY_Delay10 (0xAUL)      /*!< 10 delay elements.                                                   */
  #define EXMIF_PROGDELAY_DELAY_Delay11 (0xBUL)      /*!< 11 delay elements.                                                   */
  #define EXMIF_PROGDELAY_DELAY_Delay12 (0xCUL)      /*!< 12 delay elements.                                                   */

/* BYPASSDELAY @Bit 4 : Bypass delay calculated internally */
  #define EXMIF_PROGDELAY_BYPASSDELAY_Pos (4UL)      /*!< Position of BYPASSDELAY field.                                       */
  #define EXMIF_PROGDELAY_BYPASSDELAY_Msk (0x1UL << EXMIF_PROGDELAY_BYPASSDELAY_Pos) /*!< Bit mask of BYPASSDELAY field.       */
  #define EXMIF_PROGDELAY_BYPASSDELAY_Min (0x0UL)    /*!< Min enumerator value of BYPASSDELAY field.                           */
  #define EXMIF_PROGDELAY_BYPASSDELAY_Max (0x1UL)    /*!< Max enumerator value of BYPASSDELAY field.                           */
  #define EXMIF_PROGDELAY_BYPASSDELAY_NotBypassed (0x0UL) /*!< Delay value calculated internally.                              */
  #define EXMIF_PROGDELAY_BYPASSDELAY_Bypassed (0x1UL) /*!< Delay value used from the PROGDELAY register.                      */

/* HOLD @Bit 5 : Hold the delay value */
  #define EXMIF_PROGDELAY_HOLD_Pos (5UL)             /*!< Position of HOLD field.                                              */
  #define EXMIF_PROGDELAY_HOLD_Msk (0x1UL << EXMIF_PROGDELAY_HOLD_Pos) /*!< Bit mask of HOLD field.                            */
  #define EXMIF_PROGDELAY_HOLD_Min (0x0UL)           /*!< Min enumerator value of HOLD field.                                  */
  #define EXMIF_PROGDELAY_HOLD_Max (0x1UL)           /*!< Max enumerator value of HOLD field.                                  */
  #define EXMIF_PROGDELAY_HOLD_Disabled (0x0UL)      /*!< Outgoing delay setting is updated.                                   */
  #define EXMIF_PROGDELAY_HOLD_Enabled (0x1UL)       /*!< Outgoing delay setting is not updated.                               */

/* OFFSET @Bits 6..7 : Delay offset for automatic delay calculation */
  #define EXMIF_PROGDELAY_OFFSET_Pos (6UL)           /*!< Position of OFFSET field.                                            */
  #define EXMIF_PROGDELAY_OFFSET_Msk (0x3UL << EXMIF_PROGDELAY_OFFSET_Pos) /*!< Bit mask of OFFSET field.                      */
  #define EXMIF_PROGDELAY_OFFSET_Min (0x0UL)         /*!< Min enumerator value of OFFSET field.                                */
  #define EXMIF_PROGDELAY_OFFSET_Max (0x2UL)         /*!< Max enumerator value of OFFSET field.                                */
  #define EXMIF_PROGDELAY_OFFSET_NoOffset (0x0UL)    /*!< No offset.                                                           */
  #define EXMIF_PROGDELAY_OFFSET_OffsetPos1 (0x1UL)  /*!< Offset is +1.                                                        */
  #define EXMIF_PROGDELAY_OFFSET_OffsetNeg1 (0x2UL)  /*!< Offset is -1.                                                        */


/* EXMIF_RESET: Reset the external memory. */
  #define EXMIF_RESET_ResetValue (0x00000000UL)      /*!< Reset value of RESET register.                                       */

/* RESET @Bit 0 : (unspecified) */
  #define EXMIF_RESET_RESET_Pos (0UL)                /*!< Position of RESET field.                                             */
  #define EXMIF_RESET_RESET_Msk (0x1UL << EXMIF_RESET_RESET_Pos) /*!< Bit mask of RESET field.                                 */
  #define EXMIF_RESET_RESET_Min (0x0UL)              /*!< Min enumerator value of RESET field.                                 */
  #define EXMIF_RESET_RESET_Max (0x1UL)              /*!< Max enumerator value of RESET field.                                 */
  #define EXMIF_RESET_RESET_Clear (0x0UL)            /*!< Reset is cleared.                                                    */
  #define EXMIF_RESET_RESET_Set (0x1UL)              /*!< Reset is set.                                                        */


