adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ADDR @Bits 0..31 : Device address [n]. */
  #define FICR_BLE_ADDR_ADDR_Pos (0UL)               /*!< Position of ADDR field.                                              */
  #define FICR_BLE_ADDR_ADDR_Msk (0xFFFFFFFFUL << FICR_BLE_ADDR_ADDR_Pos) /*!< Bit mask of ADDR field.                         */


/* FICR_BLE_ER: Encryption Root. */
  #define FICR_BLE_ER_MaxCount (4UL)                 /*!< Max size of ER[4] array.                                             */
  #define FICR_BLE_ER_MaxIndex (3UL)                 /*!< Max index of ER[4] array.                                            */
  #define FICR_BLE_ER_MinIndex (0UL)                 /*!< Min index of ER[4] array.                                            */
  #define FICR_BLE_ER_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of ER[4] register.                                       */

/* ER @Bits 0..31 : Encryption root word [n]. */
  #define FICR_BLE_ER_ER_Pos (0UL)                   /*!< Position of ER field.                                                */
  #define FICR_BLE_ER_ER_Msk (0xFFFFFFFFUL << FICR_BLE_ER_ER_Pos) /*!< Bit mask of ER field.                                   */


/* FICR_BLE_IR: Identity Root. */
  #define FICR_BLE_IR_MaxCount (4UL)                 /*!< Max size of IR[4] array.                                             */
  #define FICR_BLE_IR_MaxIndex (3UL)                 /*!< Max index of IR[4] array.                                            */
  #define FICR_BLE_IR_MinIndex (0UL)                 /*!< Min index of IR[4] array.                                            */
  #define FICR_BLE_IR_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of IR[4] register.                                       */

/* IR @Bits 0..31 : Identity root word [n]. */
  #define FICR_BLE_IR_IR_Pos (0UL)                   /*!< Position of IR field.                                                */
  #define FICR_BLE_IR_IR_Msk (0xFFFFFFFFUL << FICR_BLE_IR_IR_Pos) /*!< Bit mask of IR field.                                   */



/* ===================================================== Struct FICR_NFC ===================================================== */
/**
  * @brief NFC [FICR_NFC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TAGHEADER[4];                      /*!< (@ 0x00000000) Default header for NFC Tag.                           */
} NRF_FICR_NFC_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* FICR_NFC_TAGHEADER: Default header for NFC Tag. */
  #define FICR_NFC_TAGHEADER_MaxCount (4UL)          /*!< Max size of TAGHEADER[4] array.                                      */
  #define FICR_NFC_TAGHEADER_MaxIndex (3UL)          /*!< Max index of TAGHEADER[4] array.                                     */
  #define FICR_NFC_TAGHEADER_MinIndex (0UL)          /*!< Min index of TAGHEADER[4] array.                                     */
  #define FICR_NFC_TAGHEADER_ResetValue (0xFFFFFF5FUL) /*!< Reset value of TAGHEADER[4] register.                              */

/* UD0 @Bits 0..7 : Unique identifier byte 0 */
  #define FICR_NFC_TAGHEADER_UD0_Pos (0UL)           /*!< Position of UD0 field.                                               */
  #define FICR_NFC_TAGHEADER_UD0_Msk (0xFFUL << FICR_NFC_TAGHEADER_UD0_Pos) /*!< Bit mask of UD0 field.                        */

/* UD1 @Bits 8..15 : Unique identifier byte 1 */
  #define FICR_NFC_TAGHEADER_UD1_Pos (8UL)           /*!< Position of UD1 field.                                               */
  #define FICR_NFC_TAGHEADER_UD1_Msk (0xFFUL << FICR_NFC_TAGHEADER_UD1_Pos) /*!< Bit mask of UD1 field.                        */

/* UD2 @Bits 16..23 : Unique identifier byte 2 */
  #define FICR_NFC_TAGHEADER_UD2_Pos (16UL)          /*!< Position of UD2 field.                                               */
  #define FICR_NFC_TAGHEADER_UD2_Msk (0xFFUL << FICR_NFC_TAGHEADER_UD2_Pos) /*!< Bit mask of UD2 field.                        */

/* UD3 @Bits 24..31 : Unique identifier byte 3 */
  #define FICR_NFC_TAGHEADER_UD3_Pos (24UL)          /*!< Position of UD3 field.                                               */
  #define FICR_NFC_TAGHEADER_UD3_Msk (0xFFUL << FICR_NFC_TAGHEADER_UD3_Pos) /*!< Bit mask of UD3 field.                        */



/* ==================================================== Struct FICR_INFO ===================================================== */
/**
  * @brief INFO [FICR_INFO] Device info
  */
typedef struct {
  __IM  uint32_t  CONFIGID;                          /*!< (@ 0x00000000) Configuration identifier                              */
  __IM  uint32_t  PART;                              /*!< (@ 0x00000004) Part code                                             */
  __IM  uint32_t  VARIANT;                           /*!< (@ 0x00000008) Part Variant, Hardware version and Production
                                                                         configuration*/
  __IM  uint32_t  PACKAGE;                           /*!< (@ 0x0000000C) Package option                                        */
  __IM  uint32_t  RAM;                               /*!< (@ 0x00000010) RAM variant                                           */
  __IM  uint32_t  MRAM;                              /*!< (@ 0x00000014) MRAM variant                                          */
  __IM  uint32_t  CODEPAGESIZE;                      /*!< (@ 0x00000018) Code memory page size in bytes                        */
  __IM  uint32_t  CODESIZE;                          /*!< (@ 0x0000001C) Code memory size                                      */
  __IM  uint32_t  DEVICETYPE;                        /*!< (@ 0x00000020) Device type                                           */
} NRF_FICR_INFO_Type;                                /*!< Size = 36 (0x024)                                                    */

/* FICR_INFO_CONFIGID: Configuration identifier */
  #define FICR_INFO_CONFIGID_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIGID register.                                  */

/* HWID @Bits 0..15 : Identification number for the HW */
  #define FICR_INFO_CONFIGID_HWID_Pos (0UL)          /*!< Position of HWID field.                                              */
  #define FICR_INFO_CONFIGID_HWID_Msk (0xFFFFUL << FICR_INFO_CONFIGID_HWID_Pos) /*!< Bit mask of HWID field.                   */


/* FICR_INFO_PART: Part code */
  #define FICR_INFO_PART_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of PART register.                                        */

/* PART @Bits 0..31 : Part code */
  #define FICR_INFO_PART_PART_Pos (0UL)              /*!< Position of PART field.                                              */
  #define FICR_INFO_PART_PART_Msk (0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos) /*!< Bit mask of PART field.                       */
  #define FICR_INFO_PART_PART_Min (0xFFFFFFFFUL)     /*!< Min enumerator value of PART field.                                  */
  #define FICR_INFO_PART_PART_Max (0xFFFFFFFFUL)     /*!< Max enumerator value of PART field.                                  */
  #define FICR_INFO_PART_PART_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                      */


/* FICR_INFO_VARIANT: Part Variant, Hardware version and Production configuration */
  #define FICR_INFO_VARIANT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VARIANT register.                                    */

