adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOTNR @Bits 0..31 : Lot number */
  #define FICR_PRODTEST_CP_LOTNR_LOTNR_Pos (0UL)     /*!< Position of LOTNR field.                                             */
  #define FICR_PRODTEST_CP_LOTNR_LOTNR_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_LOTNR_LOTNR_Pos) /*!< Bit mask of LOTNR field.    */


/* FICR_PRODTEST_CP_WAFERXY: Wafer number and die X,Y coordinate. */
  #define FICR_PRODTEST_CP_WAFERXY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of WAFERXY register.                             */

/* YCOORD @Bits 0..7 : Die y coordinate */
  #define FICR_PRODTEST_CP_WAFERXY_YCOORD_Pos (0UL)  /*!< Position of YCOORD field.                                            */
  #define FICR_PRODTEST_CP_WAFERXY_YCOORD_Msk (0xFFUL << FICR_PRODTEST_CP_WAFERXY_YCOORD_Pos) /*!< Bit mask of YCOORD field.   */

/* XCOORD @Bits 8..15 : Die x coordinate */
  #define FICR_PRODTEST_CP_WAFERXY_XCOORD_Pos (8UL)  /*!< Position of XCOORD field.                                            */
  #define FICR_PRODTEST_CP_WAFERXY_XCOORD_Msk (0xFFUL << FICR_PRODTEST_CP_WAFERXY_XCOORD_Pos) /*!< Bit mask of XCOORD field.   */

/* WAFER @Bits 16..23 : Wafer number */
  #define FICR_PRODTEST_CP_WAFERXY_WAFER_Pos (16UL)  /*!< Position of WAFER field.                                             */
  #define FICR_PRODTEST_CP_WAFERXY_WAFER_Msk (0xFFUL << FICR_PRODTEST_CP_WAFERXY_WAFER_Pos) /*!< Bit mask of WAFER field.      */


/* FICR_PRODTEST_CP_PROGVERSION1: CP1 test program version. */
  #define FICR_PRODTEST_CP_PROGVERSION1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROGVERSION1 register.                   */

/* VAL @Bits 0..31 : CP1 test program version */
  #define FICR_PRODTEST_CP_PROGVERSION1_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define FICR_PRODTEST_CP_PROGVERSION1_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_PROGVERSION1_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/


/* FICR_PRODTEST_CP_PROGVERSION2: CP2 test program version. */
  #define FICR_PRODTEST_CP_PROGVERSION2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROGVERSION2 register.                   */

/* VAL @Bits 0..31 : CP2 test program version */
  #define FICR_PRODTEST_CP_PROGVERSION2_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define FICR_PRODTEST_CP_PROGVERSION2_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_PROGVERSION2_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/


/* FICR_PRODTEST_CP_PASSID1: CP1 pass ID. */
  #define FICR_PRODTEST_CP_PASSID1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PASSID1 register.                             */

/* VAL @Bits 0..31 : CP1 pass ID. */
  #define FICR_PRODTEST_CP_PASSID1_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define FICR_PRODTEST_CP_PASSID1_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_PASSID1_VAL_Pos) /*!< Bit mask of VAL field.      */


/* FICR_PRODTEST_CP_PASSID2: CP2 pass ID. */
  #define FICR_PRODTEST_CP_PASSID2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PASSID2 register.                             */

/* VAL @Bits 0..31 : CP2 pass ID. */
  #define FICR_PRODTEST_CP_PASSID2_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define FICR_PRODTEST_CP_PASSID2_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_PASSID2_VAL_Pos) /*!< Bit mask of VAL field.      */


/* FICR_PRODTEST_CP_TIMESTAMP1: Timestamp for when CP1 starts or ends (YYYYMMDDTHHMMSS) */
  #define FICR_PRODTEST_CP_TIMESTAMP1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TIMESTAMP1 register.                       */

/* VAL @Bits 0..31 : CP1 timestamp */
  #define FICR_PRODTEST_CP_TIMESTAMP1_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define FICR_PRODTEST_CP_TIMESTAMP1_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_TIMESTAMP1_VAL_Pos) /*!< Bit mask of VAL field.*/


/* FICR_PRODTEST_CP_TIMESTAMP2: Timestamp for when CP2 starts or ends (YYYYMMDDTHHMMSS) */
  #define FICR_PRODTEST_CP_TIMESTAMP2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TIMESTAMP2 register.                       */

/* VAL @Bits 0..31 : CP2 timestamp */
  #define FICR_PRODTEST_CP_TIMESTAMP2_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define FICR_PRODTEST_CP_TIMESTAMP2_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_TIMESTAMP2_VAL_Pos) /*!< Bit mask of VAL field.*/



/* ================================================= Struct FICR_PRODTEST_FT ================================================= */
/**
  * @brief FT [FICR_PRODTEST_FT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PROGVERSION1;                      /*!< (@ 0x00000000) FT1 test program version.                             */
  __IM  uint32_t  PROGVERSION2;                      /*!< (@ 0x00000004) FT2/EQA test program version.                         */
  __IM  uint32_t  PASSID1;                           /*!< (@ 0x00000008) FT1 pass ID.                                          */
  __IM  uint32_t  PASSID2;                           /*!< (@ 0x0000000C) FT2/EQA pass ID.                                      */
  __IM  uint32_t  TIMESTAMP1;                        /*!< (@ 0x00000010) Timestamp for when FT1 starts or ends
                                                                         (YYYYMMDDTHHMMSS)*/
  __IM  uint32_t  TIMESTAMP2;                        /*!< (@ 0x00000014) Timestamp for when FT2/EQA starts or ends
                                                                         (YYYYMMDDTHHMMSS)*/
} NRF_FICR_PRODTEST_FT_Type;                         /*!< Size = 24 (0x018)                                                    */

/* FICR_PRODTEST_FT_PROGVERSION1: FT1 test program version. */
  #define FICR_PRODTEST_FT_PROGVERSION1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROGVERSION1 register.                   */

