adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PROGVERSION1 @Bits 0..31 : FT1 test program version */
  #define FICR_PRODTEST_FT_PROGVERSION1_PROGVERSION1_Pos (0UL) /*!< Position of PROGVERSION1 field.                            */
  #define FICR_PRODTEST_FT_PROGVERSION1_PROGVERSION1_Msk (0xFFFFFFFFUL << FICR_PRODTEST_FT_PROGVERSION1_PROGVERSION1_Pos) /*!<
                                                                            Bit mask of PROGVERSION1 field.*/


/* FICR_PRODTEST_FT_PROGVERSION2: FT2/EQA test program version. */
  #define FICR_PRODTEST_FT_PROGVERSION2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROGVERSION2 register.                   */

/* PROGVERSION2 @Bits 0..31 : FT2/EQA test program version */
  #define FICR_PRODTEST_FT_PROGVERSION2_PROGVERSION2_Pos (0UL) /*!< Position of PROGVERSION2 field.                            */
  #define FICR_PRODTEST_FT_PROGVERSION2_PROGVERSION2_Msk (0xFFFFFFFFUL << FICR_PRODTEST_FT_PROGVERSION2_PROGVERSION2_Pos) /*!<
                                                                            Bit mask of PROGVERSION2 field.*/


/* FICR_PRODTEST_FT_PASSID1: FT1 pass ID. */
  #define FICR_PRODTEST_FT_PASSID1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PASSID1 register.                             */

/* VAL @Bits 0..31 : FT1 pass ID. */
  #define FICR_PRODTEST_FT_PASSID1_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define FICR_PRODTEST_FT_PASSID1_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_FT_PASSID1_VAL_Pos) /*!< Bit mask of VAL field.      */


/* FICR_PRODTEST_FT_PASSID2: FT2/EQA pass ID. */
  #define FICR_PRODTEST_FT_PASSID2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PASSID2 register.                             */

/* VAL @Bits 0..31 : FT2/EQA pass ID. */
  #define FICR_PRODTEST_FT_PASSID2_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define FICR_PRODTEST_FT_PASSID2_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_FT_PASSID2_VAL_Pos) /*!< Bit mask of VAL field.      */


/* FICR_PRODTEST_FT_TIMESTAMP1: Timestamp for when FT1 starts or ends (YYYYMMDDTHHMMSS) */
  #define FICR_PRODTEST_FT_TIMESTAMP1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TIMESTAMP1 register.                       */

/* VAL @Bits 0..31 : FT1 timestamp */
  #define FICR_PRODTEST_FT_TIMESTAMP1_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define FICR_PRODTEST_FT_TIMESTAMP1_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_FT_TIMESTAMP1_VAL_Pos) /*!< Bit mask of VAL field.*/


/* FICR_PRODTEST_FT_TIMESTAMP2: Timestamp for when FT2/EQA starts or ends (YYYYMMDDTHHMMSS) */
  #define FICR_PRODTEST_FT_TIMESTAMP2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TIMESTAMP2 register.                       */

/* VAL @Bits 0..31 : FT2/EQA timestamp */
  #define FICR_PRODTEST_FT_TIMESTAMP2_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define FICR_PRODTEST_FT_TIMESTAMP2_VAL_Msk (0xFFFFFFFFUL << FICR_PRODTEST_FT_TIMESTAMP2_VAL_Pos) /*!< Bit mask of VAL field.*/



/* ================================================== Struct FICR_PRODTEST =================================================== */
/**
  * @brief PRODTEST [FICR_PRODTEST] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_PRODTEST_CP_Type CP;                /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_PRODTEST_FT_Type FT;                /*!< (@ 0x00000024) (unspecified)                                         */
} NRF_FICR_PRODTEST_Type;                            /*!< Size = 60 (0x03C)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_FLL16M_CONFIG ========================================== */
/**
  * @brief CONFIG [FICR_TRIM_SYSCTRL_FLL16M_CONFIG] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CFGCKSW16M;                        /*!< (@ 0x00000000) Config value for SYSCTRL.FLL16M.CONFIG.CFGCKSW16M     */
} NRF_FICR_TRIM_SYSCTRL_FLL16M_CONFIG_Type;          /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_FLL16M_CONFIG_CFGCKSW16M: Config value for SYSCTRL.FLL16M.CONFIG.CFGCKSW16M */
  #define FICR_TRIM_SYSCTRL_FLL16M_CONFIG_CFGCKSW16M_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CFGCKSW16M register.        */

/* VALUE @Bits 0..31 : Config value */
  #define FICR_TRIM_SYSCTRL_FLL16M_CONFIG_CFGCKSW16M_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SYSCTRL_FLL16M_CONFIG_CFGCKSW16M_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_CONFIG_CFGCKSW16M_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ========================================== Struct FICR_TRIM_SYSCTRL_FLL16M_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_FLL16M_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RCOARSE;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.FLL16M.TRIM.RCOARSE            */
  __IM  uint32_t  RFINE;                             /*!< (@ 0x00000004) Trim value for SYSCTRL.FLL16M.TRIM.RFINE              */
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000008) Trim value for SYSCTRL.FLL16M.TRIM.VSUP               */
  __IM  uint32_t  CKSW16MTRIM;                       /*!< (@ 0x0000000C) Trim value for SYSCTRL.FLL16M.TRIM.CKSW16MTRIM        */
  __IM  uint32_t  TCOEF;                             /*!< (@ 0x00000010) Trim value for SYSCTRL.FLL16M.TRIM.TCOEF              */
} NRF_FICR_TRIM_SYSCTRL_FLL16M_TRIM_Type;            /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE: Trim value for SYSCTRL.FLL16M.TRIM.RCOARSE */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RCOARSE register.                */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE: Trim value for SYSCTRL.FLL16M.TRIM.RFINE */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RFINE register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP: Trim value for SYSCTRL.FLL16M.TRIM.VSUP */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


