adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM: Trim value for SYSCTRL.FLL16M.TRIM.CKSW16MTRIM */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CKSW16MTRIM register.        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF: Trim value for SYSCTRL.FLL16M.TRIM.TCOEF */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TCOEF register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_SYSCTRL_FLL16M ============================================= */
/**
  * @brief FLL16M [FICR_TRIM_SYSCTRL_FLL16M] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_FLL16M_CONFIG_Type CONFIG; /*!< (@ 0x00000000) (unspecified)                                     */
  __IOM NRF_FICR_TRIM_SYSCTRL_FLL16M_TRIM_Type TRIM; /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_FLL16M_Type;                 /*!< Size = 24 (0x018)                                                    */


/* ============================================ Struct FICR_TRIM_SYSCTRL_LFRC_CAL ============================================ */
/**
  * @brief CAL [FICR_TRIM_SYSCTRL_LFRC_CAL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  LFRCOSCTRIM;                       /*!< (@ 0x00000000) Trim value for SYSCTRL.LFRC.CAL.LFRCOSCTRIM           */
} NRF_FICR_TRIM_SYSCTRL_LFRC_CAL_Type;               /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM: Trim value for SYSCTRL.LFRC.CAL.LFRCOSCTRIM */
  #define FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFRCOSCTRIM register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ============================================== Struct FICR_TRIM_SYSCTRL_LFRC ============================================== */
/**
  * @brief LFRC [FICR_TRIM_SYSCTRL_LFRC] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_LFRC_CAL_Type CAL;     /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_LFRC_Type;                   /*!< Size = 4 (0x004)                                                     */


/* =========================================== Struct FICR_TRIM_SYSCTRL_LFXO_TRIM ============================================ */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_LFXO_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PDLOWERTHR;                        /*!< (@ 0x00000000) Trim value for SYSCTRL.LFXO.TRIM.PDLOWERTHR           */
  __IM  uint32_t  PDUPPERTHR;                        /*!< (@ 0x00000004) Trim value for SYSCTRL.LFXO.TRIM.PDUPPERTHR           */
  __IM  uint32_t  BIAS;                              /*!< (@ 0x00000008) Trim value for SYSCTRL.LFXO.TRIM.BIAS                 */
  __IM  uint32_t  PIXO;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.LFXO.TRIM.PIXO                 */
  __IM  uint32_t  TRIMBUS;                           /*!< (@ 0x00000010) Trim value for SYSCTRL.LFXO.TRIM.TRIMBUS              */
} NRF_FICR_TRIM_SYSCTRL_LFXO_TRIM_Type;              /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR: Trim value for SYSCTRL.LFXO.TRIM.PDLOWERTHR */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PDLOWERTHR register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR: Trim value for SYSCTRL.LFXO.TRIM.PDUPPERTHR */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PDUPPERTHR register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS: Trim value for SYSCTRL.LFXO.TRIM.BIAS */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIAS register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO: Trim value for SYSCTRL.LFXO.TRIM.PIXO */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PIXO register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS: Trim value for SYSCTRL.LFXO.TRIM.TRIMBUS */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIMBUS register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================== Struct FICR_TRIM_SYSCTRL_LFXO ============================================== */
/**
  * @brief LFXO [FICR_TRIM_SYSCTRL_LFXO] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_LFXO_TRIM_Type TRIM;   /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_LFXO_Type;                   /*!< Size = 20 (0x014)                                                    */


/* ============================================= Struct FICR_TRIM_SYSCTRL_LFLPRC ============================================= */
/**
  * @brief LFLPRC [FICR_TRIM_SYSCTRL_LFLPRC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.LFLPRC.TRIM.VSUP               */
  __IM  uint32_t  RCOARSE;                           /*!< (@ 0x00000004) Trim value for SYSCTRL.LFLPRC.TRIM.RCOARSE            */
  __IM  uint32_t  RFINE;                             /*!< (@ 0x00000008) Trim value for SYSCTRL.LFLPRC.TRIM.RFINE              */
  __IM  uint32_t  PWMFINE;                           /*!< (@ 0x0000000C) Trim value for SYSCTRL.LFLPRC.TRIM.PWMFINE            */
} NRF_FICR_TRIM_SYSCTRL_LFLPRC_Type;                 /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_LFLPRC_VSUP: Trim value for SYSCTRL.LFLPRC.TRIM.VSUP */
  #define FICR_TRIM_SYSCTRL_LFLPRC_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFLPRC_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_SYSCTRL_LFLPRC_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFLPRC_VSUP_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE: Trim value for SYSCTRL.LFLPRC.TRIM.RCOARSE */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RCOARSE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_SYSCTRL_LFLPRC_RFINE: Trim value for SYSCTRL.LFLPRC.TRIM.RFINE */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RFINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RFINE register.                         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RFINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RFINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFLPRC_RFINE_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE: Trim value for SYSCTRL.LFLPRC.TRIM.PWMFINE */
  #define FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWMFINE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/



/* ======================================== Struct FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  POFWARN;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETPOF5V0.TRIM.POFWARN        */
} NRF_FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_Type;        /*!< Size = 4 (0x004)                                                     */

