adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_POFWARN: Trim value for SYSCTRL.VDETPOF5V0.TRIM.POFWARN */
  #define FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_POFWARN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of POFWARN register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_POFWARN_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_POFWARN_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_POFWARN_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_VDETPOF5V0 =========================================== */
/**
  * @brief VDETPOF5V0 [FICR_TRIM_SYSCTRL_VDETPOF5V0] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                     */
} NRF_FICR_TRIM_SYSCTRL_VDETPOF5V0_Type;             /*!< Size = 4 (0x004)                                                     */


/* =========================================== Struct FICR_TRIM_SYSCTRL_HFXO_TRIM ============================================ */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_HFXO_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  AREG;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.HFXO.TRIM.AREG                 */
  __IM  uint32_t  IBIAS;                             /*!< (@ 0x00000004) Trim value for SYSCTRL.HFXO.TRIM.IBIAS                */
  __IM  uint32_t  PIXO;                              /*!< (@ 0x00000008) Trim value for SYSCTRL.HFXO.TRIM.PIXO                 */
  __IM  uint32_t  PDTHR;                             /*!< (@ 0x0000000C) Trim value for SYSCTRL.HFXO.TRIM.PDTHR                */
  __IM  uint32_t  VREF;                              /*!< (@ 0x00000010) Trim value for SYSCTRL.HFXO.TRIM.VREF                 */
  __IM  uint32_t  MULT2;                             /*!< (@ 0x00000014) Trim value for SYSCTRL.HFXO.TRIM.MULT2                */
} NRF_FICR_TRIM_SYSCTRL_HFXO_TRIM_Type;              /*!< Size = 24 (0x018)                                                    */

/* FICR_TRIM_SYSCTRL_HFXO_TRIM_AREG: Trim value for SYSCTRL.HFXO.TRIM.AREG */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_AREG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of AREG register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_AREG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_AREG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO_TRIM_AREG_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HFXO_TRIM_IBIAS: Trim value for SYSCTRL.HFXO.TRIM.IBIAS */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_IBIAS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IBIAS register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_IBIAS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_IBIAS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO_TRIM_IBIAS_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HFXO_TRIM_PIXO: Trim value for SYSCTRL.HFXO.TRIM.PIXO */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_PIXO_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PIXO register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_PIXO_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_PIXO_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO_TRIM_PIXO_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HFXO_TRIM_PDTHR: Trim value for SYSCTRL.HFXO.TRIM.PDTHR */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_PDTHR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PDTHR register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_PDTHR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_PDTHR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO_TRIM_PDTHR_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HFXO_TRIM_VREF: Trim value for SYSCTRL.HFXO.TRIM.VREF */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_VREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREF register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_VREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_VREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO_TRIM_VREF_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HFXO_TRIM_MULT2: Trim value for SYSCTRL.HFXO.TRIM.MULT2 */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_MULT2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MULT2 register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_MULT2_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define FICR_TRIM_SYSCTRL_HFXO_TRIM_MULT2_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO_TRIM_MULT2_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================== Struct FICR_TRIM_SYSCTRL_HFXO ============================================== */
/**
  * @brief HFXO [FICR_TRIM_SYSCTRL_HFXO] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_HFXO_TRIM_Type TRIM;   /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  CLOAD;                             /*!< (@ 0x00000018) Config value for SYSCTRL.HFXO.CLOAD                   */
  __IM  uint32_t  AMPLITUDECTRL;                     /*!< (@ 0x0000001C) Config value for SYSCTRL.HFXO.AMPLITUDECTRL           */
} NRF_FICR_TRIM_SYSCTRL_HFXO_Type;                   /*!< Size = 32 (0x020)                                                    */

/* FICR_TRIM_SYSCTRL_HFXO_CLOAD: Config value for SYSCTRL.HFXO.CLOAD */
  #define FICR_TRIM_SYSCTRL_HFXO_CLOAD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CLOAD register.                           */

/* VALUE @Bits 0..31 : Config value */
  #define FICR_TRIM_SYSCTRL_HFXO_CLOAD_VALUE_Pos (0UL) /*!< Position of VALUE field.                                           */
  #define FICR_TRIM_SYSCTRL_HFXO_CLOAD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO_CLOAD_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* FICR_TRIM_SYSCTRL_HFXO_AMPLITUDECTRL: Config value for SYSCTRL.HFXO.AMPLITUDECTRL */
  #define FICR_TRIM_SYSCTRL_HFXO_AMPLITUDECTRL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of AMPLITUDECTRL register.           */

/* VALUE @Bits 0..31 : Config value */
  #define FICR_TRIM_SYSCTRL_HFXO_AMPLITUDECTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HFXO_AMPLITUDECTRL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO_AMPLITUDECTRL_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



