adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ========================================= Struct FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for SYSCTRL.AUDIOPLL.TRIM.CTUNE            */
} NRF_FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_Type;          /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE: Trim value for SYSCTRL.AUDIOPLL.TRIM.CTUNE */
  #define FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SYSCTRL_AUDIOPLL ============================================ */
/**
  * @brief AUDIOPLL [FICR_TRIM_SYSCTRL_AUDIOPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_AUDIOPLL_Type;               /*!< Size = 4 (0x004)                                                     */


/* ======================================== Struct FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VREFPM;                            /*!< (@ 0x00000000) Trim value for SYSCTRL.AUDIOPLLPM.TRIM.VREFPM         */
} NRF_FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM_Type;        /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM_VREFPM: Trim value for SYSCTRL.AUDIOPLLPM.TRIM.VREFPM */
  #define FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM_VREFPM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREFPM register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM_VREFPM_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM_VREFPM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM_VREFPM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_AUDIOPLLPM =========================================== */
/**
  * @brief AUDIOPLLPM [FICR_TRIM_SYSCTRL_AUDIOPLLPM] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_AUDIOPLLPM_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                     */
} NRF_FICR_TRIM_SYSCTRL_AUDIOPLLPM_Type;             /*!< Size = 4 (0x004)                                                     */


/* ========================================= Struct FICR_TRIM_SYSCTRL_USBHSPLL_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_USBHSPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for SYSCTRL.USBHSPLL.TRIM.CTUNE            */
} NRF_FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_Type;          /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE: Trim value for SYSCTRL.USBHSPLL.TRIM.CTUNE */
  #define FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SYSCTRL_USBHSPLL ============================================ */
/**
  * @brief USBHSPLL [FICR_TRIM_SYSCTRL_USBHSPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_USBHSPLL_Type;               /*!< Size = 4 (0x004)                                                     */


/* ========================================== Struct FICR_TRIM_SYSCTRL_MBIAS_CONFIG ========================================== */
/**
  * @brief CONFIG [FICR_TRIM_SYSCTRL_MBIAS_CONFIG] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CFG;                               /*!< (@ 0x00000000) Config value for SYSCTRL.MBIAS.CONFIG.CFG             */
} NRF_FICR_TRIM_SYSCTRL_MBIAS_CONFIG_Type;           /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG: Config value for SYSCTRL.MBIAS.CONFIG.CFG */
  #define FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CFG register.                       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_MBIAS_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_MBIAS_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  MBIASIBPP;                         /*!< (@ 0x00000000) Trim value for SYSCTRL.MBIAS.TRIM.MBIASIBPP           */
  __IM  uint32_t  MBIASIBPSR;                        /*!< (@ 0x00000004) Trim value for SYSCTRL.MBIAS.TRIM.MBIASIBPSR          */
} NRF_FICR_TRIM_SYSCTRL_MBIAS_TRIM_Type;             /*!< Size = 8 (0x008)                                                     */

