adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP: Trim value for SYSCTRL.MBIAS.TRIM.MBIASIBPP */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MBIASIBPP register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR: Trim value for SYSCTRL.MBIAS.TRIM.MBIASIBPSR */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MBIASIBPSR register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_SYSCTRL_MBIAS ============================================== */
/**
  * @brief MBIAS [FICR_TRIM_SYSCTRL_MBIAS] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_MBIAS_CONFIG_Type CONFIG; /*!< (@ 0x00000000) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_MBIAS_TRIM_Type TRIM;  /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_MBIAS_Type;                  /*!< Size = 12 (0x00C)                                                    */


/* ========================================== Struct FICR_TRIM_SYSCTRL_OSCRFR_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_OSCRFR_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  OSC;                               /*!< (@ 0x00000000) Trim value for SYSCTRL.OSCRFR.TRIM.OSC                */
  __IM  uint32_t  IBPSR;                             /*!< (@ 0x00000004) Trim value for SYSCTRL.OSCRFR.TRIM.IBPSR              */
} NRF_FICR_TRIM_SYSCTRL_OSCRFR_TRIM_Type;            /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC: Trim value for SYSCTRL.OSCRFR.TRIM.OSC */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OSC register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR: Trim value for SYSCTRL.OSCRFR.TRIM.IBPSR */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IBPSR register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_SYSCTRL_OSCRFR ============================================= */
/**
  * @brief OSCRFR [FICR_TRIM_SYSCTRL_OSCRFR] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_OSCRFR_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_OSCRFR_Type;                 /*!< Size = 8 (0x008)                                                     */


/* ========================================== Struct FICR_TRIM_SYSCTRL_VREG1V0_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREG1V0_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  IREF;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.VREG1V0.TRIM.IREF              */
  __IM  uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) Trim value for SYSCTRL.VREG1V0.TRIM.HIGHPOWER         */
  __IM  uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Trim value for SYSCTRL.VREG1V0.TRIM.LOWPOWER          */
  __IM  uint32_t  ULPR;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREG1V0.TRIM.ULPR              */
} NRF_FICR_TRIM_SYSCTRL_VREG1V0_TRIM_Type;           /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF: Trim value for SYSCTRL.VREG1V0.TRIM.IREF */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IREF register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER: Trim value for SYSCTRL.VREG1V0.TRIM.HIGHPOWER */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HIGHPOWER register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER: Trim value for SYSCTRL.VREG1V0.TRIM.LOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWER register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


