adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR: Trim value for SYSCTRL.VREG1V0.TRIM.ULPR */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ULPR register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SYSCTRL_VREG1V0 ============================================= */
/**
  * @brief VREG1V0 [FICR_TRIM_SYSCTRL_VREG1V0] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREG1V0_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
  __IM  uint32_t  VOUTHPNOMINAL;                     /*!< (@ 0x00000010) Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL        */
} NRF_FICR_TRIM_SYSCTRL_VREG1V0_Type;                /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL: Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL */
  #define FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VOUTHPNOMINAL register.        */

/* VALUE @Bits 0..31 : Config value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ========================================= Struct FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  IREF;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGAO0V8.TRIM.IREF            */
  __IM  uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGAO0V8.TRIM.HIGHPOWER       */
  __IM  uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGAO0V8.TRIM.LOWPOWER        */
  __IM  uint32_t  ULTRALOWPOWER;                     /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGAO0V8.TRIM.ULTRALOWPOWER   */
  __IM  uint32_t  BPDET;                             /*!< (@ 0x00000010) Trim value for SYSCTRL.VREGAO0V8.TRIM.BPDET           */
} NRF_FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_Type;         /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF: Trim value for SYSCTRL.VREGAO0V8.TRIM.IREF */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IREF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER: Trim value for SYSCTRL.VREGAO0V8.TRIM.HIGHPOWER */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HIGHPOWER register.         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER: Trim value for SYSCTRL.VREGAO0V8.TRIM.LOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWER register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER: Trim value for SYSCTRL.VREGAO0V8.TRIM.ULTRALOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ULTRALOWPOWER register. */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                         */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET: Trim value for SYSCTRL.VREGAO0V8.TRIM.BPDET */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BPDET register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_VREGAO0V8 ============================================ */
/**
  * @brief VREGAO0V8 [FICR_TRIM_SYSCTRL_VREGAO0V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VREGAO0V8_Type;              /*!< Size = 20 (0x014)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  IREF;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGAO1V8.TRIM.IREF            */
  __IM  uint32_t  VREF;                              /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGAO1V8.TRIM.VREF            */
  __IM  uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGAO1V8.TRIM.LOWPOWER        */
  __IM  uint32_t  LOWPOWERDIFF;                      /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGAO1V8.TRIM.LOWPOWERDIFF    */
} NRF_FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_Type;         /*!< Size = 16 (0x010)                                                    */

