adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF: Trim value for SYSCTRL.VREGAO1V8.TRIM.IREF */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IREF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF: Trim value for SYSCTRL.VREGAO1V8.TRIM.VREF */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER: Trim value for SYSCTRL.VREGAO1V8.TRIM.LOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWER register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWERDIFF: Trim value for SYSCTRL.VREGAO1V8.TRIM.LOWPOWERDIFF */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWERDIFF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWERDIFF register.   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWERDIFF_VALUE_Pos (0UL) /*!< Position of VALUE field.                          */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWERDIFF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWERDIFF_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_VREGAO1V8 ============================================ */
/**
  * @brief VREGAO1V8 [FICR_TRIM_SYSCTRL_VREGAO1V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VREGAO1V8_Type;              /*!< Size = 16 (0x010)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VREGMAIN_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGMAIN_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BIASIBPP;                          /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGMAIN.TRIM.BIASIBPP         */
  __IM  uint32_t  BIASIBPSR;                         /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGMAIN.TRIM.BIASIBPSR        */
  __IM  uint32_t  VDDAO1V8HYSTOUTPUT;                /*!< (@ 0x00000008) Trim value for
                                                                         SYSCTRL.VREGMAIN.TRIM.VDDAO1V8HYSTOUTPUT*/
  __IM  uint32_t  VDDAO1V8PWMOUTPUT;                 /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGMAIN.TRIM.VDDAO1V8PWMOUTPUT*/
  __IM  uint32_t  VDD1V0HYSTOUTPUT;                  /*!< (@ 0x00000010) Trim value for SYSCTRL.VREGMAIN.TRIM.VDD1V0HYSTOUTPUT */
  __IM  uint32_t  VDDVS0V8HYSTOUTPUT;                /*!< (@ 0x00000014) Trim value for
                                                                         SYSCTRL.VREGMAIN.TRIM.VDDVS0V8HYSTOUTPUT*/
  __IM  uint32_t  VDDVS0V8PWMOUTPUT;                 /*!< (@ 0x00000018) Trim value for SYSCTRL.VREGMAIN.TRIM.VDDVS0V8PWMOUTPUT*/
  __IM  uint32_t  VDD1V0PWMOUTPUT;                   /*!< (@ 0x0000001C) Trim value for SYSCTRL.VREGMAIN.TRIM.VDD1V0PWMOUTPUT  */
  __IM  uint32_t  ZCROSS;                            /*!< (@ 0x00000020) Trim value for SYSCTRL.VREGMAIN.TRIM.ZCROSS           */
  __IM  uint32_t  HSILIM;                            /*!< (@ 0x00000024) Trim value for SYSCTRL.VREGMAIN.TRIM.HSILIM           */
  __IM  uint32_t  ICMP;                              /*!< (@ 0x00000028) Trim value for SYSCTRL.VREGMAIN.TRIM.ICMP             */
  __IM  uint32_t  VGND;                              /*!< (@ 0x0000002C) Trim value for SYSCTRL.VREGMAIN.TRIM.VGND             */
} NRF_FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_Type;          /*!< Size = 48 (0x030)                                                    */

/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPP: Trim value for SYSCTRL.VREGMAIN.TRIM.BIASIBPP */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIASIBPP register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPP_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPP_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPSR: Trim value for SYSCTRL.VREGMAIN.TRIM.BIASIBPSR */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPSR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIASIBPSR register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPSR_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPSR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_BIASIBPSR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT: Trim value for SYSCTRL.VREGMAIN.TRIM.VDDAO1V8HYSTOUTPUT */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VDDAO1V8HYSTOUTPUT
                                                                            register.*/

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                     */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


