adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT: Trim value for SYSCTRL.VREGMAIN.TRIM.VDDAO1V8PWMOUTPUT */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VDDAO1V8PWMOUTPUT
                                                                            register.*/

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                      */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0HYSTOUTPUT: Trim value for SYSCTRL.VREGMAIN.TRIM.VDD1V0HYSTOUTPUT */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VDD1V0HYSTOUTPUT
                                                                            register.*/

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                       */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT: Trim value for SYSCTRL.VREGMAIN.TRIM.VDDVS0V8HYSTOUTPUT */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VDDVS0V8HYSTOUTPUT
                                                                            register.*/

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                     */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT: Trim value for SYSCTRL.VREGMAIN.TRIM.VDDVS0V8PWMOUTPUT */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VDDVS0V8PWMOUTPUT
                                                                            register.*/

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                      */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0PWMOUTPUT: Trim value for SYSCTRL.VREGMAIN.TRIM.VDD1V0PWMOUTPUT */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0PWMOUTPUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VDD1V0PWMOUTPUT
                                                                            register.*/

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0PWMOUTPUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                        */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0PWMOUTPUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VDD1V0PWMOUTPUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ZCROSS: Trim value for SYSCTRL.VREGMAIN.TRIM.ZCROSS */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ZCROSS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ZCROSS register.                */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ZCROSS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ZCROSS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ZCROSS_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM: Trim value for SYSCTRL.VREGMAIN.TRIM.HSILIM */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HSILIM register.                */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP: Trim value for SYSCTRL.VREGMAIN.TRIM.ICMP */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ICMP register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND: Trim value for SYSCTRL.VREGMAIN.TRIM.VGND */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VGND register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ======================================== Struct FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG ========================================= */
/**
  * @brief CONFIG [FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CFGCH1;                            /*!< (@ 0x00000000) Config value for SYSCTRL.VREGMAIN.CONFIG.CFGCH1       */
} NRF_FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG_Type;        /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG_CFGCH1: Config value for SYSCTRL.VREGMAIN.CONFIG.CFGCH1 */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG_CFGCH1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CFGCH1 register.              */

/* VALUE @Bits 0..31 : Config value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG_CFGCH1_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG_CFGCH1_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG_CFGCH1_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SYSCTRL_VREGMAIN ============================================ */
/**
  * @brief VREGMAIN [FICR_TRIM_SYSCTRL_VREGMAIN] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG_Type CONFIG; /*!< (@ 0x00000030) (unspecified)                                   */
  __IM  uint32_t  MODE;                              /*!< (@ 0x00000034) Config value for SYSCTRL.VREGMAIN.MODE                */
} NRF_FICR_TRIM_SYSCTRL_VREGMAIN_Type;               /*!< Size = 56 (0x038)                                                    */

/* FICR_TRIM_SYSCTRL_VREGMAIN_MODE: Config value for SYSCTRL.VREGMAIN.MODE */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_MODE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MODE register.                         */

/* VALUE @Bits 0..31 : Config value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_MODE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                        */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_MODE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_MODE_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* ======================================== Struct FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM ======================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VBG;                               /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGMRAM130.TRIM.VBG           */
  __IM  uint32_t  BIAS;                              /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGMRAM130.TRIM.BIAS          */
  __IM  uint32_t  VPR;                               /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGMRAM130.TRIM.VPR           */
  __IM  uint32_t  VREF;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGMRAM130.TRIM.VREF          */
} NRF_FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_Type;       /*!< Size = 16 (0x010)                                                    */

