adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG: Trim value for SYSCTRL.VREGMRAM130.TRIM.VBG */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VBG register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS: Trim value for SYSCTRL.VREGMRAM130.TRIM.BIAS */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIAS register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR: Trim value for SYSCTRL.VREGMRAM130.TRIM.VPR */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VPR register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF: Trim value for SYSCTRL.VREGMRAM130.TRIM.VREF */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREF register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ========================================== Struct FICR_TRIM_SYSCTRL_VREGMRAM130 =========================================== */
/**
  * @brief VREGMRAM130 [FICR_TRIM_SYSCTRL_VREGMRAM130] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                    */
} NRF_FICR_TRIM_SYSCTRL_VREGMRAM130_Type;            /*!< Size = 16 (0x010)                                                    */


/* ======================================== Struct FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM ======================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VBG;                               /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGMRAM131.TRIM.VBG           */
  __IM  uint32_t  BIAS;                              /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGMRAM131.TRIM.BIAS          */
  __IM  uint32_t  VPR;                               /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGMRAM131.TRIM.VPR           */
  __IM  uint32_t  VREF;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGMRAM131.TRIM.VREF          */
} NRF_FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_Type;       /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG: Trim value for SYSCTRL.VREGMRAM131.TRIM.VBG */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VBG register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS: Trim value for SYSCTRL.VREGMRAM131.TRIM.BIAS */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIAS register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR: Trim value for SYSCTRL.VREGMRAM131.TRIM.VPR */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VPR register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF: Trim value for SYSCTRL.VREGMRAM131.TRIM.VREF */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREF register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ========================================== Struct FICR_TRIM_SYSCTRL_VREGMRAM131 =========================================== */
/**
  * @brief VREGMRAM131 [FICR_TRIM_SYSCTRL_VREGMRAM131] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                    */
} NRF_FICR_TRIM_SYSCTRL_VREGMRAM131_Type;            /*!< Size = 16 (0x010)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  IREF;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGVS0V8.TRIM.IREF            */
  __IM  uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGVS0V8.TRIM.HIGHPOWER       */
  __IM  uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGVS0V8.TRIM.LOWPOWER        */
  __IM  uint32_t  ULPR;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGVS0V8.TRIM.ULPR            */
} NRF_FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_Type;         /*!< Size = 16 (0x010)                                                    */

