adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF: Trim value for SYSCTRL.VREGVS0V8.TRIM.IREF */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IREF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER: Trim value for SYSCTRL.VREGVS0V8.TRIM.HIGHPOWER */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HIGHPOWER register.         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER: Trim value for SYSCTRL.VREGVS0V8.TRIM.LOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWER register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR: Trim value for SYSCTRL.VREGVS0V8.TRIM.ULPR */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ULPR register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_VREGVS0V8 ============================================ */
/**
  * @brief VREGVS0V8 [FICR_TRIM_SYSCTRL_VREGVS0V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VREGVS0V8_Type;              /*!< Size = 16 (0x010)                                                    */


/* ========================================== Struct FICR_TRIM_SYSCTRL_VREGUSB_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGUSB_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIMVDD;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGUSB.TRIM.TRIMVDD           */
  __IM  uint32_t  TRIMIBP;                           /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGUSB.TRIM.TRIMIBP           */
  __IM  uint32_t  TRIM0V8;                           /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGUSB.TRIM.TRIM0V8           */
  __IM  uint32_t  TRIM3V3;                           /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGUSB.TRIM.TRIM3V3           */
} NRF_FICR_TRIM_SYSCTRL_VREGUSB_TRIM_Type;           /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD: Trim value for SYSCTRL.VREGUSB.TRIM.TRIMVDD */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIMVDD register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP: Trim value for SYSCTRL.VREGUSB.TRIM.TRIMIBP */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIMIBP register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8: Trim value for SYSCTRL.VREGUSB.TRIM.TRIM0V8 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM0V8 register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3: Trim value for SYSCTRL.VREGUSB.TRIM.TRIM3V3 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM3V3 register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SYSCTRL_VREGUSB ============================================= */
/**
  * @brief VREGUSB [FICR_TRIM_SYSCTRL_VREGUSB] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGUSB_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_SYSCTRL_VREGUSB_Type;                /*!< Size = 16 (0x010)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BROWNOUT;                          /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETAO0V8.TRIM.BROWNOUT        */
  __IM  uint32_t  PWRGOOD;                           /*!< (@ 0x00000004) Trim value for SYSCTRL.VDETAO0V8.TRIM.PWRGOOD         */
} NRF_FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_Type;         /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT: Trim value for SYSCTRL.VDETAO0V8.TRIM.BROWNOUT */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BROWNOUT register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


