adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD: Trim value for SYSCTRL.VDETVS0V8.TRIM.PWRGOOD */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWRGOOD register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_VDETVS0V8 ============================================ */
/**
  * @brief VDETVS0V8 [FICR_TRIM_SYSCTRL_VDETVS0V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VDETVS0V8_Type;              /*!< Size = 8 (0x008)                                                     */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETAO5V0.TRIM.PWRGOOD         */
} NRF_FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_Type;         /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD: Trim value for SYSCTRL.VDETAO5V0.TRIM.PWRGOOD */
  #define FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWRGOOD register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_VDETAO5V0 ============================================ */
/**
  * @brief VDETAO5V0 [FICR_TRIM_SYSCTRL_VDETAO5V0] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VDETAO5V0_Type;              /*!< Size = 4 (0x004)                                                     */


/* ========================================== Struct FICR_TRIM_SYSCTRL_VDET1V0_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDET1V0_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VDET1V0.TRIM.PWRGOOD           */
} NRF_FICR_TRIM_SYSCTRL_VDET1V0_TRIM_Type;           /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD: Trim value for SYSCTRL.VDET1V0.TRIM.PWRGOOD */
  #define FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWRGOOD register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SYSCTRL_VDET1V0 ============================================= */
/**
  * @brief VDET1V0 [FICR_TRIM_SYSCTRL_VDET1V0] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDET1V0_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_SYSCTRL_VDET1V0_Type;                /*!< Size = 4 (0x004)                                                     */


/* ========================================= Struct FICR_TRIM_SYSCTRL_HSFLL120_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_HSFLL120_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.HSFLL120.TRIM.VSUP             */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for SYSCTRL.HSFLL120.TRIM.COARSE           */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for SYSCTRL.HSFLL120.TRIM.FINE             */
  __IM  uint32_t  TCOEF;                             /*!< (@ 0x00000034) Trim value for SYSCTRL.HSFLL120.TRIM.TCOEF            */
} NRF_FICR_TRIM_SYSCTRL_HSFLL120_TRIM_Type;          /*!< Size = 56 (0x038)                                                    */

/* FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP: Trim value for SYSCTRL.HSFLL120.TRIM.VSUP */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE: Trim value for SYSCTRL.HSFLL120.TRIM.COARSE */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                              */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_MaxIndex (5UL) /*!< Max index of COARSE[6] array.                             */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_MinIndex (0UL) /*!< Min index of COARSE[6] array.                             */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE: Trim value for SYSCTRL.HSFLL120.TRIM.FINE */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                  */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_MaxIndex (5UL) /*!< Max index of FINE[6] array.                                 */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_MinIndex (0UL) /*!< Min index of FINE[6] array.                                 */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HSFLL120_TRIM_TCOEF: Trim value for SYSCTRL.HSFLL120.TRIM.TCOEF */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_TCOEF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TCOEF register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_TCOEF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_TCOEF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL120_TRIM_TCOEF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SYSCTRL_HSFLL120 ============================================ */
/**
  * @brief HSFLL120 [FICR_TRIM_SYSCTRL_HSFLL120] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_HSFLL120_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_HSFLL120_Type;               /*!< Size = 56 (0x038)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_HSFLL121_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_HSFLL121_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.HSFLL121.TRIM.VSUP             */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for SYSCTRL.HSFLL121.TRIM.COARSE           */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for SYSCTRL.HSFLL121.TRIM.FINE             */
  __IM  uint32_t  TCOEF;                             /*!< (@ 0x00000034) Trim value for SYSCTRL.HSFLL121.TRIM.TCOEF            */
} NRF_FICR_TRIM_SYSCTRL_HSFLL121_TRIM_Type;          /*!< Size = 56 (0x038)                                                    */

/* FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP: Trim value for SYSCTRL.HSFLL121.TRIM.VSUP */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


