adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE: Trim value for SYSCTRL.HSFLL121.TRIM.COARSE */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                              */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_MaxIndex (5UL) /*!< Max index of COARSE[6] array.                             */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_MinIndex (0UL) /*!< Min index of COARSE[6] array.                             */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE: Trim value for SYSCTRL.HSFLL121.TRIM.FINE */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                  */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_MaxIndex (5UL) /*!< Max index of FINE[6] array.                                 */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_MinIndex (0UL) /*!< Min index of FINE[6] array.                                 */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SYSCTRL_HSFLL121_TRIM_TCOEF: Trim value for SYSCTRL.HSFLL121.TRIM.TCOEF */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_TCOEF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TCOEF register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_TCOEF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_TCOEF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL121_TRIM_TCOEF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SYSCTRL_HSFLL121 ============================================ */
/**
  * @brief HSFLL121 [FICR_TRIM_SYSCTRL_HSFLL121] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_HSFLL121_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_HSFLL121_Type;               /*!< Size = 56 (0x038)                                                    */


/* ======================================= Struct FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR ======================================== */
/**
  * @brief REPAIR [FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BITLINE;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.MEMCONF120.REPAIR[n].BITLINE   */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_Type;      /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_MaxCount (19UL) /*!< Size of REPAIR[19] array.                                   */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_MaxIndex (18UL) /*!< Max index of REPAIR[19] array.                              */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_MinIndex (0UL) /*!< Min index of REPAIR[19] array.                               */

/* FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE: Trim value for SYSCTRL.MEMCONF120.REPAIR[n].BITLINE */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BITLINE register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ====================================== Struct FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE ====================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.MEMCONF120.BLOCKTYPE[n].TRIM   */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_Type;   /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_MaxCount (8UL) /*!< Size of BLOCKTYPE[8] array.                               */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_MaxIndex (7UL) /*!< Max index of BLOCKTYPE[8] array.                          */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_MinIndex (0UL) /*!< Min index of BLOCKTYPE[8] array.                          */

/* FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM: Trim value for SYSCTRL.MEMCONF120.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_MEMCONF120 =========================================== */
/**
  * @brief MEMCONF120 [FICR_TRIM_SYSCTRL_MEMCONF120] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_Type REPAIR[19]; /*!< (@ 0x00000000) (unspecified)                             */
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_Type BLOCKTYPE[8]; /*!< (@ 0x0000004C) (unspecified)                        */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF120_Type;             /*!< Size = 108 (0x06C)                                                   */


