adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ====================================== Struct FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE ====================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.MEMCONF130.BLOCKTYPE[n].TRIM   */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_Type;   /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_MaxCount (3UL) /*!< Size of BLOCKTYPE[3] array.                               */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_MaxIndex (2UL) /*!< Max index of BLOCKTYPE[3] array.                          */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_MinIndex (0UL) /*!< Min index of BLOCKTYPE[3] array.                          */

/* FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM: Trim value for SYSCTRL.MEMCONF130.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SYSCTRL_MEMCONF130 =========================================== */
/**
  * @brief MEMCONF130 [FICR_TRIM_SYSCTRL_MEMCONF130] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_Type BLOCKTYPE[3]; /*!< (@ 0x00000000) (unspecified)                        */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF130_Type;             /*!< Size = 12 (0x00C)                                                    */


/* ================================================ Struct FICR_TRIM_SYSCTRL ================================================= */
/**
  * @brief SYSCTRL [FICR_TRIM_SYSCTRL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_FLL16M_Type FLL16M;    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_LFRC_Type LFRC;        /*!< (@ 0x00000018) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_LFXO_Type LFXO;        /*!< (@ 0x0000001C) (unspecified)                                         */
  __IM  uint32_t  RESERVED[3];
  __IOM NRF_FICR_TRIM_SYSCTRL_LFLPRC_Type LFLPRC;    /*!< (@ 0x0000003C) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETPOF5V0_Type VDETPOF5V0; /*!< (@ 0x0000004C) (unspecified)                                    */
  __IM  uint32_t  RESERVED1;
  __IOM NRF_FICR_TRIM_SYSCTRL_HFXO_Type HFXO;        /*!< (@ 0x00000054) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_AUDIOPLL_Type AUDIOPLL; /*!< (@ 0x00000074) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_AUDIOPLLPM_Type AUDIOPLLPM; /*!< (@ 0x00000078) (unspecified)                                    */
  __IOM NRF_FICR_TRIM_SYSCTRL_USBHSPLL_Type USBHSPLL; /*!< (@ 0x0000007C) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_MBIAS_Type MBIAS;      /*!< (@ 0x00000080) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_OSCRFR_Type OSCRFR;    /*!< (@ 0x0000008C) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREG1V0_Type VREG1V0;  /*!< (@ 0x00000094) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGAO0V8_Type VREGAO0V8; /*!< (@ 0x000000A8) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGAO1V8_Type VREGAO1V8; /*!< (@ 0x000000BC) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMAIN_Type VREGMAIN; /*!< (@ 0x000000CC) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMRAM130_Type VREGMRAM130; /*!< (@ 0x00000104) (unspecified)                                  */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMRAM131_Type VREGMRAM131; /*!< (@ 0x00000114) (unspecified)                                  */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGVS0V8_Type VREGVS0V8; /*!< (@ 0x00000124) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGUSB_Type VREGUSB;  /*!< (@ 0x00000134) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO0V8_Type VDETAO0V8; /*!< (@ 0x00000144) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO1V8_Type VDETAO1V8; /*!< (@ 0x00000150) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETVS0V8_Type VDETVS0V8; /*!< (@ 0x00000158) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO5V0_Type VDETAO5V0; /*!< (@ 0x00000160) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDET1V0_Type VDET1V0;  /*!< (@ 0x00000164) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_HSFLL120_Type HSFLL120; /*!< (@ 0x00000168) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_HSFLL121_Type HSFLL121; /*!< (@ 0x000001A0) (unspecified)                                        */
  __IM  uint32_t  RESERVED2[14];
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF120_Type MEMCONF120; /*!< (@ 0x00000210) (unspecified)                                    */
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF130_Type MEMCONF130; /*!< (@ 0x0000027C) (unspecified)                                    */
} NRF_FICR_TRIM_SYSCTRL_Type;                        /*!< Size = 648 (0x288)                                                   */


/* ============================================== Struct FICR_TRIM_GLOBAL_SAADC ============================================== */
/**
  * @brief SAADC [FICR_TRIM_GLOBAL_SAADC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CAL[3];                            /*!< (@ 0x00000000) Trim value for GLOBAL.SAADC.CAL                       */
  __IM  uint32_t  CALREF;                            /*!< (@ 0x0000000C) Trim value for GLOBAL.SAADC.CALREF                    */
  __IM  uint32_t  LINCALCOEFF[6];                    /*!< (@ 0x00000010) Trim value for GLOBAL.SAADC.TRIM.LINCALCOEFF          */
} NRF_FICR_TRIM_GLOBAL_SAADC_Type;                   /*!< Size = 40 (0x028)                                                    */

/* FICR_TRIM_GLOBAL_SAADC_CAL: Trim value for GLOBAL.SAADC.CAL */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_MaxCount (3UL)  /*!< Max size of CAL[3] array.                                            */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_MaxIndex (2UL)  /*!< Max index of CAL[3] array.                                           */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_MinIndex (0UL)  /*!< Min index of CAL[3] array.                                           */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CAL[3] register.                            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CAL_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* FICR_TRIM_GLOBAL_SAADC_CALREF: Trim value for GLOBAL.SAADC.CALREF */
  #define FICR_TRIM_GLOBAL_SAADC_CALREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALREF register.                         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_GLOBAL_SAADC_CALREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALREF_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF: Trim value for GLOBAL.SAADC.TRIM.LINCALCOEFF */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxCount (6UL) /*!< Max size of LINCALCOEFF[6] array.                             */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxIndex (5UL) /*!< Max index of LINCALCOEFF[6] array.                            */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MinIndex (0UL) /*!< Min index of LINCALCOEFF[6] array.                            */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LINCALCOEFF[6] register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================== Struct FICR_TRIM_GLOBAL_TEMP =============================================== */
/**
  * @brief TEMP [FICR_TRIM_GLOBAL_TEMP] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CALIB;                             /*!< (@ 0x00000000) Trim value for GLOBAL.TEMP.CALIB                      */
} NRF_FICR_TRIM_GLOBAL_TEMP_Type;                    /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_TEMP_CALIB: Trim value for GLOBAL.TEMP.CALIB */
  #define FICR_TRIM_GLOBAL_TEMP_CALIB_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALIB register.                            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_TEMP_CALIB_VALUE_Pos (0UL) /*!< Position of VALUE field.                                            */
  #define FICR_TRIM_GLOBAL_TEMP_CALIB_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_TEMP_CALIB_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/



/* ============================================== Struct FICR_TRIM_GLOBAL_NFCT =============================================== */
/**
  * @brief NFCT [FICR_TRIM_GLOBAL_NFCT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BIASCFG;                           /*!< (@ 0x00000000) Trim value for NFCT.BIASCFG                           */
} NRF_FICR_TRIM_GLOBAL_NFCT_Type;                    /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_NFCT_BIASCFG: Trim value for NFCT.BIASCFG */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIASCFG register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* =========================================== Struct FICR_TRIM_GLOBAL_CANPLL_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_GLOBAL_CANPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for GLOBAL.CANPLL.TRIM.CTUNE               */
} NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type;             /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE: Trim value for GLOBAL.CANPLL.TRIM.CTUNE */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_GLOBAL_CANPLL ============================================== */
/**
  * @brief CANPLL [FICR_TRIM_GLOBAL_CANPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type TRIM;  /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_GLOBAL_CANPLL_Type;                  /*!< Size = 4 (0x004)                                                     */


