adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ========================================== Struct FICR_TRIM_GLOBAL_CANPLLPM_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_GLOBAL_CANPLLPM_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VREFPM;                            /*!< (@ 0x00000000) Trim value for GLOBAL.CANPLLPM.TRIM.VREFPM            */
} NRF_FICR_TRIM_GLOBAL_CANPLLPM_TRIM_Type;           /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_CANPLLPM_TRIM_VREFPM: Trim value for GLOBAL.CANPLLPM.TRIM.VREFPM */
  #define FICR_TRIM_GLOBAL_CANPLLPM_TRIM_VREFPM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREFPM register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_CANPLLPM_TRIM_VREFPM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_GLOBAL_CANPLLPM_TRIM_VREFPM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_CANPLLPM_TRIM_VREFPM_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_GLOBAL_CANPLLPM ============================================= */
/**
  * @brief CANPLLPM [FICR_TRIM_GLOBAL_CANPLLPM] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLLPM_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_GLOBAL_CANPLLPM_Type;                /*!< Size = 4 (0x004)                                                     */


/* ============================================== Struct FICR_TRIM_GLOBAL_COMP =============================================== */
/**
  * @brief COMP [FICR_TRIM_GLOBAL_COMP] (unspecified)
  */
typedef struct {
  __IM  uint32_t  REFTRIM;                           /*!< (@ 0x00000000) Trim value for GLOBAL.COMP.REFTRIM                    */
  __IM  uint32_t  RCALTRIM;                          /*!< (@ 0x00000004) Trim value for GLOBAL.COMP.DFT.RCALTRIM               */
} NRF_FICR_TRIM_GLOBAL_COMP_Type;                    /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_GLOBAL_COMP_REFTRIM: Trim value for GLOBAL.COMP.REFTRIM */
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REFTRIM register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_GLOBAL_COMP_RCALTRIM: Trim value for GLOBAL.COMP.DFT.RCALTRIM */
  #define FICR_TRIM_GLOBAL_COMP_RCALTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RCALTRIM register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_COMP_RCALTRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_GLOBAL_COMP_RCALTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_COMP_RCALTRIM_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* ================================================= Struct FICR_TRIM_GLOBAL ================================================= */
/**
  * @brief GLOBAL [FICR_TRIM_GLOBAL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_SAADC_Type SAADC;       /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_TEMP_Type TEMP;         /*!< (@ 0x00000028) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_NFCT_Type NFCT;         /*!< (@ 0x0000002C) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_Type CANPLL;     /*!< (@ 0x00000030) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLLPM_Type CANPLLPM; /*!< (@ 0x00000034) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_COMP_Type COMP;         /*!< (@ 0x00000038) (unspecified)                                         */
} NRF_FICR_TRIM_GLOBAL_Type;                         /*!< Size = 64 (0x040)                                                    */


/* ========================================= Struct FICR_TRIM_APPLICATION_HSFLL_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_APPLICATION_HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for APPLICATION.HSFLL.TRIM.VSUP            */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for APPLICATION.HSFLL.TRIM.COARSE          */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for APPLICATION.HSFLL.TRIM.FINE            */
  __IM  uint32_t  TCOEF;                             /*!< (@ 0x00000034) Trim value for APPLICATION.HSFLL.TRIM.TCOEF           */
} NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_Type;         /*!< Size = 56 (0x038)                                                    */

/* FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP: Trim value for APPLICATION.HSFLL.TRIM.VSUP */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE: Trim value for APPLICATION.HSFLL.TRIM.COARSE */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                             */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MaxIndex (5UL) /*!< Max index of COARSE[6] array.                            */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MinIndex (0UL) /*!< Min index of COARSE[6] array.                            */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE: Trim value for APPLICATION.HSFLL.TRIM.FINE */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                 */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MaxIndex (5UL) /*!< Max index of FINE[6] array.                                */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MinIndex (0UL) /*!< Min index of FINE[6] array.                                */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_APPLICATION_HSFLL_TRIM_TCOEF: Trim value for APPLICATION.HSFLL.TRIM.TCOEF */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_TCOEF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TCOEF register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_TCOEF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_TCOEF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_TCOEF_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_APPLICATION_HSFLL ============================================ */
/**
  * @brief HSFLL [FICR_TRIM_APPLICATION_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_APPLICATION_HSFLL_Type;              /*!< Size = 56 (0x038)                                                    */


/* ===================================== Struct FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE ====================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for APPLICATION.MEMCONF.BLOCKTYPE[n].TRIM  */
} NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_Type;  /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MaxCount (4UL) /*!< Size of BLOCKTYPE[4] array.                              */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MaxIndex (3UL) /*!< Max index of BLOCKTYPE[4] array.                         */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MinIndex (0UL) /*!< Min index of BLOCKTYPE[4] array.                         */

/* FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM: Trim value for APPLICATION.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                           */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ========================================== Struct FICR_TRIM_APPLICATION_MEMCONF =========================================== */
/**
  * @brief MEMCONF [FICR_TRIM_APPLICATION_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[4]; /*!< (@ 0x00000000) (unspecified)                       */
} NRF_FICR_TRIM_APPLICATION_MEMCONF_Type;            /*!< Size = 16 (0x010)                                                    */


/* ============================================== Struct FICR_TRIM_APPLICATION =============================================== */
/**
  * @brief APPLICATION [FICR_TRIM_APPLICATION] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_HSFLL_Type HSFLL;  /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_APPLICATION_MEMCONF_Type MEMCONF; /*!< (@ 0x00000038) (unspecified)                                      */
} NRF_FICR_TRIM_APPLICATION_Type;                    /*!< Size = 72 (0x048)                                                    */


/* ========================================== Struct FICR_TRIM_RADIOCORE_HSFLL_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_RADIOCORE_HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for RADIOCORE.HSFLL.TRIM.VSUP              */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for RADIOCORE.HSFLL.TRIM.COARSE            */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for RADIOCORE.HSFLL.TRIM.FINE              */
  __IM  uint32_t  TCOEF;                             /*!< (@ 0x00000034) Trim value for RADIOCORE.HSFLL.TRIM.TCOEF             */
} NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_Type;           /*!< Size = 56 (0x038)                                                    */

/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP: Trim value for RADIOCORE.HSFLL.TRIM.VSUP */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE: Trim value for RADIOCORE.HSFLL.TRIM.COARSE */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                               */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_MaxIndex (5UL) /*!< Max index of COARSE[6] array.                              */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_MinIndex (0UL) /*!< Min index of COARSE[6] array.                              */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE: Trim value for RADIOCORE.HSFLL.TRIM.FINE */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                   */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_MaxIndex (5UL) /*!< Max index of FINE[6] array.                                  */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_MinIndex (0UL) /*!< Min index of FINE[6] array.                                  */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_TCOEF: Trim value for RADIOCORE.HSFLL.TRIM.TCOEF */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_TCOEF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TCOEF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_TCOEF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_TCOEF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_TCOEF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_RADIOCORE_HSFLL ============================================= */
/**
  * @brief HSFLL [FICR_TRIM_RADIOCORE_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_RADIOCORE_HSFLL_Type;                /*!< Size = 56 (0x038)                                                    */


