adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ====================================== Struct FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE ======================================= */
/**
  * @brief BLOCKTYPE [FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for RADIOCORE.MEMCONF.BLOCKTYPE[n].TRIM    */
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type;    /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MaxCount (4UL) /*!< Size of BLOCKTYPE[4] array.                                */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MaxIndex (3UL) /*!< Max index of BLOCKTYPE[4] array.                           */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MinIndex (0UL) /*!< Min index of BLOCKTYPE[4] array.                           */

/* FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM: Trim value for RADIOCORE.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_RADIOCORE_MEMCONF ============================================ */
/**
  * @brief MEMCONF [FICR_TRIM_RADIOCORE_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[4]; /*!< (@ 0x00000000) (unspecified)                         */
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type;              /*!< Size = 16 (0x010)                                                    */


/* ======================================= Struct FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA ======================================== */
/**
  * @brief SPHYNXANA [FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA] (unspecified)
  */
typedef struct {
  __IM  uint32_t  FSCTRL0;                           /*!< (@ 0x00000000) Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL0      */
  __IM  uint32_t  FSCTRL1;                           /*!< (@ 0x00000004) Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL1      */
  __IM  uint32_t  FSCTRL2;                           /*!< (@ 0x00000008) Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL2      */
  __IM  uint32_t  RXCTRL;                            /*!< (@ 0x0000000C) Trim value for RADIOCORE.RADIO.SPHYNXANA.RXCTRL       */
  __IM  uint32_t  OVRRXTRIMCODE;                     /*!< (@ 0x00000010) Trim value for RADIOCORE.RADIO.SPHYNXANA.OVRRXTRIMCODE*/
} NRF_FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_Type;      /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0: Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL0 */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FSCTRL0 register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1: Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL1 */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FSCTRL1 register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2: Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL2 */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FSCTRL2 register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL: Trim value for RADIOCORE.RADIO.SPHYNXANA.RXCTRL */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RXCTRL register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE: Trim value for RADIOCORE.RADIO.SPHYNXANA.OVRRXTRIMCODE */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OVRRXTRIMCODE
                                                                            register.*/

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Pos (0UL) /*!< Position of VALUE field.                      */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



