adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ========================================= Struct FICR_TRIM_RADIOCORE_RADIO_RXAGC ========================================== */
/**
  * @brief RXAGC [FICR_TRIM_RADIOCORE_RADIO_RXAGC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CALIBRATION;                       /*!< (@ 0x00000000) RADIOCORE.RADIO.RXAGC.CALIBRATION                     */
} NRF_FICR_TRIM_RADIOCORE_RADIO_RXAGC_Type;          /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION: RADIOCORE.RADIO.RXAGC.CALIBRATION */
  #define FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALIBRATION register.      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_RADIOCORE_RADIO ============================================= */
/**
  * @brief RADIO [FICR_TRIM_RADIOCORE_RADIO] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_Type SPHYNXANA; /*!< (@ 0x00000000) (unspecified)                              */
  __IOM NRF_FICR_TRIM_RADIOCORE_RADIO_RXAGC_Type RXAGC; /*!< (@ 0x00000014) (unspecified)                                      */
  __IM  uint32_t  PVTTOT;                            /*!< (@ 0x00000018) Trim value for RADIOCORE.RADIO.PVTTOT                 */
  __IM  uint32_t  KDTC;                              /*!< (@ 0x0000001C) Trim value for RADIOCORE.RADIO.KDTC                   */
  __IM  uint32_t  TXHFGAIN;                          /*!< (@ 0x00000020) Trim value for RADIOCORE.RADIO.TXHFGAIN               */
  __IM  uint32_t  PVTTOFIX;                          /*!< (@ 0x00000024) Trim value for RADIOCORE.RADIO.PVTTOFIX               */
  __IM  uint32_t  LOOPGAIN;                          /*!< (@ 0x00000028) Trim value for RADIOCORE.RADIO.ADPLLTRIMCOMMAND0      */
} NRF_FICR_TRIM_RADIOCORE_RADIO_Type;                /*!< Size = 44 (0x02C)                                                    */

/* FICR_TRIM_RADIOCORE_RADIO_PVTTOT: Trim value for RADIOCORE.RADIO.PVTTOT */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PVTTOT register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOT_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_PVTTOT_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_KDTC: Trim value for RADIOCORE.RADIO.KDTC */
  #define FICR_TRIM_RADIOCORE_RADIO_KDTC_ResetValue (0xFFFFFFFFUL) /*!< Reset value of KDTC register.                          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_KDTC_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_RADIOCORE_RADIO_KDTC_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_KDTC_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN: Trim value for RADIOCORE.RADIO.TXHFGAIN */
  #define FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TXHFGAIN register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX: Trim value for RADIOCORE.RADIO.PVTTOFIX */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PVTTOFIX register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN: Trim value for RADIOCORE.RADIO.ADPLLTRIMCOMMAND0 */
  #define FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOOPGAIN register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* =============================================== Struct FICR_TRIM_RADIOCORE ================================================ */
/**
  * @brief RADIOCORE [FICR_TRIM_RADIOCORE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_HSFLL_Type HSFLL;    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type MEMCONF; /*!< (@ 0x00000038) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_RADIOCORE_RADIO_Type RADIO;    /*!< (@ 0x00000048) (unspecified)                                         */
} NRF_FICR_TRIM_RADIOCORE_Type;                      /*!< Size = 116 (0x074)                                                   */


/* ====================================== Struct FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL ======================================= */
/**
  * @brief DRIVECTRL [FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  P[2];                              /*!< (@ 0x00000000) Trim value for GPIO.Pn.PORTCNF.DRIVECTRL              */
} NRF_FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_Type;    /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_P: Trim value for GPIO.Pn.PORTCNF.DRIVECTRL */
  #define FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_P_MaxCount (2UL) /*!< Max size of P[2] array.                                  */
  #define FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_P_MaxIndex (1UL) /*!< Max index of P[2] array.                                 */
  #define FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_P_MinIndex (0UL) /*!< Min index of P[2] array.                                 */
  #define FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_P_ResetValue (0xFFFFFFFFUL) /*!< Reset value of P[2] register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_P_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_P_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_P_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_BOOT_GPIO_PORTCNF ============================================ */
/**
  * @brief PORTCNF [FICR_TRIM_BOOT_GPIO_PORTCNF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL_Type DRIVECTRL; /*!< (@ 0x00000000) (unspecified)                            */
} NRF_FICR_TRIM_BOOT_GPIO_PORTCNF_Type;              /*!< Size = 8 (0x008)                                                     */


/* =============================================== Struct FICR_TRIM_BOOT_GPIO ================================================ */
/**
  * @brief GPIO [FICR_TRIM_BOOT_GPIO] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_BOOT_GPIO_PORTCNF_Type PORTCNF; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_BOOT_GPIO_Type;                      /*!< Size = 8 (0x008)                                                     */


