adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ============================================== Struct FICR_TRIM_BOOT_VREG1V0 ============================================== */
/**
  * @brief VREG1V0 [FICR_TRIM_BOOT_VREG1V0] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VOUTHPRADIOHELPER;                 /*!< (@ 0x00000000) Config value for SYSCTRL.VREG1V0.VOUTHPRADIO when
                                                                         VREG1V0 used in Helper mode*/
  __IM  uint32_t  VOUTHPNOMINAL;                     /*!< (@ 0x00000004) Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL        */
} NRF_FICR_TRIM_BOOT_VREG1V0_Type;                   /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_BOOT_VREG1V0_VOUTHPRADIOHELPER: Config value for SYSCTRL.VREG1V0.VOUTHPRADIO when VREG1V0 used in Helper mode */
  #define FICR_TRIM_BOOT_VREG1V0_VOUTHPRADIOHELPER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VOUTHPRADIOHELPER register.   */

/* VALUE @Bits 0..31 : Config value */
  #define FICR_TRIM_BOOT_VREG1V0_VOUTHPRADIOHELPER_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_BOOT_VREG1V0_VOUTHPRADIOHELPER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_VREG1V0_VOUTHPRADIOHELPER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_BOOT_VREG1V0_VOUTHPNOMINAL: Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL */
  #define FICR_TRIM_BOOT_VREG1V0_VOUTHPNOMINAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VOUTHPNOMINAL register.           */

/* VALUE @Bits 0..31 : Config value */
  #define FICR_TRIM_BOOT_VREG1V0_VOUTHPNOMINAL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_BOOT_VREG1V0_VOUTHPNOMINAL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_VREG1V0_VOUTHPNOMINAL_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_BOOT_HSFLL120_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_BOOT_HSFLL120_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.HSFLL120.TRIM.VSUP             */
  __IM  uint32_t  COARSE;                            /*!< (@ 0x00000004) Trim value for SYSCTRL.HSFLL120.TRIM.COARSE           */
  __IM  uint32_t  FINE;                              /*!< (@ 0x00000008) Trim value for SYSCTRL.HSFLL120.TRIM.FINE             */
  __IM  uint32_t  TCOEF;                             /*!< (@ 0x0000000C) Trim value for SYSCTRL.HSFLL120.TRIM.TCOEF            */
} NRF_FICR_TRIM_BOOT_HSFLL120_TRIM_Type;             /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_BOOT_HSFLL120_TRIM_VSUP: Trim value for SYSCTRL.HSFLL120.TRIM.VSUP */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_HSFLL120_TRIM_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_BOOT_HSFLL120_TRIM_COARSE: Trim value for SYSCTRL.HSFLL120.TRIM.COARSE */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_HSFLL120_TRIM_COARSE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_BOOT_HSFLL120_TRIM_FINE: Trim value for SYSCTRL.HSFLL120.TRIM.FINE */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE register.                       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_HSFLL120_TRIM_FINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_BOOT_HSFLL120_TRIM_TCOEF: Trim value for SYSCTRL.HSFLL120.TRIM.TCOEF */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_TCOEF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TCOEF register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_TCOEF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_BOOT_HSFLL120_TRIM_TCOEF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_HSFLL120_TRIM_TCOEF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_BOOT_HSFLL120 ============================================== */
/**
  * @brief HSFLL120 [FICR_TRIM_BOOT_HSFLL120] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_BOOT_HSFLL120_TRIM_Type TRIM;  /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_BOOT_HSFLL120_Type;                  /*!< Size = 16 (0x010)                                                    */


/* =============================================== Struct FICR_TRIM_BOOT_OTPC ================================================ */
/**
  * @brief OTPC [FICR_TRIM_BOOT_OTPC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  WAITSTATES;                        /*!< (@ 0x00000000) Config value for GLOBAL.OTPC.WAITSTATES               */
  __IM  uint32_t  FREQUENCY;                         /*!< (@ 0x00000004) Config value for GLOBAL.OTPC.FREQUENCY                */
} NRF_FICR_TRIM_BOOT_OTPC_Type;                      /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_BOOT_OTPC_WAITSTATES: Config value for GLOBAL.OTPC.WAITSTATES */
  #define FICR_TRIM_BOOT_OTPC_WAITSTATES_ResetValue (0xFFFFFFFFUL) /*!< Reset value of WAITSTATES register.                    */

/* WAITSTATES @Bits 0..31 : Waitstates */
  #define FICR_TRIM_BOOT_OTPC_WAITSTATES_WAITSTATES_Pos (0UL) /*!< Position of WAITSTATES field.                               */
  #define FICR_TRIM_BOOT_OTPC_WAITSTATES_WAITSTATES_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_OTPC_WAITSTATES_WAITSTATES_Pos) /*!< Bit
                                                                            mask of WAITSTATES field.*/


/* FICR_TRIM_BOOT_OTPC_FREQUENCY: Config value for GLOBAL.OTPC.FREQUENCY */
  #define FICR_TRIM_BOOT_OTPC_FREQUENCY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FREQUENCY register.                      */

