adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ============================================== Struct FICR_TRIM_SECURE_HSFLL ============================================== */
/**
  * @brief HSFLL [FICR_TRIM_SECURE_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_HSFLL_TRIM_Type TRIM;   /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SECURE_HSFLL_Type;                   /*!< Size = 52 (0x034)                                                    */


/* ========================================== Struct FICR_TRIM_SECURE_HSFLL200_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SECURE_HSFLL200_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SECURE.HSFLL200.TRIM.VSUP              */
  __IM  uint32_t  COARSE[4];                         /*!< (@ 0x00000004) Trim value for SECURE.HSFLL200.TRIM.COARSE            */
  __IM  uint32_t  FINE[4];                           /*!< (@ 0x00000014) Trim value for SECURE.HSFLL200.TRIM.FINE              */
} NRF_FICR_TRIM_SECURE_HSFLL200_TRIM_Type;           /*!< Size = 36 (0x024)                                                    */

/* FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP: Trim value for SECURE.HSFLL200.TRIM.VSUP */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE: Trim value for SECURE.HSFLL200.TRIM.COARSE */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_MaxCount (4UL) /*!< Max size of COARSE[4] array.                               */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_MaxIndex (3UL) /*!< Max index of COARSE[4] array.                              */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_MinIndex (0UL) /*!< Min index of COARSE[4] array.                              */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[4] register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_SECURE_HSFLL200_TRIM_FINE: Trim value for SECURE.HSFLL200.TRIM.FINE */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_MaxCount (4UL) /*!< Max size of FINE[4] array.                                   */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_MaxIndex (3UL) /*!< Max index of FINE[4] array.                                  */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_MinIndex (0UL) /*!< Min index of FINE[4] array.                                  */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[4] register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_SECURE_HSFLL200 ============================================= */
/**
  * @brief HSFLL200 [FICR_TRIM_SECURE_HSFLL200] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_HSFLL200_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_SECURE_HSFLL200_Type;                /*!< Size = 36 (0x024)                                                    */


/* ======================================== Struct FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE ======================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for SECURE.MEMCONF.BLOCKTYPE[n].TRIM       */
} NRF_FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_Type;       /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_MaxCount (8UL) /*!< Size of BLOCKTYPE[8] array.                                   */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_MaxIndex (7UL) /*!< Max index of BLOCKTYPE[8] array.                              */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_MinIndex (0UL) /*!< Min index of BLOCKTYPE[8] array.                              */

/* FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM: Trim value for SECURE.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_SECURE_MEMCONF ============================================= */
/**
  * @brief MEMCONF [FICR_TRIM_SECURE_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[8]; /*!< (@ 0x00000000) (unspecified)                            */
} NRF_FICR_TRIM_SECURE_MEMCONF_Type;                 /*!< Size = 32 (0x020)                                                    */


/* ====================================== Struct FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE ======================================= */
/**
  * @brief BLOCKTYPE [FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for SECURE.MEMCONF200.BLOCKTYPE.TRIM       */
} NRF_FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_Type;    /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM: Trim value for SECURE.MEMCONF200.BLOCKTYPE.TRIM */
  #define FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_SECURE_MEMCONF200 ============================================ */
/**
  * @brief MEMCONF200 [FICR_TRIM_SECURE_MEMCONF200] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_Type BLOCKTYPE; /*!< (@ 0x00000000) (unspecified)                            */
} NRF_FICR_TRIM_SECURE_MEMCONF200_Type;              /*!< Size = 4 (0x004)                                                     */


/* =========================================== Struct FICR_TRIM_SECURE_TCOEFS_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_SECURE_TCOEFS_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  HSFLL;                             /*!< (@ 0x00000000) Trim value for SECURE.HSFLL.TRIM.TCOEF                */
  __IM  uint32_t  HSFLL200;                          /*!< (@ 0x00000004) Trim value for SECURE.HSFLL200.TRIM.TCOEF             */
} NRF_FICR_TRIM_SECURE_TCOEFS_TRIM_Type;             /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL: Trim value for SECURE.HSFLL.TRIM.TCOEF */
  #define FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HSFLL register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL200: Trim value for SECURE.HSFLL200.TRIM.TCOEF */
  #define FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL200_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HSFLL200 register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL200_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL200_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_TCOEFS_TRIM_HSFLL200_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_SECURE_TCOEFS ============================================== */
/**
  * @brief TCOEFS [FICR_TRIM_SECURE_TCOEFS] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_TCOEFS_TRIM_Type TRIM;  /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SECURE_TCOEFS_Type;                  /*!< Size = 8 (0x008)                                                     */


/* ================================================= Struct FICR_TRIM_SECURE ================================================= */
/**
  * @brief SECURE [FICR_TRIM_SECURE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_HSFLL_Type HSFLL;       /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SECURE_HSFLL200_Type HSFLL200; /*!< (@ 0x00000034) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SECURE_MEMCONF_Type MEMCONF;   /*!< (@ 0x00000058) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SECURE_MEMCONF200_Type MEMCONF200; /*!< (@ 0x00000078) (unspecified)                                     */
  __IOM NRF_FICR_TRIM_SECURE_TCOEFS_Type TCOEFS;     /*!< (@ 0x0000007C) (unspecified)                                         */
} NRF_FICR_TRIM_SECURE_Type;                         /*!< Size = 132 (0x084)                                                   */


/* ==================================================== Struct FICR_TRIM ===================================================== */
/**
  * @brief TRIM [FICR_TRIM] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_Type SYSCTRL;          /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_Type GLOBAL;            /*!< (@ 0x00000288) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_APPLICATION_Type APPLICATION;  /*!< (@ 0x000002C8) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_RADIOCORE_Type RADIOCORE;      /*!< (@ 0x00000310) (unspecified)                                         */
  __IM  uint32_t  RESERVED[18];
  __IOM NRF_FICR_TRIM_BOOT_Type BOOT;                /*!< (@ 0x000003CC) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_COMMON_Type COMMON;            /*!< (@ 0x000003F4) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SECURE_Type SECURE;            /*!< (@ 0x00000400) (unspecified)                                         */
} NRF_FICR_TRIM_Type;                                /*!< Size = 1156 (0x484)                                                  */


