adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GDCACHERAM00 @Bits 24..31 : GD Cache Data Ram 0 */
  #define FICR_SRAM_REPAIR8_GDCACHERAM00_Pos (24UL)  /*!< Position of GDCACHERAM00 field.                                      */
  #define FICR_SRAM_REPAIR8_GDCACHERAM00_Msk (0xFFUL << FICR_SRAM_REPAIR8_GDCACHERAM00_Pos) /*!< Bit mask of GDCACHERAM00
                                                                            field.*/


/* ======================================================= Struct FICR ======================================================= */
/**
  * @brief Factory Information Configuration Registers
  */
  typedef struct {                                   /*!< FICR Structure                                                       */
    __IOM NRF_FICR_SOCINFO_Type SOCINFO;             /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_FICR_BLE_Type BLE;                     /*!< (@ 0x0000000C) (unspecified)                                         */
    __IM uint32_t RESERVED[2];
    __IOM NRF_FICR_NFC_Type NFC;                     /*!< (@ 0x00000040) (unspecified)                                         */
    __IOM NRF_FICR_INFO_Type INFO;                   /*!< (@ 0x00000050) Device info                                           */
    __IM uint32_t RESERVED1[3];
    __IOM NRF_FICR_PRODTEST_Type PRODTEST;           /*!< (@ 0x00000080) (unspecified)                                         */
    __IM uint32_t RESERVED2[17];
    __IOM NRF_FICR_TRIM_Type TRIM;                   /*!< (@ 0x00000100) (unspecified)                                         */
    __IM uint32_t RESERVED3[7];
    __IOM NRF_FICR_BOOT_Type BOOT;                   /*!< (@ 0x000005A0) (unspecified)                                         */
    __IM uint32_t RESERVED4[3];
    __IOM NRF_FICR_SRAM_Type SRAM;                   /*!< (@ 0x000007B0) (unspecified)                                         */
    __IM uint32_t RESERVED5[10];
    __IOM uint32_t CRC32;                            /*!< (@ 0x000007FC) CRC32 value for FICR (except this word)               */
  } NRF_FICR_Type;                                   /*!< Size = 2048 (0x800)                                                  */

/* FICR_CRC32: CRC32 value for FICR (except this word) */
  #define FICR_CRC32_ResetValue (0x00000000UL)       /*!< Reset value of CRC32 register.                                       */

/* VALUE @Bits 0..31 : CRC32 value */
  #define FICR_CRC32_VALUE_Pos (0UL)                 /*!< Position of VALUE field.                                             */
  #define FICR_CRC32_VALUE_Msk (0xFFFFFFFFUL << FICR_CRC32_VALUE_Pos) /*!< Bit mask of VALUE field.                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          FLL16M                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct FLL16M_CONFIG =================================================== */
/**
  * @brief CONFIG [FLL16M_CONFIG] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CFGCKSW16M;                        /*!< (@ 0x00000004) CKSW16M configuration                                 */
} NRF_FLL16M_CONFIG_Type;                            /*!< Size = 8 (0x008)                                                     */

/* FLL16M_CONFIG_CFGCKSW16M: CKSW16M configuration */
  #define FLL16M_CONFIG_CFGCKSW16M_ResetValue (0x00000000UL) /*!< Reset value of CFGCKSW16M register.                          */

/* SKEW @Bit 0 : configures the delay used in the phasedetector */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_Pos (0UL)    /*!< Position of SKEW field.                                              */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_Msk (0x1UL << FLL16M_CONFIG_CFGCKSW16M_SKEW_Pos) /*!< Bit mask of SKEW field.          */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_Min (0x0UL)  /*!< Min enumerator value of SKEW field.                                  */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_Max (0x1UL)  /*!< Max enumerator value of SKEW field.                                  */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_SkewNeg56kHz (0x0UL) /*!< DCO skew = -56 kHz.                                          */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_SkewNeg160kHz (0x1UL) /*!< DCO skew = -160 kHz.                                        */

/* OVERRIDETRIM @Bit 1 : Enable override trim */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Pos (1UL) /*!< Position of OVERRIDETRIM field.                                 */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Msk (0x1UL << FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Pos) /*!< Bit mask of
                                                                            OVERRIDETRIM field.*/
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Min (0x0UL) /*!< Min enumerator value of OVERRIDETRIM field.                   */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Max (0x1UL) /*!< Max enumerator value of OVERRIDETRIM field.                   */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Disabled (0x0UL) /*!< Override trim is disabled.                               */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Enabled (0x1UL) /*!< Override trim is enabled.                                 */



/* =================================================== Struct FLL16M_FREQM =================================================== */
/**
  * @brief FREQM [FLL16M_FREQM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  DONE;                              /*!< (@ 0x00000000) Frequency measurement done status                     */
  __IM  uint32_t  ERROR;                             /*!< (@ 0x00000004) Frequency measurement error status                    */
  __IM  uint32_t  MEAS;                              /*!< (@ 0x00000008) Frequency measurement                                 */
  __IOM uint32_t  CLOCKSEL;                          /*!< (@ 0x0000000C) Clock select for Frequency measurement                */
} NRF_FLL16M_FREQM_Type;                             /*!< Size = 16 (0x010)                                                    */

/* FLL16M_FREQM_DONE: Frequency measurement done status */
  #define FLL16M_FREQM_DONE_ResetValue (0x00000000UL) /*!< Reset value of DONE register.                                       */

/* DONE @Bit 0 : Measurement done. */
  #define FLL16M_FREQM_DONE_DONE_Pos (0UL)           /*!< Position of DONE field.                                              */
  #define FLL16M_FREQM_DONE_DONE_Msk (0x1UL << FLL16M_FREQM_DONE_DONE_Pos) /*!< Bit mask of DONE field.                        */
  #define FLL16M_FREQM_DONE_DONE_Min (0x0UL)         /*!< Min enumerator value of DONE field.                                  */
  #define FLL16M_FREQM_DONE_DONE_Max (0x1UL)         /*!< Max enumerator value of DONE field.                                  */
  #define FLL16M_FREQM_DONE_DONE_InProgress (0x0UL)  /*!< Frequency measurement is in progress.                                */
  #define FLL16M_FREQM_DONE_DONE_Completed (0x1UL)   /*!< Frequency measurement is completed.                                  */


/* FLL16M_FREQM_ERROR: Frequency measurement error status */
  #define FLL16M_FREQM_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                                     */

/* ERROR @Bit 0 : Error status. */
  #define FLL16M_FREQM_ERROR_ERROR_Pos (0UL)         /*!< Position of ERROR field.                                             */
  #define FLL16M_FREQM_ERROR_ERROR_Msk (0x1UL << FLL16M_FREQM_ERROR_ERROR_Pos) /*!< Bit mask of ERROR field.                   */
  #define FLL16M_FREQM_ERROR_ERROR_Min (0x0UL)       /*!< Min enumerator value of ERROR field.                                 */
  #define FLL16M_FREQM_ERROR_ERROR_Max (0x1UL)       /*!< Max enumerator value of ERROR field.                                 */
  #define FLL16M_FREQM_ERROR_ERROR_OutsideLimit (0x1UL) /*!< Frequency exceeded the accuracy 0.5 percent in closed loop mode.  */
  #define FLL16M_FREQM_ERROR_ERROR_WithinLimit (0x0UL) /*!< Frequency stayed within accuracy 0.5 percent in closed loop mode.  */


/* FLL16M_FREQM_MEAS: Frequency measurement */
  #define FLL16M_FREQM_MEAS_ResetValue (0x00000000UL) /*!< Reset value of MEAS register.                                       */

