adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VALUE @Bits 0..10 : Last frequency measurement value. */
  #define FLL16M_FREQM_MEAS_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define FLL16M_FREQM_MEAS_VALUE_Msk (0x7FFUL << FLL16M_FREQM_MEAS_VALUE_Pos) /*!< Bit mask of VALUE field.                   */


/* FLL16M_FREQM_CLOCKSEL: Clock select for Frequency measurement */
  #define FLL16M_FREQM_CLOCKSEL_ResetValue (0x00000000UL) /*!< Reset value of CLOCKSEL register.                               */

/* CLOCKSEL @Bits 0..1 : Clock select */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Pos (0UL)   /*!< Position of CLOCKSEL field.                                          */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Msk (0x3UL << FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Pos) /*!< Bit mask of CLOCKSEL field.    */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Min (0x0UL) /*!< Min enumerator value of CLOCKSEL field.                              */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Max (0x3UL) /*!< Max enumerator value of CLOCKSEL field.                              */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_DCO16M (0x0UL) /*!< Clock from DCO16M selected.                                       */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_CKSW16M (0x1UL) /*!< Clock from CKSW16M selected.                                     */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_HFXOBy2 (0x2UL) /*!< Clock from 32MHz HFXO divided by 2 selected.                     */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_CKSW16MTestOsc (0x3UL) /*!< Clock from CKSW16M TESTOSC selected.                      */



/* =================================================== Struct FLL16M_TRIM ==================================================== */
/**
  * @brief TRIM [FLL16M_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RCOARSE;                           /*!< (@ 0x00000000) Coarse frequency trimming                             */
  __IOM uint32_t  RFINE;                             /*!< (@ 0x00000004) Fine frequency trimming                               */
  __IOM uint32_t  TCOEF;                             /*!< (@ 0x00000008) Temperature coefficient                               */
  __IOM uint32_t  VSUP;                              /*!< (@ 0x0000000C) DCO16M internal DCO supply                            */
  __IOM uint32_t  CKSW16MTRIM;                       /*!< (@ 0x00000010) CKSW16M trim delay                                    */
} NRF_FLL16M_TRIM_Type;                              /*!< Size = 20 (0x014)                                                    */

/* FLL16M_TRIM_RCOARSE: Coarse frequency trimming */
  #define FLL16M_TRIM_RCOARSE_ResetValue (0x00000000UL) /*!< Reset value of RCOARSE register.                                  */

/* VALUE @Bits 0..4 : Coarse frequency trimming value. */
  #define FLL16M_TRIM_RCOARSE_VALUE_Pos (0UL)        /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_RCOARSE_VALUE_Msk (0x1FUL << FLL16M_TRIM_RCOARSE_VALUE_Pos) /*!< Bit mask of VALUE field.                */


/* FLL16M_TRIM_RFINE: Fine frequency trimming */
  #define FLL16M_TRIM_RFINE_ResetValue (0x00000000UL) /*!< Reset value of RFINE register.                                      */

/* VALUE @Bits 0..7 : Fine frequency trimming value. */
  #define FLL16M_TRIM_RFINE_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_RFINE_VALUE_Msk (0xFFUL << FLL16M_TRIM_RFINE_VALUE_Pos) /*!< Bit mask of VALUE field.                    */


/* FLL16M_TRIM_TCOEF: Temperature coefficient */
  #define FLL16M_TRIM_TCOEF_ResetValue (0x00000000UL) /*!< Reset value of TCOEF register.                                      */

/* VALUE @Bits 0..3 : (unspecified) */
  #define FLL16M_TRIM_TCOEF_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_TCOEF_VALUE_Msk (0xFUL << FLL16M_TRIM_TCOEF_VALUE_Pos) /*!< Bit mask of VALUE field.                     */


/* FLL16M_TRIM_VSUP: DCO16M internal DCO supply */
  #define FLL16M_TRIM_VSUP_ResetValue (0x00000010UL) /*!< Reset value of VSUP register.                                        */

/* VALUE @Bits 0..4 : (unspecified) */
  #define FLL16M_TRIM_VSUP_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_VSUP_VALUE_Msk (0x1FUL << FLL16M_TRIM_VSUP_VALUE_Pos) /*!< Bit mask of VALUE field.                      */


/* FLL16M_TRIM_CKSW16MTRIM: CKSW16M trim delay */
  #define FLL16M_TRIM_CKSW16MTRIM_ResetValue (0x00000000UL) /*!< Reset value of CKSW16MTRIM register.                          */

/* VALUE @Bits 0..3 : (unspecified) */
  #define FLL16M_TRIM_CKSW16MTRIM_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_CKSW16MTRIM_VALUE_Msk (0xFUL << FLL16M_TRIM_CKSW16MTRIM_VALUE_Pos) /*!< Bit mask of VALUE field.         */



/* ================================================= Struct FLL16M_CLOCKCTRL ================================================= */
/**
  * @brief CLOCKCTRL [FLL16M_CLOCKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Clock control                                         */
  __IOM uint32_t  DITHERING;                         /*!< (@ 0x00000004) Clock dithering configuration                         */
  __IOM uint32_t  SLEEP;                             /*!< (@ 0x00000008) Sleep configuration                                   */
  __IOM uint32_t  RETAINFINETRIM;                    /*!< (@ 0x0000000C) Fine trim retain control                              */
  __IOM uint32_t  OVERRIDELOCKED;                    /*!< (@ 0x00000010) Override the LOCKED signal                            */
  __IOM uint32_t  REFCLOCK;                          /*!< (@ 0x00000014) Reference clock configuration                         */
  __IOM uint32_t  DEFAULTSLOPE;                      /*!< (@ 0x00000018) Default slope value for FLL16M                        */
  __IOM uint32_t  FREQMEASLIMIT;                     /*!< (@ 0x0000001C) Frequency measurement limit                           */
  __IOM uint32_t  OVERRIDECSR;                       /*!< (@ 0x00000020) Override clockSourceRunning output                    */
} NRF_FLL16M_CLOCKCTRL_Type;                         /*!< Size = 36 (0x024)                                                    */

