adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FLL16M_CLOCKCTRL_MODE: Clock control */
  #define FLL16M_CLOCKCTRL_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                   */

/* MODE @Bits 0..2 : The FLL16M operating mode. */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Pos (0UL)       /*!< Position of MODE field.                                              */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Msk (0x7UL << FLL16M_CLOCKCTRL_MODE_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Max (0x4UL)     /*!< Max enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Auto (0x0UL)    /*!< The PCGC controls the mode automatically.                            */
  #define FLL16M_CLOCKCTRL_MODE_MODE_OpenLoop (0x1UL) /*!< Open loop mode.                                                     */
  #define FLL16M_CLOCKCTRL_MODE_MODE_ClosedLoop (0x2UL) /*!< Closed loop mode.                                                 */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Refresh (0x3UL) /*!< Refresh mode.                                                        */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Bypass (0x4UL)  /*!< Bypass mode.                                                         */

/* OVERRIDE @Bit 4 : FLL16M override mode. */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Pos (4UL)   /*!< Position of OVERRIDE field.                                          */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Msk (0x1UL << FLL16M_CLOCKCTRL_MODE_OVERRIDE_Pos) /*!< Bit mask of OVERRIDE field.    */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Min (0x0UL) /*!< Min enumerator value of OVERRIDE field.                              */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Max (0x1UL) /*!< Max enumerator value of OVERRIDE field.                              */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Disabled (0x0UL) /*!< Override mode disabled.                                         */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Enabled (0x1UL) /*!< Override mode enabled.                                           */

/* CLOCKSEL @Bit 8 : Clock select */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Pos (8UL)   /*!< Position of CLOCKSEL field.                                          */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Msk (0x1UL << FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Pos) /*!< Bit mask of CLOCKSEL field.    */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Min (0x0UL) /*!< Min enumerator value of CLOCKSEL field.                              */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Max (0x1UL) /*!< Max enumerator value of CLOCKSEL field.                              */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_DCO16M (0x0UL) /*!< Clock from DCO16M selected.                                       */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_HFXO (0x1UL) /*!< Clock from HFXO selected.                                           */


/* FLL16M_CLOCKCTRL_DITHERING: Clock dithering configuration */
  #define FLL16M_CLOCKCTRL_DITHERING_ResetValue (0x00096733UL) /*!< Reset value of DITHERING register.                         */

/* CYCLECOUNT @Bits 0..2 : Cycle count configuration for clock dithering */
  #define FLL16M_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos (0UL) /*!< Position of CYCLECOUNT field.                                   */
  #define FLL16M_CLOCKCTRL_DITHERING_CYCLECOUNT_Msk (0x7UL << FLL16M_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos) /*!< Bit mask of
                                                                            CYCLECOUNT field.*/

/* MAXOFFSET @Bits 4..6 : Maximum offset configuration for clock dithering */
  #define FLL16M_CLOCKCTRL_DITHERING_MAXOFFSET_Pos (4UL) /*!< Position of MAXOFFSET field.                                     */
  #define FLL16M_CLOCKCTRL_DITHERING_MAXOFFSET_Msk (0x7UL << FLL16M_CLOCKCTRL_DITHERING_MAXOFFSET_Pos) /*!< Bit mask of
                                                                            MAXOFFSET field.*/

/* INITVALUE @Bits 8..19 : Initial value for the dithering */
  #define FLL16M_CLOCKCTRL_DITHERING_INITVALUE_Pos (8UL) /*!< Position of INITVALUE field.                                     */
  #define FLL16M_CLOCKCTRL_DITHERING_INITVALUE_Msk (0xFFFUL << FLL16M_CLOCKCTRL_DITHERING_INITVALUE_Pos) /*!< Bit mask of
                                                                            INITVALUE field.*/

/* EN @Bit 31 : Enable the clock dithering */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Msk (0x1UL << FLL16M_CLOCKCTRL_DITHERING_EN_Pos) /*!< Bit mask of EN field.            */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Disabled (0x0UL) /*!< Clock dithering is disabled                                      */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Enabled (0x1UL) /*!< Clock dithering is enabled                                        */


/* FLL16M_CLOCKCTRL_SLEEP: Sleep configuration */
  #define FLL16M_CLOCKCTRL_SLEEP_ResetValue (0x00000000UL) /*!< Reset value of SLEEP register.                                 */

/* MODE @Bit 0 : FLL16M sleep mode. */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Pos (0UL)      /*!< Position of MODE field.                                              */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Msk (0x1UL << FLL16M_CLOCKCTRL_SLEEP_MODE_Pos) /*!< Bit mask of MODE field.              */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Min (0x0UL)    /*!< Min enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Max (0x1UL)    /*!< Max enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Normal (0x0UL) /*!< Normal mode operation                                                */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Sleep (0x1UL)  /*!< Power down the FLL16M core                                           */

/* RETDCO16M @Bit 1 : Retain DCO16M. */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Pos (1UL) /*!< Position of RETDCO16M field.                                         */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Msk (0x1UL << FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Pos) /*!< Bit mask of RETDCO16M
                                                                            field.*/
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Min (0x0UL) /*!< Min enumerator value of RETDCO16M field.                           */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Max (0x1UL) /*!< Max enumerator value of RETDCO16M field.                           */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Disabled (0x0UL) /*!< No retention while powered down                               */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Enabled (0x1UL) /*!< Retain all inputs while powered down                           */

/* RETCKSW16M @Bit 2 : Retain CKSW16M. */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Pos (2UL) /*!< Position of RETCKSW16M field.                                       */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Msk (0x1UL << FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Pos) /*!< Bit mask of RETCKSW16M
                                                                            field.*/
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Min (0x0UL) /*!< Min enumerator value of RETCKSW16M field.                         */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Max (0x1UL) /*!< Max enumerator value of RETCKSW16M field.                         */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Disabled (0x0UL) /*!< No retention while powered down                              */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Enabled (0x1UL) /*!< Retain all inputs while powered down                          */


/* FLL16M_CLOCKCTRL_RETAINFINETRIM: Fine trim retain control */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_ResetValue (0x00000000UL) /*!< Reset value of RETAINFINETRIM register.               */

