adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RETAIN @Bit 0 : Retain control */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos (0UL) /*!< Position of RETAIN field.                                      */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Msk (0x1UL << FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos) /*!< Bit mask of
                                                                            RETAIN field.*/
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Min (0x0UL) /*!< Min enumerator value of RETAIN field.                        */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Max (0x1UL) /*!< Max enumerator value of RETAIN field.                        */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_NoRetain (0x0UL) /*!< No retain.                                              */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Retain (0x1UL) /*!< Retain control when FLL16M goes to open-loop mode.        */


/* FLL16M_CLOCKCTRL_OVERRIDELOCKED: Override the LOCKED signal */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDELOCKED register.               */

/* OVERRIDE @Bit 0 : Override */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos (0UL) /*!< Position of OVERRIDE field.                                  */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Msk (0x1UL << FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos) /*!< Bit mask of
                                                                            OVERRIDE field.*/
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Min (0x0UL) /*!< Min enumerator value of OVERRIDE field.                    */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Max (0x1UL) /*!< Max enumerator value of OVERRIDE field.                    */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_NoOperation (0x0UL) /*!< No Operation.                                      */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Override (0x1UL) /*!< Override                                              */


/* FLL16M_CLOCKCTRL_REFCLOCK: Reference clock configuration */
  #define FLL16M_CLOCKCTRL_REFCLOCK_ResetValue (0x00000000UL) /*!< Reset value of REFCLOCK register.                           */

/* SELREF @Bit 0 : Selection for the reference clock signal in software controlled mode */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Pos (0UL) /*!< Position of SELREF field.                                            */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Msk (0x1UL << FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Pos) /*!< Bit mask of SELREF field.  */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Min (0x0UL) /*!< Min enumerator value of SELREF field.                              */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Max (0x1UL) /*!< Max enumerator value of SELREF field.                              */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Clock32Ki (0x0UL) /*!< The 32Ki clock selected                                      */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Clock16M (0x1UL) /*!< The 16MHz clock selected                                      */

/* DISABLE32KI @Bit 1 : Disable the 32Ki reference clock */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Pos (1UL) /*!< Position of DISABLE32KI field.                                  */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Msk (0x1UL << FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Pos) /*!< Bit mask of
                                                                            DISABLE32KI field.*/
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Min (0x0UL) /*!< Min enumerator value of DISABLE32KI field.                    */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Max (0x1UL) /*!< Max enumerator value of DISABLE32KI field.                    */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Enable (0x0UL) /*!< The 32Ki reference clock is enabled                        */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Disable (0x1UL) /*!< The 32Ki reference clock is disabled                      */


/* FLL16M_CLOCKCTRL_DEFAULTSLOPE: Default slope value for FLL16M */
  #define FLL16M_CLOCKCTRL_DEFAULTSLOPE_ResetValue (0x00000040UL) /*!< Reset value of DEFAULTSLOPE register.                   */

/* VALUE @Bits 0..8 : Slope value */
  #define FLL16M_CLOCKCTRL_DEFAULTSLOPE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FLL16M_CLOCKCTRL_DEFAULTSLOPE_VALUE_Msk (0x1FFUL << FLL16M_CLOCKCTRL_DEFAULTSLOPE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* FLL16M_CLOCKCTRL_FREQMEASLIMIT: Frequency measurement limit */
  #define FLL16M_CLOCKCTRL_FREQMEASLIMIT_ResetValue (0x00000002UL) /*!< Reset value of FREQMEASLIMIT register.                 */

/* VALUE @Bits 0..2 : Value */
  #define FLL16M_CLOCKCTRL_FREQMEASLIMIT_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FLL16M_CLOCKCTRL_FREQMEASLIMIT_VALUE_Msk (0x7UL << FLL16M_CLOCKCTRL_FREQMEASLIMIT_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* FLL16M_CLOCKCTRL_OVERRIDECSR: Override clockSourceRunning output */
  #define FLL16M_CLOCKCTRL_OVERRIDECSR_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDECSR register.                     */

/* VALUE @Bits 0..2 : Override Value */
  #define FLL16M_CLOCKCTRL_OVERRIDECSR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                           */
  #define FLL16M_CLOCKCTRL_OVERRIDECSR_VALUE_Msk (0x7UL << FLL16M_CLOCKCTRL_OVERRIDECSR_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/

/* EN @Bit 31 : Enable Override */
  #define FLL16M_CLOCKCTRL_OVERRIDECSR_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_CLOCKCTRL_OVERRIDECSR_EN_Msk (0x1UL << FLL16M_CLOCKCTRL_OVERRIDECSR_EN_Pos) /*!< Bit mask of EN field.        */



