adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_EN_Msk (0x1UL << FLL16M_DFT_DCO16M_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                   */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                     */


/* FLL16M_DFT_DCO16M_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                      */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB2 */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                         */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_Msk (0x3UL << FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX
                                                                            field.*/
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_VSS (0x0UL) /*!< VSS selected                                                    */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_SETTLEDDCO16M (0x1UL) /*!< SETTLED_DCO16M_AO_0V8 selected                        */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_READYDCO16M (0x2UL) /*!< READY_DCO16M_AO_0V8 selected                            */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_SELMUX_OSCDIV16INT (0x3UL) /*!< OSC_DIV16_INT_0V8 selected                              */

/* EN @Bit 31 : Enable the digital test bus */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_EN_Msk (0x1UL << FLL16M_DFT_DCO16M_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                   */
  #define FLL16M_DFT_DCO16M_DTB2CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                     */


/* FLL16M_DFT_DCO16M_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                      */

/* SELMUX @Bit 0 : Select multiplexer for DTB3 */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                         */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_SELMUX_Msk (0x1UL << FLL16M_DFT_DCO16M_DTB3CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX
                                                                            field.*/
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_SELMUX_Max (0x1UL) /*!< Max enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_SELMUX_VSS (0x0UL) /*!< VSS selected                                                    */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_SELMUX_SETTLEDDCO16M (0x1UL) /*!< SETTLED_DCO16M_AO_0V8 selected                        */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                            */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << FLL16M_DFT_DCO16M_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask
                                                                            of PWRUPDELTEST field.*/
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.               */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.               */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                 */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                   */

/* EN @Bit 31 : Enable the digital test bus */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_EN_Msk (0x1UL << FLL16M_DFT_DCO16M_DTB3CONFIG_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                   */
  #define FLL16M_DFT_DCO16M_DTB3CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                     */


/* FLL16M_DFT_DCO16M_TCFG: Test mode configuration */
  #define FLL16M_DFT_DCO16M_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                  */

/* TURNOFFINTREG @Bit 0 : Turn off internal regulator */
  #define FLL16M_DFT_DCO16M_TCFG_TURNOFFINTREG_Pos (0UL) /*!< Position of TURNOFFINTREG field.                                 */
  #define FLL16M_DFT_DCO16M_TCFG_TURNOFFINTREG_Msk (0x1UL << FLL16M_DFT_DCO16M_TCFG_TURNOFFINTREG_Pos) /*!< Bit mask of
                                                                            TURNOFFINTREG field.*/
  #define FLL16M_DFT_DCO16M_TCFG_TURNOFFINTREG_Min (0x0UL) /*!< Min enumerator value of TURNOFFINTREG field.                   */
  #define FLL16M_DFT_DCO16M_TCFG_TURNOFFINTREG_Max (0x1UL) /*!< Max enumerator value of TURNOFFINTREG field.                   */
  #define FLL16M_DFT_DCO16M_TCFG_TURNOFFINTREG_Disabled (0x0UL) /*!< (unspecified)                                             */
  #define FLL16M_DFT_DCO16M_TCFG_TURNOFFINTREG_Enabled (0x1UL) /*!< (unspecified)                                              */

/* MUTEOUTCLK @Bit 1 : Mute output clock */
  #define FLL16M_DFT_DCO16M_TCFG_MUTEOUTCLK_Pos (1UL) /*!< Position of MUTEOUTCLK field.                                       */
  #define FLL16M_DFT_DCO16M_TCFG_MUTEOUTCLK_Msk (0x1UL << FLL16M_DFT_DCO16M_TCFG_MUTEOUTCLK_Pos) /*!< Bit mask of MUTEOUTCLK
                                                                            field.*/
  #define FLL16M_DFT_DCO16M_TCFG_MUTEOUTCLK_Min (0x0UL) /*!< Min enumerator value of MUTEOUTCLK field.                         */
  #define FLL16M_DFT_DCO16M_TCFG_MUTEOUTCLK_Max (0x1UL) /*!< Max enumerator value of MUTEOUTCLK field.                         */
  #define FLL16M_DFT_DCO16M_TCFG_MUTEOUTCLK_Disabled (0x0UL) /*!< (unspecified)                                                */
  #define FLL16M_DFT_DCO16M_TCFG_MUTEOUTCLK_Enabled (0x1UL) /*!< (unspecified)                                                 */

/* Spare @Bit 2 : Spare */
  #define FLL16M_DFT_DCO16M_TCFG_Spare_Pos (2UL)     /*!< Position of Spare field.                                             */
  #define FLL16M_DFT_DCO16M_TCFG_Spare_Msk (0x1UL << FLL16M_DFT_DCO16M_TCFG_Spare_Pos) /*!< Bit mask of Spare field.           */
  #define FLL16M_DFT_DCO16M_TCFG_Spare_Min (0x0UL)   /*!< Min enumerator value of Spare field.                                 */
  #define FLL16M_DFT_DCO16M_TCFG_Spare_Max (0x1UL)   /*!< Max enumerator value of Spare field.                                 */
  #define FLL16M_DFT_DCO16M_TCFG_Spare_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define FLL16M_DFT_DCO16M_TCFG_Spare_Enabled (0x1UL) /*!< (unspecified)                                                      */



/* ================================================ Struct FLL16M_DFT_CKSW16M ================================================ */
/**
  * @brief CKSW16M [FLL16M_DFT_CKSW16M] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus configuration                        */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_FLL16M_DFT_CKSW16M_Type;                       /*!< Size = 52 (0x034)                                                    */

/* FLL16M_DFT_CKSW16M_DTBCONFIG: Digital Test Bus configuration */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTBCONFIG register.                       */

/* SELMUX @Bit 0 : Select multiplexer for DTB */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                         */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_SELMUX_Msk (0x1UL << FLL16M_DFT_CKSW16M_DTBCONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX
                                                                            field.*/
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_SELMUX_Max (0x1UL) /*!< Max enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_SELMUX_DTBSel0 (0x0UL) /*!< DTB select 0                                                */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_SELMUX_DTBSel1 (0x1UL) /*!< DTB select 1                                                */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                            */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_PWRUPDELTEST_Msk (0x1UL << FLL16M_DFT_CKSW16M_DTBCONFIG_PWRUPDELTEST_Pos) /*!< Bit mask
                                                                            of PWRUPDELTEST field.*/
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.               */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.               */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                 */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                   */

/* DTB0EN @Bit 28 : Enable digital test bus 0 */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB0EN_Pos (28UL) /*!< Position of DTB0EN field.                                        */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB0EN_Msk (0x1UL << FLL16M_DFT_CKSW16M_DTBCONFIG_DTB0EN_Pos) /*!< Bit mask of DTB0EN
                                                                            field.*/
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB0EN_Min (0x0UL) /*!< Min enumerator value of DTB0EN field.                           */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB0EN_Max (0x1UL) /*!< Max enumerator value of DTB0EN field.                           */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB0EN_Disabled (0x0UL) /*!< Digital test bus is disabled                               */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB0EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                 */

/* DTB1EN @Bit 29 : Enable digital test bus 1 */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB1EN_Pos (29UL) /*!< Position of DTB1EN field.                                        */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB1EN_Msk (0x1UL << FLL16M_DFT_CKSW16M_DTBCONFIG_DTB1EN_Pos) /*!< Bit mask of DTB1EN
                                                                            field.*/
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB1EN_Min (0x0UL) /*!< Min enumerator value of DTB1EN field.                           */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB1EN_Max (0x1UL) /*!< Max enumerator value of DTB1EN field.                           */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB1EN_Disabled (0x0UL) /*!< Digital test bus is disabled                               */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB1EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                 */

/* DTB2EN @Bit 30 : Enable digital test bus 2 */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB2EN_Pos (30UL) /*!< Position of DTB2EN field.                                        */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB2EN_Msk (0x1UL << FLL16M_DFT_CKSW16M_DTBCONFIG_DTB2EN_Pos) /*!< Bit mask of DTB2EN
                                                                            field.*/
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB2EN_Min (0x0UL) /*!< Min enumerator value of DTB2EN field.                           */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB2EN_Max (0x1UL) /*!< Max enumerator value of DTB2EN field.                           */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB2EN_Disabled (0x0UL) /*!< Digital test bus is disabled                               */
  #define FLL16M_DFT_CKSW16M_DTBCONFIG_DTB2EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                 */


/* FLL16M_DFT_CKSW16M_TCFG: Test mode configuration */
  #define FLL16M_DFT_CKSW16M_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                 */

/* TESTMODE @Bits 0..1 : Test mode */
  #define FLL16M_DFT_CKSW16M_TCFG_TESTMODE_Pos (0UL) /*!< Position of TESTMODE field.                                          */
  #define FLL16M_DFT_CKSW16M_TCFG_TESTMODE_Msk (0x3UL << FLL16M_DFT_CKSW16M_TCFG_TESTMODE_Pos) /*!< Bit mask of TESTMODE field.*/
  #define FLL16M_DFT_CKSW16M_TCFG_TESTMODE_Min (0x0UL) /*!< Min enumerator value of TESTMODE field.                            */
  #define FLL16M_DFT_CKSW16M_TCFG_TESTMODE_Max (0x3UL) /*!< Max enumerator value of TESTMODE field.                            */
  #define FLL16M_DFT_CKSW16M_TCFG_TESTMODE_None (0x0UL) /*!< No test mode enabled                                              */
  #define FLL16M_DFT_CKSW16M_TCFG_TESTMODE_CtrlClkMux (0x1UL) /*!< Override controller to control clock mux enabled            */
  #define FLL16M_DFT_CKSW16M_TCFG_TESTMODE_DelayCells64 (0x2UL) /*!< Configure delay cells in phase detector as ring oscillator
                                                                     for characterization, frequency is divided down with a
                                                                     factor of 64*/
  #define FLL16M_DFT_CKSW16M_TCFG_TESTMODE_DelayCells128 (0x3UL) /*!< Configure delay cells in phase detector as ring oscillator
                                                                      for characterization, frequency is divided down with a
                                                                      factor of 128*/



/* ==================================================== Struct FLL16M_DFT ==================================================== */
/**
  * @brief DFT [FLL16M_DFT] (unspecified)
  */
typedef struct {
  __IOM NRF_FLL16M_DFT_DCO16M_Type DCO16M;           /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED[3];
  __IOM NRF_FLL16M_DFT_CKSW16M_Type CKSW16M;         /*!< (@ 0x00000040) (unspecified)                                         */
} NRF_FLL16M_DFT_Type;                               /*!< Size = 116 (0x074)                                                   */

/* ====================================================== Struct FLL16M ====================================================== */
/**
  * @brief FLL16M
  */
  typedef struct {                                   /*!< FLL16M Structure                                                     */
    __OM uint32_t TASKS_ONESHOTLOCK;                 /*!< (@ 0x00000000) Start one-shot locking process in Refresh mode.       */
    __OM uint32_t TASKS_SLEEP;                       /*!< (@ 0x00000004) Enter into FLL16M sleep mode                          */
    __OM uint32_t TASKS_FREQMEAS;                    /*!< (@ 0x00000008) Start frequency measurement in software-controlled
                                                                         mode*/
    __OM uint32_t TASKS_FREQCHANGE;                  /*!< (@ 0x0000000C) Trigger frequency change                              */
    __IM uint32_t RESERVED[60];
    __IOM uint32_t EVENTS_FREQMDONE;                 /*!< (@ 0x00000100) Frequency measurement done                            */
    __IOM uint32_t EVENTS_FREQMERROR;                /*!< (@ 0x00000104) Frequency measurement error                           */
    __IOM uint32_t EVENTS_FREQCHANGED;               /*!< (@ 0x00000108) Frequency change done                                 */
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t READY;                             /*!< (@ 0x00000400) Power up status                                       */
    __IM uint32_t CLOCKSTATUS;                       /*!< (@ 0x00000404) Clock status                                          */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000408) Status of analog module output signals                */
    __IM uint32_t RESERVED3;
    __IOM NRF_FLL16M_CONFIG_Type CONFIG;             /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[2];
    __IOM NRF_FLL16M_FREQM_Type FREQM;               /*!< (@ 0x00000420) (unspecified)                                         */
    __IM uint32_t RESERVED5[4];
    __IOM NRF_FLL16M_TRIM_Type TRIM;                 /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED6[11];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IM uint32_t RESERVED7[3];
    __IOM NRF_FLL16M_CLOCKCTRL_Type CLOCKCTRL;       /*!< (@ 0x00000490) (unspecified)                                         */
    __IM uint32_t RESERVED8[19];
    __IOM NRF_FLL16M_OVERRIDE_Type OVERRIDE;         /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED9[52];
    __IOM NRF_FLL16M_DFT_Type DFT;                   /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_FLL16M_Type;                                 /*!< Size = 1652 (0x674)                                                  */

/* FLL16M_TASKS_ONESHOTLOCK: Start one-shot locking process in Refresh mode. */
  #define FLL16M_TASKS_ONESHOTLOCK_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ONESHOTLOCK register.                   */

