adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FREQMDONE @Bit 0 : Read pending status of interrupt for event FREQMDONE */
  #define FLL16M_INTPEND_FREQMDONE_Pos (0UL)         /*!< Position of FREQMDONE field.                                         */
  #define FLL16M_INTPEND_FREQMDONE_Msk (0x1UL << FLL16M_INTPEND_FREQMDONE_Pos) /*!< Bit mask of FREQMDONE field.               */
  #define FLL16M_INTPEND_FREQMDONE_Min (0x0UL)       /*!< Min enumerator value of FREQMDONE field.                             */
  #define FLL16M_INTPEND_FREQMDONE_Max (0x1UL)       /*!< Max enumerator value of FREQMDONE field.                             */
  #define FLL16M_INTPEND_FREQMDONE_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define FLL16M_INTPEND_FREQMDONE_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* FREQMERROR @Bit 1 : Read pending status of interrupt for event FREQMERROR */
  #define FLL16M_INTPEND_FREQMERROR_Pos (1UL)        /*!< Position of FREQMERROR field.                                        */
  #define FLL16M_INTPEND_FREQMERROR_Msk (0x1UL << FLL16M_INTPEND_FREQMERROR_Pos) /*!< Bit mask of FREQMERROR field.            */
  #define FLL16M_INTPEND_FREQMERROR_Min (0x0UL)      /*!< Min enumerator value of FREQMERROR field.                            */
  #define FLL16M_INTPEND_FREQMERROR_Max (0x1UL)      /*!< Max enumerator value of FREQMERROR field.                            */
  #define FLL16M_INTPEND_FREQMERROR_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define FLL16M_INTPEND_FREQMERROR_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* FREQCHANGED @Bit 2 : Read pending status of interrupt for event FREQCHANGED */
  #define FLL16M_INTPEND_FREQCHANGED_Pos (2UL)       /*!< Position of FREQCHANGED field.                                       */
  #define FLL16M_INTPEND_FREQCHANGED_Msk (0x1UL << FLL16M_INTPEND_FREQCHANGED_Pos) /*!< Bit mask of FREQCHANGED field.         */
  #define FLL16M_INTPEND_FREQCHANGED_Min (0x0UL)     /*!< Min enumerator value of FREQCHANGED field.                           */
  #define FLL16M_INTPEND_FREQCHANGED_Max (0x1UL)     /*!< Max enumerator value of FREQCHANGED field.                           */
  #define FLL16M_INTPEND_FREQCHANGED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define FLL16M_INTPEND_FREQCHANGED_Pending (0x1UL) /*!< Read: Pending                                                        */


/* FLL16M_READY: Power up status */
  #define FLL16M_READY_ResetValue (0x00000000UL)     /*!< Reset value of READY register.                                       */

/* READY @Bit 0 : Power up ready. */
  #define FLL16M_READY_READY_Pos (0UL)               /*!< Position of READY field.                                             */
  #define FLL16M_READY_READY_Msk (0x1UL << FLL16M_READY_READY_Pos) /*!< Bit mask of READY field.                               */
  #define FLL16M_READY_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define FLL16M_READY_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define FLL16M_READY_READY_NotPoweredUp (0x0UL)    /*!< Not powered up                                                       */
  #define FLL16M_READY_READY_PoweredUp (0x1UL)       /*!< Powered up                                                           */


/* FLL16M_CLOCKSTATUS: Clock status */
  #define FLL16M_CLOCKSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CLOCKSTATUS register.                               */

/* MODE @Bits 0..2 : The FLL16M operating mode. */
  #define FLL16M_CLOCKSTATUS_MODE_Pos (0UL)          /*!< Position of MODE field.                                              */
  #define FLL16M_CLOCKSTATUS_MODE_Msk (0x7UL << FLL16M_CLOCKSTATUS_MODE_Pos) /*!< Bit mask of MODE field.                      */
  #define FLL16M_CLOCKSTATUS_MODE_Min (0x0UL)        /*!< Min enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKSTATUS_MODE_Max (0x4UL)        /*!< Max enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKSTATUS_MODE_Auto (0x0UL)       /*!< The PCGC controls the mode automatically.                            */
  #define FLL16M_CLOCKSTATUS_MODE_OpenLoop (0x1UL)   /*!< Open loop mode.                                                      */
  #define FLL16M_CLOCKSTATUS_MODE_ClosedLoop (0x2UL) /*!< Closed loop mode.                                                    */
  #define FLL16M_CLOCKSTATUS_MODE_Refresh (0x3UL)    /*!< Refresh mode.                                                        */
  #define FLL16M_CLOCKSTATUS_MODE_Bypass (0x4UL)     /*!< Bypass mode.                                                         */

/* OVERRIDE @Bit 4 : FLL16M Override mode. */
  #define FLL16M_CLOCKSTATUS_OVERRIDE_Pos (4UL)      /*!< Position of OVERRIDE field.                                          */
  #define FLL16M_CLOCKSTATUS_OVERRIDE_Msk (0x1UL << FLL16M_CLOCKSTATUS_OVERRIDE_Pos) /*!< Bit mask of OVERRIDE field.          */
  #define FLL16M_CLOCKSTATUS_OVERRIDE_Min (0x0UL)    /*!< Min enumerator value of OVERRIDE field.                              */
  #define FLL16M_CLOCKSTATUS_OVERRIDE_Max (0x1UL)    /*!< Max enumerator value of OVERRIDE field.                              */
  #define FLL16M_CLOCKSTATUS_OVERRIDE_Disabled (0x0UL) /*!< Override mode disabled.                                            */
  #define FLL16M_CLOCKSTATUS_OVERRIDE_Enabled (0x1UL) /*!< Override mode enabled.                                              */

/* CLOCKSEL @Bit 8 : Clock selected */
  #define FLL16M_CLOCKSTATUS_CLOCKSEL_Pos (8UL)      /*!< Position of CLOCKSEL field.                                          */
  #define FLL16M_CLOCKSTATUS_CLOCKSEL_Msk (0x1UL << FLL16M_CLOCKSTATUS_CLOCKSEL_Pos) /*!< Bit mask of CLOCKSEL field.          */
  #define FLL16M_CLOCKSTATUS_CLOCKSEL_Min (0x0UL)    /*!< Min enumerator value of CLOCKSEL field.                              */
  #define FLL16M_CLOCKSTATUS_CLOCKSEL_Max (0x1UL)    /*!< Max enumerator value of CLOCKSEL field.                              */
  #define FLL16M_CLOCKSTATUS_CLOCKSEL_DCO16M (0x0UL) /*!< Clock from DCO16M selected.                                          */
  #define FLL16M_CLOCKSTATUS_CLOCKSEL_HFXO (0x1UL)   /*!< Clock from HFXO selected.                                            */

/* ACCURACY @Bit 9 : Clock accuracy. */
  #define FLL16M_CLOCKSTATUS_ACCURACY_Pos (9UL)      /*!< Position of ACCURACY field.                                          */
  #define FLL16M_CLOCKSTATUS_ACCURACY_Msk (0x1UL << FLL16M_CLOCKSTATUS_ACCURACY_Pos) /*!< Bit mask of ACCURACY field.          */
  #define FLL16M_CLOCKSTATUS_ACCURACY_Min (0x0UL)    /*!< Min enumerator value of ACCURACY field.                              */
  #define FLL16M_CLOCKSTATUS_ACCURACY_Max (0x1UL)    /*!< Max enumerator value of ACCURACY field.                              */
  #define FLL16M_CLOCKSTATUS_ACCURACY_OutsideLimit (0x0UL) /*!< Clock accuracy is outside 2 percent.                           */
  #define FLL16M_CLOCKSTATUS_ACCURACY_WithinLimit (0x1UL) /*!< Clock accuracy is within 2 percent.                             */

/* LOCKED @Bit 10 : The FLL16M lock status. */
  #define FLL16M_CLOCKSTATUS_LOCKED_Pos (10UL)       /*!< Position of LOCKED field.                                            */
  #define FLL16M_CLOCKSTATUS_LOCKED_Msk (0x1UL << FLL16M_CLOCKSTATUS_LOCKED_Pos) /*!< Bit mask of LOCKED field.                */
  #define FLL16M_CLOCKSTATUS_LOCKED_Min (0x0UL)      /*!< Min enumerator value of LOCKED field.                                */
  #define FLL16M_CLOCKSTATUS_LOCKED_Max (0x1UL)      /*!< Max enumerator value of LOCKED field.                                */
  #define FLL16M_CLOCKSTATUS_LOCKED_NotLocked (0x0UL) /*!< Not locked to reference clock                                       */
  #define FLL16M_CLOCKSTATUS_LOCKED_Locked (0x1UL)   /*!< Locked to reference clock.                                           */

/* SLOPE @Bits 16..24 : The calculated slope value. */
  #define FLL16M_CLOCKSTATUS_SLOPE_Pos (16UL)        /*!< Position of SLOPE field.                                             */
  #define FLL16M_CLOCKSTATUS_SLOPE_Msk (0x1FFUL << FLL16M_CLOCKSTATUS_SLOPE_Pos) /*!< Bit mask of SLOPE field.                 */


/* FLL16M_STATUSANA: Status of analog module output signals */
  #define FLL16M_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                   */

/* READYDCO16M @Bit 0 : Current value of the READY signal from the DCO16M analog module */
  #define FLL16M_STATUSANA_READYDCO16M_Pos (0UL)     /*!< Position of READYDCO16M field.                                       */
  #define FLL16M_STATUSANA_READYDCO16M_Msk (0x1UL << FLL16M_STATUSANA_READYDCO16M_Pos) /*!< Bit mask of READYDCO16M field.     */

