adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SETTLEDDCO16M @Bit 1 : Current value of the SETTLED signal from the DCO16M analog module */
  #define FLL16M_STATUSANA_SETTLEDDCO16M_Pos (1UL)   /*!< Position of SETTLEDDCO16M field.                                     */
  #define FLL16M_STATUSANA_SETTLEDDCO16M_Msk (0x1UL << FLL16M_STATUSANA_SETTLEDDCO16M_Pos) /*!< Bit mask of SETTLEDDCO16M
                                                                            field.*/

/* READYCKSW16M @Bit 2 : Current value of the READY signal from the CKSW16M analog module */
  #define FLL16M_STATUSANA_READYCKSW16M_Pos (2UL)    /*!< Position of READYCKSW16M field.                                      */
  #define FLL16M_STATUSANA_READYCKSW16M_Msk (0x1UL << FLL16M_STATUSANA_READYCKSW16M_Pos) /*!< Bit mask of READYCKSW16M field.  */

/* SETTLEDCKSW16M @Bit 3 : Current value of the SETTLED signal from the CKSW16M analog module */
  #define FLL16M_STATUSANA_SETTLEDCKSW16M_Pos (3UL)  /*!< Position of SETTLEDCKSW16M field.                                    */
  #define FLL16M_STATUSANA_SETTLEDCKSW16M_Msk (0x1UL << FLL16M_STATUSANA_SETTLEDCKSW16M_Pos) /*!< Bit mask of SETTLEDCKSW16M
                                                                            field.*/

/* CKSEL @Bit 4 : Current value of the CKSEL signal from the CKSW16M analog module */
  #define FLL16M_STATUSANA_CKSEL_Pos (4UL)           /*!< Position of CKSEL field.                                             */
  #define FLL16M_STATUSANA_CKSEL_Msk (0x1UL << FLL16M_STATUSANA_CKSEL_Pos) /*!< Bit mask of CKSEL field.                       */


/* FLL16M_MIRROR: Enable LOCK for mirrored registers */
  #define FLL16M_MIRROR_ResetValue (0x00000003UL)    /*!< Reset value of MIRROR register.                                      */

/* LOCKDCO @Bit 0 : Lock for mirrored registers of DCO */
  #define FLL16M_MIRROR_LOCKDCO_Pos (0UL)            /*!< Position of LOCKDCO field.                                           */
  #define FLL16M_MIRROR_LOCKDCO_Msk (0x1UL << FLL16M_MIRROR_LOCKDCO_Pos) /*!< Bit mask of LOCKDCO field.                       */
  #define FLL16M_MIRROR_LOCKDCO_Min (0x0UL)          /*!< Min enumerator value of LOCKDCO field.                               */
  #define FLL16M_MIRROR_LOCKDCO_Max (0x1UL)          /*!< Max enumerator value of LOCKDCO field.                               */
  #define FLL16M_MIRROR_LOCKDCO_Disabled (0x0UL)     /*!< Lock disabled                                                        */
  #define FLL16M_MIRROR_LOCKDCO_Enabled (0x1UL)      /*!< Lock enabled                                                         */

/* LOCKCKSW @Bit 1 : Lock for mirrored registers of CKSW */
  #define FLL16M_MIRROR_LOCKCKSW_Pos (1UL)           /*!< Position of LOCKCKSW field.                                          */
  #define FLL16M_MIRROR_LOCKCKSW_Msk (0x1UL << FLL16M_MIRROR_LOCKCKSW_Pos) /*!< Bit mask of LOCKCKSW field.                    */
  #define FLL16M_MIRROR_LOCKCKSW_Min (0x0UL)         /*!< Min enumerator value of LOCKCKSW field.                              */
  #define FLL16M_MIRROR_LOCKCKSW_Max (0x1UL)         /*!< Max enumerator value of LOCKCKSW field.                              */
  #define FLL16M_MIRROR_LOCKCKSW_Disabled (0x0UL)    /*!< Lock disabled                                                        */
  #define FLL16M_MIRROR_LOCKCKSW_Enabled (0x1UL)     /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GENERIC                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ===================================================== Struct GENERIC ====================================================== */
/**
  * @brief GENERIC
  */
  typedef struct {                                   /*!< GENERIC Structure                                                    */
    __OM uint32_t TASKS_GENERICTASK;                 /*!< (@ 0x00000000) Generic event                                         */
    __IM uint32_t RESERVED[31];
    __IOM uint32_t SUBSCRIBE_GENERICTASK;            /*!< (@ 0x00000080) Subscribe configuration for task GENERICTASK          */
    __IM uint32_t RESERVED1[31];
    __IOM uint32_t EVENTS_GENERICEVENT;              /*!< (@ 0x00000100) Generic event                                         */
    __IM uint32_t RESERVED2[31];
    __IOM uint32_t PUBLISH_GENERICEVENT;             /*!< (@ 0x00000180) Publish configuration for event GENERICEVENT          */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
  } NRF_GENERIC_Type;                                /*!< Size = 780 (0x30C)                                                   */

/* GENERIC_TASKS_GENERICTASK: Generic event */
  #define GENERIC_TASKS_GENERICTASK_ResetValue (0x00000000UL) /*!< Reset value of TASKS_GENERICTASK register.                  */

/* TASKS_GENERICTASK @Bit 0 : Generic event */
  #define GENERIC_TASKS_GENERICTASK_TASKS_GENERICTASK_Pos (0UL) /*!< Position of TASKS_GENERICTASK field.                      */
  #define GENERIC_TASKS_GENERICTASK_TASKS_GENERICTASK_Msk (0x1UL << GENERIC_TASKS_GENERICTASK_TASKS_GENERICTASK_Pos) /*!< Bit
                                                                            mask of TASKS_GENERICTASK field.*/
  #define GENERIC_TASKS_GENERICTASK_TASKS_GENERICTASK_Min (0x1UL) /*!< Min enumerator value of TASKS_GENERICTASK field.        */
  #define GENERIC_TASKS_GENERICTASK_TASKS_GENERICTASK_Max (0x1UL) /*!< Max enumerator value of TASKS_GENERICTASK field.        */
  #define GENERIC_TASKS_GENERICTASK_TASKS_GENERICTASK_Trigger (0x1UL) /*!< Trigger task                                        */


/* GENERIC_SUBSCRIBE_GENERICTASK: Subscribe configuration for task GENERICTASK */
  #define GENERIC_SUBSCRIBE_GENERICTASK_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_GENERICTASK register.          */

