adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GENERIC_INTENCLR: Disable interrupt */
  #define GENERIC_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                    */

/* GENERICEVENT @Bit 0 : Write '1' to disable interrupt for event GENERICEVENT */
  #define GENERIC_INTENCLR_GENERICEVENT_Pos (0UL)    /*!< Position of GENERICEVENT field.                                      */
  #define GENERIC_INTENCLR_GENERICEVENT_Msk (0x1UL << GENERIC_INTENCLR_GENERICEVENT_Pos) /*!< Bit mask of GENERICEVENT field.  */
  #define GENERIC_INTENCLR_GENERICEVENT_Min (0x0UL)  /*!< Min enumerator value of GENERICEVENT field.                          */
  #define GENERIC_INTENCLR_GENERICEVENT_Max (0x1UL)  /*!< Max enumerator value of GENERICEVENT field.                          */
  #define GENERIC_INTENCLR_GENERICEVENT_Clear (0x1UL) /*!< Disable                                                             */
  #define GENERIC_INTENCLR_GENERICEVENT_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define GENERIC_INTENCLR_GENERICEVENT_Enabled (0x1UL) /*!< Read: Enabled                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           GPIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct GPIO_PORTCNF =================================================== */
/**
  * @brief PORTCNF [GPIO_PORTCNF] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DRIVECTRL;                         /*!< (@ 0x00000000) Drive control for impedance matching of the pins in
                                                                         this port*/
  __IOM uint32_t  PWRCTRL;                           /*!< (@ 0x00000004) Power control of the pins in this port                */
} NRF_GPIO_PORTCNF_Type;                             /*!< Size = 8 (0x008)                                                     */

/* GPIO_PORTCNF_DRIVECTRL: Drive control for impedance matching of the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_ResetValue (0x00000000UL) /*!< Reset value of DRIVECTRL register.                             */

/* IMPEDANCE50 @Bit 0 : Enable 50 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Pos (0UL) /*!< Position of IMPEDANCE50 field.                                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Pos) /*!< Bit mask of IMPEDANCE50
                                                                            field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE50 field.                       */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE50 field.                       */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Disable (0x0UL) /*!< Disabled                                                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Enable (0x1UL) /*!< Enable                                                        */

/* IMPEDANCE100 @Bit 1 : Enable 100 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Pos (1UL) /*!< Position of IMPEDANCE100 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Pos) /*!< Bit mask of
                                                                            IMPEDANCE100 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE100 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE100 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE200 @Bit 2 : Enable 200 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Pos (2UL) /*!< Position of IMPEDANCE200 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Pos) /*!< Bit mask of
                                                                            IMPEDANCE200 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE200 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE200 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE400 @Bit 3 : Enable 400 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Pos (3UL) /*!< Position of IMPEDANCE400 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Pos) /*!< Bit mask of
                                                                            IMPEDANCE400 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE400 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE400 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Enable (0x1UL) /*!< Enable                                                       */

