adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* IMPEDANCE800 @Bit 4 : Enable 800 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Pos (4UL) /*!< Position of IMPEDANCE800 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Pos) /*!< Bit mask of
                                                                            IMPEDANCE800 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE800 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE800 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE1600 @Bit 5 : Enable 1600 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Pos (5UL) /*!< Position of IMPEDANCE1600 field.                                 */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Pos) /*!< Bit mask of
                                                                            IMPEDANCE1600 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE1600 field.                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE1600 field.                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Disable (0x0UL) /*!< Disabled                                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Enable (0x1UL) /*!< Enable                                                      */


/* GPIO_PORTCNF_PWRCTRL: Power control of the pins in this port */
  #define GPIO_PORTCNF_PWRCTRL_ResetValue (0x00000003UL) /*!< Reset value of PWRCTRL register.                                 */

/* PWRCTRL @Bits 0..1 : Power control */
  #define GPIO_PORTCNF_PWRCTRL_PWRCTRL_Pos (0UL)     /*!< Position of PWRCTRL field.                                           */
  #define GPIO_PORTCNF_PWRCTRL_PWRCTRL_Msk (0x3UL << GPIO_PORTCNF_PWRCTRL_PWRCTRL_Pos) /*!< Bit mask of PWRCTRL field.         */
  #define GPIO_PORTCNF_PWRCTRL_PWRCTRL_Min (0x0UL)   /*!< Min enumerator value of PWRCTRL field.                               */
  #define GPIO_PORTCNF_PWRCTRL_PWRCTRL_Max (0x3UL)   /*!< Max enumerator value of PWRCTRL field.                               */
  #define GPIO_PORTCNF_PWRCTRL_PWRCTRL_Off (0x0UL)   /*!< Power off                                                            */
  #define GPIO_PORTCNF_PWRCTRL_PWRCTRL_FloatingGND0V (0x1UL) /*!< Static floating GND of the pin, connected to 0V              */
  #define GPIO_PORTCNF_PWRCTRL_PWRCTRL_FloatingGND1V8 (0x2UL) /*!< Static floating GND of the pin, connected to 1.8V           */
  #define GPIO_PORTCNF_PWRCTRL_PWRCTRL_FloatingGNDBuf (0x3UL) /*!< Buffered floating GND of the pin, generating VDDIO - 1.8V   */

/* DFT @Bit 12 : Enable down divided VSS_FLOAT on analog test bus */
  #define GPIO_PORTCNF_PWRCTRL_DFT_Pos (12UL)        /*!< Position of DFT field.                                               */
  #define GPIO_PORTCNF_PWRCTRL_DFT_Msk (0x1UL << GPIO_PORTCNF_PWRCTRL_DFT_Pos) /*!< Bit mask of DFT field.                     */
  #define GPIO_PORTCNF_PWRCTRL_DFT_Min (0x0UL)       /*!< Min enumerator value of DFT field.                                   */
  #define GPIO_PORTCNF_PWRCTRL_DFT_Max (0x1UL)       /*!< Max enumerator value of DFT field.                                   */
  #define GPIO_PORTCNF_PWRCTRL_DFT_Disable (0x0UL)   /*!< Disabled                                                             */
  #define GPIO_PORTCNF_PWRCTRL_DFT_Enable (0x1UL)    /*!< Enable                                                               */


/* ======================================================= Struct GPIO ======================================================= */
/**
  * @brief GPIO Port
  */
  typedef struct {                                   /*!< GPIO Structure                                                       */
    __IOM uint32_t OUT;                              /*!< (@ 0x00000000) Write GPIO port                                       */
    __IOM uint32_t OUTSET;                           /*!< (@ 0x00000004) Set individual bits in GPIO port                      */
    __IOM uint32_t OUTCLR;                           /*!< (@ 0x00000008) Clear individual bits in GPIO port                    */
    __IM uint32_t IN;                                /*!< (@ 0x0000000C) Read GPIO port                                        */
    __IOM uint32_t DIR;                              /*!< (@ 0x00000010) Direction of GPIO pins                                */
    __IOM uint32_t DIRSET;                           /*!< (@ 0x00000014) DIR set register                                      */
    __IOM uint32_t DIRCLR;                           /*!< (@ 0x00000018) DIR clear register                                    */
    __IM uint32_t RESERVED;
    __IOM uint32_t LATCH;                            /*!< (@ 0x00000020) Latch register indicating what GPIO pins that have met
                                                                         the criteria set in the PIN_CNF[n].SENSE registers*/
    __IOM uint32_t DETECTMODE;                       /*!< (@ 0x00000024) Select between default DETECT signal behavior and
                                                                         LDETECT mode*/
    __IM uint32_t RESERVED1[2];
    __IOM NRF_GPIO_PORTCNF_Type PORTCNF;             /*!< (@ 0x00000030) (unspecified)                                         */
    __IM uint32_t RESERVED2[2];
    __IOM uint32_t RETAIN;                           /*!< (@ 0x00000040) RETAIN of each individual GPIO pin. Pins with their
                                                                         RETAIN bit set keep their state independent of changes
                                                                         of the GPIO-configuration and peripheral changes.
                                                                         RETAIN must be cleared before the pin can be used.
                                                                         RETAIN is typically used to isolate the pin state from
                                                                         internal device state changes. The pin will keep all
                                                                         its state including the output value, DIR and PORTCNF
                                                                         settings.*/
    __IOM uint32_t RETAINSET;                        /*!< (@ 0x00000044) Set RETAIN for individual GPIO pins                   */
    __IOM uint32_t RETAINCLR;                        /*!< (@ 0x00000048) Clear RETAIN for individual GPIO pins                 */
    __IM uint32_t RESERVED3[13];
    __IOM uint32_t PIN_CNF[32];                      /*!< (@ 0x00000080) Pin n configuration of GPIO pin                       */
  } NRF_GPIO_Type;                                   /*!< Size = 256 (0x100)                                                   */

/* GPIO_OUT: Write GPIO port */
  #define GPIO_OUT_ResetValue (0x00000000UL)         /*!< Reset value of OUT register.                                         */

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUT_PIN0_Pos (0UL)                    /*!< Position of PIN0 field.                                              */
  #define GPIO_OUT_PIN0_Msk (0x1UL << GPIO_OUT_PIN0_Pos) /*!< Bit mask of PIN0 field.                                          */
  #define GPIO_OUT_PIN0_Min (0x0UL)                  /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_OUT_PIN0_Max (0x1UL)                  /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_OUT_PIN0_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN0_High (0x1UL)                 /*!< Pin driver is high                                                   */

