adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PIN18 @Bit 18 : Set RETAIN for pin 18 */
  #define GPIO_RETAINSET_PIN18_Pos (18UL)            /*!< Position of PIN18 field.                                             */
  #define GPIO_RETAINSET_PIN18_Msk (0x1UL << GPIO_RETAINSET_PIN18_Pos) /*!< Bit mask of PIN18 field.                           */
  #define GPIO_RETAINSET_PIN18_Min (0x0UL)           /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_RETAINSET_PIN18_Max (0x1UL)           /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_RETAINSET_PIN18_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN18_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN18_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN19 @Bit 19 : Set RETAIN for pin 19 */
  #define GPIO_RETAINSET_PIN19_Pos (19UL)            /*!< Position of PIN19 field.                                             */
  #define GPIO_RETAINSET_PIN19_Msk (0x1UL << GPIO_RETAINSET_PIN19_Pos) /*!< Bit mask of PIN19 field.                           */
  #define GPIO_RETAINSET_PIN19_Min (0x0UL)           /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_RETAINSET_PIN19_Max (0x1UL)           /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_RETAINSET_PIN19_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN19_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN19_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN20 @Bit 20 : Set RETAIN for pin 20 */
  #define GPIO_RETAINSET_PIN20_Pos (20UL)            /*!< Position of PIN20 field.                                             */
  #define GPIO_RETAINSET_PIN20_Msk (0x1UL << GPIO_RETAINSET_PIN20_Pos) /*!< Bit mask of PIN20 field.                           */
  #define GPIO_RETAINSET_PIN20_Min (0x0UL)           /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_RETAINSET_PIN20_Max (0x1UL)           /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_RETAINSET_PIN20_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN20_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN20_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN21 @Bit 21 : Set RETAIN for pin 21 */
  #define GPIO_RETAINSET_PIN21_Pos (21UL)            /*!< Position of PIN21 field.                                             */
  #define GPIO_RETAINSET_PIN21_Msk (0x1UL << GPIO_RETAINSET_PIN21_Pos) /*!< Bit mask of PIN21 field.                           */
  #define GPIO_RETAINSET_PIN21_Min (0x0UL)           /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_RETAINSET_PIN21_Max (0x1UL)           /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_RETAINSET_PIN21_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN21_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN21_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN22 @Bit 22 : Set RETAIN for pin 22 */
  #define GPIO_RETAINSET_PIN22_Pos (22UL)            /*!< Position of PIN22 field.                                             */
  #define GPIO_RETAINSET_PIN22_Msk (0x1UL << GPIO_RETAINSET_PIN22_Pos) /*!< Bit mask of PIN22 field.                           */
  #define GPIO_RETAINSET_PIN22_Min (0x0UL)           /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_RETAINSET_PIN22_Max (0x1UL)           /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_RETAINSET_PIN22_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN22_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN22_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN23 @Bit 23 : Set RETAIN for pin 23 */
  #define GPIO_RETAINSET_PIN23_Pos (23UL)            /*!< Position of PIN23 field.                                             */
  #define GPIO_RETAINSET_PIN23_Msk (0x1UL << GPIO_RETAINSET_PIN23_Pos) /*!< Bit mask of PIN23 field.                           */
  #define GPIO_RETAINSET_PIN23_Min (0x0UL)           /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_RETAINSET_PIN23_Max (0x1UL)           /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_RETAINSET_PIN23_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN23_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN23_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN24 @Bit 24 : Set RETAIN for pin 24 */
  #define GPIO_RETAINSET_PIN24_Pos (24UL)            /*!< Position of PIN24 field.                                             */
  #define GPIO_RETAINSET_PIN24_Msk (0x1UL << GPIO_RETAINSET_PIN24_Pos) /*!< Bit mask of PIN24 field.                           */
  #define GPIO_RETAINSET_PIN24_Min (0x0UL)           /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_RETAINSET_PIN24_Max (0x1UL)           /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_RETAINSET_PIN24_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN24_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN24_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

