adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PIN25 @Bit 25 : Set RETAIN for pin 25 */
  #define GPIO_RETAINSET_PIN25_Pos (25UL)            /*!< Position of PIN25 field.                                             */
  #define GPIO_RETAINSET_PIN25_Msk (0x1UL << GPIO_RETAINSET_PIN25_Pos) /*!< Bit mask of PIN25 field.                           */
  #define GPIO_RETAINSET_PIN25_Min (0x0UL)           /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_RETAINSET_PIN25_Max (0x1UL)           /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_RETAINSET_PIN25_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN25_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN25_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN26 @Bit 26 : Set RETAIN for pin 26 */
  #define GPIO_RETAINSET_PIN26_Pos (26UL)            /*!< Position of PIN26 field.                                             */
  #define GPIO_RETAINSET_PIN26_Msk (0x1UL << GPIO_RETAINSET_PIN26_Pos) /*!< Bit mask of PIN26 field.                           */
  #define GPIO_RETAINSET_PIN26_Min (0x0UL)           /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_RETAINSET_PIN26_Max (0x1UL)           /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_RETAINSET_PIN26_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN26_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN26_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN27 @Bit 27 : Set RETAIN for pin 27 */
  #define GPIO_RETAINSET_PIN27_Pos (27UL)            /*!< Position of PIN27 field.                                             */
  #define GPIO_RETAINSET_PIN27_Msk (0x1UL << GPIO_RETAINSET_PIN27_Pos) /*!< Bit mask of PIN27 field.                           */
  #define GPIO_RETAINSET_PIN27_Min (0x0UL)           /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_RETAINSET_PIN27_Max (0x1UL)           /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_RETAINSET_PIN27_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN27_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN27_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN28 @Bit 28 : Set RETAIN for pin 28 */
  #define GPIO_RETAINSET_PIN28_Pos (28UL)            /*!< Position of PIN28 field.                                             */
  #define GPIO_RETAINSET_PIN28_Msk (0x1UL << GPIO_RETAINSET_PIN28_Pos) /*!< Bit mask of PIN28 field.                           */
  #define GPIO_RETAINSET_PIN28_Min (0x0UL)           /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_RETAINSET_PIN28_Max (0x1UL)           /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_RETAINSET_PIN28_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN28_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN28_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN29 @Bit 29 : Set RETAIN for pin 29 */
  #define GPIO_RETAINSET_PIN29_Pos (29UL)            /*!< Position of PIN29 field.                                             */
  #define GPIO_RETAINSET_PIN29_Msk (0x1UL << GPIO_RETAINSET_PIN29_Pos) /*!< Bit mask of PIN29 field.                           */
  #define GPIO_RETAINSET_PIN29_Min (0x0UL)           /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_RETAINSET_PIN29_Max (0x1UL)           /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_RETAINSET_PIN29_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN29_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN29_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN30 @Bit 30 : Set RETAIN for pin 30 */
  #define GPIO_RETAINSET_PIN30_Pos (30UL)            /*!< Position of PIN30 field.                                             */
  #define GPIO_RETAINSET_PIN30_Msk (0x1UL << GPIO_RETAINSET_PIN30_Pos) /*!< Bit mask of PIN30 field.                           */
  #define GPIO_RETAINSET_PIN30_Min (0x0UL)           /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_RETAINSET_PIN30_Max (0x1UL)           /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_RETAINSET_PIN30_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN30_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN30_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN31 @Bit 31 : Set RETAIN for pin 31 */
  #define GPIO_RETAINSET_PIN31_Pos (31UL)            /*!< Position of PIN31 field.                                             */
  #define GPIO_RETAINSET_PIN31_Msk (0x1UL << GPIO_RETAINSET_PIN31_Pos) /*!< Bit mask of PIN31 field.                           */
  #define GPIO_RETAINSET_PIN31_Min (0x0UL)           /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_RETAINSET_PIN31_Max (0x1UL)           /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_RETAINSET_PIN31_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN31_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN31_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/


/* GPIO_RETAINCLR: Clear RETAIN for individual GPIO pins */
  #define GPIO_RETAINCLR_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of RETAINCLR register.                                   */

/* PIN0 @Bit 0 : Clear RETAIN for pin 0 */
  #define GPIO_RETAINCLR_PIN0_Pos (0UL)              /*!< Position of PIN0 field.                                              */
  #define GPIO_RETAINCLR_PIN0_Msk (0x1UL << GPIO_RETAINCLR_PIN0_Pos) /*!< Bit mask of PIN0 field.                              */
  #define GPIO_RETAINCLR_PIN0_Min (0x0UL)            /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_RETAINCLR_PIN0_Max (0x1UL)            /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_RETAINCLR_PIN0_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN0_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN0_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN1 @Bit 1 : Clear RETAIN for pin 1 */
  #define GPIO_RETAINCLR_PIN1_Pos (1UL)              /*!< Position of PIN1 field.                                              */
  #define GPIO_RETAINCLR_PIN1_Msk (0x1UL << GPIO_RETAINCLR_PIN1_Pos) /*!< Bit mask of PIN1 field.                              */
  #define GPIO_RETAINCLR_PIN1_Min (0x0UL)            /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_RETAINCLR_PIN1_Max (0x1UL)            /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_RETAINCLR_PIN1_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN1_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN1_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN2 @Bit 2 : Clear RETAIN for pin 2 */
  #define GPIO_RETAINCLR_PIN2_Pos (2UL)              /*!< Position of PIN2 field.                                              */
  #define GPIO_RETAINCLR_PIN2_Msk (0x1UL << GPIO_RETAINCLR_PIN2_Pos) /*!< Bit mask of PIN2 field.                              */
  #define GPIO_RETAINCLR_PIN2_Min (0x0UL)            /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_RETAINCLR_PIN2_Max (0x1UL)            /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_RETAINCLR_PIN2_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN2_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN2_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN3 @Bit 3 : Clear RETAIN for pin 3 */
  #define GPIO_RETAINCLR_PIN3_Pos (3UL)              /*!< Position of PIN3 field.                                              */
  #define GPIO_RETAINCLR_PIN3_Msk (0x1UL << GPIO_RETAINCLR_PIN3_Pos) /*!< Bit mask of PIN3 field.                              */
  #define GPIO_RETAINCLR_PIN3_Min (0x0UL)            /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_RETAINCLR_PIN3_Max (0x1UL)            /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_RETAINCLR_PIN3_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN3_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN3_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN4 @Bit 4 : Clear RETAIN for pin 4 */
  #define GPIO_RETAINCLR_PIN4_Pos (4UL)              /*!< Position of PIN4 field.                                              */
  #define GPIO_RETAINCLR_PIN4_Msk (0x1UL << GPIO_RETAINCLR_PIN4_Pos) /*!< Bit mask of PIN4 field.                              */
  #define GPIO_RETAINCLR_PIN4_Min (0x0UL)            /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_RETAINCLR_PIN4_Max (0x1UL)            /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_RETAINCLR_PIN4_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN4_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN4_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN5 @Bit 5 : Clear RETAIN for pin 5 */
  #define GPIO_RETAINCLR_PIN5_Pos (5UL)              /*!< Position of PIN5 field.                                              */
  #define GPIO_RETAINCLR_PIN5_Msk (0x1UL << GPIO_RETAINCLR_PIN5_Pos) /*!< Bit mask of PIN5 field.                              */
  #define GPIO_RETAINCLR_PIN5_Min (0x0UL)            /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_RETAINCLR_PIN5_Max (0x1UL)            /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_RETAINCLR_PIN5_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN5_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN5_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN6 @Bit 6 : Clear RETAIN for pin 6 */
  #define GPIO_RETAINCLR_PIN6_Pos (6UL)              /*!< Position of PIN6 field.                                              */
  #define GPIO_RETAINCLR_PIN6_Msk (0x1UL << GPIO_RETAINCLR_PIN6_Pos) /*!< Bit mask of PIN6 field.                              */
  #define GPIO_RETAINCLR_PIN6_Min (0x0UL)            /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_RETAINCLR_PIN6_Max (0x1UL)            /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_RETAINCLR_PIN6_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN6_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN6_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN7 @Bit 7 : Clear RETAIN for pin 7 */
  #define GPIO_RETAINCLR_PIN7_Pos (7UL)              /*!< Position of PIN7 field.                                              */
  #define GPIO_RETAINCLR_PIN7_Msk (0x1UL << GPIO_RETAINCLR_PIN7_Pos) /*!< Bit mask of PIN7 field.                              */
  #define GPIO_RETAINCLR_PIN7_Min (0x0UL)            /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_RETAINCLR_PIN7_Max (0x1UL)            /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_RETAINCLR_PIN7_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN7_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN7_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

