adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PIN22 @Bit 22 : Clear RETAIN for pin 22 */
  #define GPIO_RETAINCLR_PIN22_Pos (22UL)            /*!< Position of PIN22 field.                                             */
  #define GPIO_RETAINCLR_PIN22_Msk (0x1UL << GPIO_RETAINCLR_PIN22_Pos) /*!< Bit mask of PIN22 field.                           */
  #define GPIO_RETAINCLR_PIN22_Min (0x0UL)           /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_RETAINCLR_PIN22_Max (0x1UL)           /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_RETAINCLR_PIN22_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN22_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN22_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN23 @Bit 23 : Clear RETAIN for pin 23 */
  #define GPIO_RETAINCLR_PIN23_Pos (23UL)            /*!< Position of PIN23 field.                                             */
  #define GPIO_RETAINCLR_PIN23_Msk (0x1UL << GPIO_RETAINCLR_PIN23_Pos) /*!< Bit mask of PIN23 field.                           */
  #define GPIO_RETAINCLR_PIN23_Min (0x0UL)           /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_RETAINCLR_PIN23_Max (0x1UL)           /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_RETAINCLR_PIN23_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN23_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN23_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN24 @Bit 24 : Clear RETAIN for pin 24 */
  #define GPIO_RETAINCLR_PIN24_Pos (24UL)            /*!< Position of PIN24 field.                                             */
  #define GPIO_RETAINCLR_PIN24_Msk (0x1UL << GPIO_RETAINCLR_PIN24_Pos) /*!< Bit mask of PIN24 field.                           */
  #define GPIO_RETAINCLR_PIN24_Min (0x0UL)           /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_RETAINCLR_PIN24_Max (0x1UL)           /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_RETAINCLR_PIN24_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN24_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN24_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN25 @Bit 25 : Clear RETAIN for pin 25 */
  #define GPIO_RETAINCLR_PIN25_Pos (25UL)            /*!< Position of PIN25 field.                                             */
  #define GPIO_RETAINCLR_PIN25_Msk (0x1UL << GPIO_RETAINCLR_PIN25_Pos) /*!< Bit mask of PIN25 field.                           */
  #define GPIO_RETAINCLR_PIN25_Min (0x0UL)           /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_RETAINCLR_PIN25_Max (0x1UL)           /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_RETAINCLR_PIN25_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN25_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN25_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN26 @Bit 26 : Clear RETAIN for pin 26 */
  #define GPIO_RETAINCLR_PIN26_Pos (26UL)            /*!< Position of PIN26 field.                                             */
  #define GPIO_RETAINCLR_PIN26_Msk (0x1UL << GPIO_RETAINCLR_PIN26_Pos) /*!< Bit mask of PIN26 field.                           */
  #define GPIO_RETAINCLR_PIN26_Min (0x0UL)           /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_RETAINCLR_PIN26_Max (0x1UL)           /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_RETAINCLR_PIN26_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN26_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN26_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN27 @Bit 27 : Clear RETAIN for pin 27 */
  #define GPIO_RETAINCLR_PIN27_Pos (27UL)            /*!< Position of PIN27 field.                                             */
  #define GPIO_RETAINCLR_PIN27_Msk (0x1UL << GPIO_RETAINCLR_PIN27_Pos) /*!< Bit mask of PIN27 field.                           */
  #define GPIO_RETAINCLR_PIN27_Min (0x0UL)           /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_RETAINCLR_PIN27_Max (0x1UL)           /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_RETAINCLR_PIN27_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN27_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN27_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN28 @Bit 28 : Clear RETAIN for pin 28 */
  #define GPIO_RETAINCLR_PIN28_Pos (28UL)            /*!< Position of PIN28 field.                                             */
  #define GPIO_RETAINCLR_PIN28_Msk (0x1UL << GPIO_RETAINCLR_PIN28_Pos) /*!< Bit mask of PIN28 field.                           */
  #define GPIO_RETAINCLR_PIN28_Min (0x0UL)           /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_RETAINCLR_PIN28_Max (0x1UL)           /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_RETAINCLR_PIN28_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN28_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN28_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN29 @Bit 29 : Clear RETAIN for pin 29 */
  #define GPIO_RETAINCLR_PIN29_Pos (29UL)            /*!< Position of PIN29 field.                                             */
  #define GPIO_RETAINCLR_PIN29_Msk (0x1UL << GPIO_RETAINCLR_PIN29_Pos) /*!< Bit mask of PIN29 field.                           */
  #define GPIO_RETAINCLR_PIN29_Min (0x0UL)           /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_RETAINCLR_PIN29_Max (0x1UL)           /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_RETAINCLR_PIN29_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN29_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN29_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN30 @Bit 30 : Clear RETAIN for pin 30 */
  #define GPIO_RETAINCLR_PIN30_Pos (30UL)            /*!< Position of PIN30 field.                                             */
  #define GPIO_RETAINCLR_PIN30_Msk (0x1UL << GPIO_RETAINCLR_PIN30_Pos) /*!< Bit mask of PIN30 field.                           */
  #define GPIO_RETAINCLR_PIN30_Min (0x0UL)           /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_RETAINCLR_PIN30_Max (0x1UL)           /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_RETAINCLR_PIN30_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN30_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN30_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN31 @Bit 31 : Clear RETAIN for pin 31 */
  #define GPIO_RETAINCLR_PIN31_Pos (31UL)            /*!< Position of PIN31 field.                                             */
  #define GPIO_RETAINCLR_PIN31_Msk (0x1UL << GPIO_RETAINCLR_PIN31_Pos) /*!< Bit mask of PIN31 field.                           */
  #define GPIO_RETAINCLR_PIN31_Min (0x0UL)           /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_RETAINCLR_PIN31_Max (0x1UL)           /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_RETAINCLR_PIN31_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN31_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN31_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/


/* GPIO_PIN_CNF: Pin n configuration of GPIO pin */
  #define GPIO_PIN_CNF_MaxCount (32UL)               /*!< Max size of PIN_CNF[32] array.                                       */
  #define GPIO_PIN_CNF_MaxIndex (31UL)               /*!< Max index of PIN_CNF[32] array.                                      */
  #define GPIO_PIN_CNF_MinIndex (0UL)                /*!< Min index of PIN_CNF[32] array.                                      */
  #define GPIO_PIN_CNF_ResetValue (0x00000002UL)     /*!< Reset value of PIN_CNF[32] register.                                 */

