adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LATCHCLRWAITCNT @Bits 0..1 : Select the number of wait cycles inserted on the bus when a LATCH register is cleared. */
  #define GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Pos (0UL) /*!< Position of LATCHCLRWAITCNT field.                       */
  #define GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Msk (0x3UL << GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Pos) /*!< Bit
                                                                            mask of LATCHCLRWAITCNT field.*/
  #define GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Min (0x0UL) /*!< Min value of LATCHCLRWAITCNT field.                    */
  #define GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Max (0x3UL) /*!< Max size of LATCHCLRWAITCNT field.                     */


/* GPIOINTERNAL_FORCELDETECTLOWCNT: Select the number of cycles that LDETECT is forced low after clearing a LATCH register. */
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_ResetValue (0x00000008UL) /*!< Reset value of FORCELDETECTLOWCNT register.           */

/* FORCELDETECTLOWCNT @Bits 0..3 : Select the number of cycles that LDETECT is forced low after clearing a LATCH register. */
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Pos (0UL) /*!< Position of FORCELDETECTLOWCNT field.              */
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Msk (0xFUL << GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Pos)
                                                                            /*!< Bit mask of FORCELDETECTLOWCNT field.*/
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Min (0x0UL) /*!< Min value of FORCELDETECTLOWCNT field.           */
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Max (0xFUL) /*!< Max size of FORCELDETECTLOWCNT field.            */


/* GPIOINTERNAL_RESET: Reset all GPIO registers. */
  #define GPIOINTERNAL_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                                     */

/* RESET @Bit 0 : Reset all GPIO registers. */
  #define GPIOINTERNAL_RESET_RESET_Pos (0UL)         /*!< Position of RESET field.                                             */
  #define GPIOINTERNAL_RESET_RESET_Msk (0x1UL << GPIOINTERNAL_RESET_RESET_Pos) /*!< Bit mask of RESET field.                   */
  #define GPIOINTERNAL_RESET_RESET_Min (0x0UL)       /*!< Min enumerator value of RESET field.                                 */
  #define GPIOINTERNAL_RESET_RESET_Max (0x1UL)       /*!< Max enumerator value of RESET field.                                 */
  #define GPIOINTERNAL_RESET_RESET_RESET (0x1UL)     /*!< Trigger reset                                                        */
  #define GPIOINTERNAL_RESET_RESET_NA (0x0UL)        /*!< No effect                                                            */


/* GPIOINTERNAL_SENSECONFIGCHANGECNT: Selects the number of cycles before the SENSE configuration takes effect when it is
                                       changed. Setting this register lower than the reset value can lead to unwanted LATCH set
                                       when SENSE and INPUT fields (PIN[n].CNF) are changed simultaneously. */

  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_ResetValue (0x00000003UL) /*!< Reset value of SENSECONFIGCHANGECNT register.       */

/* SENSECONFIGCHANGECNT @Bits 0..2 : Selects the number of cycles before the SENSE configuration takes effect when it is
                                     changed. */

  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Pos (0UL) /*!< Position of SENSECONFIGCHANGECNT field.        */
  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Msk (0x7UL << GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Pos)
                                                                            /*!< Bit mask of SENSECONFIGCHANGECNT field.*/
  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Min (0x0UL) /*!< Min value of SENSECONFIGCHANGECNT field.     */
  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Max (0x7UL) /*!< Max size of SENSECONFIGCHANGECNT field.      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GPIOTE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct GPIOTE_EVENTS_PORT ================================================ */
/**
  * @brief EVENTS_PORT [GPIOTE_EVENTS_PORT] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  NONSECURE;                         /*!< (@ 0x00000000) Non-secure port event from owner n                    */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Secure port event from owner n                        */
} NRF_GPIOTE_EVENTS_PORT_Type;                       /*!< Size = 8 (0x008)                                                     */
  #define GPIOTE_EVENTS_PORT_MaxCount (4UL)          /*!< Size of EVENTS_PORT[4] array.                                        */
  #define GPIOTE_EVENTS_PORT_MaxIndex (3UL)          /*!< Max index of EVENTS_PORT[4] array.                                   */
  #define GPIOTE_EVENTS_PORT_MinIndex (0UL)          /*!< Min index of EVENTS_PORT[4] array.                                   */

/* GPIOTE_EVENTS_PORT_NONSECURE: Non-secure port event from owner n */
  #define GPIOTE_EVENTS_PORT_NONSECURE_ResetValue (0x00000000UL) /*!< Reset value of NONSECURE register.                       */

/* NONSECURE @Bit 0 : Non-secure port event from owner n */
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Pos (0UL) /*!< Position of NONSECURE field.                                   */
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Msk (0x1UL << GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Pos) /*!< Bit mask of
                                                                            NONSECURE field.*/
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Min (0x0UL) /*!< Min enumerator value of NONSECURE field.                     */
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Max (0x1UL) /*!< Max enumerator value of NONSECURE field.                     */
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Generated (0x1UL) /*!< Event generated                                        */


/* GPIOTE_EVENTS_PORT_SECURE: Secure port event from owner n */
  #define GPIOTE_EVENTS_PORT_SECURE_ResetValue (0x00000000UL) /*!< Reset value of SECURE register.                             */

/* SECURE @Bit 0 : Secure port event from owner n */
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Pos (0UL) /*!< Position of SECURE field.                                            */
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Msk (0x1UL << GPIOTE_EVENTS_PORT_SECURE_SECURE_Pos) /*!< Bit mask of SECURE field.  */
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Min (0x0UL) /*!< Min enumerator value of SECURE field.                              */
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Max (0x1UL) /*!< Max enumerator value of SECURE field.                              */
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Generated (0x1UL) /*!< Event generated                                              */



/* =============================================== Struct GPIOTE_PUBLISH_PORT ================================================ */
/**
  * @brief PUBLISH_PORT [GPIOTE_PUBLISH_PORT] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  NONSECURE;                         /*!< (@ 0x00000000) Publish configuration for event PORT[n].NONSECURE     */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Publish configuration for event PORT[n].SECURE        */
} NRF_GPIOTE_PUBLISH_PORT_Type;                      /*!< Size = 8 (0x008)                                                     */
