adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task OUT[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_OUT_EN_Pos) /*!< Bit mask of EN field.                        */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* GPIOTE_SUBSCRIBE_SET: Subscribe configuration for task SET[n] */
  #define GPIOTE_SUBSCRIBE_SET_MaxCount (8UL)        /*!< Max size of SUBSCRIBE_SET[8] array.                                  */
  #define GPIOTE_SUBSCRIBE_SET_MaxIndex (7UL)        /*!< Max index of SUBSCRIBE_SET[8] array.                                 */
  #define GPIOTE_SUBSCRIBE_SET_MinIndex (0UL)        /*!< Min index of SUBSCRIBE_SET[8] array.                                 */
  #define GPIOTE_SUBSCRIBE_SET_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SET[8] register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task SET[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_SET_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_SET_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define GPIOTE_SUBSCRIBE_SET_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_SET_EN_Pos) /*!< Bit mask of EN field.                        */
  #define GPIOTE_SUBSCRIBE_SET_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_SET_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_SET_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define GPIOTE_SUBSCRIBE_SET_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* GPIOTE_SUBSCRIBE_CLR: Subscribe configuration for task CLR[n] */
  #define GPIOTE_SUBSCRIBE_CLR_MaxCount (8UL)        /*!< Max size of SUBSCRIBE_CLR[8] array.                                  */
  #define GPIOTE_SUBSCRIBE_CLR_MaxIndex (7UL)        /*!< Max index of SUBSCRIBE_CLR[8] array.                                 */
  #define GPIOTE_SUBSCRIBE_CLR_MinIndex (0UL)        /*!< Min index of SUBSCRIBE_CLR[8] array.                                 */
  #define GPIOTE_SUBSCRIBE_CLR_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CLR[8] register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task CLR[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_CLR_EN_Pos) /*!< Bit mask of EN field.                        */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* GPIOTE_EVENTS_IN: Event from pin specified in CONFIG[n].PSEL */
  #define GPIOTE_EVENTS_IN_MaxCount (8UL)            /*!< Max size of EVENTS_IN[8] array.                                      */
  #define GPIOTE_EVENTS_IN_MaxIndex (7UL)            /*!< Max index of EVENTS_IN[8] array.                                     */
  #define GPIOTE_EVENTS_IN_MinIndex (0UL)            /*!< Min index of EVENTS_IN[8] array.                                     */
  #define GPIOTE_EVENTS_IN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_IN[8] register.                                */

/* EVENTS_IN @Bit 0 : Event from pin specified in CONFIG[n].PSEL */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Pos (0UL)       /*!< Position of EVENTS_IN field.                                         */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Msk (0x1UL << GPIOTE_EVENTS_IN_EVENTS_IN_Pos) /*!< Bit mask of EVENTS_IN field.           */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Min (0x0UL)     /*!< Min enumerator value of EVENTS_IN field.                             */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Max (0x1UL)     /*!< Max enumerator value of EVENTS_IN field.                             */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Generated (0x1UL) /*!< Event generated                                                    */


/* GPIOTE_PUBLISH_IN: Publish configuration for event IN[n] */
  #define GPIOTE_PUBLISH_IN_MaxCount (8UL)           /*!< Max size of PUBLISH_IN[8] array.                                     */
  #define GPIOTE_PUBLISH_IN_MaxIndex (7UL)           /*!< Max index of PUBLISH_IN[8] array.                                    */
  #define GPIOTE_PUBLISH_IN_MinIndex (0UL)           /*!< Min index of PUBLISH_IN[8] array.                                    */
  #define GPIOTE_PUBLISH_IN_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_IN[8] register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event IN[n] will publish to */
  #define GPIOTE_PUBLISH_IN_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define GPIOTE_PUBLISH_IN_CHIDX_Msk (0xFFUL << GPIOTE_PUBLISH_IN_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define GPIOTE_PUBLISH_IN_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_PUBLISH_IN_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_PUBLISH_IN_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define GPIOTE_PUBLISH_IN_EN_Msk (0x1UL << GPIOTE_PUBLISH_IN_EN_Pos) /*!< Bit mask of EN field.                              */
  #define GPIOTE_PUBLISH_IN_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_PUBLISH_IN_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_PUBLISH_IN_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define GPIOTE_PUBLISH_IN_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* GPIOTE_INTEN0: Enable or disable interrupt */
  #define GPIOTE_INTEN0_ResetValue (0x00000000UL)    /*!< Reset value of INTEN0 register.                                      */

/* IN0 @Bit 0 : Enable or disable interrupt for event IN[0] */
  #define GPIOTE_INTEN0_IN0_Pos (0UL)                /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTEN0_IN0_Msk (0x1UL << GPIOTE_INTEN0_IN0_Pos) /*!< Bit mask of IN0 field.                                   */
  #define GPIOTE_INTEN0_IN0_Min (0x0UL)              /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTEN0_IN0_Max (0x1UL)              /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTEN0_IN0_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN0_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN1 @Bit 1 : Enable or disable interrupt for event IN[1] */
  #define GPIOTE_INTEN0_IN1_Pos (1UL)                /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTEN0_IN1_Msk (0x1UL << GPIOTE_INTEN0_IN1_Pos) /*!< Bit mask of IN1 field.                                   */
  #define GPIOTE_INTEN0_IN1_Min (0x0UL)              /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTEN0_IN1_Max (0x1UL)              /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTEN0_IN1_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN1_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN2 @Bit 2 : Enable or disable interrupt for event IN[2] */
  #define GPIOTE_INTEN0_IN2_Pos (2UL)                /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTEN0_IN2_Msk (0x1UL << GPIOTE_INTEN0_IN2_Pos) /*!< Bit mask of IN2 field.                                   */
  #define GPIOTE_INTEN0_IN2_Min (0x0UL)              /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTEN0_IN2_Max (0x1UL)              /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTEN0_IN2_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN2_Enabled (0x1UL)          /*!< Enable                                                               */

