adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* IN2 @Bit 2 : Write '1' to disable interrupt for event IN[2] */
  #define GPIOTE_INTENCLR0_IN2_Pos (2UL)             /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTENCLR0_IN2_Msk (0x1UL << GPIOTE_INTENCLR0_IN2_Pos) /*!< Bit mask of IN2 field.                             */
  #define GPIOTE_INTENCLR0_IN2_Min (0x0UL)           /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTENCLR0_IN2_Max (0x1UL)           /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTENCLR0_IN2_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN2_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN2_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN3 @Bit 3 : Write '1' to disable interrupt for event IN[3] */
  #define GPIOTE_INTENCLR0_IN3_Pos (3UL)             /*!< Position of IN3 field.                                               */
  #define GPIOTE_INTENCLR0_IN3_Msk (0x1UL << GPIOTE_INTENCLR0_IN3_Pos) /*!< Bit mask of IN3 field.                             */
  #define GPIOTE_INTENCLR0_IN3_Min (0x0UL)           /*!< Min enumerator value of IN3 field.                                   */
  #define GPIOTE_INTENCLR0_IN3_Max (0x1UL)           /*!< Max enumerator value of IN3 field.                                   */
  #define GPIOTE_INTENCLR0_IN3_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN3_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN3_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN4 @Bit 4 : Write '1' to disable interrupt for event IN[4] */
  #define GPIOTE_INTENCLR0_IN4_Pos (4UL)             /*!< Position of IN4 field.                                               */
  #define GPIOTE_INTENCLR0_IN4_Msk (0x1UL << GPIOTE_INTENCLR0_IN4_Pos) /*!< Bit mask of IN4 field.                             */
  #define GPIOTE_INTENCLR0_IN4_Min (0x0UL)           /*!< Min enumerator value of IN4 field.                                   */
  #define GPIOTE_INTENCLR0_IN4_Max (0x1UL)           /*!< Max enumerator value of IN4 field.                                   */
  #define GPIOTE_INTENCLR0_IN4_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN4_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN4_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN5 @Bit 5 : Write '1' to disable interrupt for event IN[5] */
  #define GPIOTE_INTENCLR0_IN5_Pos (5UL)             /*!< Position of IN5 field.                                               */
  #define GPIOTE_INTENCLR0_IN5_Msk (0x1UL << GPIOTE_INTENCLR0_IN5_Pos) /*!< Bit mask of IN5 field.                             */
  #define GPIOTE_INTENCLR0_IN5_Min (0x0UL)           /*!< Min enumerator value of IN5 field.                                   */
  #define GPIOTE_INTENCLR0_IN5_Max (0x1UL)           /*!< Max enumerator value of IN5 field.                                   */
  #define GPIOTE_INTENCLR0_IN5_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN5_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN5_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN6 @Bit 6 : Write '1' to disable interrupt for event IN[6] */
  #define GPIOTE_INTENCLR0_IN6_Pos (6UL)             /*!< Position of IN6 field.                                               */
  #define GPIOTE_INTENCLR0_IN6_Msk (0x1UL << GPIOTE_INTENCLR0_IN6_Pos) /*!< Bit mask of IN6 field.                             */
  #define GPIOTE_INTENCLR0_IN6_Min (0x0UL)           /*!< Min enumerator value of IN6 field.                                   */
  #define GPIOTE_INTENCLR0_IN6_Max (0x1UL)           /*!< Max enumerator value of IN6 field.                                   */
  #define GPIOTE_INTENCLR0_IN6_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN6_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN6_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN7 @Bit 7 : Write '1' to disable interrupt for event IN[7] */
  #define GPIOTE_INTENCLR0_IN7_Pos (7UL)             /*!< Position of IN7 field.                                               */
  #define GPIOTE_INTENCLR0_IN7_Msk (0x1UL << GPIOTE_INTENCLR0_IN7_Pos) /*!< Bit mask of IN7 field.                             */
  #define GPIOTE_INTENCLR0_IN7_Min (0x0UL)           /*!< Min enumerator value of IN7 field.                                   */
  #define GPIOTE_INTENCLR0_IN7_Max (0x1UL)           /*!< Max enumerator value of IN7 field.                                   */
  #define GPIOTE_INTENCLR0_IN7_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN7_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN7_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* PORT0NONSECURE @Bit 16 : Write '1' to disable interrupt for event PORT0NONSECURE */
  #define GPIOTE_INTENCLR0_PORT0NONSECURE_Pos (16UL) /*!< Position of PORT0NONSECURE field.                                    */
  #define GPIOTE_INTENCLR0_PORT0NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR0_PORT0NONSECURE_Pos) /*!< Bit mask of PORT0NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR0_PORT0NONSECURE_Min (0x0UL) /*!< Min enumerator value of PORT0NONSECURE field.                       */
  #define GPIOTE_INTENCLR0_PORT0NONSECURE_Max (0x1UL) /*!< Max enumerator value of PORT0NONSECURE field.                       */
  #define GPIOTE_INTENCLR0_PORT0NONSECURE_Clear (0x1UL) /*!< Disable                                                           */
  #define GPIOTE_INTENCLR0_PORT0NONSECURE_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GPIOTE_INTENCLR0_PORT0NONSECURE_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PORT0SECURE @Bit 17 : Write '1' to disable interrupt for event PORT0SECURE */
  #define GPIOTE_INTENCLR0_PORT0SECURE_Pos (17UL)    /*!< Position of PORT0SECURE field.                                       */
  #define GPIOTE_INTENCLR0_PORT0SECURE_Msk (0x1UL << GPIOTE_INTENCLR0_PORT0SECURE_Pos) /*!< Bit mask of PORT0SECURE field.     */
  #define GPIOTE_INTENCLR0_PORT0SECURE_Min (0x0UL)   /*!< Min enumerator value of PORT0SECURE field.                           */
  #define GPIOTE_INTENCLR0_PORT0SECURE_Max (0x1UL)   /*!< Max enumerator value of PORT0SECURE field.                           */
  #define GPIOTE_INTENCLR0_PORT0SECURE_Clear (0x1UL) /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT0SECURE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GPIOTE_INTENCLR0_PORT0SECURE_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* PORT1NONSECURE @Bit 18 : Write '1' to disable interrupt for event PORT1NONSECURE */
  #define GPIOTE_INTENCLR0_PORT1NONSECURE_Pos (18UL) /*!< Position of PORT1NONSECURE field.                                    */
  #define GPIOTE_INTENCLR0_PORT1NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR0_PORT1NONSECURE_Pos) /*!< Bit mask of PORT1NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR0_PORT1NONSECURE_Min (0x0UL) /*!< Min enumerator value of PORT1NONSECURE field.                       */
  #define GPIOTE_INTENCLR0_PORT1NONSECURE_Max (0x1UL) /*!< Max enumerator value of PORT1NONSECURE field.                       */
  #define GPIOTE_INTENCLR0_PORT1NONSECURE_Clear (0x1UL) /*!< Disable                                                           */
  #define GPIOTE_INTENCLR0_PORT1NONSECURE_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GPIOTE_INTENCLR0_PORT1NONSECURE_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PORT1SECURE @Bit 19 : Write '1' to disable interrupt for event PORT1SECURE */
  #define GPIOTE_INTENCLR0_PORT1SECURE_Pos (19UL)    /*!< Position of PORT1SECURE field.                                       */
  #define GPIOTE_INTENCLR0_PORT1SECURE_Msk (0x1UL << GPIOTE_INTENCLR0_PORT1SECURE_Pos) /*!< Bit mask of PORT1SECURE field.     */
  #define GPIOTE_INTENCLR0_PORT1SECURE_Min (0x0UL)   /*!< Min enumerator value of PORT1SECURE field.                           */
  #define GPIOTE_INTENCLR0_PORT1SECURE_Max (0x1UL)   /*!< Max enumerator value of PORT1SECURE field.                           */
  #define GPIOTE_INTENCLR0_PORT1SECURE_Clear (0x1UL) /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT1SECURE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GPIOTE_INTENCLR0_PORT1SECURE_Enabled (0x1UL) /*!< Read: Enabled                                                      */

