adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PORT2NONSECURE @Bit 20 : Write '1' to disable interrupt for event PORT2NONSECURE */
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Pos (20UL) /*!< Position of PORT2NONSECURE field.                                    */
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR5_PORT2NONSECURE_Pos) /*!< Bit mask of PORT2NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Min (0x0UL) /*!< Min enumerator value of PORT2NONSECURE field.                       */
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Max (0x1UL) /*!< Max enumerator value of PORT2NONSECURE field.                       */
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Clear (0x1UL) /*!< Disable                                                           */
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PORT2SECURE @Bit 21 : Write '1' to disable interrupt for event PORT2SECURE */
  #define GPIOTE_INTENCLR5_PORT2SECURE_Pos (21UL)    /*!< Position of PORT2SECURE field.                                       */
  #define GPIOTE_INTENCLR5_PORT2SECURE_Msk (0x1UL << GPIOTE_INTENCLR5_PORT2SECURE_Pos) /*!< Bit mask of PORT2SECURE field.     */
  #define GPIOTE_INTENCLR5_PORT2SECURE_Min (0x0UL)   /*!< Min enumerator value of PORT2SECURE field.                           */
  #define GPIOTE_INTENCLR5_PORT2SECURE_Max (0x1UL)   /*!< Max enumerator value of PORT2SECURE field.                           */
  #define GPIOTE_INTENCLR5_PORT2SECURE_Clear (0x1UL) /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT2SECURE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GPIOTE_INTENCLR5_PORT2SECURE_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* PORT3NONSECURE @Bit 22 : Write '1' to disable interrupt for event PORT3NONSECURE */
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Pos (22UL) /*!< Position of PORT3NONSECURE field.                                    */
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR5_PORT3NONSECURE_Pos) /*!< Bit mask of PORT3NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Min (0x0UL) /*!< Min enumerator value of PORT3NONSECURE field.                       */
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Max (0x1UL) /*!< Max enumerator value of PORT3NONSECURE field.                       */
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Clear (0x1UL) /*!< Disable                                                           */
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PORT3SECURE @Bit 23 : Write '1' to disable interrupt for event PORT3SECURE */
  #define GPIOTE_INTENCLR5_PORT3SECURE_Pos (23UL)    /*!< Position of PORT3SECURE field.                                       */
  #define GPIOTE_INTENCLR5_PORT3SECURE_Msk (0x1UL << GPIOTE_INTENCLR5_PORT3SECURE_Pos) /*!< Bit mask of PORT3SECURE field.     */
  #define GPIOTE_INTENCLR5_PORT3SECURE_Min (0x0UL)   /*!< Min enumerator value of PORT3SECURE field.                           */
  #define GPIOTE_INTENCLR5_PORT3SECURE_Max (0x1UL)   /*!< Max enumerator value of PORT3SECURE field.                           */
  #define GPIOTE_INTENCLR5_PORT3SECURE_Clear (0x1UL) /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT3SECURE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GPIOTE_INTENCLR5_PORT3SECURE_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* GPIOTE_INTEN6: Enable or disable interrupt */
  #define GPIOTE_INTEN6_ResetValue (0x00000000UL)    /*!< Reset value of INTEN6 register.                                      */

/* IN0 @Bit 0 : Enable or disable interrupt for event IN[0] */
  #define GPIOTE_INTEN6_IN0_Pos (0UL)                /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTEN6_IN0_Msk (0x1UL << GPIOTE_INTEN6_IN0_Pos) /*!< Bit mask of IN0 field.                                   */
  #define GPIOTE_INTEN6_IN0_Min (0x0UL)              /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTEN6_IN0_Max (0x1UL)              /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTEN6_IN0_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN6_IN0_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN1 @Bit 1 : Enable or disable interrupt for event IN[1] */
  #define GPIOTE_INTEN6_IN1_Pos (1UL)                /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTEN6_IN1_Msk (0x1UL << GPIOTE_INTEN6_IN1_Pos) /*!< Bit mask of IN1 field.                                   */
  #define GPIOTE_INTEN6_IN1_Min (0x0UL)              /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTEN6_IN1_Max (0x1UL)              /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTEN6_IN1_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN6_IN1_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN2 @Bit 2 : Enable or disable interrupt for event IN[2] */
  #define GPIOTE_INTEN6_IN2_Pos (2UL)                /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTEN6_IN2_Msk (0x1UL << GPIOTE_INTEN6_IN2_Pos) /*!< Bit mask of IN2 field.                                   */
  #define GPIOTE_INTEN6_IN2_Min (0x0UL)              /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTEN6_IN2_Max (0x1UL)              /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTEN6_IN2_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN6_IN2_Enabled (0x1UL)          /*!< Enable                                                               */

