adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CPWRUPREQ_BIT1 @Bit 1 : Bit 1 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT1_Pos (1UL)     /*!< Position of CPWRUPREQ_BIT1 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT1_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT1_Pos) /*!< Bit mask of CPWRUPREQ_BIT1 field.  */

/* CPWRUPREQ_BIT2 @Bit 2 : Bit 2 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT2_Pos (2UL)     /*!< Position of CPWRUPREQ_BIT2 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT2_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT2_Pos) /*!< Bit mask of CPWRUPREQ_BIT2 field.  */

/* CPWRUPREQ_BIT3 @Bit 3 : Bit 3 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT3_Pos (3UL)     /*!< Position of CPWRUPREQ_BIT3 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT3_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT3_Pos) /*!< Bit mask of CPWRUPREQ_BIT3 field.  */

/* CPWRUPREQ_BIT4 @Bit 4 : Bit 4 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT4_Pos (4UL)     /*!< Position of CPWRUPREQ_BIT4 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT4_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT4_Pos) /*!< Bit mask of CPWRUPREQ_BIT4 field.  */

/* CPWRUPREQ_BIT5 @Bit 5 : Bit 5 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT5_Pos (5UL)     /*!< Position of CPWRUPREQ_BIT5 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT5_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT5_Pos) /*!< Bit mask of CPWRUPREQ_BIT5 field.  */

/* CPWRUPREQ_BIT6 @Bit 6 : Bit 6 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT6_Pos (6UL)     /*!< Position of CPWRUPREQ_BIT6 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT6_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT6_Pos) /*!< Bit mask of CPWRUPREQ_BIT6 field.  */

/* CPWRUPREQ_BIT7 @Bit 7 : Bit 7 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT7_Pos (7UL)     /*!< Position of CPWRUPREQ_BIT7 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT7_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT7_Pos) /*!< Bit mask of CPWRUPREQ_BIT7 field.  */

/* CPWRUPREQ_BIT8 @Bit 8 : Bit 8 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT8_Pos (8UL)     /*!< Position of CPWRUPREQ_BIT8 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT8_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT8_Pos) /*!< Bit mask of CPWRUPREQ_BIT8 field.  */


/* GPR_CPWRUPACK: Debug Power Acknowledge Register */
  #define GPR_CPWRUPACK_ResetValue (0x00000000UL)    /*!< Reset value of CPWRUPACK register.                                   */

/* CPWRUPACK_BIT0 @Bit 0 : Bit 0 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT0_Pos (0UL)     /*!< Position of CPWRUPACK_BIT0 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT0_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT0_Pos) /*!< Bit mask of CPWRUPACK_BIT0 field.  */

/* CPWRUPACK_BIT1 @Bit 1 : Bit 1 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT1_Pos (1UL)     /*!< Position of CPWRUPACK_BIT1 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT1_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT1_Pos) /*!< Bit mask of CPWRUPACK_BIT1 field.  */

/* CPWRUPACK_BIT2 @Bit 2 : Bit 2 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT2_Pos (2UL)     /*!< Position of CPWRUPACK_BIT2 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT2_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT2_Pos) /*!< Bit mask of CPWRUPACK_BIT2 field.  */

/* CPWRUPACK_BIT3 @Bit 3 : Bit 3 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT3_Pos (3UL)     /*!< Position of CPWRUPACK_BIT3 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT3_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT3_Pos) /*!< Bit mask of CPWRUPACK_BIT3 field.  */

/* CPWRUPACK_BIT4 @Bit 4 : Bit 4 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT4_Pos (4UL)     /*!< Position of CPWRUPACK_BIT4 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT4_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT4_Pos) /*!< Bit mask of CPWRUPACK_BIT4 field.  */

/* CPWRUPACK_BIT5 @Bit 5 : Bit 5 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT5_Pos (5UL)     /*!< Position of CPWRUPACK_BIT5 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT5_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT5_Pos) /*!< Bit mask of CPWRUPACK_BIT5 field.  */

/* CPWRUPACK_BIT6 @Bit 6 : Bit 6 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT6_Pos (6UL)     /*!< Position of CPWRUPACK_BIT6 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT6_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT6_Pos) /*!< Bit mask of CPWRUPACK_BIT6 field.  */

/* CPWRUPACK_BIT7 @Bit 7 : Bit 7 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT7_Pos (7UL)     /*!< Position of CPWRUPACK_BIT7 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT7_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT7_Pos) /*!< Bit mask of CPWRUPACK_BIT7 field.  */

/* CPWRUPACK_BIT8 @Bit 8 : Bit 8 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT8_Pos (8UL)     /*!< Position of CPWRUPACK_BIT8 field.                                    */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT8_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT8_Pos) /*!< Bit mask of CPWRUPACK_BIT8 field.  */


/* GPR_ITCTRL: Integration Mode Control Register */
  #define GPR_ITCTRL_ResetValue (0x00000000UL)       /*!< Reset value of ITCTRL register.                                      */

/* INTEGRATION_MODE @Bit 0 : When you read this register, CXGPR returns a zero because no integration functionality is
                             implemented. */

  #define GPR_ITCTRL_INTEGRATION_MODE_Pos (0UL)      /*!< Position of INTEGRATION_MODE field.                                  */
  #define GPR_ITCTRL_INTEGRATION_MODE_Msk (0x1UL << GPR_ITCTRL_INTEGRATION_MODE_Pos) /*!< Bit mask of INTEGRATION_MODE field.  */


/* GPR_CLAIMSET: Claim Tag Set Register */
  #define GPR_CLAIMSET_ResetValue (0x0000000FUL)     /*!< Reset value of CLAIMSET register.                                    */

/* CLAIMSET @Bits 0..3 : On Read for each bit 1 means claim tag bit implemented. On Write for each bit 0 has no effect, 1 sets
                         the relevant bit of the claim tag */

  #define GPR_CLAIMSET_CLAIMSET_Pos (0UL)            /*!< Position of CLAIMSET field.                                          */
  #define GPR_CLAIMSET_CLAIMSET_Msk (0xFUL << GPR_CLAIMSET_CLAIMSET_Pos) /*!< Bit mask of CLAIMSET field.                      */


/* GPR_CLAIMCLR: Claim Tag Clear Register */
  #define GPR_CLAIMCLR_ResetValue (0x00000000UL)     /*!< Reset value of CLAIMCLR register.                                    */

/* CLAIMCLR @Bits 0..3 : The value present reflects the present value of the Claim Tag. */
  #define GPR_CLAIMCLR_CLAIMCLR_Pos (0UL)            /*!< Position of CLAIMCLR field.                                          */
  #define GPR_CLAIMCLR_CLAIMCLR_Msk (0xFUL << GPR_CLAIMCLR_CLAIMCLR_Pos) /*!< Bit mask of CLAIMCLR field.                      */


/* GPR_LOCKACCESS: Lock Access Register */
  #define GPR_LOCKACCESS_ResetValue (0x00000000UL)   /*!< Reset value of LOCKACCESS register.                                  */

/* LOCKACCESS @Bits 0..31 : When you write 0xC5ACCE55, subsequent write operations to this device are enabled. Any other value
                            disables subsequent write operations. */

  #define GPR_LOCKACCESS_LOCKACCESS_Pos (0UL)        /*!< Position of LOCKACCESS field.                                        */
  #define GPR_LOCKACCESS_LOCKACCESS_Msk (0xFFFFFFFFUL << GPR_LOCKACCESS_LOCKACCESS_Pos) /*!< Bit mask of LOCKACCESS field.     */


