adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GPR_LOCKSTATUS: Lock Status Register */
  #define GPR_LOCKSTATUS_ResetValue (0x00000003UL)   /*!< Reset value of LOCKSTATUS register.                                  */

/* LOCKEXIST @Bit 0 : Indicates that a lock control mechanism is present in this device. */
  #define GPR_LOCKSTATUS_LOCKEXIST_Pos (0UL)         /*!< Position of LOCKEXIST field.                                         */
  #define GPR_LOCKSTATUS_LOCKEXIST_Msk (0x1UL << GPR_LOCKSTATUS_LOCKEXIST_Pos) /*!< Bit mask of LOCKEXIST field.               */

/* LOCKGRANT @Bit 1 : Returns the present lock status of the device. */
  #define GPR_LOCKSTATUS_LOCKGRANT_Pos (1UL)         /*!< Position of LOCKGRANT field.                                         */
  #define GPR_LOCKSTATUS_LOCKGRANT_Msk (0x1UL << GPR_LOCKSTATUS_LOCKGRANT_Pos) /*!< Bit mask of LOCKGRANT field.               */

/* LOCKTYPE @Bit 2 : Indicates that the Lock Access Register is implemented as 32-bit. */
  #define GPR_LOCKSTATUS_LOCKTYPE_Pos (2UL)          /*!< Position of LOCKTYPE field.                                          */
  #define GPR_LOCKSTATUS_LOCKTYPE_Msk (0x1UL << GPR_LOCKSTATUS_LOCKTYPE_Pos) /*!< Bit mask of LOCKTYPE field.                  */


/* GPR_AUTHSTATUS: Authentication Status Register */
  #define GPR_AUTHSTATUS_ResetValue (0x00000000UL)   /*!< Reset value of AUTHSTATUS register.                                  */

/* NSID @Bits 0..1 : Indicates the security level for Non-Secure Invasive Debug. */
  #define GPR_AUTHSTATUS_NSID_Pos (0UL)              /*!< Position of NSID field.                                              */
  #define GPR_AUTHSTATUS_NSID_Msk (0x3UL << GPR_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                              */

/* NSNID @Bits 2..3 : Indicates the security level for Non-Secure Non-Invasive Debug. */
  #define GPR_AUTHSTATUS_NSNID_Pos (2UL)             /*!< Position of NSNID field.                                             */
  #define GPR_AUTHSTATUS_NSNID_Msk (0x3UL << GPR_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                           */

/* SID @Bits 4..5 : Indicates the security level for Secure Invasive Debug. */
  #define GPR_AUTHSTATUS_SID_Pos (4UL)               /*!< Position of SID field.                                               */
  #define GPR_AUTHSTATUS_SID_Msk (0x3UL << GPR_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                                 */

/* SNID @Bits 6..7 : Indicates the security level for Secure Non-Invasive Debug. */
  #define GPR_AUTHSTATUS_SNID_Pos (6UL)              /*!< Position of SNID field.                                              */
  #define GPR_AUTHSTATUS_SNID_Msk (0x3UL << GPR_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                              */


/* GPR_DEVARCH: Device Architecture Register */
  #define GPR_DEVARCH_ResetValue (0x47700A34UL)      /*!< Reset value of DEVARCH register.                                     */

/* ARCHID @Bits 0..15 : Indicates the architecture of the component. */
  #define GPR_DEVARCH_ARCHID_Pos (0UL)               /*!< Position of ARCHID field.                                            */
  #define GPR_DEVARCH_ARCHID_Msk (0xFFFFUL << GPR_DEVARCH_ARCHID_Pos) /*!< Bit mask of ARCHID field.                           */

/* REVISION @Bits 16..19 : Indicates the revision of the architecture. */
  #define GPR_DEVARCH_REVISION_Pos (16UL)            /*!< Position of REVISION field.                                          */
  #define GPR_DEVARCH_REVISION_Msk (0xFUL << GPR_DEVARCH_REVISION_Pos) /*!< Bit mask of REVISION field.                        */

/* PRESENT @Bit 20 : Indicates whether the DEVARCH register is present. */
  #define GPR_DEVARCH_PRESENT_Pos (20UL)             /*!< Position of PRESENT field.                                           */
  #define GPR_DEVARCH_PRESENT_Msk (0x1UL << GPR_DEVARCH_PRESENT_Pos) /*!< Bit mask of PRESENT field.                           */

/* ARCHITECT @Bits 21..31 : Indicates the JEP106 code pf the architect who specifies the architecture of the component. Bits
                            [31:28] are the JEP106 continuation code. Bits [27:21] are the JEP106 identity code. */

  #define GPR_DEVARCH_ARCHITECT_Pos (21UL)           /*!< Position of ARCHITECT field.                                         */
  #define GPR_DEVARCH_ARCHITECT_Msk (0x7FFUL << GPR_DEVARCH_ARCHITECT_Pos) /*!< Bit mask of ARCHITECT field.                   */


/* GPR_DEVID: Device Configuration Register */
  #define GPR_DEVID_ResetValue (0x00000001UL)        /*!< Reset value of DEVID register.                                       */

/* CPWRUPM_COUNT @Bits 0..5 : The value present in this field indicates the number of CPWRUP master interfaces available in
                              CXGPR. Permitted range of values: 0x1 to 0x20. */

  #define GPR_DEVID_CPWRUPM_COUNT_Pos (0UL)          /*!< Position of CPWRUPM_COUNT field.                                     */
  #define GPR_DEVID_CPWRUPM_COUNT_Msk (0x3FUL << GPR_DEVID_CPWRUPM_COUNT_Pos) /*!< Bit mask of CPWRUPM_COUNT field.            */


/* GPR_DEVTYPE: Device Type Identifier Register */
  #define GPR_DEVTYPE_ResetValue (0x00000034UL)      /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR_TYPE @Bits 0..3 : Major classification of the type of the debug component as specified in the CoreSight Architecture
                           Specification for this debug and trace component. */

  #define GPR_DEVTYPE_MAJOR_TYPE_Pos (0UL)           /*!< Position of MAJOR_TYPE field.                                        */
  #define GPR_DEVTYPE_MAJOR_TYPE_Msk (0xFUL << GPR_DEVTYPE_MAJOR_TYPE_Pos) /*!< Bit mask of MAJOR_TYPE field.                  */

/* SUB_TYPE @Bits 4..7 : Sub-classification of the type of the debug component as specified in the CoreSight Architecture
                         Specification within the major classification as specified in the Major_Type field. */

  #define GPR_DEVTYPE_SUB_TYPE_Pos (4UL)             /*!< Position of SUB_TYPE field.                                          */
  #define GPR_DEVTYPE_SUB_TYPE_Msk (0xFUL << GPR_DEVTYPE_SUB_TYPE_Pos) /*!< Bit mask of SUB_TYPE field.                        */


/* GPR_PERIPHID4: Peripheral ID4 Register */
  #define GPR_PERIPHID4_ResetValue (0x00000004UL)    /*!< Reset value of PERIPHID4 register.                                   */

