adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DES_2 @Bits 0..3 : This is the JEDEC JEP106 continuation code. This code along with, bits[6:4] of the identity code defined
                      in PERIPHID0 register. and with bits[3:0] of the identity code defined in PERIPHID1 register, gives the
                      designer of the component. */

  #define GPR_PERIPHID4_DES_2_Pos (0UL)              /*!< Position of DES_2 field.                                             */
  #define GPR_PERIPHID4_DES_2_Msk (0xFUL << GPR_PERIPHID4_DES_2_Pos) /*!< Bit mask of DES_2 field.                             */

/* SIZE @Bits 4..7 : This is a 4-bit value that indicates the total contiguous size in powers of two of the memory window that
                     this component uses from the standard 4KB. If a component only requires the standard 4KB size then this
                     reads as 0x0, for 8KB: 0x1, 16KB:0x2, 32KB: 0x3, until 128MB. */

  #define GPR_PERIPHID4_SIZE_Pos (4UL)               /*!< Position of SIZE field.                                              */
  #define GPR_PERIPHID4_SIZE_Msk (0xFUL << GPR_PERIPHID4_SIZE_Pos) /*!< Bit mask of SIZE field.                                */


/* GPR_PERIPHID0: Peripheral ID0 Register */
  #define GPR_PERIPHID0_ResetValue (0x000000A4UL)    /*!< Reset value of PERIPHID0 register.                                   */

/* PART_0 @Bits 0..7 : Bits [7:0] of the components 12 bit part number. The designer of the component assigns this part number.
                       */

  #define GPR_PERIPHID0_PART_0_Pos (0UL)             /*!< Position of PART_0 field.                                            */
  #define GPR_PERIPHID0_PART_0_Msk (0xFFUL << GPR_PERIPHID0_PART_0_Pos) /*!< Bit mask of PART_0 field.                         */


/* GPR_PERIPHID1: Peripheral ID1 Register */
  #define GPR_PERIPHID1_ResetValue (0x000000B9UL)    /*!< Reset value of PERIPHID1 register.                                   */

/* PART_1 @Bits 0..3 : Bits[11:8] of the components 12 bit part number. The designer of the component assigns this part number.
                       */

  #define GPR_PERIPHID1_PART_1_Pos (0UL)             /*!< Position of PART_1 field.                                            */
  #define GPR_PERIPHID1_PART_1_Msk (0xFUL << GPR_PERIPHID1_PART_1_Pos) /*!< Bit mask of PART_1 field.                          */

/* DES_0 @Bits 4..7 : Bits[3:0] of the JEDEC JEP106 identity code. This code, along with bits[6:4] of the identity code defined
                      in PERIPHID2 register and the continuation code defined in PERIPHID4 register, gives the designer of the
                      component. */

  #define GPR_PERIPHID1_DES_0_Pos (4UL)              /*!< Position of DES_0 field.                                             */
  #define GPR_PERIPHID1_DES_0_Msk (0xFUL << GPR_PERIPHID1_DES_0_Pos) /*!< Bit mask of DES_0 field.                             */


/* GPR_PERIPHID2: Peripheral ID2 Register */
  #define GPR_PERIPHID2_ResetValue (0x0000000BUL)    /*!< Reset value of PERIPHID2 register.                                   */

/* DES_1 @Bits 0..2 : Bits[6:4] of the JEDEC JEP106 identity code. This code, along with bits[3:0] of the identity code defined
                      in PERIPHID1 register and the continuation code defined in PERIPHID4 register, gives the designer of the
                      component. */

  #define GPR_PERIPHID2_DES_1_Pos (0UL)              /*!< Position of DES_1 field.                                             */
  #define GPR_PERIPHID2_DES_1_Msk (0x7UL << GPR_PERIPHID2_DES_1_Pos) /*!< Bit mask of DES_1 field.                             */

/* JEDEC @Bit 3 : Always set. Indicates if the JEDEC assigned designer ID is used. */
  #define GPR_PERIPHID2_JEDEC_Pos (3UL)              /*!< Position of JEDEC field.                                             */
  #define GPR_PERIPHID2_JEDEC_Msk (0x1UL << GPR_PERIPHID2_JEDEC_Pos) /*!< Bit mask of JEDEC field.                             */

/* REVISION @Bits 4..7 : An incremental value starting from 0x0 for the first revision of this component. This increases by 1
                         for both major and minor revisions and is used to identify the major or minor revisions. */

  #define GPR_PERIPHID2_REVISION_Pos (4UL)           /*!< Position of REVISION field.                                          */
  #define GPR_PERIPHID2_REVISION_Msk (0xFUL << GPR_PERIPHID2_REVISION_Pos) /*!< Bit mask of REVISION field.                    */


/* GPR_PERIPHID3: Peripheral ID3 Register */
  #define GPR_PERIPHID3_ResetValue (0x00000000UL)    /*!< Reset value of PERIPHID3 register.                                   */

/* CMOD @Bits 0..3 : Indicates if the customer modified the behavior of the component. In most cases, this field might be zero.
                     The customer changes this value on modifications to this component. */

  #define GPR_PERIPHID3_CMOD_Pos (0UL)               /*!< Position of CMOD field.                                              */
  #define GPR_PERIPHID3_CMOD_Msk (0xFUL << GPR_PERIPHID3_CMOD_Pos) /*!< Bit mask of CMOD field.                                */

/* REVAND @Bits 4..7 : Indicates minor errata fixes specific to the revision of the component being used, for example metal
                       fixes after implementation. In most cases, this field might be zero. ARM recommends that the component
                       designers ensure that a metal fix can change this field if required, for example, by driving it from
                       registers that reset to zero. */

  #define GPR_PERIPHID3_REVAND_Pos (4UL)             /*!< Position of REVAND field.                                            */
  #define GPR_PERIPHID3_REVAND_Msk (0xFUL << GPR_PERIPHID3_REVAND_Pos) /*!< Bit mask of REVAND field.                          */


/* GPR_COMPID0: Component ID0 Register */
  #define GPR_COMPID0_ResetValue (0x0000000DUL)      /*!< Reset value of COMPID0 register.                                     */

/* PRMBL_0 @Bits 0..7 : Contains bits[7:0] of the component identification code. */
  #define GPR_COMPID0_PRMBL_0_Pos (0UL)              /*!< Position of PRMBL_0 field.                                           */
  #define GPR_COMPID0_PRMBL_0_Msk (0xFFUL << GPR_COMPID0_PRMBL_0_Pos) /*!< Bit mask of PRMBL_0 field.                          */


/* GPR_COMPID1: Component ID1 Register */
  #define GPR_COMPID1_ResetValue (0x00000090UL)      /*!< Reset value of COMPID1 register.                                     */

/* PRMBL_1 @Bits 0..3 : Contains bits [11:8] of the component identification */
  #define GPR_COMPID1_PRMBL_1_Pos (0UL)              /*!< Position of PRMBL_1 field.                                           */
  #define GPR_COMPID1_PRMBL_1_Msk (0xFUL << GPR_COMPID1_PRMBL_1_Pos) /*!< Bit mask of PRMBL_1 field.                           */

/* CLASS @Bits 4..7 : Class of the component, for example, if the component is a ROM table or a generic CoreSight component.
                      Contains bits[15:12] of the component identification code. */

