adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define GPR_COMPID1_CLASS_Pos (4UL)                /*!< Position of CLASS field.                                             */
  #define GPR_COMPID1_CLASS_Msk (0xFUL << GPR_COMPID1_CLASS_Pos) /*!< Bit mask of CLASS field.                                 */


/* GPR_COMPID2: Component ID2 Register */
  #define GPR_COMPID2_ResetValue (0x00000005UL)      /*!< Reset value of COMPID2 register.                                     */

/* PRMBL_2 @Bits 0..7 : Contains bits [23:16] of the component identification */
  #define GPR_COMPID2_PRMBL_2_Pos (0UL)              /*!< Position of PRMBL_2 field.                                           */
  #define GPR_COMPID2_PRMBL_2_Msk (0xFFUL << GPR_COMPID2_PRMBL_2_Pos) /*!< Bit mask of PRMBL_2 field.                          */


/* GPR_COMPID3: Component ID3 Register */
  #define GPR_COMPID3_ResetValue (0x000000B1UL)      /*!< Reset value of COMPID3 register.                                     */

/* PRMBL_3 @Bits 0..7 : Contains bits [31:24] of the component identification */
  #define GPR_COMPID3_PRMBL_3_Pos (0UL)              /*!< Position of PRMBL_3 field.                                           */
  #define GPR_COMPID3_PRMBL_3_Msk (0xFFUL << GPR_COMPID3_PRMBL_3_Pos) /*!< Bit mask of PRMBL_3 field.                          */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GRCCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct GRCCONF_GRCFORCEON ================================================ */
/**
  * @brief GRCFORCEON [GRCCONF_GRCFORCEON] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MASK0;                             /*!< (@ 0x00000000) Mask the active power domain request due to interrupt
                                                                         from GRC peripheral identifier [31:0]*/
  __IOM uint32_t  MASK1;                             /*!< (@ 0x00000004) Mask the active power domain request due to interrupt
                                                                         from GRC peripheral identifier [63 : 32]*/
} NRF_GRCCONF_GRCFORCEON_Type;                       /*!< Size = 8 (0x008)                                                     */

/* GRCCONF_GRCFORCEON_MASK0: Mask the active power domain request due to interrupt from GRC peripheral identifier [31:0] */
  #define GRCCONF_GRCFORCEON_MASK0_ResetValue (0x00000000UL) /*!< Reset value of MASK0 register.                               */

/* PERIPHID0 @Bit 0 : GRC peripheral identifier [0] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Pos (0UL) /*!< Position of PERIPHID0 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Pos) /*!< Bit mask of PERIPHID0
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Min (0x0UL) /*!< Min enumerator value of PERIPHID0 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Max (0x1UL) /*!< Max enumerator value of PERIPHID0 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [0] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [0]
                                                             interrupt is active*/

/* PERIPHID1 @Bit 1 : GRC peripheral identifier [1] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Pos (1UL) /*!< Position of PERIPHID1 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Pos) /*!< Bit mask of PERIPHID1
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Min (0x0UL) /*!< Min enumerator value of PERIPHID1 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Max (0x1UL) /*!< Max enumerator value of PERIPHID1 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [1] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [1]
                                                             interrupt is active*/

/* PERIPHID2 @Bit 2 : GRC peripheral identifier [2] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Pos (2UL) /*!< Position of PERIPHID2 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Pos) /*!< Bit mask of PERIPHID2
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Min (0x0UL) /*!< Min enumerator value of PERIPHID2 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Max (0x1UL) /*!< Max enumerator value of PERIPHID2 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [2] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [2]
                                                             interrupt is active*/

/* PERIPHID3 @Bit 3 : GRC peripheral identifier [3] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Pos (3UL) /*!< Position of PERIPHID3 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Pos) /*!< Bit mask of PERIPHID3
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Min (0x0UL) /*!< Min enumerator value of PERIPHID3 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Max (0x1UL) /*!< Max enumerator value of PERIPHID3 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [3] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [3]
                                                             interrupt is active*/

/* PERIPHID4 @Bit 4 : GRC peripheral identifier [4] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Pos (4UL) /*!< Position of PERIPHID4 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Pos) /*!< Bit mask of PERIPHID4
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Min (0x0UL) /*!< Min enumerator value of PERIPHID4 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Max (0x1UL) /*!< Max enumerator value of PERIPHID4 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [4] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [4]
                                                             interrupt is active*/

/* PERIPHID5 @Bit 5 : GRC peripheral identifier [5] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Pos (5UL) /*!< Position of PERIPHID5 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Pos) /*!< Bit mask of PERIPHID5
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Min (0x0UL) /*!< Min enumerator value of PERIPHID5 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Max (0x1UL) /*!< Max enumerator value of PERIPHID5 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [5] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [5]
                                                             interrupt is active*/

/* PERIPHID6 @Bit 6 : GRC peripheral identifier [6] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Pos (6UL) /*!< Position of PERIPHID6 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Pos) /*!< Bit mask of PERIPHID6
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Min (0x0UL) /*!< Min enumerator value of PERIPHID6 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Max (0x1UL) /*!< Max enumerator value of PERIPHID6 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [6] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [6]
                                                             interrupt is active*/

