adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PERIPHID7 @Bit 7 : GRC peripheral identifier [7] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Pos (7UL) /*!< Position of PERIPHID7 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Pos) /*!< Bit mask of PERIPHID7
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Min (0x0UL) /*!< Min enumerator value of PERIPHID7 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Max (0x1UL) /*!< Max enumerator value of PERIPHID7 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [7] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [7]
                                                             interrupt is active*/

/* PERIPHID8 @Bit 8 : GRC peripheral identifier [8] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Pos (8UL) /*!< Position of PERIPHID8 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Pos) /*!< Bit mask of PERIPHID8
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Min (0x0UL) /*!< Min enumerator value of PERIPHID8 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Max (0x1UL) /*!< Max enumerator value of PERIPHID8 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [8] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [8]
                                                             interrupt is active*/

/* PERIPHID9 @Bit 9 : GRC peripheral identifier [9] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Pos (9UL) /*!< Position of PERIPHID9 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Pos) /*!< Bit mask of PERIPHID9
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Min (0x0UL) /*!< Min enumerator value of PERIPHID9 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Max (0x1UL) /*!< Max enumerator value of PERIPHID9 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [9] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [9]
                                                             interrupt is active*/

/* PERIPHID10 @Bit 10 : GRC peripheral identifier [10] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Pos (10UL) /*!< Position of PERIPHID10 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Pos) /*!< Bit mask of PERIPHID10
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Min (0x0UL) /*!< Min enumerator value of PERIPHID10 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Max (0x1UL) /*!< Max enumerator value of PERIPHID10 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [10] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [10]
                                                              interrupt is active*/

/* PERIPHID11 @Bit 11 : GRC peripheral identifier [11] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Pos (11UL) /*!< Position of PERIPHID11 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Pos) /*!< Bit mask of PERIPHID11
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Min (0x0UL) /*!< Min enumerator value of PERIPHID11 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Max (0x1UL) /*!< Max enumerator value of PERIPHID11 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [11] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [11]
                                                              interrupt is active*/

/* PERIPHID12 @Bit 12 : GRC peripheral identifier [12] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Pos (12UL) /*!< Position of PERIPHID12 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Pos) /*!< Bit mask of PERIPHID12
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Min (0x0UL) /*!< Min enumerator value of PERIPHID12 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Max (0x1UL) /*!< Max enumerator value of PERIPHID12 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [12] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [12]
                                                              interrupt is active*/

