adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PERIPHID23 @Bit 23 : GRC peripheral identifier [23] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Pos (23UL) /*!< Position of PERIPHID23 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Pos) /*!< Bit mask of PERIPHID23
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Min (0x0UL) /*!< Min enumerator value of PERIPHID23 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Max (0x1UL) /*!< Max enumerator value of PERIPHID23 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [23] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [23]
                                                              interrupt is active*/

/* PERIPHID24 @Bit 24 : GRC peripheral identifier [24] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Pos (24UL) /*!< Position of PERIPHID24 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Pos) /*!< Bit mask of PERIPHID24
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Min (0x0UL) /*!< Min enumerator value of PERIPHID24 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Max (0x1UL) /*!< Max enumerator value of PERIPHID24 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [24] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [24]
                                                              interrupt is active*/

/* PERIPHID25 @Bit 25 : GRC peripheral identifier [25] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Pos (25UL) /*!< Position of PERIPHID25 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Pos) /*!< Bit mask of PERIPHID25
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Min (0x0UL) /*!< Min enumerator value of PERIPHID25 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Max (0x1UL) /*!< Max enumerator value of PERIPHID25 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [25] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [25]
                                                              interrupt is active*/

/* PERIPHID26 @Bit 26 : GRC peripheral identifier [26] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Pos (26UL) /*!< Position of PERIPHID26 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Pos) /*!< Bit mask of PERIPHID26
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Min (0x0UL) /*!< Min enumerator value of PERIPHID26 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Max (0x1UL) /*!< Max enumerator value of PERIPHID26 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [26] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [26]
                                                              interrupt is active*/

/* PERIPHID27 @Bit 27 : GRC peripheral identifier [27] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Pos (27UL) /*!< Position of PERIPHID27 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Pos) /*!< Bit mask of PERIPHID27
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Min (0x0UL) /*!< Min enumerator value of PERIPHID27 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Max (0x1UL) /*!< Max enumerator value of PERIPHID27 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [27] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [27]
                                                              interrupt is active*/

/* PERIPHID28 @Bit 28 : GRC peripheral identifier [28] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Pos (28UL) /*!< Position of PERIPHID28 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Pos) /*!< Bit mask of PERIPHID28
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Min (0x0UL) /*!< Min enumerator value of PERIPHID28 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Max (0x1UL) /*!< Max enumerator value of PERIPHID28 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [28] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [28]
                                                              interrupt is active*/

/* PERIPHID29 @Bit 29 : GRC peripheral identifier [29] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Pos (29UL) /*!< Position of PERIPHID29 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Pos) /*!< Bit mask of PERIPHID29
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Min (0x0UL) /*!< Min enumerator value of PERIPHID29 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Max (0x1UL) /*!< Max enumerator value of PERIPHID29 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [29] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [29]
                                                              interrupt is active*/

/* PERIPHID30 @Bit 30 : GRC peripheral identifier [30] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Pos (30UL) /*!< Position of PERIPHID30 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Pos) /*!< Bit mask of PERIPHID30
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Min (0x0UL) /*!< Min enumerator value of PERIPHID30 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Max (0x1UL) /*!< Max enumerator value of PERIPHID30 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [30] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [30]
                                                              interrupt is active*/

/* PERIPHID31 @Bit 31 : GRC peripheral identifier [31] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Pos (31UL) /*!< Position of PERIPHID31 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Pos) /*!< Bit mask of PERIPHID31
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Min (0x0UL) /*!< Min enumerator value of PERIPHID31 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Max (0x1UL) /*!< Max enumerator value of PERIPHID31 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [31] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [31]
                                                              interrupt is active*/


/* GRCCONF_GRCFORCEON_MASK1: Mask the active power domain request due to interrupt from GRC peripheral identifier [63 : 32] */
  #define GRCCONF_GRCFORCEON_MASK1_ResetValue (0x00000000UL) /*!< Reset value of MASK1 register.                               */

/* PERIPHID0 @Bit 0 : GRC peripheral identifier [0] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Pos (0UL) /*!< Position of PERIPHID0 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Pos) /*!< Bit mask of PERIPHID0
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Min (0x0UL) /*!< Min enumerator value of PERIPHID0 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Max (0x1UL) /*!< Max enumerator value of PERIPHID0 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 0] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 0]
                                                             interrupt is active*/

/* PERIPHID1 @Bit 1 : GRC peripheral identifier [1] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Pos (1UL) /*!< Position of PERIPHID1 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Pos) /*!< Bit mask of PERIPHID1
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Min (0x0UL) /*!< Min enumerator value of PERIPHID1 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Max (0x1UL) /*!< Max enumerator value of PERIPHID1 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 1] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 1]
                                                             interrupt is active*/

