adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PERIPHID2 @Bit 2 : GRC peripheral identifier [2] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Pos (2UL) /*!< Position of PERIPHID2 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Pos) /*!< Bit mask of PERIPHID2
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Min (0x0UL) /*!< Min enumerator value of PERIPHID2 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Max (0x1UL) /*!< Max enumerator value of PERIPHID2 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 2] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 2]
                                                             interrupt is active*/

/* PERIPHID3 @Bit 3 : GRC peripheral identifier [3] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Pos (3UL) /*!< Position of PERIPHID3 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Pos) /*!< Bit mask of PERIPHID3
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Min (0x0UL) /*!< Min enumerator value of PERIPHID3 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Max (0x1UL) /*!< Max enumerator value of PERIPHID3 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 3] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 3]
                                                             interrupt is active*/

/* PERIPHID4 @Bit 4 : GRC peripheral identifier [4] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Pos (4UL) /*!< Position of PERIPHID4 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Pos) /*!< Bit mask of PERIPHID4
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Min (0x0UL) /*!< Min enumerator value of PERIPHID4 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Max (0x1UL) /*!< Max enumerator value of PERIPHID4 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 4] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 4]
                                                             interrupt is active*/

/* PERIPHID5 @Bit 5 : GRC peripheral identifier [5] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Pos (5UL) /*!< Position of PERIPHID5 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Pos) /*!< Bit mask of PERIPHID5
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Min (0x0UL) /*!< Min enumerator value of PERIPHID5 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Max (0x1UL) /*!< Max enumerator value of PERIPHID5 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 5] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 5]
                                                             interrupt is active*/

/* PERIPHID6 @Bit 6 : GRC peripheral identifier [6] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Pos (6UL) /*!< Position of PERIPHID6 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Pos) /*!< Bit mask of PERIPHID6
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Min (0x0UL) /*!< Min enumerator value of PERIPHID6 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Max (0x1UL) /*!< Max enumerator value of PERIPHID6 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 6] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 6]
                                                             interrupt is active*/

/* PERIPHID7 @Bit 7 : GRC peripheral identifier [7] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Pos (7UL) /*!< Position of PERIPHID7 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Pos) /*!< Bit mask of PERIPHID7
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Min (0x0UL) /*!< Min enumerator value of PERIPHID7 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Max (0x1UL) /*!< Max enumerator value of PERIPHID7 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 7] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 7]
                                                             interrupt is active*/

/* PERIPHID8 @Bit 8 : GRC peripheral identifier [8] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Pos (8UL) /*!< Position of PERIPHID8 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Pos) /*!< Bit mask of PERIPHID8
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Min (0x0UL) /*!< Min enumerator value of PERIPHID8 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Max (0x1UL) /*!< Max enumerator value of PERIPHID8 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 8] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 8]
                                                             interrupt is active*/

/* PERIPHID9 @Bit 9 : GRC peripheral identifier [9] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Pos (9UL) /*!< Position of PERIPHID9 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Pos) /*!< Bit mask of PERIPHID9
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Min (0x0UL) /*!< Min enumerator value of PERIPHID9 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Max (0x1UL) /*!< Max enumerator value of PERIPHID9 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                              [32 + 9] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 + 9]
                                                             interrupt is active*/

/* PERIPHID10 @Bit 10 : GRC peripheral identifier [10] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Pos (10UL) /*!< Position of PERIPHID10 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Pos) /*!< Bit mask of PERIPHID10
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Min (0x0UL) /*!< Min enumerator value of PERIPHID10 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Max (0x1UL) /*!< Max enumerator value of PERIPHID10 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 10] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              10] interrupt is active*/

/* PERIPHID11 @Bit 11 : GRC peripheral identifier [11] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Pos (11UL) /*!< Position of PERIPHID11 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Pos) /*!< Bit mask of PERIPHID11
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Min (0x0UL) /*!< Min enumerator value of PERIPHID11 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Max (0x1UL) /*!< Max enumerator value of PERIPHID11 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 11] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              11] interrupt is active*/

/* PERIPHID12 @Bit 12 : GRC peripheral identifier [12] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Pos (12UL) /*!< Position of PERIPHID12 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Pos) /*!< Bit mask of PERIPHID12
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Min (0x0UL) /*!< Min enumerator value of PERIPHID12 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Max (0x1UL) /*!< Max enumerator value of PERIPHID12 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 12] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              12] interrupt is active*/

