adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PERIPHID13 @Bit 13 : GRC peripheral identifier [13] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Pos (13UL) /*!< Position of PERIPHID13 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Pos) /*!< Bit mask of PERIPHID13
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Min (0x0UL) /*!< Min enumerator value of PERIPHID13 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Max (0x1UL) /*!< Max enumerator value of PERIPHID13 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 13] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              13] interrupt is active*/

/* PERIPHID14 @Bit 14 : GRC peripheral identifier [14] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Pos (14UL) /*!< Position of PERIPHID14 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Pos) /*!< Bit mask of PERIPHID14
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Min (0x0UL) /*!< Min enumerator value of PERIPHID14 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Max (0x1UL) /*!< Max enumerator value of PERIPHID14 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 14] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              14] interrupt is active*/

/* PERIPHID15 @Bit 15 : GRC peripheral identifier [15] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Pos (15UL) /*!< Position of PERIPHID15 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Pos) /*!< Bit mask of PERIPHID15
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Min (0x0UL) /*!< Min enumerator value of PERIPHID15 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Max (0x1UL) /*!< Max enumerator value of PERIPHID15 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 15] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              15] interrupt is active*/

/* PERIPHID16 @Bit 16 : GRC peripheral identifier [16] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Pos (16UL) /*!< Position of PERIPHID16 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Pos) /*!< Bit mask of PERIPHID16
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Min (0x0UL) /*!< Min enumerator value of PERIPHID16 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Max (0x1UL) /*!< Max enumerator value of PERIPHID16 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 16] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              16] interrupt is active*/

/* PERIPHID17 @Bit 17 : GRC peripheral identifier [17] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Pos (17UL) /*!< Position of PERIPHID17 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Pos) /*!< Bit mask of PERIPHID17
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Min (0x0UL) /*!< Min enumerator value of PERIPHID17 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Max (0x1UL) /*!< Max enumerator value of PERIPHID17 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 17] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              17] interrupt is active*/

/* PERIPHID18 @Bit 18 : GRC peripheral identifier [18] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Pos (18UL) /*!< Position of PERIPHID18 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Pos) /*!< Bit mask of PERIPHID18
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Min (0x0UL) /*!< Min enumerator value of PERIPHID18 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Max (0x1UL) /*!< Max enumerator value of PERIPHID18 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 18] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              18] interrupt is active*/

/* PERIPHID19 @Bit 19 : GRC peripheral identifier [19] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Pos (19UL) /*!< Position of PERIPHID19 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Pos) /*!< Bit mask of PERIPHID19
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Min (0x0UL) /*!< Min enumerator value of PERIPHID19 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Max (0x1UL) /*!< Max enumerator value of PERIPHID19 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 19] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              19] interrupt is active*/

/* PERIPHID20 @Bit 20 : GRC peripheral identifier [20] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Pos (20UL) /*!< Position of PERIPHID20 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Pos) /*!< Bit mask of PERIPHID20
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Min (0x0UL) /*!< Min enumerator value of PERIPHID20 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Max (0x1UL) /*!< Max enumerator value of PERIPHID20 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 20] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              20] interrupt is active*/

/* PERIPHID21 @Bit 21 : GRC peripheral identifier [21] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Pos (21UL) /*!< Position of PERIPHID21 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Pos) /*!< Bit mask of PERIPHID21
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Min (0x0UL) /*!< Min enumerator value of PERIPHID21 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Max (0x1UL) /*!< Max enumerator value of PERIPHID21 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 21] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              21] interrupt is active*/

/* PERIPHID22 @Bit 22 : GRC peripheral identifier [22] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Pos (22UL) /*!< Position of PERIPHID22 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Pos) /*!< Bit mask of PERIPHID22
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Min (0x0UL) /*!< Min enumerator value of PERIPHID22 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Max (0x1UL) /*!< Max enumerator value of PERIPHID22 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 22] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              22] interrupt is active*/

