adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PERIPHID23 @Bit 23 : GRC peripheral identifier [23] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Pos (23UL) /*!< Position of PERIPHID23 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Pos) /*!< Bit mask of PERIPHID23
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Min (0x0UL) /*!< Min enumerator value of PERIPHID23 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Max (0x1UL) /*!< Max enumerator value of PERIPHID23 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 23] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              23] interrupt is active*/

/* PERIPHID24 @Bit 24 : GRC peripheral identifier [24] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Pos (24UL) /*!< Position of PERIPHID24 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Pos) /*!< Bit mask of PERIPHID24
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Min (0x0UL) /*!< Min enumerator value of PERIPHID24 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Max (0x1UL) /*!< Max enumerator value of PERIPHID24 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 24] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              24] interrupt is active*/

/* PERIPHID25 @Bit 25 : GRC peripheral identifier [25] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Pos (25UL) /*!< Position of PERIPHID25 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Pos) /*!< Bit mask of PERIPHID25
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Min (0x0UL) /*!< Min enumerator value of PERIPHID25 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Max (0x1UL) /*!< Max enumerator value of PERIPHID25 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 25] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              25] interrupt is active*/

/* PERIPHID26 @Bit 26 : GRC peripheral identifier [26] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Pos (26UL) /*!< Position of PERIPHID26 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Pos) /*!< Bit mask of PERIPHID26
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Min (0x0UL) /*!< Min enumerator value of PERIPHID26 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Max (0x1UL) /*!< Max enumerator value of PERIPHID26 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 26] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              26] interrupt is active*/

/* PERIPHID27 @Bit 27 : GRC peripheral identifier [27] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Pos (27UL) /*!< Position of PERIPHID27 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Pos) /*!< Bit mask of PERIPHID27
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Min (0x0UL) /*!< Min enumerator value of PERIPHID27 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Max (0x1UL) /*!< Max enumerator value of PERIPHID27 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 27] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              27] interrupt is active*/

/* PERIPHID28 @Bit 28 : GRC peripheral identifier [28] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Pos (28UL) /*!< Position of PERIPHID28 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Pos) /*!< Bit mask of PERIPHID28
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Min (0x0UL) /*!< Min enumerator value of PERIPHID28 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Max (0x1UL) /*!< Max enumerator value of PERIPHID28 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 28] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              28] interrupt is active*/

/* PERIPHID29 @Bit 29 : GRC peripheral identifier [29] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Pos (29UL) /*!< Position of PERIPHID29 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Pos) /*!< Bit mask of PERIPHID29
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Min (0x0UL) /*!< Min enumerator value of PERIPHID29 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Max (0x1UL) /*!< Max enumerator value of PERIPHID29 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 29] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              29] interrupt is active*/

/* PERIPHID30 @Bit 30 : GRC peripheral identifier [30] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Pos (30UL) /*!< Position of PERIPHID30 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Pos) /*!< Bit mask of PERIPHID30
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Min (0x0UL) /*!< Min enumerator value of PERIPHID30 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Max (0x1UL) /*!< Max enumerator value of PERIPHID30 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 30] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              30] interrupt is active*/

/* PERIPHID31 @Bit 31 : GRC peripheral identifier [31] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Pos (31UL) /*!< Position of PERIPHID31 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Pos) /*!< Bit mask of PERIPHID31
                                                                            field.*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Min (0x0UL) /*!< Min enumerator value of PERIPHID31 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Max (0x1UL) /*!< Max enumerator value of PERIPHID31 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Off (0x0UL) /*!< The GRC active power domain remain Off even when GRC peripheral
                                                               [32 + 31] interrupt is active*/
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_On (0x1UL) /*!< The GRC active power domain is kept On when GRC peripheral [32 +
                                                              31] interrupt is active*/



/* ================================================= Struct GRCCONF_METALFIX ================================================= */
/**
  * @brief METALFIX [GRCCONF_METALFIX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PDMAIN;                            /*!< (@ 0x00000000) Register for possible metal-fix in GRC Main power
                                                                         domain*/
  __IOM uint32_t  PDACT;                             /*!< (@ 0x00000004) Register for possible metal-fix in GRC Active power
                                                                         domain*/
} NRF_GRCCONF_METALFIX_Type;                         /*!< Size = 8 (0x008)                                                     */

/* GRCCONF_METALFIX_PDMAIN: Register for possible metal-fix in GRC Main power domain */
  #define GRCCONF_METALFIX_PDMAIN_ResetValue (0x00000000UL) /*!< Reset value of PDMAIN register.                               */

/* VAL @Bits 0..3 : Value */
  #define GRCCONF_METALFIX_PDMAIN_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define GRCCONF_METALFIX_PDMAIN_VAL_Msk (0xFUL << GRCCONF_METALFIX_PDMAIN_VAL_Pos) /*!< Bit mask of VAL field.               */
  #define GRCCONF_METALFIX_PDMAIN_VAL_Min (0x0UL)    /*!< Min value of VAL field.                                              */
  #define GRCCONF_METALFIX_PDMAIN_VAL_Max (0xFUL)    /*!< Max size of VAL field.                                               */


