adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH026 @Bit 26 : Enable or disable interrupt for event GRCPERIPH0[26] */
  #define GRCCONF_INTEN00_GRCPERIPH026_Pos (26UL)    /*!< Position of GRCPERIPH026 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH026_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH026_Pos) /*!< Bit mask of GRCPERIPH026 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH026_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH026 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH026_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH026 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH026_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH026_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH027 @Bit 27 : Enable or disable interrupt for event GRCPERIPH0[27] */
  #define GRCCONF_INTEN00_GRCPERIPH027_Pos (27UL)    /*!< Position of GRCPERIPH027 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH027_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH027_Pos) /*!< Bit mask of GRCPERIPH027 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH027_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH027 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH027_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH027 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH027_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH027_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH028 @Bit 28 : Enable or disable interrupt for event GRCPERIPH0[28] */
  #define GRCCONF_INTEN00_GRCPERIPH028_Pos (28UL)    /*!< Position of GRCPERIPH028 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH028_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH028_Pos) /*!< Bit mask of GRCPERIPH028 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH028_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH028 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH028_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH028 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH028_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH028_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH029 @Bit 29 : Enable or disable interrupt for event GRCPERIPH0[29] */
  #define GRCCONF_INTEN00_GRCPERIPH029_Pos (29UL)    /*!< Position of GRCPERIPH029 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH029_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH029_Pos) /*!< Bit mask of GRCPERIPH029 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH029_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH029 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH029_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH029 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH029_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH029_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH030 @Bit 30 : Enable or disable interrupt for event GRCPERIPH0[30] */
  #define GRCCONF_INTEN00_GRCPERIPH030_Pos (30UL)    /*!< Position of GRCPERIPH030 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH030_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH030_Pos) /*!< Bit mask of GRCPERIPH030 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH030_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH030 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH030_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH030 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH030_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH030_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH031 @Bit 31 : Enable or disable interrupt for event GRCPERIPH0[31] */
  #define GRCCONF_INTEN00_GRCPERIPH031_Pos (31UL)    /*!< Position of GRCPERIPH031 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH031_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH031_Pos) /*!< Bit mask of GRCPERIPH031 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH031_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH031 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH031_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH031 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH031_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH031_Enabled (0x1UL) /*!< Enable                                                             */


/* GRCCONF_INTEN01: Enable or disable interrupt */
  #define GRCCONF_INTEN01_ResetValue (0x00000000UL)  /*!< Reset value of INTEN01 register.                                     */

/* GRCPERIPH10 @Bit 0 : Enable or disable interrupt for event GRCPERIPH1[0] */
  #define GRCCONF_INTEN01_GRCPERIPH10_Pos (0UL)      /*!< Position of GRCPERIPH10 field.                                       */
  #define GRCCONF_INTEN01_GRCPERIPH10_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH10_Pos) /*!< Bit mask of GRCPERIPH10 field.       */
  #define GRCCONF_INTEN01_GRCPERIPH10_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH10 field.                           */
  #define GRCCONF_INTEN01_GRCPERIPH10_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH10 field.                           */
  #define GRCCONF_INTEN01_GRCPERIPH10_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN01_GRCPERIPH10_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH11 @Bit 1 : Enable or disable interrupt for event GRCPERIPH1[1] */
  #define GRCCONF_INTEN01_GRCPERIPH11_Pos (1UL)      /*!< Position of GRCPERIPH11 field.                                       */
  #define GRCCONF_INTEN01_GRCPERIPH11_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH11_Pos) /*!< Bit mask of GRCPERIPH11 field.       */
  #define GRCCONF_INTEN01_GRCPERIPH11_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH11 field.                           */
  #define GRCCONF_INTEN01_GRCPERIPH11_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH11 field.                           */
  #define GRCCONF_INTEN01_GRCPERIPH11_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN01_GRCPERIPH11_Enabled (0x1UL) /*!< Enable                                                              */

