adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH112 @Bit 12 : Enable or disable interrupt for event GRCPERIPH1[12] */
  #define GRCCONF_INTEN01_GRCPERIPH112_Pos (12UL)    /*!< Position of GRCPERIPH112 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH112_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH112_Pos) /*!< Bit mask of GRCPERIPH112 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH112_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH112 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH112_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH112 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH112_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH112_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH113 @Bit 13 : Enable or disable interrupt for event GRCPERIPH1[13] */
  #define GRCCONF_INTEN01_GRCPERIPH113_Pos (13UL)    /*!< Position of GRCPERIPH113 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH113_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH113_Pos) /*!< Bit mask of GRCPERIPH113 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH113_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH113 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH113_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH113 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH113_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH113_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH114 @Bit 14 : Enable or disable interrupt for event GRCPERIPH1[14] */
  #define GRCCONF_INTEN01_GRCPERIPH114_Pos (14UL)    /*!< Position of GRCPERIPH114 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH114_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH114_Pos) /*!< Bit mask of GRCPERIPH114 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH114_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH114 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH114_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH114 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH114_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH114_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH115 @Bit 15 : Enable or disable interrupt for event GRCPERIPH1[15] */
  #define GRCCONF_INTEN01_GRCPERIPH115_Pos (15UL)    /*!< Position of GRCPERIPH115 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH115_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH115_Pos) /*!< Bit mask of GRCPERIPH115 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH115_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH115 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH115_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH115 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH115_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH115_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH116 @Bit 16 : Enable or disable interrupt for event GRCPERIPH1[16] */
  #define GRCCONF_INTEN01_GRCPERIPH116_Pos (16UL)    /*!< Position of GRCPERIPH116 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH116_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH116_Pos) /*!< Bit mask of GRCPERIPH116 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH116_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH116 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH116_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH116 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH116_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH116_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH117 @Bit 17 : Enable or disable interrupt for event GRCPERIPH1[17] */
  #define GRCCONF_INTEN01_GRCPERIPH117_Pos (17UL)    /*!< Position of GRCPERIPH117 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH117_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH117_Pos) /*!< Bit mask of GRCPERIPH117 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH117_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH117 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH117_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH117 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH117_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH117_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH118 @Bit 18 : Enable or disable interrupt for event GRCPERIPH1[18] */
  #define GRCCONF_INTEN01_GRCPERIPH118_Pos (18UL)    /*!< Position of GRCPERIPH118 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH118_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH118_Pos) /*!< Bit mask of GRCPERIPH118 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH118_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH118 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH118_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH118 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH118_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH118_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH119 @Bit 19 : Enable or disable interrupt for event GRCPERIPH1[19] */
  #define GRCCONF_INTEN01_GRCPERIPH119_Pos (19UL)    /*!< Position of GRCPERIPH119 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH119_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH119_Pos) /*!< Bit mask of GRCPERIPH119 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH119_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH119 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH119_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH119 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH119_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH119_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH120 @Bit 20 : Enable or disable interrupt for event GRCPERIPH1[20] */
  #define GRCCONF_INTEN01_GRCPERIPH120_Pos (20UL)    /*!< Position of GRCPERIPH120 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH120_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH120_Pos) /*!< Bit mask of GRCPERIPH120 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH120_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH120 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH120_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH120 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH120_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH120_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH121 @Bit 21 : Enable or disable interrupt for event GRCPERIPH1[21] */
  #define GRCCONF_INTEN01_GRCPERIPH121_Pos (21UL)    /*!< Position of GRCPERIPH121 field.                                      */
  #define GRCCONF_INTEN01_GRCPERIPH121_Msk (0x1UL << GRCCONF_INTEN01_GRCPERIPH121_Pos) /*!< Bit mask of GRCPERIPH121 field.    */
  #define GRCCONF_INTEN01_GRCPERIPH121_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH121 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH121_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH121 field.                          */
  #define GRCCONF_INTEN01_GRCPERIPH121_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN01_GRCPERIPH121_Enabled (0x1UL) /*!< Enable                                                             */

