adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH02 @Bit 2 : Write '1' to enable interrupt for event GRCPERIPH0[2] */
  #define GRCCONF_INTENSET00_GRCPERIPH02_Pos (2UL)   /*!< Position of GRCPERIPH02 field.                                       */
  #define GRCCONF_INTENSET00_GRCPERIPH02_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH02_Pos) /*!< Bit mask of GRCPERIPH02 field. */
  #define GRCCONF_INTENSET00_GRCPERIPH02_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH02_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH02_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET00_GRCPERIPH02_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET00_GRCPERIPH02_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH03 @Bit 3 : Write '1' to enable interrupt for event GRCPERIPH0[3] */
  #define GRCCONF_INTENSET00_GRCPERIPH03_Pos (3UL)   /*!< Position of GRCPERIPH03 field.                                       */
  #define GRCCONF_INTENSET00_GRCPERIPH03_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH03_Pos) /*!< Bit mask of GRCPERIPH03 field. */
  #define GRCCONF_INTENSET00_GRCPERIPH03_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH03_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH03_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET00_GRCPERIPH03_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET00_GRCPERIPH03_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH04 @Bit 4 : Write '1' to enable interrupt for event GRCPERIPH0[4] */
  #define GRCCONF_INTENSET00_GRCPERIPH04_Pos (4UL)   /*!< Position of GRCPERIPH04 field.                                       */
  #define GRCCONF_INTENSET00_GRCPERIPH04_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH04_Pos) /*!< Bit mask of GRCPERIPH04 field. */
  #define GRCCONF_INTENSET00_GRCPERIPH04_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH04_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH04_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET00_GRCPERIPH04_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET00_GRCPERIPH04_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH05 @Bit 5 : Write '1' to enable interrupt for event GRCPERIPH0[5] */
  #define GRCCONF_INTENSET00_GRCPERIPH05_Pos (5UL)   /*!< Position of GRCPERIPH05 field.                                       */
  #define GRCCONF_INTENSET00_GRCPERIPH05_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH05_Pos) /*!< Bit mask of GRCPERIPH05 field. */
  #define GRCCONF_INTENSET00_GRCPERIPH05_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH05_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH05_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET00_GRCPERIPH05_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET00_GRCPERIPH05_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH06 @Bit 6 : Write '1' to enable interrupt for event GRCPERIPH0[6] */
  #define GRCCONF_INTENSET00_GRCPERIPH06_Pos (6UL)   /*!< Position of GRCPERIPH06 field.                                       */
  #define GRCCONF_INTENSET00_GRCPERIPH06_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH06_Pos) /*!< Bit mask of GRCPERIPH06 field. */
  #define GRCCONF_INTENSET00_GRCPERIPH06_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH06_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH06_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET00_GRCPERIPH06_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET00_GRCPERIPH06_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH07 @Bit 7 : Write '1' to enable interrupt for event GRCPERIPH0[7] */
  #define GRCCONF_INTENSET00_GRCPERIPH07_Pos (7UL)   /*!< Position of GRCPERIPH07 field.                                       */
  #define GRCCONF_INTENSET00_GRCPERIPH07_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH07_Pos) /*!< Bit mask of GRCPERIPH07 field. */
  #define GRCCONF_INTENSET00_GRCPERIPH07_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH07 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH07_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH07 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH07_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET00_GRCPERIPH07_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET00_GRCPERIPH07_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH08 @Bit 8 : Write '1' to enable interrupt for event GRCPERIPH0[8] */
  #define GRCCONF_INTENSET00_GRCPERIPH08_Pos (8UL)   /*!< Position of GRCPERIPH08 field.                                       */
  #define GRCCONF_INTENSET00_GRCPERIPH08_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH08_Pos) /*!< Bit mask of GRCPERIPH08 field. */
  #define GRCCONF_INTENSET00_GRCPERIPH08_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH08 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH08_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH08 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH08_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET00_GRCPERIPH08_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET00_GRCPERIPH08_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH09 @Bit 9 : Write '1' to enable interrupt for event GRCPERIPH0[9] */
  #define GRCCONF_INTENSET00_GRCPERIPH09_Pos (9UL)   /*!< Position of GRCPERIPH09 field.                                       */
  #define GRCCONF_INTENSET00_GRCPERIPH09_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH09_Pos) /*!< Bit mask of GRCPERIPH09 field. */
  #define GRCCONF_INTENSET00_GRCPERIPH09_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH09 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH09_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH09 field.                           */
  #define GRCCONF_INTENSET00_GRCPERIPH09_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET00_GRCPERIPH09_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET00_GRCPERIPH09_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH010 @Bit 10 : Write '1' to enable interrupt for event GRCPERIPH0[10] */
  #define GRCCONF_INTENSET00_GRCPERIPH010_Pos (10UL) /*!< Position of GRCPERIPH010 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH010_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH010_Pos) /*!< Bit mask of GRCPERIPH010
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH010_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH010 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH010_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH010 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH010_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH010_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH010_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH011 @Bit 11 : Write '1' to enable interrupt for event GRCPERIPH0[11] */
  #define GRCCONF_INTENSET00_GRCPERIPH011_Pos (11UL) /*!< Position of GRCPERIPH011 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH011_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH011_Pos) /*!< Bit mask of GRCPERIPH011
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH011_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH011 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH011_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH011 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH011_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH011_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH011_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH012 @Bit 12 : Write '1' to enable interrupt for event GRCPERIPH0[12] */
  #define GRCCONF_INTENSET00_GRCPERIPH012_Pos (12UL) /*!< Position of GRCPERIPH012 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH012_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH012_Pos) /*!< Bit mask of GRCPERIPH012
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH012_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH012 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH012_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH012 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH012_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH012_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH012_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH013 @Bit 13 : Write '1' to enable interrupt for event GRCPERIPH0[13] */
  #define GRCCONF_INTENSET00_GRCPERIPH013_Pos (13UL) /*!< Position of GRCPERIPH013 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH013_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH013_Pos) /*!< Bit mask of GRCPERIPH013
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH013_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH013 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH013_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH013 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH013_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH013_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH013_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH014 @Bit 14 : Write '1' to enable interrupt for event GRCPERIPH0[14] */
  #define GRCCONF_INTENSET00_GRCPERIPH014_Pos (14UL) /*!< Position of GRCPERIPH014 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH014_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH014_Pos) /*!< Bit mask of GRCPERIPH014
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH014_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH014 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH014_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH014 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH014_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH014_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH014_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH015 @Bit 15 : Write '1' to enable interrupt for event GRCPERIPH0[15] */
  #define GRCCONF_INTENSET00_GRCPERIPH015_Pos (15UL) /*!< Position of GRCPERIPH015 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH015_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH015_Pos) /*!< Bit mask of GRCPERIPH015
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH015_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH015 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH015_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH015 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH015_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH015_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH015_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH016 @Bit 16 : Write '1' to enable interrupt for event GRCPERIPH0[16] */
  #define GRCCONF_INTENSET00_GRCPERIPH016_Pos (16UL) /*!< Position of GRCPERIPH016 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH016_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH016_Pos) /*!< Bit mask of GRCPERIPH016
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH016_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH016 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH016_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH016 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH016_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH016_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH016_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH017 @Bit 17 : Write '1' to enable interrupt for event GRCPERIPH0[17] */
  #define GRCCONF_INTENSET00_GRCPERIPH017_Pos (17UL) /*!< Position of GRCPERIPH017 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH017_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH017_Pos) /*!< Bit mask of GRCPERIPH017
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH017_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH017 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH017_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH017 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH017_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH017_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH017_Enabled (0x1UL) /*!< Read: Enabled                                                   */

