adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH025 @Bit 25 : Write '1' to enable interrupt for event GRCPERIPH0[25] */
  #define GRCCONF_INTENSET00_GRCPERIPH025_Pos (25UL) /*!< Position of GRCPERIPH025 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH025_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH025_Pos) /*!< Bit mask of GRCPERIPH025
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH025_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH025 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH025_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH025 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH025_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH025_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH025_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH026 @Bit 26 : Write '1' to enable interrupt for event GRCPERIPH0[26] */
  #define GRCCONF_INTENSET00_GRCPERIPH026_Pos (26UL) /*!< Position of GRCPERIPH026 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH026_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH026_Pos) /*!< Bit mask of GRCPERIPH026
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH026_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH026 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH026_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH026 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH026_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH026_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH026_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH027 @Bit 27 : Write '1' to enable interrupt for event GRCPERIPH0[27] */
  #define GRCCONF_INTENSET00_GRCPERIPH027_Pos (27UL) /*!< Position of GRCPERIPH027 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH027_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH027_Pos) /*!< Bit mask of GRCPERIPH027
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH027_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH027 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH027_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH027 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH027_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH027_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH027_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH028 @Bit 28 : Write '1' to enable interrupt for event GRCPERIPH0[28] */
  #define GRCCONF_INTENSET00_GRCPERIPH028_Pos (28UL) /*!< Position of GRCPERIPH028 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH028_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH028_Pos) /*!< Bit mask of GRCPERIPH028
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH028_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH028 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH028_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH028 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH028_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH028_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH028_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH029 @Bit 29 : Write '1' to enable interrupt for event GRCPERIPH0[29] */
  #define GRCCONF_INTENSET00_GRCPERIPH029_Pos (29UL) /*!< Position of GRCPERIPH029 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH029_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH029_Pos) /*!< Bit mask of GRCPERIPH029
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH029_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH029 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH029_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH029 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH029_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH029_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH029_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH030 @Bit 30 : Write '1' to enable interrupt for event GRCPERIPH0[30] */
  #define GRCCONF_INTENSET00_GRCPERIPH030_Pos (30UL) /*!< Position of GRCPERIPH030 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH030_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH030_Pos) /*!< Bit mask of GRCPERIPH030
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH030_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH030 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH030_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH030 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH030_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH030_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH030_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH031 @Bit 31 : Write '1' to enable interrupt for event GRCPERIPH0[31] */
  #define GRCCONF_INTENSET00_GRCPERIPH031_Pos (31UL) /*!< Position of GRCPERIPH031 field.                                      */
  #define GRCCONF_INTENSET00_GRCPERIPH031_Msk (0x1UL << GRCCONF_INTENSET00_GRCPERIPH031_Pos) /*!< Bit mask of GRCPERIPH031
                                                                            field.*/
  #define GRCCONF_INTENSET00_GRCPERIPH031_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH031 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH031_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH031 field.                         */
  #define GRCCONF_INTENSET00_GRCPERIPH031_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET00_GRCPERIPH031_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET00_GRCPERIPH031_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* GRCCONF_INTENSET01: Enable interrupt */
  #define GRCCONF_INTENSET01_ResetValue (0x00000000UL) /*!< Reset value of INTENSET01 register.                                */

