adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH17 @Bit 7 : Write '1' to enable interrupt for event GRCPERIPH1[7] */
  #define GRCCONF_INTENSET01_GRCPERIPH17_Pos (7UL)   /*!< Position of GRCPERIPH17 field.                                       */
  #define GRCCONF_INTENSET01_GRCPERIPH17_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH17_Pos) /*!< Bit mask of GRCPERIPH17 field. */
  #define GRCCONF_INTENSET01_GRCPERIPH17_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH17 field.                           */
  #define GRCCONF_INTENSET01_GRCPERIPH17_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH17 field.                           */
  #define GRCCONF_INTENSET01_GRCPERIPH17_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET01_GRCPERIPH17_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET01_GRCPERIPH17_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH18 @Bit 8 : Write '1' to enable interrupt for event GRCPERIPH1[8] */
  #define GRCCONF_INTENSET01_GRCPERIPH18_Pos (8UL)   /*!< Position of GRCPERIPH18 field.                                       */
  #define GRCCONF_INTENSET01_GRCPERIPH18_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH18_Pos) /*!< Bit mask of GRCPERIPH18 field. */
  #define GRCCONF_INTENSET01_GRCPERIPH18_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH18 field.                           */
  #define GRCCONF_INTENSET01_GRCPERIPH18_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH18 field.                           */
  #define GRCCONF_INTENSET01_GRCPERIPH18_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET01_GRCPERIPH18_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET01_GRCPERIPH18_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH19 @Bit 9 : Write '1' to enable interrupt for event GRCPERIPH1[9] */
  #define GRCCONF_INTENSET01_GRCPERIPH19_Pos (9UL)   /*!< Position of GRCPERIPH19 field.                                       */
  #define GRCCONF_INTENSET01_GRCPERIPH19_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH19_Pos) /*!< Bit mask of GRCPERIPH19 field. */
  #define GRCCONF_INTENSET01_GRCPERIPH19_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH19 field.                           */
  #define GRCCONF_INTENSET01_GRCPERIPH19_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH19 field.                           */
  #define GRCCONF_INTENSET01_GRCPERIPH19_Set (0x1UL) /*!< Enable                                                               */
  #define GRCCONF_INTENSET01_GRCPERIPH19_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENSET01_GRCPERIPH19_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH110 @Bit 10 : Write '1' to enable interrupt for event GRCPERIPH1[10] */
  #define GRCCONF_INTENSET01_GRCPERIPH110_Pos (10UL) /*!< Position of GRCPERIPH110 field.                                      */
  #define GRCCONF_INTENSET01_GRCPERIPH110_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH110_Pos) /*!< Bit mask of GRCPERIPH110
                                                                            field.*/
  #define GRCCONF_INTENSET01_GRCPERIPH110_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH110 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH110_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH110 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH110_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET01_GRCPERIPH110_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET01_GRCPERIPH110_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH111 @Bit 11 : Write '1' to enable interrupt for event GRCPERIPH1[11] */
  #define GRCCONF_INTENSET01_GRCPERIPH111_Pos (11UL) /*!< Position of GRCPERIPH111 field.                                      */
  #define GRCCONF_INTENSET01_GRCPERIPH111_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH111_Pos) /*!< Bit mask of GRCPERIPH111
                                                                            field.*/
  #define GRCCONF_INTENSET01_GRCPERIPH111_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH111 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH111_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH111 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH111_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET01_GRCPERIPH111_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET01_GRCPERIPH111_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH112 @Bit 12 : Write '1' to enable interrupt for event GRCPERIPH1[12] */
  #define GRCCONF_INTENSET01_GRCPERIPH112_Pos (12UL) /*!< Position of GRCPERIPH112 field.                                      */
  #define GRCCONF_INTENSET01_GRCPERIPH112_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH112_Pos) /*!< Bit mask of GRCPERIPH112
                                                                            field.*/
  #define GRCCONF_INTENSET01_GRCPERIPH112_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH112 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH112_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH112 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH112_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET01_GRCPERIPH112_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET01_GRCPERIPH112_Enabled (0x1UL) /*!< Read: Enabled                                                   */

