adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH115 @Bit 15 : Write '1' to disable interrupt for event GRCPERIPH1[15] */
  #define GRCCONF_INTENCLR01_GRCPERIPH115_Pos (15UL) /*!< Position of GRCPERIPH115 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH115_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH115_Pos) /*!< Bit mask of GRCPERIPH115
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH115_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH115 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH115_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH115 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH115_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH115_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH115_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH116 @Bit 16 : Write '1' to disable interrupt for event GRCPERIPH1[16] */
  #define GRCCONF_INTENCLR01_GRCPERIPH116_Pos (16UL) /*!< Position of GRCPERIPH116 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH116_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH116_Pos) /*!< Bit mask of GRCPERIPH116
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH116_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH116 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH116_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH116 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH116_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH116_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH116_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH117 @Bit 17 : Write '1' to disable interrupt for event GRCPERIPH1[17] */
  #define GRCCONF_INTENCLR01_GRCPERIPH117_Pos (17UL) /*!< Position of GRCPERIPH117 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH117_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH117_Pos) /*!< Bit mask of GRCPERIPH117
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH117_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH117 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH117_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH117 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH117_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH117_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH117_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH118 @Bit 18 : Write '1' to disable interrupt for event GRCPERIPH1[18] */
  #define GRCCONF_INTENCLR01_GRCPERIPH118_Pos (18UL) /*!< Position of GRCPERIPH118 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH118_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH118_Pos) /*!< Bit mask of GRCPERIPH118
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH118_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH118 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH118_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH118 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH118_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH118_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH118_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH119 @Bit 19 : Write '1' to disable interrupt for event GRCPERIPH1[19] */
  #define GRCCONF_INTENCLR01_GRCPERIPH119_Pos (19UL) /*!< Position of GRCPERIPH119 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH119_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH119_Pos) /*!< Bit mask of GRCPERIPH119
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH119_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH119 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH119_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH119 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH119_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH119_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH119_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH120 @Bit 20 : Write '1' to disable interrupt for event GRCPERIPH1[20] */
  #define GRCCONF_INTENCLR01_GRCPERIPH120_Pos (20UL) /*!< Position of GRCPERIPH120 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH120_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH120_Pos) /*!< Bit mask of GRCPERIPH120
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH120_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH120 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH120_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH120 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH120_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH120_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH120_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH121 @Bit 21 : Write '1' to disable interrupt for event GRCPERIPH1[21] */
  #define GRCCONF_INTENCLR01_GRCPERIPH121_Pos (21UL) /*!< Position of GRCPERIPH121 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH121_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH121_Pos) /*!< Bit mask of GRCPERIPH121
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH121_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH121 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH121_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH121 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH121_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH121_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH121_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH122 @Bit 22 : Write '1' to disable interrupt for event GRCPERIPH1[22] */
  #define GRCCONF_INTENCLR01_GRCPERIPH122_Pos (22UL) /*!< Position of GRCPERIPH122 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH122_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH122_Pos) /*!< Bit mask of GRCPERIPH122
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH122_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH122 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH122_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH122 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH122_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH122_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH122_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH123 @Bit 23 : Write '1' to disable interrupt for event GRCPERIPH1[23] */
  #define GRCCONF_INTENCLR01_GRCPERIPH123_Pos (23UL) /*!< Position of GRCPERIPH123 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH123_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH123_Pos) /*!< Bit mask of GRCPERIPH123
                                                                            field.*/
  #define GRCCONF_INTENCLR01_GRCPERIPH123_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH123 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH123_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH123 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH123_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH123_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH123_Enabled (0x1UL) /*!< Read: Enabled                                                   */

