adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH129 @Bit 29 : Read pending status of interrupt for event GRCPERIPH1[29] */
  #define GRCCONF_INTPEND01_GRCPERIPH129_Pos (29UL)  /*!< Position of GRCPERIPH129 field.                                      */
  #define GRCCONF_INTPEND01_GRCPERIPH129_Msk (0x1UL << GRCCONF_INTPEND01_GRCPERIPH129_Pos) /*!< Bit mask of GRCPERIPH129 field.*/
  #define GRCCONF_INTPEND01_GRCPERIPH129_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH129 field.                          */
  #define GRCCONF_INTPEND01_GRCPERIPH129_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH129 field.                          */
  #define GRCCONF_INTPEND01_GRCPERIPH129_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND01_GRCPERIPH129_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH130 @Bit 30 : Read pending status of interrupt for event GRCPERIPH1[30] */
  #define GRCCONF_INTPEND01_GRCPERIPH130_Pos (30UL)  /*!< Position of GRCPERIPH130 field.                                      */
  #define GRCCONF_INTPEND01_GRCPERIPH130_Msk (0x1UL << GRCCONF_INTPEND01_GRCPERIPH130_Pos) /*!< Bit mask of GRCPERIPH130 field.*/
  #define GRCCONF_INTPEND01_GRCPERIPH130_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH130 field.                          */
  #define GRCCONF_INTPEND01_GRCPERIPH130_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH130 field.                          */
  #define GRCCONF_INTPEND01_GRCPERIPH130_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND01_GRCPERIPH130_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH131 @Bit 31 : Read pending status of interrupt for event GRCPERIPH1[31] */
  #define GRCCONF_INTPEND01_GRCPERIPH131_Pos (31UL)  /*!< Position of GRCPERIPH131 field.                                      */
  #define GRCCONF_INTPEND01_GRCPERIPH131_Msk (0x1UL << GRCCONF_INTPEND01_GRCPERIPH131_Pos) /*!< Bit mask of GRCPERIPH131 field.*/
  #define GRCCONF_INTPEND01_GRCPERIPH131_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH131 field.                          */
  #define GRCCONF_INTPEND01_GRCPERIPH131_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH131 field.                          */
  #define GRCCONF_INTPEND01_GRCPERIPH131_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND01_GRCPERIPH131_Pending (0x1UL) /*!< Read: Pending                                                    */


/* GRCCONF_INTPEND02: Pending interrupts */
  #define GRCCONF_INTPEND02_ResetValue (0x00000000UL) /*!< Reset value of INTPEND02 register.                                  */

/* SYSTEMOFFREADY @Bit 0 : Read pending status of interrupt for event SYSTEMOFFREADY */
  #define GRCCONF_INTPEND02_SYSTEMOFFREADY_Pos (0UL) /*!< Position of SYSTEMOFFREADY field.                                    */
  #define GRCCONF_INTPEND02_SYSTEMOFFREADY_Msk (0x1UL << GRCCONF_INTPEND02_SYSTEMOFFREADY_Pos) /*!< Bit mask of SYSTEMOFFREADY
                                                                            field.*/
  #define GRCCONF_INTPEND02_SYSTEMOFFREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFREADY field.                      */
  #define GRCCONF_INTPEND02_SYSTEMOFFREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFREADY field.                      */
  #define GRCCONF_INTPEND02_SYSTEMOFFREADY_NotPending (0x0UL) /*!< Read: Not pending                                           */
  #define GRCCONF_INTPEND02_SYSTEMOFFREADY_Pending (0x1UL) /*!< Read: Pending                                                  */

/* SYSTEMOFFNOTREADY @Bit 1 : Read pending status of interrupt for event SYSTEMOFFNOTREADY */
  #define GRCCONF_INTPEND02_SYSTEMOFFNOTREADY_Pos (1UL) /*!< Position of SYSTEMOFFNOTREADY field.                              */
  #define GRCCONF_INTPEND02_SYSTEMOFFNOTREADY_Msk (0x1UL << GRCCONF_INTPEND02_SYSTEMOFFNOTREADY_Pos) /*!< Bit mask of
                                                                            SYSTEMOFFNOTREADY field.*/
  #define GRCCONF_INTPEND02_SYSTEMOFFNOTREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFNOTREADY field.                */
  #define GRCCONF_INTPEND02_SYSTEMOFFNOTREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFNOTREADY field.                */
  #define GRCCONF_INTPEND02_SYSTEMOFFNOTREADY_NotPending (0x0UL) /*!< Read: Not pending                                        */
  #define GRCCONF_INTPEND02_SYSTEMOFFNOTREADY_Pending (0x1UL) /*!< Read: Pending                                               */

/* SYSTEMOFFLOCALDOMAINOFF @Bit 2 : Read pending status of interrupt for event SYSTEMOFFLOCALDOMAINOFF */
  #define GRCCONF_INTPEND02_SYSTEMOFFLOCALDOMAINOFF_Pos (2UL) /*!< Position of SYSTEMOFFLOCALDOMAINOFF field.                  */
  #define GRCCONF_INTPEND02_SYSTEMOFFLOCALDOMAINOFF_Msk (0x1UL << GRCCONF_INTPEND02_SYSTEMOFFLOCALDOMAINOFF_Pos) /*!< Bit mask
                                                                            of SYSTEMOFFLOCALDOMAINOFF field.*/
  #define GRCCONF_INTPEND02_SYSTEMOFFLOCALDOMAINOFF_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFLOCALDOMAINOFF field.    */
  #define GRCCONF_INTPEND02_SYSTEMOFFLOCALDOMAINOFF_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFLOCALDOMAINOFF field.    */
  #define GRCCONF_INTPEND02_SYSTEMOFFLOCALDOMAINOFF_NotPending (0x0UL) /*!< Read: Not pending                                  */
  #define GRCCONF_INTPEND02_SYSTEMOFFLOCALDOMAINOFF_Pending (0x1UL) /*!< Read: Pending                                         */


/* GRCCONF_INTEN10: Enable or disable interrupt */
  #define GRCCONF_INTEN10_ResetValue (0x00000000UL)  /*!< Reset value of INTEN10 register.                                     */

/* GRCPERIPH00 @Bit 0 : Enable or disable interrupt for event GRCPERIPH0[0] */
  #define GRCCONF_INTEN10_GRCPERIPH00_Pos (0UL)      /*!< Position of GRCPERIPH00 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH00_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH00_Pos) /*!< Bit mask of GRCPERIPH00 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH00_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH00 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH00_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH00 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH00_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH00_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH01 @Bit 1 : Enable or disable interrupt for event GRCPERIPH0[1] */
  #define GRCCONF_INTEN10_GRCPERIPH01_Pos (1UL)      /*!< Position of GRCPERIPH01 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH01_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH01_Pos) /*!< Bit mask of GRCPERIPH01 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH01_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH01 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH01_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH01 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH01_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH01_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH02 @Bit 2 : Enable or disable interrupt for event GRCPERIPH0[2] */
  #define GRCCONF_INTEN10_GRCPERIPH02_Pos (2UL)      /*!< Position of GRCPERIPH02 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH02_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH02_Pos) /*!< Bit mask of GRCPERIPH02 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH02_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH02_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH02_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH02_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH03 @Bit 3 : Enable or disable interrupt for event GRCPERIPH0[3] */
  #define GRCCONF_INTEN10_GRCPERIPH03_Pos (3UL)      /*!< Position of GRCPERIPH03 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH03_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH03_Pos) /*!< Bit mask of GRCPERIPH03 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH03_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH03_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH03_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH03_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH04 @Bit 4 : Enable or disable interrupt for event GRCPERIPH0[4] */
  #define GRCCONF_INTEN10_GRCPERIPH04_Pos (4UL)      /*!< Position of GRCPERIPH04 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH04_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH04_Pos) /*!< Bit mask of GRCPERIPH04 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH04_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH04_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH04_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH04_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH05 @Bit 5 : Enable or disable interrupt for event GRCPERIPH0[5] */
  #define GRCCONF_INTEN10_GRCPERIPH05_Pos (5UL)      /*!< Position of GRCPERIPH05 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH05_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH05_Pos) /*!< Bit mask of GRCPERIPH05 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH05_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH05_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH05_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH05_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH06 @Bit 6 : Enable or disable interrupt for event GRCPERIPH0[6] */
  #define GRCCONF_INTEN10_GRCPERIPH06_Pos (6UL)      /*!< Position of GRCPERIPH06 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH06_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH06_Pos) /*!< Bit mask of GRCPERIPH06 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH06_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH06_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH06_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH06_Enabled (0x1UL) /*!< Enable                                                              */

