adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH018 @Bit 18 : Write '1' to enable interrupt for event GRCPERIPH0[18] */
  #define GRCCONF_INTENSET20_GRCPERIPH018_Pos (18UL) /*!< Position of GRCPERIPH018 field.                                      */
  #define GRCCONF_INTENSET20_GRCPERIPH018_Msk (0x1UL << GRCCONF_INTENSET20_GRCPERIPH018_Pos) /*!< Bit mask of GRCPERIPH018
                                                                            field.*/
  #define GRCCONF_INTENSET20_GRCPERIPH018_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH018 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH018_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH018 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH018_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET20_GRCPERIPH018_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET20_GRCPERIPH018_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH019 @Bit 19 : Write '1' to enable interrupt for event GRCPERIPH0[19] */
  #define GRCCONF_INTENSET20_GRCPERIPH019_Pos (19UL) /*!< Position of GRCPERIPH019 field.                                      */
  #define GRCCONF_INTENSET20_GRCPERIPH019_Msk (0x1UL << GRCCONF_INTENSET20_GRCPERIPH019_Pos) /*!< Bit mask of GRCPERIPH019
                                                                            field.*/
  #define GRCCONF_INTENSET20_GRCPERIPH019_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH019 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH019_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH019 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH019_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET20_GRCPERIPH019_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET20_GRCPERIPH019_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH020 @Bit 20 : Write '1' to enable interrupt for event GRCPERIPH0[20] */
  #define GRCCONF_INTENSET20_GRCPERIPH020_Pos (20UL) /*!< Position of GRCPERIPH020 field.                                      */
  #define GRCCONF_INTENSET20_GRCPERIPH020_Msk (0x1UL << GRCCONF_INTENSET20_GRCPERIPH020_Pos) /*!< Bit mask of GRCPERIPH020
                                                                            field.*/
  #define GRCCONF_INTENSET20_GRCPERIPH020_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH020 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH020_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH020 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH020_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET20_GRCPERIPH020_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET20_GRCPERIPH020_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH021 @Bit 21 : Write '1' to enable interrupt for event GRCPERIPH0[21] */
  #define GRCCONF_INTENSET20_GRCPERIPH021_Pos (21UL) /*!< Position of GRCPERIPH021 field.                                      */
  #define GRCCONF_INTENSET20_GRCPERIPH021_Msk (0x1UL << GRCCONF_INTENSET20_GRCPERIPH021_Pos) /*!< Bit mask of GRCPERIPH021
                                                                            field.*/
  #define GRCCONF_INTENSET20_GRCPERIPH021_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH021 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH021_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH021 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH021_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET20_GRCPERIPH021_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET20_GRCPERIPH021_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH022 @Bit 22 : Write '1' to enable interrupt for event GRCPERIPH0[22] */
  #define GRCCONF_INTENSET20_GRCPERIPH022_Pos (22UL) /*!< Position of GRCPERIPH022 field.                                      */
  #define GRCCONF_INTENSET20_GRCPERIPH022_Msk (0x1UL << GRCCONF_INTENSET20_GRCPERIPH022_Pos) /*!< Bit mask of GRCPERIPH022
                                                                            field.*/
  #define GRCCONF_INTENSET20_GRCPERIPH022_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH022 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH022_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH022 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH022_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET20_GRCPERIPH022_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET20_GRCPERIPH022_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH023 @Bit 23 : Write '1' to enable interrupt for event GRCPERIPH0[23] */
  #define GRCCONF_INTENSET20_GRCPERIPH023_Pos (23UL) /*!< Position of GRCPERIPH023 field.                                      */
  #define GRCCONF_INTENSET20_GRCPERIPH023_Msk (0x1UL << GRCCONF_INTENSET20_GRCPERIPH023_Pos) /*!< Bit mask of GRCPERIPH023
                                                                            field.*/
  #define GRCCONF_INTENSET20_GRCPERIPH023_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH023 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH023_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH023 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH023_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET20_GRCPERIPH023_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET20_GRCPERIPH023_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH024 @Bit 24 : Write '1' to enable interrupt for event GRCPERIPH0[24] */
  #define GRCCONF_INTENSET20_GRCPERIPH024_Pos (24UL) /*!< Position of GRCPERIPH024 field.                                      */
  #define GRCCONF_INTENSET20_GRCPERIPH024_Msk (0x1UL << GRCCONF_INTENSET20_GRCPERIPH024_Pos) /*!< Bit mask of GRCPERIPH024
                                                                            field.*/
  #define GRCCONF_INTENSET20_GRCPERIPH024_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH024 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH024_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH024 field.                         */
  #define GRCCONF_INTENSET20_GRCPERIPH024_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET20_GRCPERIPH024_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET20_GRCPERIPH024_Enabled (0x1UL) /*!< Read: Enabled                                                   */

