adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH113 @Bit 13 : Write '1' to enable interrupt for event GRCPERIPH1[13] */
  #define GRCCONF_INTENSET21_GRCPERIPH113_Pos (13UL) /*!< Position of GRCPERIPH113 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH113_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH113_Pos) /*!< Bit mask of GRCPERIPH113
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH113_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH113 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH113_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH113 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH113_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH113_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH113_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH114 @Bit 14 : Write '1' to enable interrupt for event GRCPERIPH1[14] */
  #define GRCCONF_INTENSET21_GRCPERIPH114_Pos (14UL) /*!< Position of GRCPERIPH114 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH114_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH114_Pos) /*!< Bit mask of GRCPERIPH114
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH114_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH114 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH114_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH114 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH114_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH114_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH114_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH115 @Bit 15 : Write '1' to enable interrupt for event GRCPERIPH1[15] */
  #define GRCCONF_INTENSET21_GRCPERIPH115_Pos (15UL) /*!< Position of GRCPERIPH115 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH115_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH115_Pos) /*!< Bit mask of GRCPERIPH115
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH115_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH115 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH115_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH115 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH115_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH115_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH115_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH116 @Bit 16 : Write '1' to enable interrupt for event GRCPERIPH1[16] */
  #define GRCCONF_INTENSET21_GRCPERIPH116_Pos (16UL) /*!< Position of GRCPERIPH116 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH116_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH116_Pos) /*!< Bit mask of GRCPERIPH116
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH116_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH116 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH116_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH116 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH116_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH116_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH116_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH117 @Bit 17 : Write '1' to enable interrupt for event GRCPERIPH1[17] */
  #define GRCCONF_INTENSET21_GRCPERIPH117_Pos (17UL) /*!< Position of GRCPERIPH117 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH117_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH117_Pos) /*!< Bit mask of GRCPERIPH117
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH117_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH117 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH117_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH117 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH117_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH117_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH117_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH118 @Bit 18 : Write '1' to enable interrupt for event GRCPERIPH1[18] */
  #define GRCCONF_INTENSET21_GRCPERIPH118_Pos (18UL) /*!< Position of GRCPERIPH118 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH118_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH118_Pos) /*!< Bit mask of GRCPERIPH118
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH118_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH118 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH118_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH118 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH118_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH118_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH118_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH119 @Bit 19 : Write '1' to enable interrupt for event GRCPERIPH1[19] */
  #define GRCCONF_INTENSET21_GRCPERIPH119_Pos (19UL) /*!< Position of GRCPERIPH119 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH119_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH119_Pos) /*!< Bit mask of GRCPERIPH119
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH119_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH119 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH119_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH119 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH119_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH119_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH119_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH120 @Bit 20 : Write '1' to enable interrupt for event GRCPERIPH1[20] */
  #define GRCCONF_INTENSET21_GRCPERIPH120_Pos (20UL) /*!< Position of GRCPERIPH120 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH120_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH120_Pos) /*!< Bit mask of GRCPERIPH120
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH120_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH120 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH120_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH120 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH120_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH120_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH120_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH121 @Bit 21 : Write '1' to enable interrupt for event GRCPERIPH1[21] */
  #define GRCCONF_INTENSET21_GRCPERIPH121_Pos (21UL) /*!< Position of GRCPERIPH121 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH121_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH121_Pos) /*!< Bit mask of GRCPERIPH121
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH121_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH121 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH121_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH121 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH121_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH121_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH121_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH122 @Bit 22 : Write '1' to enable interrupt for event GRCPERIPH1[22] */
  #define GRCCONF_INTENSET21_GRCPERIPH122_Pos (22UL) /*!< Position of GRCPERIPH122 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH122_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH122_Pos) /*!< Bit mask of GRCPERIPH122
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH122_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH122 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH122_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH122 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH122_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH122_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH122_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH123 @Bit 23 : Write '1' to enable interrupt for event GRCPERIPH1[23] */
  #define GRCCONF_INTENSET21_GRCPERIPH123_Pos (23UL) /*!< Position of GRCPERIPH123 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH123_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH123_Pos) /*!< Bit mask of GRCPERIPH123
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH123_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH123 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH123_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH123 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH123_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH123_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH123_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH124 @Bit 24 : Write '1' to enable interrupt for event GRCPERIPH1[24] */
  #define GRCCONF_INTENSET21_GRCPERIPH124_Pos (24UL) /*!< Position of GRCPERIPH124 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH124_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH124_Pos) /*!< Bit mask of GRCPERIPH124
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH124_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH124 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH124_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH124 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH124_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH124_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH124_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH125 @Bit 25 : Write '1' to enable interrupt for event GRCPERIPH1[25] */
  #define GRCCONF_INTENSET21_GRCPERIPH125_Pos (25UL) /*!< Position of GRCPERIPH125 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH125_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH125_Pos) /*!< Bit mask of GRCPERIPH125
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH125_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH125 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH125_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH125 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH125_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH125_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH125_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH126 @Bit 26 : Write '1' to enable interrupt for event GRCPERIPH1[26] */
  #define GRCCONF_INTENSET21_GRCPERIPH126_Pos (26UL) /*!< Position of GRCPERIPH126 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH126_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH126_Pos) /*!< Bit mask of GRCPERIPH126
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH126_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH126 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH126_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH126 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH126_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH126_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH126_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH127 @Bit 27 : Write '1' to enable interrupt for event GRCPERIPH1[27] */
  #define GRCCONF_INTENSET21_GRCPERIPH127_Pos (27UL) /*!< Position of GRCPERIPH127 field.                                      */
  #define GRCCONF_INTENSET21_GRCPERIPH127_Msk (0x1UL << GRCCONF_INTENSET21_GRCPERIPH127_Pos) /*!< Bit mask of GRCPERIPH127
                                                                            field.*/
  #define GRCCONF_INTENSET21_GRCPERIPH127_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH127 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH127_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH127 field.                         */
  #define GRCCONF_INTENSET21_GRCPERIPH127_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET21_GRCPERIPH127_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET21_GRCPERIPH127_Enabled (0x1UL) /*!< Read: Enabled                                                   */

