adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH020 @Bit 20 : Write '1' to disable interrupt for event GRCPERIPH0[20] */
  #define GRCCONF_INTENCLR20_GRCPERIPH020_Pos (20UL) /*!< Position of GRCPERIPH020 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH020_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH020_Pos) /*!< Bit mask of GRCPERIPH020
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH020_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH020 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH020_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH020 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH020_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH020_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH020_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH021 @Bit 21 : Write '1' to disable interrupt for event GRCPERIPH0[21] */
  #define GRCCONF_INTENCLR20_GRCPERIPH021_Pos (21UL) /*!< Position of GRCPERIPH021 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH021_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH021_Pos) /*!< Bit mask of GRCPERIPH021
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH021_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH021 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH021_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH021 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH021_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH021_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH021_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH022 @Bit 22 : Write '1' to disable interrupt for event GRCPERIPH0[22] */
  #define GRCCONF_INTENCLR20_GRCPERIPH022_Pos (22UL) /*!< Position of GRCPERIPH022 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH022_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH022_Pos) /*!< Bit mask of GRCPERIPH022
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH022_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH022 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH022_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH022 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH022_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH022_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH022_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH023 @Bit 23 : Write '1' to disable interrupt for event GRCPERIPH0[23] */
  #define GRCCONF_INTENCLR20_GRCPERIPH023_Pos (23UL) /*!< Position of GRCPERIPH023 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH023_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH023_Pos) /*!< Bit mask of GRCPERIPH023
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH023_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH023 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH023_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH023 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH023_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH023_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH023_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH024 @Bit 24 : Write '1' to disable interrupt for event GRCPERIPH0[24] */
  #define GRCCONF_INTENCLR20_GRCPERIPH024_Pos (24UL) /*!< Position of GRCPERIPH024 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH024_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH024_Pos) /*!< Bit mask of GRCPERIPH024
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH024_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH024 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH024_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH024 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH024_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH024_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH024_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH025 @Bit 25 : Write '1' to disable interrupt for event GRCPERIPH0[25] */
  #define GRCCONF_INTENCLR20_GRCPERIPH025_Pos (25UL) /*!< Position of GRCPERIPH025 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH025_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH025_Pos) /*!< Bit mask of GRCPERIPH025
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH025_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH025 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH025_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH025 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH025_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH025_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH025_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH026 @Bit 26 : Write '1' to disable interrupt for event GRCPERIPH0[26] */
  #define GRCCONF_INTENCLR20_GRCPERIPH026_Pos (26UL) /*!< Position of GRCPERIPH026 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH026_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH026_Pos) /*!< Bit mask of GRCPERIPH026
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH026_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH026 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH026_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH026 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH026_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH026_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH026_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH027 @Bit 27 : Write '1' to disable interrupt for event GRCPERIPH0[27] */
  #define GRCCONF_INTENCLR20_GRCPERIPH027_Pos (27UL) /*!< Position of GRCPERIPH027 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH027_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH027_Pos) /*!< Bit mask of GRCPERIPH027
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH027_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH027 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH027_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH027 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH027_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH027_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH027_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH028 @Bit 28 : Write '1' to disable interrupt for event GRCPERIPH0[28] */
  #define GRCCONF_INTENCLR20_GRCPERIPH028_Pos (28UL) /*!< Position of GRCPERIPH028 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH028_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH028_Pos) /*!< Bit mask of GRCPERIPH028
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH028_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH028 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH028_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH028 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH028_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH028_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH028_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH029 @Bit 29 : Write '1' to disable interrupt for event GRCPERIPH0[29] */
  #define GRCCONF_INTENCLR20_GRCPERIPH029_Pos (29UL) /*!< Position of GRCPERIPH029 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH029_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH029_Pos) /*!< Bit mask of GRCPERIPH029
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH029_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH029 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH029_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH029 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH029_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH029_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH029_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH030 @Bit 30 : Write '1' to disable interrupt for event GRCPERIPH0[30] */
  #define GRCCONF_INTENCLR20_GRCPERIPH030_Pos (30UL) /*!< Position of GRCPERIPH030 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH030_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH030_Pos) /*!< Bit mask of GRCPERIPH030
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH030_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH030 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH030_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH030 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH030_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH030_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH030_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH031 @Bit 31 : Write '1' to disable interrupt for event GRCPERIPH0[31] */
  #define GRCCONF_INTENCLR20_GRCPERIPH031_Pos (31UL) /*!< Position of GRCPERIPH031 field.                                      */
  #define GRCCONF_INTENCLR20_GRCPERIPH031_Msk (0x1UL << GRCCONF_INTENCLR20_GRCPERIPH031_Pos) /*!< Bit mask of GRCPERIPH031
                                                                            field.*/
  #define GRCCONF_INTENCLR20_GRCPERIPH031_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH031 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH031_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH031 field.                         */
  #define GRCCONF_INTENCLR20_GRCPERIPH031_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR20_GRCPERIPH031_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR20_GRCPERIPH031_Enabled (0x1UL) /*!< Read: Enabled                                                   */


