adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCCONF_INTENCLR21: Disable interrupt */
  #define GRCCONF_INTENCLR21_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR21 register.                                */

/* GRCPERIPH10 @Bit 0 : Write '1' to disable interrupt for event GRCPERIPH1[0] */
  #define GRCCONF_INTENCLR21_GRCPERIPH10_Pos (0UL)   /*!< Position of GRCPERIPH10 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH10_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH10_Pos) /*!< Bit mask of GRCPERIPH10 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH10_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH10 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH10_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH10 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH10_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH10_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH10_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH11 @Bit 1 : Write '1' to disable interrupt for event GRCPERIPH1[1] */
  #define GRCCONF_INTENCLR21_GRCPERIPH11_Pos (1UL)   /*!< Position of GRCPERIPH11 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH11_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH11_Pos) /*!< Bit mask of GRCPERIPH11 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH11_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH11 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH11_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH11 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH11_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH11_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH11_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH12 @Bit 2 : Write '1' to disable interrupt for event GRCPERIPH1[2] */
  #define GRCCONF_INTENCLR21_GRCPERIPH12_Pos (2UL)   /*!< Position of GRCPERIPH12 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH12_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH12_Pos) /*!< Bit mask of GRCPERIPH12 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH12_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH12 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH12_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH12 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH12_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH12_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH12_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH13 @Bit 3 : Write '1' to disable interrupt for event GRCPERIPH1[3] */
  #define GRCCONF_INTENCLR21_GRCPERIPH13_Pos (3UL)   /*!< Position of GRCPERIPH13 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH13_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH13_Pos) /*!< Bit mask of GRCPERIPH13 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH13_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH13 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH13_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH13 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH13_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH13_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH13_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH14 @Bit 4 : Write '1' to disable interrupt for event GRCPERIPH1[4] */
  #define GRCCONF_INTENCLR21_GRCPERIPH14_Pos (4UL)   /*!< Position of GRCPERIPH14 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH14_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH14_Pos) /*!< Bit mask of GRCPERIPH14 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH14_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH14 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH14_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH14 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH14_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH14_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH14_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH15 @Bit 5 : Write '1' to disable interrupt for event GRCPERIPH1[5] */
  #define GRCCONF_INTENCLR21_GRCPERIPH15_Pos (5UL)   /*!< Position of GRCPERIPH15 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH15_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH15_Pos) /*!< Bit mask of GRCPERIPH15 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH15_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH15 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH15_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH15 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH15_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH15_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH15_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH16 @Bit 6 : Write '1' to disable interrupt for event GRCPERIPH1[6] */
  #define GRCCONF_INTENCLR21_GRCPERIPH16_Pos (6UL)   /*!< Position of GRCPERIPH16 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH16_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH16_Pos) /*!< Bit mask of GRCPERIPH16 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH16_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH16 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH16_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH16 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH16_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH16_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH16_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH17 @Bit 7 : Write '1' to disable interrupt for event GRCPERIPH1[7] */
  #define GRCCONF_INTENCLR21_GRCPERIPH17_Pos (7UL)   /*!< Position of GRCPERIPH17 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH17_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH17_Pos) /*!< Bit mask of GRCPERIPH17 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH17_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH17 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH17_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH17 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH17_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH17_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH17_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH18 @Bit 8 : Write '1' to disable interrupt for event GRCPERIPH1[8] */
  #define GRCCONF_INTENCLR21_GRCPERIPH18_Pos (8UL)   /*!< Position of GRCPERIPH18 field.                                       */
  #define GRCCONF_INTENCLR21_GRCPERIPH18_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH18_Pos) /*!< Bit mask of GRCPERIPH18 field. */
  #define GRCCONF_INTENCLR21_GRCPERIPH18_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH18 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH18_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH18 field.                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH18_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR21_GRCPERIPH18_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR21_GRCPERIPH18_Enabled (0x1UL) /*!< Read: Enabled                                                    */

