adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH012 @Bit 12 : Read pending status of interrupt for event GRCPERIPH0[12] */
  #define GRCCONF_INTPEND20_GRCPERIPH012_Pos (12UL)  /*!< Position of GRCPERIPH012 field.                                      */
  #define GRCCONF_INTPEND20_GRCPERIPH012_Msk (0x1UL << GRCCONF_INTPEND20_GRCPERIPH012_Pos) /*!< Bit mask of GRCPERIPH012 field.*/
  #define GRCCONF_INTPEND20_GRCPERIPH012_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH012 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH012_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH012 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH012_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND20_GRCPERIPH012_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH013 @Bit 13 : Read pending status of interrupt for event GRCPERIPH0[13] */
  #define GRCCONF_INTPEND20_GRCPERIPH013_Pos (13UL)  /*!< Position of GRCPERIPH013 field.                                      */
  #define GRCCONF_INTPEND20_GRCPERIPH013_Msk (0x1UL << GRCCONF_INTPEND20_GRCPERIPH013_Pos) /*!< Bit mask of GRCPERIPH013 field.*/
  #define GRCCONF_INTPEND20_GRCPERIPH013_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH013 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH013_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH013 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH013_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND20_GRCPERIPH013_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH014 @Bit 14 : Read pending status of interrupt for event GRCPERIPH0[14] */
  #define GRCCONF_INTPEND20_GRCPERIPH014_Pos (14UL)  /*!< Position of GRCPERIPH014 field.                                      */
  #define GRCCONF_INTPEND20_GRCPERIPH014_Msk (0x1UL << GRCCONF_INTPEND20_GRCPERIPH014_Pos) /*!< Bit mask of GRCPERIPH014 field.*/
  #define GRCCONF_INTPEND20_GRCPERIPH014_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH014 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH014_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH014 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH014_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND20_GRCPERIPH014_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH015 @Bit 15 : Read pending status of interrupt for event GRCPERIPH0[15] */
  #define GRCCONF_INTPEND20_GRCPERIPH015_Pos (15UL)  /*!< Position of GRCPERIPH015 field.                                      */
  #define GRCCONF_INTPEND20_GRCPERIPH015_Msk (0x1UL << GRCCONF_INTPEND20_GRCPERIPH015_Pos) /*!< Bit mask of GRCPERIPH015 field.*/
  #define GRCCONF_INTPEND20_GRCPERIPH015_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH015 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH015_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH015 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH015_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND20_GRCPERIPH015_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH016 @Bit 16 : Read pending status of interrupt for event GRCPERIPH0[16] */
  #define GRCCONF_INTPEND20_GRCPERIPH016_Pos (16UL)  /*!< Position of GRCPERIPH016 field.                                      */
  #define GRCCONF_INTPEND20_GRCPERIPH016_Msk (0x1UL << GRCCONF_INTPEND20_GRCPERIPH016_Pos) /*!< Bit mask of GRCPERIPH016 field.*/
  #define GRCCONF_INTPEND20_GRCPERIPH016_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH016 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH016_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH016 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH016_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND20_GRCPERIPH016_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH017 @Bit 17 : Read pending status of interrupt for event GRCPERIPH0[17] */
  #define GRCCONF_INTPEND20_GRCPERIPH017_Pos (17UL)  /*!< Position of GRCPERIPH017 field.                                      */
  #define GRCCONF_INTPEND20_GRCPERIPH017_Msk (0x1UL << GRCCONF_INTPEND20_GRCPERIPH017_Pos) /*!< Bit mask of GRCPERIPH017 field.*/
  #define GRCCONF_INTPEND20_GRCPERIPH017_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH017 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH017_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH017 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH017_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND20_GRCPERIPH017_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH018 @Bit 18 : Read pending status of interrupt for event GRCPERIPH0[18] */
  #define GRCCONF_INTPEND20_GRCPERIPH018_Pos (18UL)  /*!< Position of GRCPERIPH018 field.                                      */
  #define GRCCONF_INTPEND20_GRCPERIPH018_Msk (0x1UL << GRCCONF_INTPEND20_GRCPERIPH018_Pos) /*!< Bit mask of GRCPERIPH018 field.*/
  #define GRCCONF_INTPEND20_GRCPERIPH018_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH018 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH018_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH018 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH018_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND20_GRCPERIPH018_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH019 @Bit 19 : Read pending status of interrupt for event GRCPERIPH0[19] */
  #define GRCCONF_INTPEND20_GRCPERIPH019_Pos (19UL)  /*!< Position of GRCPERIPH019 field.                                      */
  #define GRCCONF_INTPEND20_GRCPERIPH019_Msk (0x1UL << GRCCONF_INTPEND20_GRCPERIPH019_Pos) /*!< Bit mask of GRCPERIPH019 field.*/
  #define GRCCONF_INTPEND20_GRCPERIPH019_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH019 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH019_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH019 field.                          */
  #define GRCCONF_INTPEND20_GRCPERIPH019_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND20_GRCPERIPH019_Pending (0x1UL) /*!< Read: Pending                                                    */

