adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRCPERIPH129 @Bit 29 : Read pending status of interrupt for event GRCPERIPH1[29] */
  #define GRCCONF_INTPEND21_GRCPERIPH129_Pos (29UL)  /*!< Position of GRCPERIPH129 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH129_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH129_Pos) /*!< Bit mask of GRCPERIPH129 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH129_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH129 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH129_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH129 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH129_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH129_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH130 @Bit 30 : Read pending status of interrupt for event GRCPERIPH1[30] */
  #define GRCCONF_INTPEND21_GRCPERIPH130_Pos (30UL)  /*!< Position of GRCPERIPH130 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH130_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH130_Pos) /*!< Bit mask of GRCPERIPH130 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH130_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH130 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH130_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH130 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH130_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH130_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH131 @Bit 31 : Read pending status of interrupt for event GRCPERIPH1[31] */
  #define GRCCONF_INTPEND21_GRCPERIPH131_Pos (31UL)  /*!< Position of GRCPERIPH131 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH131_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH131_Pos) /*!< Bit mask of GRCPERIPH131 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH131_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH131 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH131_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH131 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH131_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH131_Pending (0x1UL) /*!< Read: Pending                                                    */


/* GRCCONF_INTPEND22: Pending interrupts */
  #define GRCCONF_INTPEND22_ResetValue (0x00000000UL) /*!< Reset value of INTPEND22 register.                                  */

/* SYSTEMOFFREADY @Bit 0 : Read pending status of interrupt for event SYSTEMOFFREADY */
  #define GRCCONF_INTPEND22_SYSTEMOFFREADY_Pos (0UL) /*!< Position of SYSTEMOFFREADY field.                                    */
  #define GRCCONF_INTPEND22_SYSTEMOFFREADY_Msk (0x1UL << GRCCONF_INTPEND22_SYSTEMOFFREADY_Pos) /*!< Bit mask of SYSTEMOFFREADY
                                                                            field.*/
  #define GRCCONF_INTPEND22_SYSTEMOFFREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFREADY field.                      */
  #define GRCCONF_INTPEND22_SYSTEMOFFREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFREADY field.                      */
  #define GRCCONF_INTPEND22_SYSTEMOFFREADY_NotPending (0x0UL) /*!< Read: Not pending                                           */
  #define GRCCONF_INTPEND22_SYSTEMOFFREADY_Pending (0x1UL) /*!< Read: Pending                                                  */

/* SYSTEMOFFNOTREADY @Bit 1 : Read pending status of interrupt for event SYSTEMOFFNOTREADY */
  #define GRCCONF_INTPEND22_SYSTEMOFFNOTREADY_Pos (1UL) /*!< Position of SYSTEMOFFNOTREADY field.                              */
  #define GRCCONF_INTPEND22_SYSTEMOFFNOTREADY_Msk (0x1UL << GRCCONF_INTPEND22_SYSTEMOFFNOTREADY_Pos) /*!< Bit mask of
                                                                            SYSTEMOFFNOTREADY field.*/
  #define GRCCONF_INTPEND22_SYSTEMOFFNOTREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFNOTREADY field.                */
  #define GRCCONF_INTPEND22_SYSTEMOFFNOTREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFNOTREADY field.                */
  #define GRCCONF_INTPEND22_SYSTEMOFFNOTREADY_NotPending (0x0UL) /*!< Read: Not pending                                        */
  #define GRCCONF_INTPEND22_SYSTEMOFFNOTREADY_Pending (0x1UL) /*!< Read: Pending                                               */

/* SYSTEMOFFLOCALDOMAINOFF @Bit 2 : Read pending status of interrupt for event SYSTEMOFFLOCALDOMAINOFF */
  #define GRCCONF_INTPEND22_SYSTEMOFFLOCALDOMAINOFF_Pos (2UL) /*!< Position of SYSTEMOFFLOCALDOMAINOFF field.                  */
  #define GRCCONF_INTPEND22_SYSTEMOFFLOCALDOMAINOFF_Msk (0x1UL << GRCCONF_INTPEND22_SYSTEMOFFLOCALDOMAINOFF_Pos) /*!< Bit mask
                                                                            of SYSTEMOFFLOCALDOMAINOFF field.*/
  #define GRCCONF_INTPEND22_SYSTEMOFFLOCALDOMAINOFF_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFLOCALDOMAINOFF field.    */
  #define GRCCONF_INTPEND22_SYSTEMOFFLOCALDOMAINOFF_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFLOCALDOMAINOFF field.    */
  #define GRCCONF_INTPEND22_SYSTEMOFFLOCALDOMAINOFF_NotPending (0x0UL) /*!< Read: Not pending                                  */
  #define GRCCONF_INTPEND22_SYSTEMOFFLOCALDOMAINOFF_Pending (0x1UL) /*!< Read: Pending                                         */


/* GRCCONF_CHIPCONF: Chip configuration */
  #define GRCCONF_CHIPCONF_ResetValue (0x00000000UL) /*!< Reset value of CHIPCONF register.                                    */

/* CONFREADY @Bit 0 : Chip configuration ready */
  #define GRCCONF_CHIPCONF_CONFREADY_Pos (0UL)       /*!< Position of CONFREADY field.                                         */
  #define GRCCONF_CHIPCONF_CONFREADY_Msk (0x1UL << GRCCONF_CHIPCONF_CONFREADY_Pos) /*!< Bit mask of CONFREADY field.           */
  #define GRCCONF_CHIPCONF_CONFREADY_Min (0x0UL)     /*!< Min enumerator value of CONFREADY field.                             */
  #define GRCCONF_CHIPCONF_CONFREADY_Max (0x1UL)     /*!< Max enumerator value of CONFREADY field.                             */
  #define GRCCONF_CHIPCONF_CONFREADY_NotReady (0x0UL) /*!< Chip configuration is not ready                                     */
  #define GRCCONF_CHIPCONF_CONFREADY_Ready (0x1UL)   /*!< Chip configuration is completed                                      */

/* TRIMREADY @Bit 1 : Trim configuration ready */
  #define GRCCONF_CHIPCONF_TRIMREADY_Pos (1UL)       /*!< Position of TRIMREADY field.                                         */
  #define GRCCONF_CHIPCONF_TRIMREADY_Msk (0x1UL << GRCCONF_CHIPCONF_TRIMREADY_Pos) /*!< Bit mask of TRIMREADY field.           */
  #define GRCCONF_CHIPCONF_TRIMREADY_Min (0x0UL)     /*!< Min enumerator value of TRIMREADY field.                             */
  #define GRCCONF_CHIPCONF_TRIMREADY_Max (0x1UL)     /*!< Max enumerator value of TRIMREADY field.                             */
  #define GRCCONF_CHIPCONF_TRIMREADY_NotReady (0x0UL) /*!< Trim configuration is not ready                                     */
  #define GRCCONF_CHIPCONF_TRIMREADY_Ready (0x1UL)   /*!< Trim configuration is completed                                      */

