adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RAMPUP @Bit 2 : Ramp up done status */
  #define GRCCONF_CHIPCONF_RAMPUP_Pos (2UL)          /*!< Position of RAMPUP field.                                            */
  #define GRCCONF_CHIPCONF_RAMPUP_Msk (0x1UL << GRCCONF_CHIPCONF_RAMPUP_Pos) /*!< Bit mask of RAMPUP field.                    */
  #define GRCCONF_CHIPCONF_RAMPUP_Min (0x0UL)        /*!< Min enumerator value of RAMPUP field.                                */
  #define GRCCONF_CHIPCONF_RAMPUP_Max (0x1UL)        /*!< Max enumerator value of RAMPUP field.                                */
  #define GRCCONF_CHIPCONF_RAMPUP_NotDone (0x0UL)    /*!< Ramp up is not done                                                  */
  #define GRCCONF_CHIPCONF_RAMPUP_Done (0x1UL)       /*!< Ramp up is done                                                      */


/* GRCCONF_SYSTEMOFF: System OFF register */
  #define GRCCONF_SYSTEMOFF_ResetValue (0x00000000UL) /*!< Reset value of SYSTEMOFF register.                                  */

/* SYSTEMOFF @Bit 0 : Enable System OFF mode */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Pos (0UL)      /*!< Position of SYSTEMOFF field.                                         */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Msk (0x1UL << GRCCONF_SYSTEMOFF_SYSTEMOFF_Pos) /*!< Bit mask of SYSTEMOFF field.         */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Min (0x0UL)    /*!< Min enumerator value of SYSTEMOFF field.                             */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Max (0x1UL)    /*!< Max enumerator value of SYSTEMOFF field.                             */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Exit (0x0UL)   /*!< Exit System OFF mode. Local domains are allowed to power on again.   */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Enter (0x1UL)  /*!< Enter into System OFF mode. Local domains are not allowed to be
                                                          powered up once they are all powered down.*/

/* FORCEGDOFF @Bit 1 : Force global domain OFF */
  #define GRCCONF_SYSTEMOFF_FORCEGDOFF_Pos (1UL)     /*!< Position of FORCEGDOFF field.                                        */
  #define GRCCONF_SYSTEMOFF_FORCEGDOFF_Msk (0x1UL << GRCCONF_SYSTEMOFF_FORCEGDOFF_Pos) /*!< Bit mask of FORCEGDOFF field.      */
  #define GRCCONF_SYSTEMOFF_FORCEGDOFF_Min (0x0UL)   /*!< Min enumerator value of FORCEGDOFF field.                            */
  #define GRCCONF_SYSTEMOFF_FORCEGDOFF_Max (0x1UL)   /*!< Max enumerator value of FORCEGDOFF field.                            */
  #define GRCCONF_SYSTEMOFF_FORCEGDOFF_NoOperation (0x0UL) /*!< No operation                                                   */
  #define GRCCONF_SYSTEMOFF_FORCEGDOFF_Force (0x1UL) /*!< Enter into System OFF mode and force global domain off once all local
                                                          domains are powered down.*/

/* FORCESYSTEMOFFNOW @Bit 2 : Force System OFF mode immediately */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Pos (2UL) /*!< Position of FORCESYSTEMOFFNOW field.                              */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Msk (0x1UL << GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Pos) /*!< Bit mask of
                                                                            FORCESYSTEMOFFNOW field.*/
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Min (0x0UL) /*!< Min enumerator value of FORCESYSTEMOFFNOW field.                */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Max (0x1UL) /*!< Max enumerator value of FORCESYSTEMOFFNOW field.                */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_NoOperation (0x0UL) /*!< No operation                                            */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Force (0x1UL) /*!< Force System OFF mode and power all domains OFF mode
                                                                 immediately except Secure Domain. Secure Domain power itself
                                                                 down before the device enters System Off.*/

/* SYSTEMOFFIGNORESECDOM @Bit 3 : System OFF without considering Secure Domain */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFFIGNORESECDOM_Pos (3UL) /*!< Position of SYSTEMOFFIGNORESECDOM field.                      */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFFIGNORESECDOM_Msk (0x1UL << GRCCONF_SYSTEMOFF_SYSTEMOFFIGNORESECDOM_Pos) /*!< Bit mask of
                                                                            SYSTEMOFFIGNORESECDOM field.*/
  #define GRCCONF_SYSTEMOFF_SYSTEMOFFIGNORESECDOM_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFIGNORESECDOM field.        */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFFIGNORESECDOM_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFIGNORESECDOM field.        */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFFIGNORESECDOM_Disable (0x0UL) /*!< Power state of secure domain is considered for
                                                                       SYSTEMOFFLOCALDOMAINOFF and secure domain is not allowed
                                                                       to wake up again after SYSTEMOFFLOCALDOMAINOFF.*/
  #define GRCCONF_SYSTEMOFF_SYSTEMOFFIGNORESECDOM_Enable (0x1UL) /*!< Power state of secure domain is ignored for
                                                                      SYSTEMOFFLOCALDOMAINOFF and secure domain is allowed to
                                                                      both run during and wake up again after
                                                                      SYSTEMOFFLOCALDOMAINOFF.*/


/* GRCCONF_SYSTEMOFFSTAT: System OFF status */
  #define GRCCONF_SYSTEMOFFSTAT_ResetValue (0x00000000UL) /*!< Reset value of SYSTEMOFFSTAT register.                          */

/* STATUS0 @Bit 0 : System OFF status for power domain [0] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Pos (0UL)    /*!< Position of STATUS0 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS0_Pos) /*!< Bit mask of STATUS0 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Min (0x0UL)  /*!< Min enumerator value of STATUS0 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Max (0x1UL)  /*!< Max enumerator value of STATUS0 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Ready (0x0UL) /*!< Power domain [0] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Prevent (0x1UL) /*!< Power domain [0] is preventing system OFF                         */

/* STATUS1 @Bit 1 : System OFF status for power domain [1] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Pos (1UL)    /*!< Position of STATUS1 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS1_Pos) /*!< Bit mask of STATUS1 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Min (0x0UL)  /*!< Min enumerator value of STATUS1 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Max (0x1UL)  /*!< Max enumerator value of STATUS1 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Ready (0x0UL) /*!< Power domain [1] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Prevent (0x1UL) /*!< Power domain [1] is preventing system OFF                         */

/* STATUS2 @Bit 2 : System OFF status for power domain [2] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Pos (2UL)    /*!< Position of STATUS2 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS2_Pos) /*!< Bit mask of STATUS2 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Min (0x0UL)  /*!< Min enumerator value of STATUS2 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Max (0x1UL)  /*!< Max enumerator value of STATUS2 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Ready (0x0UL) /*!< Power domain [2] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Prevent (0x1UL) /*!< Power domain [2] is preventing system OFF                         */

/* STATUS3 @Bit 3 : System OFF status for power domain [3] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Pos (3UL)    /*!< Position of STATUS3 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS3_Pos) /*!< Bit mask of STATUS3 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Min (0x0UL)  /*!< Min enumerator value of STATUS3 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Max (0x1UL)  /*!< Max enumerator value of STATUS3 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Ready (0x0UL) /*!< Power domain [3] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Prevent (0x1UL) /*!< Power domain [3] is preventing system OFF                         */

/* STATUS4 @Bit 4 : System OFF status for power domain [4] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Pos (4UL)    /*!< Position of STATUS4 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS4_Pos) /*!< Bit mask of STATUS4 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Min (0x0UL)  /*!< Min enumerator value of STATUS4 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Max (0x1UL)  /*!< Max enumerator value of STATUS4 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Ready (0x0UL) /*!< Power domain [4] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Prevent (0x1UL) /*!< Power domain [4] is preventing system OFF                         */

/* STATUS5 @Bit 5 : System OFF status for power domain [5] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Pos (5UL)    /*!< Position of STATUS5 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS5_Pos) /*!< Bit mask of STATUS5 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Min (0x0UL)  /*!< Min enumerator value of STATUS5 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Max (0x1UL)  /*!< Max enumerator value of STATUS5 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Ready (0x0UL) /*!< Power domain [5] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Prevent (0x1UL) /*!< Power domain [5] is preventing system OFF                         */

/* STATUS6 @Bit 6 : System OFF status for power domain [6] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Pos (6UL)    /*!< Position of STATUS6 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS6_Pos) /*!< Bit mask of STATUS6 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Min (0x0UL)  /*!< Min enumerator value of STATUS6 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Max (0x1UL)  /*!< Max enumerator value of STATUS6 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Ready (0x0UL) /*!< Power domain [6] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Prevent (0x1UL) /*!< Power domain [6] is preventing system OFF                         */

