adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STATUS7 @Bit 7 : System OFF status for power domain [7] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS7_Pos (7UL)    /*!< Position of STATUS7 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS7_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS7_Pos) /*!< Bit mask of STATUS7 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS7_Min (0x0UL)  /*!< Min enumerator value of STATUS7 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS7_Max (0x1UL)  /*!< Max enumerator value of STATUS7 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS7_Ready (0x0UL) /*!< Power domain [7] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS7_Prevent (0x1UL) /*!< Power domain [7] is preventing system OFF                         */

/* STATUS8 @Bit 8 : System OFF status for power domain [8] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS8_Pos (8UL)    /*!< Position of STATUS8 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS8_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS8_Pos) /*!< Bit mask of STATUS8 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS8_Min (0x0UL)  /*!< Min enumerator value of STATUS8 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS8_Max (0x1UL)  /*!< Max enumerator value of STATUS8 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS8_Ready (0x0UL) /*!< Power domain [8] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS8_Prevent (0x1UL) /*!< Power domain [8] is preventing system OFF                         */

/* STATUS9 @Bit 9 : System OFF status for power domain [9] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS9_Pos (9UL)    /*!< Position of STATUS9 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS9_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS9_Pos) /*!< Bit mask of STATUS9 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS9_Min (0x0UL)  /*!< Min enumerator value of STATUS9 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS9_Max (0x1UL)  /*!< Max enumerator value of STATUS9 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS9_Ready (0x0UL) /*!< Power domain [9] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS9_Prevent (0x1UL) /*!< Power domain [9] is preventing system OFF                         */

/* STATUS10 @Bit 10 : System OFF status for power domain [10] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS10_Pos (10UL)  /*!< Position of STATUS10 field.                                          */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS10_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS10_Pos) /*!< Bit mask of STATUS10 field.    */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS10_Min (0x0UL) /*!< Min enumerator value of STATUS10 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS10_Max (0x1UL) /*!< Max enumerator value of STATUS10 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS10_Ready (0x0UL) /*!< Power domain [10] is ready to go to system OFF                     */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS10_Prevent (0x1UL) /*!< Power domain [10] is preventing system OFF                       */

/* STATUS11 @Bit 11 : System OFF status for power domain [11] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS11_Pos (11UL)  /*!< Position of STATUS11 field.                                          */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS11_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS11_Pos) /*!< Bit mask of STATUS11 field.    */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS11_Min (0x0UL) /*!< Min enumerator value of STATUS11 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS11_Max (0x1UL) /*!< Max enumerator value of STATUS11 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS11_Ready (0x0UL) /*!< Power domain [11] is ready to go to system OFF                     */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS11_Prevent (0x1UL) /*!< Power domain [11] is preventing system OFF                       */

/* STATUS12 @Bit 12 : System OFF status for power domain [12] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS12_Pos (12UL)  /*!< Position of STATUS12 field.                                          */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS12_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS12_Pos) /*!< Bit mask of STATUS12 field.    */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS12_Min (0x0UL) /*!< Min enumerator value of STATUS12 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS12_Max (0x1UL) /*!< Max enumerator value of STATUS12 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS12_Ready (0x0UL) /*!< Power domain [12] is ready to go to system OFF                     */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS12_Prevent (0x1UL) /*!< Power domain [12] is preventing system OFF                       */

/* STATUS13 @Bit 13 : System OFF status for power domain [13] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS13_Pos (13UL)  /*!< Position of STATUS13 field.                                          */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS13_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS13_Pos) /*!< Bit mask of STATUS13 field.    */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS13_Min (0x0UL) /*!< Min enumerator value of STATUS13 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS13_Max (0x1UL) /*!< Max enumerator value of STATUS13 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS13_Ready (0x0UL) /*!< Power domain [13] is ready to go to system OFF                     */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS13_Prevent (0x1UL) /*!< Power domain [13] is preventing system OFF                       */

/* STATUS14 @Bit 14 : System OFF status for power domain [14] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS14_Pos (14UL)  /*!< Position of STATUS14 field.                                          */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS14_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS14_Pos) /*!< Bit mask of STATUS14 field.    */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS14_Min (0x0UL) /*!< Min enumerator value of STATUS14 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS14_Max (0x1UL) /*!< Max enumerator value of STATUS14 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS14_Ready (0x0UL) /*!< Power domain [14] is ready to go to system OFF                     */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS14_Prevent (0x1UL) /*!< Power domain [14] is preventing system OFF                       */

/* STATUS15 @Bit 15 : System OFF status for power domain [15] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS15_Pos (15UL)  /*!< Position of STATUS15 field.                                          */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS15_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS15_Pos) /*!< Bit mask of STATUS15 field.    */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS15_Min (0x0UL) /*!< Min enumerator value of STATUS15 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS15_Max (0x1UL) /*!< Max enumerator value of STATUS15 field.                              */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS15_Ready (0x0UL) /*!< Power domain [15] is ready to go to system OFF                     */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS15_Prevent (0x1UL) /*!< Power domain [15] is preventing system OFF                       */


/* GRCCONF_PDREQSTATUS: Power domain request status */
  #define GRCCONF_PDREQSTATUS_MaxCount (2UL)         /*!< Max size of PDREQSTATUS[2] array.                                    */
  #define GRCCONF_PDREQSTATUS_MaxIndex (1UL)         /*!< Max index of PDREQSTATUS[2] array.                                   */
  #define GRCCONF_PDREQSTATUS_MinIndex (0UL)         /*!< Min index of PDREQSTATUS[2] array.                                   */
  #define GRCCONF_PDREQSTATUS_ResetValue (0x00000000UL) /*!< Reset value of PDREQSTATUS[2] register.                           */

