adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STATUS0 @Bit 0 : The power domain request status for power domain [n] * 32 + [0] */
  #define GRCCONF_PDREQSTATUS_STATUS0_Pos (0UL)      /*!< Position of STATUS0 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS0_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS0_Pos) /*!< Bit mask of STATUS0 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS0_Min (0x0UL)    /*!< Min enumerator value of STATUS0 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS0_Max (0x1UL)    /*!< Max enumerator value of STATUS0 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS0_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS0_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS1 @Bit 1 : The power domain request status for power domain [n] * 32 + [1] */
  #define GRCCONF_PDREQSTATUS_STATUS1_Pos (1UL)      /*!< Position of STATUS1 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS1_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS1_Pos) /*!< Bit mask of STATUS1 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS1_Min (0x0UL)    /*!< Min enumerator value of STATUS1 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS1_Max (0x1UL)    /*!< Max enumerator value of STATUS1 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS1_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS1_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS2 @Bit 2 : The power domain request status for power domain [n] * 32 + [2] */
  #define GRCCONF_PDREQSTATUS_STATUS2_Pos (2UL)      /*!< Position of STATUS2 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS2_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS2_Pos) /*!< Bit mask of STATUS2 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS2_Min (0x0UL)    /*!< Min enumerator value of STATUS2 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS2_Max (0x1UL)    /*!< Max enumerator value of STATUS2 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS2_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS2_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS3 @Bit 3 : The power domain request status for power domain [n] * 32 + [3] */
  #define GRCCONF_PDREQSTATUS_STATUS3_Pos (3UL)      /*!< Position of STATUS3 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS3_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS3_Pos) /*!< Bit mask of STATUS3 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS3_Min (0x0UL)    /*!< Min enumerator value of STATUS3 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS3_Max (0x1UL)    /*!< Max enumerator value of STATUS3 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS3_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS3_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS4 @Bit 4 : The power domain request status for power domain [n] * 32 + [4] */
  #define GRCCONF_PDREQSTATUS_STATUS4_Pos (4UL)      /*!< Position of STATUS4 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS4_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS4_Pos) /*!< Bit mask of STATUS4 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS4_Min (0x0UL)    /*!< Min enumerator value of STATUS4 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS4_Max (0x1UL)    /*!< Max enumerator value of STATUS4 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS4_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS4_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS5 @Bit 5 : The power domain request status for power domain [n] * 32 + [5] */
  #define GRCCONF_PDREQSTATUS_STATUS5_Pos (5UL)      /*!< Position of STATUS5 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS5_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS5_Pos) /*!< Bit mask of STATUS5 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS5_Min (0x0UL)    /*!< Min enumerator value of STATUS5 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS5_Max (0x1UL)    /*!< Max enumerator value of STATUS5 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS5_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS5_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS6 @Bit 6 : The power domain request status for power domain [n] * 32 + [6] */
  #define GRCCONF_PDREQSTATUS_STATUS6_Pos (6UL)      /*!< Position of STATUS6 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS6_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS6_Pos) /*!< Bit mask of STATUS6 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS6_Min (0x0UL)    /*!< Min enumerator value of STATUS6 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS6_Max (0x1UL)    /*!< Max enumerator value of STATUS6 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS6_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS6_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS7 @Bit 7 : The power domain request status for power domain [n] * 32 + [7] */
  #define GRCCONF_PDREQSTATUS_STATUS7_Pos (7UL)      /*!< Position of STATUS7 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS7_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS7_Pos) /*!< Bit mask of STATUS7 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS7_Min (0x0UL)    /*!< Min enumerator value of STATUS7 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS7_Max (0x1UL)    /*!< Max enumerator value of STATUS7 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS7_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS7_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS8 @Bit 8 : The power domain request status for power domain [n] * 32 + [8] */
  #define GRCCONF_PDREQSTATUS_STATUS8_Pos (8UL)      /*!< Position of STATUS8 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS8_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS8_Pos) /*!< Bit mask of STATUS8 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS8_Min (0x0UL)    /*!< Min enumerator value of STATUS8 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS8_Max (0x1UL)    /*!< Max enumerator value of STATUS8 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS8_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS8_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS9 @Bit 9 : The power domain request status for power domain [n] * 32 + [9] */
  #define GRCCONF_PDREQSTATUS_STATUS9_Pos (9UL)      /*!< Position of STATUS9 field.                                           */
  #define GRCCONF_PDREQSTATUS_STATUS9_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS9_Pos) /*!< Bit mask of STATUS9 field.           */
  #define GRCCONF_PDREQSTATUS_STATUS9_Min (0x0UL)    /*!< Min enumerator value of STATUS9 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS9_Max (0x1UL)    /*!< Max enumerator value of STATUS9 field.                               */
  #define GRCCONF_PDREQSTATUS_STATUS9_Inactive (0x0UL) /*!< Power domain request is inactive                                   */
  #define GRCCONF_PDREQSTATUS_STATUS9_Active (0x1UL) /*!< Power domain request is active                                       */

/* STATUS10 @Bit 10 : The power domain request status for power domain [n] * 32 + [10] */
  #define GRCCONF_PDREQSTATUS_STATUS10_Pos (10UL)    /*!< Position of STATUS10 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS10_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS10_Pos) /*!< Bit mask of STATUS10 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS10_Min (0x0UL)   /*!< Min enumerator value of STATUS10 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS10_Max (0x1UL)   /*!< Max enumerator value of STATUS10 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS10_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS10_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS11 @Bit 11 : The power domain request status for power domain [n] * 32 + [11] */
  #define GRCCONF_PDREQSTATUS_STATUS11_Pos (11UL)    /*!< Position of STATUS11 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS11_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS11_Pos) /*!< Bit mask of STATUS11 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS11_Min (0x0UL)   /*!< Min enumerator value of STATUS11 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS11_Max (0x1UL)   /*!< Max enumerator value of STATUS11 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS11_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS11_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS12 @Bit 12 : The power domain request status for power domain [n] * 32 + [12] */
  #define GRCCONF_PDREQSTATUS_STATUS12_Pos (12UL)    /*!< Position of STATUS12 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS12_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS12_Pos) /*!< Bit mask of STATUS12 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS12_Min (0x0UL)   /*!< Min enumerator value of STATUS12 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS12_Max (0x1UL)   /*!< Max enumerator value of STATUS12 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS12_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS12_Active (0x1UL) /*!< Power domain request is active                                      */

