adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STATUS13 @Bit 13 : The power domain request status for power domain [n] * 32 + [13] */
  #define GRCCONF_PDREQSTATUS_STATUS13_Pos (13UL)    /*!< Position of STATUS13 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS13_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS13_Pos) /*!< Bit mask of STATUS13 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS13_Min (0x0UL)   /*!< Min enumerator value of STATUS13 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS13_Max (0x1UL)   /*!< Max enumerator value of STATUS13 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS13_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS13_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS14 @Bit 14 : The power domain request status for power domain [n] * 32 + [14] */
  #define GRCCONF_PDREQSTATUS_STATUS14_Pos (14UL)    /*!< Position of STATUS14 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS14_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS14_Pos) /*!< Bit mask of STATUS14 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS14_Min (0x0UL)   /*!< Min enumerator value of STATUS14 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS14_Max (0x1UL)   /*!< Max enumerator value of STATUS14 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS14_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS14_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS15 @Bit 15 : The power domain request status for power domain [n] * 32 + [15] */
  #define GRCCONF_PDREQSTATUS_STATUS15_Pos (15UL)    /*!< Position of STATUS15 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS15_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS15_Pos) /*!< Bit mask of STATUS15 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS15_Min (0x0UL)   /*!< Min enumerator value of STATUS15 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS15_Max (0x1UL)   /*!< Max enumerator value of STATUS15 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS15_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS15_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS16 @Bit 16 : The power domain request status for power domain [n] * 32 + [16] */
  #define GRCCONF_PDREQSTATUS_STATUS16_Pos (16UL)    /*!< Position of STATUS16 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS16_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS16_Pos) /*!< Bit mask of STATUS16 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS16_Min (0x0UL)   /*!< Min enumerator value of STATUS16 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS16_Max (0x1UL)   /*!< Max enumerator value of STATUS16 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS16_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS16_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS17 @Bit 17 : The power domain request status for power domain [n] * 32 + [17] */
  #define GRCCONF_PDREQSTATUS_STATUS17_Pos (17UL)    /*!< Position of STATUS17 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS17_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS17_Pos) /*!< Bit mask of STATUS17 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS17_Min (0x0UL)   /*!< Min enumerator value of STATUS17 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS17_Max (0x1UL)   /*!< Max enumerator value of STATUS17 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS17_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS17_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS18 @Bit 18 : The power domain request status for power domain [n] * 32 + [18] */
  #define GRCCONF_PDREQSTATUS_STATUS18_Pos (18UL)    /*!< Position of STATUS18 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS18_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS18_Pos) /*!< Bit mask of STATUS18 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS18_Min (0x0UL)   /*!< Min enumerator value of STATUS18 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS18_Max (0x1UL)   /*!< Max enumerator value of STATUS18 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS18_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS18_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS19 @Bit 19 : The power domain request status for power domain [n] * 32 + [19] */
  #define GRCCONF_PDREQSTATUS_STATUS19_Pos (19UL)    /*!< Position of STATUS19 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS19_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS19_Pos) /*!< Bit mask of STATUS19 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS19_Min (0x0UL)   /*!< Min enumerator value of STATUS19 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS19_Max (0x1UL)   /*!< Max enumerator value of STATUS19 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS19_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS19_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS20 @Bit 20 : The power domain request status for power domain [n] * 32 + [20] */
  #define GRCCONF_PDREQSTATUS_STATUS20_Pos (20UL)    /*!< Position of STATUS20 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS20_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS20_Pos) /*!< Bit mask of STATUS20 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS20_Min (0x0UL)   /*!< Min enumerator value of STATUS20 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS20_Max (0x1UL)   /*!< Max enumerator value of STATUS20 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS20_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS20_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS21 @Bit 21 : The power domain request status for power domain [n] * 32 + [21] */
  #define GRCCONF_PDREQSTATUS_STATUS21_Pos (21UL)    /*!< Position of STATUS21 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS21_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS21_Pos) /*!< Bit mask of STATUS21 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS21_Min (0x0UL)   /*!< Min enumerator value of STATUS21 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS21_Max (0x1UL)   /*!< Max enumerator value of STATUS21 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS21_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS21_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS22 @Bit 22 : The power domain request status for power domain [n] * 32 + [22] */
  #define GRCCONF_PDREQSTATUS_STATUS22_Pos (22UL)    /*!< Position of STATUS22 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS22_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS22_Pos) /*!< Bit mask of STATUS22 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS22_Min (0x0UL)   /*!< Min enumerator value of STATUS22 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS22_Max (0x1UL)   /*!< Max enumerator value of STATUS22 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS22_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS22_Active (0x1UL) /*!< Power domain request is active                                      */

