adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STATUS23 @Bit 23 : The power domain request status for power domain [n] * 32 + [23] */
  #define GRCCONF_PDREQSTATUS_STATUS23_Pos (23UL)    /*!< Position of STATUS23 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS23_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS23_Pos) /*!< Bit mask of STATUS23 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS23_Min (0x0UL)   /*!< Min enumerator value of STATUS23 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS23_Max (0x1UL)   /*!< Max enumerator value of STATUS23 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS23_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS23_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS24 @Bit 24 : The power domain request status for power domain [n] * 32 + [24] */
  #define GRCCONF_PDREQSTATUS_STATUS24_Pos (24UL)    /*!< Position of STATUS24 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS24_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS24_Pos) /*!< Bit mask of STATUS24 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS24_Min (0x0UL)   /*!< Min enumerator value of STATUS24 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS24_Max (0x1UL)   /*!< Max enumerator value of STATUS24 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS24_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS24_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS25 @Bit 25 : The power domain request status for power domain [n] * 32 + [25] */
  #define GRCCONF_PDREQSTATUS_STATUS25_Pos (25UL)    /*!< Position of STATUS25 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS25_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS25_Pos) /*!< Bit mask of STATUS25 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS25_Min (0x0UL)   /*!< Min enumerator value of STATUS25 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS25_Max (0x1UL)   /*!< Max enumerator value of STATUS25 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS25_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS25_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS26 @Bit 26 : The power domain request status for power domain [n] * 32 + [26] */
  #define GRCCONF_PDREQSTATUS_STATUS26_Pos (26UL)    /*!< Position of STATUS26 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS26_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS26_Pos) /*!< Bit mask of STATUS26 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS26_Min (0x0UL)   /*!< Min enumerator value of STATUS26 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS26_Max (0x1UL)   /*!< Max enumerator value of STATUS26 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS26_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS26_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS27 @Bit 27 : The power domain request status for power domain [n] * 32 + [27] */
  #define GRCCONF_PDREQSTATUS_STATUS27_Pos (27UL)    /*!< Position of STATUS27 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS27_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS27_Pos) /*!< Bit mask of STATUS27 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS27_Min (0x0UL)   /*!< Min enumerator value of STATUS27 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS27_Max (0x1UL)   /*!< Max enumerator value of STATUS27 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS27_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS27_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS28 @Bit 28 : The power domain request status for power domain [n] * 32 + [28] */
  #define GRCCONF_PDREQSTATUS_STATUS28_Pos (28UL)    /*!< Position of STATUS28 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS28_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS28_Pos) /*!< Bit mask of STATUS28 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS28_Min (0x0UL)   /*!< Min enumerator value of STATUS28 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS28_Max (0x1UL)   /*!< Max enumerator value of STATUS28 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS28_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS28_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS29 @Bit 29 : The power domain request status for power domain [n] * 32 + [29] */
  #define GRCCONF_PDREQSTATUS_STATUS29_Pos (29UL)    /*!< Position of STATUS29 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS29_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS29_Pos) /*!< Bit mask of STATUS29 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS29_Min (0x0UL)   /*!< Min enumerator value of STATUS29 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS29_Max (0x1UL)   /*!< Max enumerator value of STATUS29 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS29_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS29_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS30 @Bit 30 : The power domain request status for power domain [n] * 32 + [30] */
  #define GRCCONF_PDREQSTATUS_STATUS30_Pos (30UL)    /*!< Position of STATUS30 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS30_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS30_Pos) /*!< Bit mask of STATUS30 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS30_Min (0x0UL)   /*!< Min enumerator value of STATUS30 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS30_Max (0x1UL)   /*!< Max enumerator value of STATUS30 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS30_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS30_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS31 @Bit 31 : The power domain request status for power domain [n] * 32 + [31] */
  #define GRCCONF_PDREQSTATUS_STATUS31_Pos (31UL)    /*!< Position of STATUS31 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS31_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS31_Pos) /*!< Bit mask of STATUS31 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS31_Min (0x0UL)   /*!< Min enumerator value of STATUS31 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS31_Max (0x1UL)   /*!< Max enumerator value of STATUS31 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS31_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS31_Active (0x1UL) /*!< Power domain request is active                                      */


/* GRCCONF_PORBORRESET: Enable PORBOR type global reset */
  #define GRCCONF_PORBORRESET_ResetValue (0x00000000UL) /*!< Reset value of PORBORRESET register.                              */

