adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENABLE @Bit 0 : Global reset will trigger PORBOR type reset in analog reset controller */
  #define GRCCONF_PORBORRESET_ENABLE_Pos (0UL)       /*!< Position of ENABLE field.                                            */
  #define GRCCONF_PORBORRESET_ENABLE_Msk (0x1UL << GRCCONF_PORBORRESET_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define GRCCONF_PORBORRESET_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define GRCCONF_PORBORRESET_ENABLE_Max (0x1UL)     /*!< Max enumerator value of ENABLE field.                                */
  #define GRCCONF_PORBORRESET_ENABLE_Disabled (0x0UL) /*!< Reset feature disabled                                              */
  #define GRCCONF_PORBORRESET_ENABLE_Enabled (0x1UL) /*!< Reset feature enabled                                                */


/* GRCCONF_A2A: Control for analog-to-asynchronous components */
  #define GRCCONF_A2A_ResetValue (0x00000001UL)      /*!< Reset value of A2A register.                                         */

/* WAIT2 @Bit 0 : (unspecified) */
  #define GRCCONF_A2A_WAIT2_Pos (0UL)                /*!< Position of WAIT2 field.                                             */
  #define GRCCONF_A2A_WAIT2_Msk (0x1UL << GRCCONF_A2A_WAIT2_Pos) /*!< Bit mask of WAIT2 field.                                 */
  #define GRCCONF_A2A_WAIT2_Min (0x0UL)              /*!< Min enumerator value of WAIT2 field.                                 */
  #define GRCCONF_A2A_WAIT2_Max (0x1UL)              /*!< Max enumerator value of WAIT2 field.                                 */
  #define GRCCONF_A2A_WAIT2_Enabled (0x0UL)          /*!< Wait2 elements are enabled.                                          */
  #define GRCCONF_A2A_WAIT2_Disabled (0x1UL)         /*!< Wait2 elements are disabled.                                         */

/* ACKHANDLER @Bit 1 : (unspecified) */
  #define GRCCONF_A2A_ACKHANDLER_Pos (1UL)           /*!< Position of ACKHANDLER field.                                        */
  #define GRCCONF_A2A_ACKHANDLER_Msk (0x1UL << GRCCONF_A2A_ACKHANDLER_Pos) /*!< Bit mask of ACKHANDLER field.                  */
  #define GRCCONF_A2A_ACKHANDLER_Min (0x0UL)         /*!< Min enumerator value of ACKHANDLER field.                            */
  #define GRCCONF_A2A_ACKHANDLER_Max (0x1UL)         /*!< Max enumerator value of ACKHANDLER field.                            */
  #define GRCCONF_A2A_ACKHANDLER_Disabled (0x0UL)    /*!< Asynchronous request acknowledge handler is disabled.                */
  #define GRCCONF_A2A_ACKHANDLER_Enabled (0x1UL)     /*!< Asynchronous request acknowledge handler is enabled.                 */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           GRTC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct GRTC_CC ====================================================== */
/**
  * @brief CC [GRTC_CC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CCL;                               /*!< (@ 0x00000000) The lower 32-bits of Capture/Compare register CC[n]   */
  __IOM uint32_t  CCH;                               /*!< (@ 0x00000004) The higher 32-bits of Capture/Compare register CC[n]  */
  __OM  uint32_t  CCADD;                             /*!< (@ 0x00000008) Count to add to CC[n] when this register is written.  */
  __IOM uint32_t  CCEN;                              /*!< (@ 0x0000000C) Configure Capture/Compare register CC[n]              */
} NRF_GRTC_CC_Type;                                  /*!< Size = 16 (0x010)                                                    */
  #define GRTC_CC_MaxCount (16UL)                    /*!< Size of CC[16] array.                                                */
  #define GRTC_CC_MaxIndex (15UL)                    /*!< Max index of CC[16] array.                                           */
  #define GRTC_CC_MinIndex (0UL)                     /*!< Min index of CC[16] array.                                           */

/* GRTC_CC_CCL: The lower 32-bits of Capture/Compare register CC[n] */
  #define GRTC_CC_CCL_ResetValue (0x00000000UL)      /*!< Reset value of CCL register.                                         */

/* CCL @Bits 0..31 : Capture/Compare low value in 1 us */
  #define GRTC_CC_CCL_CCL_Pos (0UL)                  /*!< Position of CCL field.                                               */
  #define GRTC_CC_CCL_CCL_Msk (0xFFFFFFFFUL << GRTC_CC_CCL_CCL_Pos) /*!< Bit mask of CCL field.                                */


/* GRTC_CC_CCH: The higher 32-bits of Capture/Compare register CC[n] */
  #define GRTC_CC_CCH_ResetValue (0x00000000UL)      /*!< Reset value of CCH register.                                         */

/* CCH @Bits 0..19 : Capture/Compare high value in 1 us */
  #define GRTC_CC_CCH_CCH_Pos (0UL)                  /*!< Position of CCH field.                                               */
  #define GRTC_CC_CCH_CCH_Msk (0xFFFFFUL << GRTC_CC_CCH_CCH_Pos) /*!< Bit mask of CCH field.                                   */


/* GRTC_CC_CCADD: Count to add to CC[n] when this register is written. */
  #define GRTC_CC_CCADD_ResetValue (0x00000000UL)    /*!< Reset value of CCADD register.                                       */

/* VALUE @Bits 0..30 : Count to add to CC[n] */
  #define GRTC_CC_CCADD_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define GRTC_CC_CCADD_VALUE_Msk (0x7FFFFFFFUL << GRTC_CC_CCADD_VALUE_Pos) /*!< Bit mask of VALUE field.                      */

/* REFERENCE @Bit 31 : Configure the Capture/Compare register */
  #define GRTC_CC_CCADD_REFERENCE_Pos (31UL)         /*!< Position of REFERENCE field.                                         */
  #define GRTC_CC_CCADD_REFERENCE_Msk (0x1UL << GRTC_CC_CCADD_REFERENCE_Pos) /*!< Bit mask of REFERENCE field.                 */
  #define GRTC_CC_CCADD_REFERENCE_Min (0x0UL)        /*!< Min enumerator value of REFERENCE field.                             */
  #define GRTC_CC_CCADD_REFERENCE_Max (0x1UL)        /*!< Max enumerator value of REFERENCE field.                             */
  #define GRTC_CC_CCADD_REFERENCE_SYSCOUNTER (0x0UL) /*!< Adds SYSCOUNTER value.                                               */
  #define GRTC_CC_CCADD_REFERENCE_CC (0x1UL)         /*!< Adds CC value.                                                       */


/* GRTC_CC_CCEN: Configure Capture/Compare register CC[n] */
  #define GRTC_CC_CCEN_ResetValue (0x00000000UL)     /*!< Reset value of CCEN register.                                        */

/* ACTIVE @Bit 0 : Configure the Capture/Compare register */
  #define GRTC_CC_CCEN_ACTIVE_Pos (0UL)              /*!< Position of ACTIVE field.                                            */
  #define GRTC_CC_CCEN_ACTIVE_Msk (0x1UL << GRTC_CC_CCEN_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.                            */
  #define GRTC_CC_CCEN_ACTIVE_Min (0x0UL)            /*!< Min enumerator value of ACTIVE field.                                */
  #define GRTC_CC_CCEN_ACTIVE_Max (0x1UL)            /*!< Max enumerator value of ACTIVE field.                                */
  #define GRTC_CC_CCEN_ACTIVE_Disable (0x0UL)        /*!< Capture/Compare register CC[n] Disabled.                             */
  #define GRTC_CC_CCEN_ACTIVE_Enable (0x1UL)         /*!< Capture/Compare register CC[n] enabled.                              */



