adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* COMPARE12 @Bit 12 : Write '1' to disable interrupt for event COMPARE[12] */
  #define GRTC_INTENCLR6_COMPARE12_Pos (12UL)        /*!< Position of COMPARE12 field.                                         */
  #define GRTC_INTENCLR6_COMPARE12_Msk (0x1UL << GRTC_INTENCLR6_COMPARE12_Pos) /*!< Bit mask of COMPARE12 field.               */
  #define GRTC_INTENCLR6_COMPARE12_Min (0x0UL)       /*!< Min enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENCLR6_COMPARE12_Max (0x1UL)       /*!< Max enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENCLR6_COMPARE12_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR6_COMPARE12_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR6_COMPARE12_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE13 @Bit 13 : Write '1' to disable interrupt for event COMPARE[13] */
  #define GRTC_INTENCLR6_COMPARE13_Pos (13UL)        /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTENCLR6_COMPARE13_Msk (0x1UL << GRTC_INTENCLR6_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.               */
  #define GRTC_INTENCLR6_COMPARE13_Min (0x0UL)       /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENCLR6_COMPARE13_Max (0x1UL)       /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENCLR6_COMPARE13_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR6_COMPARE13_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR6_COMPARE13_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE14 @Bit 14 : Write '1' to disable interrupt for event COMPARE[14] */
  #define GRTC_INTENCLR6_COMPARE14_Pos (14UL)        /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTENCLR6_COMPARE14_Msk (0x1UL << GRTC_INTENCLR6_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.               */
  #define GRTC_INTENCLR6_COMPARE14_Min (0x0UL)       /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENCLR6_COMPARE14_Max (0x1UL)       /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENCLR6_COMPARE14_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR6_COMPARE14_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR6_COMPARE14_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE15 @Bit 15 : Write '1' to disable interrupt for event COMPARE[15] */
  #define GRTC_INTENCLR6_COMPARE15_Pos (15UL)        /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTENCLR6_COMPARE15_Msk (0x1UL << GRTC_INTENCLR6_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.               */
  #define GRTC_INTENCLR6_COMPARE15_Min (0x0UL)       /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENCLR6_COMPARE15_Max (0x1UL)       /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENCLR6_COMPARE15_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR6_COMPARE15_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR6_COMPARE15_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RTCOMPARE @Bit 24 : Write '1' to disable interrupt for event RTCOMPARE */
  #define GRTC_INTENCLR6_RTCOMPARE_Pos (24UL)        /*!< Position of RTCOMPARE field.                                         */
  #define GRTC_INTENCLR6_RTCOMPARE_Msk (0x1UL << GRTC_INTENCLR6_RTCOMPARE_Pos) /*!< Bit mask of RTCOMPARE field.               */
  #define GRTC_INTENCLR6_RTCOMPARE_Min (0x0UL)       /*!< Min enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTENCLR6_RTCOMPARE_Max (0x1UL)       /*!< Max enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTENCLR6_RTCOMPARE_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR6_RTCOMPARE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR6_RTCOMPARE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RTCOMPARESYNC @Bit 25 : Write '1' to disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENCLR6_RTCOMPARESYNC_Pos (25UL)    /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTENCLR6_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENCLR6_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.   */
  #define GRTC_INTENCLR6_RTCOMPARESYNC_Min (0x0UL)   /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENCLR6_RTCOMPARESYNC_Max (0x1UL)   /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENCLR6_RTCOMPARESYNC_Clear (0x1UL) /*!< Disable                                                              */
  #define GRTC_INTENCLR6_RTCOMPARESYNC_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GRTC_INTENCLR6_RTCOMPARESYNC_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* SYSCOUNTERVALID @Bit 26 : Write '1' to disable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTENCLR6_SYSCOUNTERVALID_Pos (26UL)  /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTENCLR6_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTENCLR6_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_INTENCLR6_SYSCOUNTERVALID_Min (0x0UL) /*!< Min enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTENCLR6_SYSCOUNTERVALID_Max (0x1UL) /*!< Max enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTENCLR6_SYSCOUNTERVALID_Clear (0x1UL) /*!< Disable                                                            */
  #define GRTC_INTENCLR6_SYSCOUNTERVALID_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRTC_INTENCLR6_SYSCOUNTERVALID_Enabled (0x1UL) /*!< Read: Enabled                                                    */

