adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* COMPARE6 @Bit 6 : Read pending status of interrupt for event COMPARE[6] */
  #define GRTC_INTPEND6_COMPARE6_Pos (6UL)           /*!< Position of COMPARE6 field.                                          */
  #define GRTC_INTPEND6_COMPARE6_Msk (0x1UL << GRTC_INTPEND6_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                    */
  #define GRTC_INTPEND6_COMPARE6_Min (0x0UL)         /*!< Min enumerator value of COMPARE6 field.                              */
  #define GRTC_INTPEND6_COMPARE6_Max (0x1UL)         /*!< Max enumerator value of COMPARE6 field.                              */
  #define GRTC_INTPEND6_COMPARE6_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE6_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE7 @Bit 7 : Read pending status of interrupt for event COMPARE[7] */
  #define GRTC_INTPEND6_COMPARE7_Pos (7UL)           /*!< Position of COMPARE7 field.                                          */
  #define GRTC_INTPEND6_COMPARE7_Msk (0x1UL << GRTC_INTPEND6_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                    */
  #define GRTC_INTPEND6_COMPARE7_Min (0x0UL)         /*!< Min enumerator value of COMPARE7 field.                              */
  #define GRTC_INTPEND6_COMPARE7_Max (0x1UL)         /*!< Max enumerator value of COMPARE7 field.                              */
  #define GRTC_INTPEND6_COMPARE7_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE7_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE8 @Bit 8 : Read pending status of interrupt for event COMPARE[8] */
  #define GRTC_INTPEND6_COMPARE8_Pos (8UL)           /*!< Position of COMPARE8 field.                                          */
  #define GRTC_INTPEND6_COMPARE8_Msk (0x1UL << GRTC_INTPEND6_COMPARE8_Pos) /*!< Bit mask of COMPARE8 field.                    */
  #define GRTC_INTPEND6_COMPARE8_Min (0x0UL)         /*!< Min enumerator value of COMPARE8 field.                              */
  #define GRTC_INTPEND6_COMPARE8_Max (0x1UL)         /*!< Max enumerator value of COMPARE8 field.                              */
  #define GRTC_INTPEND6_COMPARE8_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE8_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE9 @Bit 9 : Read pending status of interrupt for event COMPARE[9] */
  #define GRTC_INTPEND6_COMPARE9_Pos (9UL)           /*!< Position of COMPARE9 field.                                          */
  #define GRTC_INTPEND6_COMPARE9_Msk (0x1UL << GRTC_INTPEND6_COMPARE9_Pos) /*!< Bit mask of COMPARE9 field.                    */
  #define GRTC_INTPEND6_COMPARE9_Min (0x0UL)         /*!< Min enumerator value of COMPARE9 field.                              */
  #define GRTC_INTPEND6_COMPARE9_Max (0x1UL)         /*!< Max enumerator value of COMPARE9 field.                              */
  #define GRTC_INTPEND6_COMPARE9_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE9_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE10 @Bit 10 : Read pending status of interrupt for event COMPARE[10] */
  #define GRTC_INTPEND6_COMPARE10_Pos (10UL)         /*!< Position of COMPARE10 field.                                         */
  #define GRTC_INTPEND6_COMPARE10_Msk (0x1UL << GRTC_INTPEND6_COMPARE10_Pos) /*!< Bit mask of COMPARE10 field.                 */
  #define GRTC_INTPEND6_COMPARE10_Min (0x0UL)        /*!< Min enumerator value of COMPARE10 field.                             */
  #define GRTC_INTPEND6_COMPARE10_Max (0x1UL)        /*!< Max enumerator value of COMPARE10 field.                             */
  #define GRTC_INTPEND6_COMPARE10_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE10_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE11 @Bit 11 : Read pending status of interrupt for event COMPARE[11] */
  #define GRTC_INTPEND6_COMPARE11_Pos (11UL)         /*!< Position of COMPARE11 field.                                         */
  #define GRTC_INTPEND6_COMPARE11_Msk (0x1UL << GRTC_INTPEND6_COMPARE11_Pos) /*!< Bit mask of COMPARE11 field.                 */
  #define GRTC_INTPEND6_COMPARE11_Min (0x0UL)        /*!< Min enumerator value of COMPARE11 field.                             */
  #define GRTC_INTPEND6_COMPARE11_Max (0x1UL)        /*!< Max enumerator value of COMPARE11 field.                             */
  #define GRTC_INTPEND6_COMPARE11_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE11_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE12 @Bit 12 : Read pending status of interrupt for event COMPARE[12] */
  #define GRTC_INTPEND6_COMPARE12_Pos (12UL)         /*!< Position of COMPARE12 field.                                         */
  #define GRTC_INTPEND6_COMPARE12_Msk (0x1UL << GRTC_INTPEND6_COMPARE12_Pos) /*!< Bit mask of COMPARE12 field.                 */
  #define GRTC_INTPEND6_COMPARE12_Min (0x0UL)        /*!< Min enumerator value of COMPARE12 field.                             */
  #define GRTC_INTPEND6_COMPARE12_Max (0x1UL)        /*!< Max enumerator value of COMPARE12 field.                             */
  #define GRTC_INTPEND6_COMPARE12_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE12_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE13 @Bit 13 : Read pending status of interrupt for event COMPARE[13] */
  #define GRTC_INTPEND6_COMPARE13_Pos (13UL)         /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTPEND6_COMPARE13_Msk (0x1UL << GRTC_INTPEND6_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.                 */
  #define GRTC_INTPEND6_COMPARE13_Min (0x0UL)        /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTPEND6_COMPARE13_Max (0x1UL)        /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTPEND6_COMPARE13_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE13_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE14 @Bit 14 : Read pending status of interrupt for event COMPARE[14] */
  #define GRTC_INTPEND6_COMPARE14_Pos (14UL)         /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTPEND6_COMPARE14_Msk (0x1UL << GRTC_INTPEND6_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.                 */
  #define GRTC_INTPEND6_COMPARE14_Min (0x0UL)        /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTPEND6_COMPARE14_Max (0x1UL)        /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTPEND6_COMPARE14_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE14_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE15 @Bit 15 : Read pending status of interrupt for event COMPARE[15] */
  #define GRTC_INTPEND6_COMPARE15_Pos (15UL)         /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTPEND6_COMPARE15_Msk (0x1UL << GRTC_INTPEND6_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.                 */
  #define GRTC_INTPEND6_COMPARE15_Min (0x0UL)        /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTPEND6_COMPARE15_Max (0x1UL)        /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTPEND6_COMPARE15_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_COMPARE15_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RTCOMPARE @Bit 24 : Read pending status of interrupt for event RTCOMPARE */
  #define GRTC_INTPEND6_RTCOMPARE_Pos (24UL)         /*!< Position of RTCOMPARE field.                                         */
  #define GRTC_INTPEND6_RTCOMPARE_Msk (0x1UL << GRTC_INTPEND6_RTCOMPARE_Pos) /*!< Bit mask of RTCOMPARE field.                 */
  #define GRTC_INTPEND6_RTCOMPARE_Min (0x0UL)        /*!< Min enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTPEND6_RTCOMPARE_Max (0x1UL)        /*!< Max enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTPEND6_RTCOMPARE_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND6_RTCOMPARE_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RTCOMPARESYNC @Bit 25 : Read pending status of interrupt for event RTCOMPARESYNC */
  #define GRTC_INTPEND6_RTCOMPARESYNC_Pos (25UL)     /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTPEND6_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTPEND6_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.     */
  #define GRTC_INTPEND6_RTCOMPARESYNC_Min (0x0UL)    /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTPEND6_RTCOMPARESYNC_Max (0x1UL)    /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTPEND6_RTCOMPARESYNC_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define GRTC_INTPEND6_RTCOMPARESYNC_Pending (0x1UL) /*!< Read: Pending                                                       */

/* SYSCOUNTERVALID @Bit 26 : Read pending status of interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTPEND6_SYSCOUNTERVALID_Pos (26UL)   /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTPEND6_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTPEND6_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_INTPEND6_SYSCOUNTERVALID_Min (0x0UL)  /*!< Min enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTPEND6_SYSCOUNTERVALID_Max (0x1UL)  /*!< Max enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTPEND6_SYSCOUNTERVALID_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRTC_INTPEND6_SYSCOUNTERVALID_Pending (0x1UL) /*!< Read: Pending                                                     */

/* PWMPERIODEND @Bit 27 : Read pending status of interrupt for event PWMPERIODEND */
  #define GRTC_INTPEND6_PWMPERIODEND_Pos (27UL)      /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTPEND6_PWMPERIODEND_Msk (0x1UL << GRTC_INTPEND6_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.        */
  #define GRTC_INTPEND6_PWMPERIODEND_Min (0x0UL)     /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTPEND6_PWMPERIODEND_Max (0x1UL)     /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTPEND6_PWMPERIODEND_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define GRTC_INTPEND6_PWMPERIODEND_Pending (0x1UL) /*!< Read: Pending                                                        */


/* GRTC_INTEN7: Enable or disable interrupt */
  #define GRTC_INTEN7_ResetValue (0x00000000UL)      /*!< Reset value of INTEN7 register.                                      */

/* COMPARE0 @Bit 0 : Enable or disable interrupt for event COMPARE[0] */
  #define GRTC_INTEN7_COMPARE0_Pos (0UL)             /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTEN7_COMPARE0_Msk (0x1UL << GRTC_INTEN7_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                        */
  #define GRTC_INTEN7_COMPARE0_Min (0x0UL)           /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN7_COMPARE0_Max (0x1UL)           /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN7_COMPARE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN7_COMPARE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE1 @Bit 1 : Enable or disable interrupt for event COMPARE[1] */
  #define GRTC_INTEN7_COMPARE1_Pos (1UL)             /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTEN7_COMPARE1_Msk (0x1UL << GRTC_INTEN7_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                        */
  #define GRTC_INTEN7_COMPARE1_Min (0x0UL)           /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN7_COMPARE1_Max (0x1UL)           /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN7_COMPARE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN7_COMPARE1_Enabled (0x1UL)       /*!< Enable                                                               */

