adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* COMPARE10 @Bit 10 : Write '1' to enable interrupt for event COMPARE[10] */
  #define GRTC_INTENSET8_COMPARE10_Pos (10UL)        /*!< Position of COMPARE10 field.                                         */
  #define GRTC_INTENSET8_COMPARE10_Msk (0x1UL << GRTC_INTENSET8_COMPARE10_Pos) /*!< Bit mask of COMPARE10 field.               */
  #define GRTC_INTENSET8_COMPARE10_Min (0x0UL)       /*!< Min enumerator value of COMPARE10 field.                             */
  #define GRTC_INTENSET8_COMPARE10_Max (0x1UL)       /*!< Max enumerator value of COMPARE10 field.                             */
  #define GRTC_INTENSET8_COMPARE10_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET8_COMPARE10_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET8_COMPARE10_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE11 @Bit 11 : Write '1' to enable interrupt for event COMPARE[11] */
  #define GRTC_INTENSET8_COMPARE11_Pos (11UL)        /*!< Position of COMPARE11 field.                                         */
  #define GRTC_INTENSET8_COMPARE11_Msk (0x1UL << GRTC_INTENSET8_COMPARE11_Pos) /*!< Bit mask of COMPARE11 field.               */
  #define GRTC_INTENSET8_COMPARE11_Min (0x0UL)       /*!< Min enumerator value of COMPARE11 field.                             */
  #define GRTC_INTENSET8_COMPARE11_Max (0x1UL)       /*!< Max enumerator value of COMPARE11 field.                             */
  #define GRTC_INTENSET8_COMPARE11_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET8_COMPARE11_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET8_COMPARE11_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE12 @Bit 12 : Write '1' to enable interrupt for event COMPARE[12] */
  #define GRTC_INTENSET8_COMPARE12_Pos (12UL)        /*!< Position of COMPARE12 field.                                         */
  #define GRTC_INTENSET8_COMPARE12_Msk (0x1UL << GRTC_INTENSET8_COMPARE12_Pos) /*!< Bit mask of COMPARE12 field.               */
  #define GRTC_INTENSET8_COMPARE12_Min (0x0UL)       /*!< Min enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENSET8_COMPARE12_Max (0x1UL)       /*!< Max enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENSET8_COMPARE12_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET8_COMPARE12_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET8_COMPARE12_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE13 @Bit 13 : Write '1' to enable interrupt for event COMPARE[13] */
  #define GRTC_INTENSET8_COMPARE13_Pos (13UL)        /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTENSET8_COMPARE13_Msk (0x1UL << GRTC_INTENSET8_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.               */
  #define GRTC_INTENSET8_COMPARE13_Min (0x0UL)       /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENSET8_COMPARE13_Max (0x1UL)       /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENSET8_COMPARE13_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET8_COMPARE13_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET8_COMPARE13_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE14 @Bit 14 : Write '1' to enable interrupt for event COMPARE[14] */
  #define GRTC_INTENSET8_COMPARE14_Pos (14UL)        /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTENSET8_COMPARE14_Msk (0x1UL << GRTC_INTENSET8_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.               */
  #define GRTC_INTENSET8_COMPARE14_Min (0x0UL)       /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENSET8_COMPARE14_Max (0x1UL)       /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENSET8_COMPARE14_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET8_COMPARE14_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET8_COMPARE14_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE15 @Bit 15 : Write '1' to enable interrupt for event COMPARE[15] */
  #define GRTC_INTENSET8_COMPARE15_Pos (15UL)        /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTENSET8_COMPARE15_Msk (0x1UL << GRTC_INTENSET8_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.               */
  #define GRTC_INTENSET8_COMPARE15_Min (0x0UL)       /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENSET8_COMPARE15_Max (0x1UL)       /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENSET8_COMPARE15_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET8_COMPARE15_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET8_COMPARE15_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RTCOMPARE @Bit 24 : Write '1' to enable interrupt for event RTCOMPARE */
  #define GRTC_INTENSET8_RTCOMPARE_Pos (24UL)        /*!< Position of RTCOMPARE field.                                         */
  #define GRTC_INTENSET8_RTCOMPARE_Msk (0x1UL << GRTC_INTENSET8_RTCOMPARE_Pos) /*!< Bit mask of RTCOMPARE field.               */
  #define GRTC_INTENSET8_RTCOMPARE_Min (0x0UL)       /*!< Min enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTENSET8_RTCOMPARE_Max (0x1UL)       /*!< Max enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTENSET8_RTCOMPARE_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET8_RTCOMPARE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET8_RTCOMPARE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RTCOMPARESYNC @Bit 25 : Write '1' to enable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENSET8_RTCOMPARESYNC_Pos (25UL)    /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTENSET8_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENSET8_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.   */
  #define GRTC_INTENSET8_RTCOMPARESYNC_Min (0x0UL)   /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENSET8_RTCOMPARESYNC_Max (0x1UL)   /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENSET8_RTCOMPARESYNC_Set (0x1UL)   /*!< Enable                                                               */
  #define GRTC_INTENSET8_RTCOMPARESYNC_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GRTC_INTENSET8_RTCOMPARESYNC_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* SYSCOUNTERVALID @Bit 26 : Write '1' to enable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTENSET8_SYSCOUNTERVALID_Pos (26UL)  /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTENSET8_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTENSET8_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_INTENSET8_SYSCOUNTERVALID_Min (0x0UL) /*!< Min enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTENSET8_SYSCOUNTERVALID_Max (0x1UL) /*!< Max enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTENSET8_SYSCOUNTERVALID_Set (0x1UL) /*!< Enable                                                               */
  #define GRTC_INTENSET8_SYSCOUNTERVALID_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRTC_INTENSET8_SYSCOUNTERVALID_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* PWMPERIODEND @Bit 27 : Write '1' to enable interrupt for event PWMPERIODEND */
  #define GRTC_INTENSET8_PWMPERIODEND_Pos (27UL)     /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTENSET8_PWMPERIODEND_Msk (0x1UL << GRTC_INTENSET8_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.      */
  #define GRTC_INTENSET8_PWMPERIODEND_Min (0x0UL)    /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENSET8_PWMPERIODEND_Max (0x1UL)    /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENSET8_PWMPERIODEND_Set (0x1UL)    /*!< Enable                                                               */
  #define GRTC_INTENSET8_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define GRTC_INTENSET8_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* GRTC_INTENCLR8: Disable interrupt */
  #define GRTC_INTENCLR8_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR8 register.                                   */

/* COMPARE0 @Bit 0 : Write '1' to disable interrupt for event COMPARE[0] */
  #define GRTC_INTENCLR8_COMPARE0_Pos (0UL)          /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTENCLR8_COMPARE0_Msk (0x1UL << GRTC_INTENCLR8_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                  */
  #define GRTC_INTENCLR8_COMPARE0_Min (0x0UL)        /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENCLR8_COMPARE0_Max (0x1UL)        /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENCLR8_COMPARE0_Clear (0x1UL)      /*!< Disable                                                              */
  #define GRTC_INTENCLR8_COMPARE0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR8_COMPARE0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE1 @Bit 1 : Write '1' to disable interrupt for event COMPARE[1] */
  #define GRTC_INTENCLR8_COMPARE1_Pos (1UL)          /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTENCLR8_COMPARE1_Msk (0x1UL << GRTC_INTENCLR8_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                  */
  #define GRTC_INTENCLR8_COMPARE1_Min (0x0UL)        /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENCLR8_COMPARE1_Max (0x1UL)        /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENCLR8_COMPARE1_Clear (0x1UL)      /*!< Disable                                                              */
  #define GRTC_INTENCLR8_COMPARE1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR8_COMPARE1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

