adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GRTC_EVTENSET: Enable event routing */
  #define GRTC_EVTENSET_ResetValue (0x00000000UL)    /*!< Reset value of EVTENSET register.                                    */

/* PWMPERIODEND @Bit 27 : Write '1' to enable event routing for event PWMPERIODEND */
  #define GRTC_EVTENSET_PWMPERIODEND_Pos (27UL)      /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_EVTENSET_PWMPERIODEND_Msk (0x1UL << GRTC_EVTENSET_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.        */
  #define GRTC_EVTENSET_PWMPERIODEND_Min (0x0UL)     /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENSET_PWMPERIODEND_Max (0x1UL)     /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENSET_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define GRTC_EVTENSET_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                        */
  #define GRTC_EVTENSET_PWMPERIODEND_Set (0x1UL)     /*!< Enable                                                               */


/* GRTC_EVTENCLR: Disable event routing */
  #define GRTC_EVTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of EVTENCLR register.                                    */

/* PWMPERIODEND @Bit 27 : Write '1' to disable event routing for event PWMPERIODEND */
  #define GRTC_EVTENCLR_PWMPERIODEND_Pos (27UL)      /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_EVTENCLR_PWMPERIODEND_Msk (0x1UL << GRTC_EVTENCLR_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.        */
  #define GRTC_EVTENCLR_PWMPERIODEND_Min (0x0UL)     /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENCLR_PWMPERIODEND_Max (0x1UL)     /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENCLR_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define GRTC_EVTENCLR_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                        */
  #define GRTC_EVTENCLR_PWMPERIODEND_Clear (0x1UL)   /*!< Disable                                                              */


/* GRTC_RTCOUNTERL: The lower 32-bits of the RTCOUNTER counter. */
  #define GRTC_RTCOUNTERL_ResetValue (0x00000000UL)  /*!< Reset value of RTCOUNTERL register.                                  */

/* VALUE @Bits 0..31 : The lower 32-bits of the current counter value. */
  #define GRTC_RTCOUNTERL_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define GRTC_RTCOUNTERL_VALUE_Msk (0xFFFFFFFFUL << GRTC_RTCOUNTERL_VALUE_Pos) /*!< Bit mask of VALUE field.                  */


/* GRTC_RTCOUNTERH: The most significant bits of the RTCOUNTER counter. */
  #define GRTC_RTCOUNTERH_ResetValue (0x00000000UL)  /*!< Reset value of RTCOUNTERH register.                                  */

/* VALUE @Bits 0..14 : The most significant bits of the last latched counter. */
  #define GRTC_RTCOUNTERH_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define GRTC_RTCOUNTERH_VALUE_Msk (0x7FFFUL << GRTC_RTCOUNTERH_VALUE_Pos) /*!< Bit mask of VALUE field.                      */


/* GRTC_MODE: Counter mode selection */
  #define GRTC_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* AUTOEN @Bit 0 : Automatic enable to keep the SYSCOUNTER active. */
  #define GRTC_MODE_AUTOEN_Pos (0UL)                 /*!< Position of AUTOEN field.                                            */
  #define GRTC_MODE_AUTOEN_Msk (0x1UL << GRTC_MODE_AUTOEN_Pos) /*!< Bit mask of AUTOEN field.                                  */
  #define GRTC_MODE_AUTOEN_Min (0x0UL)               /*!< Min enumerator value of AUTOEN field.                                */
  #define GRTC_MODE_AUTOEN_Max (0x1UL)               /*!< Max enumerator value of AUTOEN field.                                */
  #define GRTC_MODE_AUTOEN_Default (0x0UL)           /*!< Default configuration to keep the SYSCOUNTER active.                 */
  #define GRTC_MODE_AUTOEN_CpuActive (0x1UL)         /*!< In addition to the above mode, any local CPU that is not sleeping keep
                                                          the SYSCOUNTER active.*/

/* SYSCOUNTEREN @Bit 1 : Enable the SYSCOUNTER */
  #define GRTC_MODE_SYSCOUNTEREN_Pos (1UL)           /*!< Position of SYSCOUNTEREN field.                                      */
  #define GRTC_MODE_SYSCOUNTEREN_Msk (0x1UL << GRTC_MODE_SYSCOUNTEREN_Pos) /*!< Bit mask of SYSCOUNTEREN field.                */
  #define GRTC_MODE_SYSCOUNTEREN_Min (0x0UL)         /*!< Min enumerator value of SYSCOUNTEREN field.                          */
  #define GRTC_MODE_SYSCOUNTEREN_Max (0x1UL)         /*!< Max enumerator value of SYSCOUNTEREN field.                          */
  #define GRTC_MODE_SYSCOUNTEREN_Disabled (0x0UL)    /*!< SYSCOUNTER disabled                                                  */
  #define GRTC_MODE_SYSCOUNTEREN_Enabled (0x1UL)     /*!< SYSCOUNTER enabled                                                   */


/* GRTC_SYSCOUNTERL: The lower 32-bits of the SYSCOUNTER */
  #define GRTC_SYSCOUNTERL_ResetValue (0x00000000UL) /*!< Reset value of SYSCOUNTERL register.                                 */

/* VALUE @Bits 0..31 : The lower 32-bits of the SYSCOUNTER value. */
  #define GRTC_SYSCOUNTERL_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define GRTC_SYSCOUNTERL_VALUE_Msk (0xFFFFFFFFUL << GRTC_SYSCOUNTERL_VALUE_Pos) /*!< Bit mask of VALUE field.                */


/* GRTC_SYSCOUNTERH: The higher 20-bits of the SYSCOUNTER */
  #define GRTC_SYSCOUNTERH_ResetValue (0x40000000UL) /*!< Reset value of SYSCOUNTERH register.                                 */

