adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DOMAIN8 @Bit 8 : Request from the Domain [8] */
  #define GRTC_KEEPRUNNING_DOMAIN8_Pos (8UL)         /*!< Position of DOMAIN8 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN8_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN8_Pos) /*!< Bit mask of DOMAIN8 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN8_Min (0x0UL)       /*!< Min enumerator value of DOMAIN8 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN8_Max (0x1UL)       /*!< Max enumerator value of DOMAIN8 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN8_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN8_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN9 @Bit 9 : Request from the Domain [9] */
  #define GRTC_KEEPRUNNING_DOMAIN9_Pos (9UL)         /*!< Position of DOMAIN9 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN9_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN9_Pos) /*!< Bit mask of DOMAIN9 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN9_Min (0x0UL)       /*!< Min enumerator value of DOMAIN9 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN9_Max (0x1UL)       /*!< Max enumerator value of DOMAIN9 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN9_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN9_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN10 @Bit 10 : Request from the Domain [10] */
  #define GRTC_KEEPRUNNING_DOMAIN10_Pos (10UL)       /*!< Position of DOMAIN10 field.                                          */
  #define GRTC_KEEPRUNNING_DOMAIN10_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN10_Pos) /*!< Bit mask of DOMAIN10 field.              */
  #define GRTC_KEEPRUNNING_DOMAIN10_Min (0x0UL)      /*!< Min enumerator value of DOMAIN10 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN10_Max (0x1UL)      /*!< Max enumerator value of DOMAIN10 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN10_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_DOMAIN10_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN11 @Bit 11 : Request from the Domain [11] */
  #define GRTC_KEEPRUNNING_DOMAIN11_Pos (11UL)       /*!< Position of DOMAIN11 field.                                          */
  #define GRTC_KEEPRUNNING_DOMAIN11_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN11_Pos) /*!< Bit mask of DOMAIN11 field.              */
  #define GRTC_KEEPRUNNING_DOMAIN11_Min (0x0UL)      /*!< Min enumerator value of DOMAIN11 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN11_Max (0x1UL)      /*!< Max enumerator value of DOMAIN11 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN11_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_DOMAIN11_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN12 @Bit 12 : Request from the Domain [12] */
  #define GRTC_KEEPRUNNING_DOMAIN12_Pos (12UL)       /*!< Position of DOMAIN12 field.                                          */
  #define GRTC_KEEPRUNNING_DOMAIN12_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN12_Pos) /*!< Bit mask of DOMAIN12 field.              */
  #define GRTC_KEEPRUNNING_DOMAIN12_Min (0x0UL)      /*!< Min enumerator value of DOMAIN12 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN12_Max (0x1UL)      /*!< Max enumerator value of DOMAIN12 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN12_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_DOMAIN12_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN13 @Bit 13 : Request from the Domain [13] */
  #define GRTC_KEEPRUNNING_DOMAIN13_Pos (13UL)       /*!< Position of DOMAIN13 field.                                          */
  #define GRTC_KEEPRUNNING_DOMAIN13_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN13_Pos) /*!< Bit mask of DOMAIN13 field.              */
  #define GRTC_KEEPRUNNING_DOMAIN13_Min (0x0UL)      /*!< Min enumerator value of DOMAIN13 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN13_Max (0x1UL)      /*!< Max enumerator value of DOMAIN13 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN13_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_DOMAIN13_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN14 @Bit 14 : Request from the Domain [14] */
  #define GRTC_KEEPRUNNING_DOMAIN14_Pos (14UL)       /*!< Position of DOMAIN14 field.                                          */
  #define GRTC_KEEPRUNNING_DOMAIN14_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN14_Pos) /*!< Bit mask of DOMAIN14 field.              */
  #define GRTC_KEEPRUNNING_DOMAIN14_Min (0x0UL)      /*!< Min enumerator value of DOMAIN14 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN14_Max (0x1UL)      /*!< Max enumerator value of DOMAIN14 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN14_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_DOMAIN14_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN15 @Bit 15 : Request from the Domain [15] */
  #define GRTC_KEEPRUNNING_DOMAIN15_Pos (15UL)       /*!< Position of DOMAIN15 field.                                          */
  #define GRTC_KEEPRUNNING_DOMAIN15_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN15_Pos) /*!< Bit mask of DOMAIN15 field.              */
  #define GRTC_KEEPRUNNING_DOMAIN15_Min (0x0UL)      /*!< Min enumerator value of DOMAIN15 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN15_Max (0x1UL)      /*!< Max enumerator value of DOMAIN15 field.                              */
  #define GRTC_KEEPRUNNING_DOMAIN15_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_DOMAIN15_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST0 @Bit 0 : Request from index [0] */
  #define GRTC_KEEPRUNNING_REQUEST0_Pos (0UL)        /*!< Position of REQUEST0 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST0_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST0_Pos) /*!< Bit mask of REQUEST0 field.              */
  #define GRTC_KEEPRUNNING_REQUEST0_Min (0x0UL)      /*!< Min enumerator value of REQUEST0 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST0_Max (0x1UL)      /*!< Max enumerator value of REQUEST0 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST0_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST0_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

