adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUEST1 @Bit 1 : Request from index [1] */
  #define GRTC_KEEPRUNNING_REQUEST1_Pos (1UL)        /*!< Position of REQUEST1 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST1_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST1_Pos) /*!< Bit mask of REQUEST1 field.              */
  #define GRTC_KEEPRUNNING_REQUEST1_Min (0x0UL)      /*!< Min enumerator value of REQUEST1 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST1_Max (0x1UL)      /*!< Max enumerator value of REQUEST1 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST1_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST1_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST2 @Bit 2 : Request from index [2] */
  #define GRTC_KEEPRUNNING_REQUEST2_Pos (2UL)        /*!< Position of REQUEST2 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST2_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST2_Pos) /*!< Bit mask of REQUEST2 field.              */
  #define GRTC_KEEPRUNNING_REQUEST2_Min (0x0UL)      /*!< Min enumerator value of REQUEST2 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST2_Max (0x1UL)      /*!< Max enumerator value of REQUEST2 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST2_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST2_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST3 @Bit 3 : Request from index [3] */
  #define GRTC_KEEPRUNNING_REQUEST3_Pos (3UL)        /*!< Position of REQUEST3 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST3_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST3_Pos) /*!< Bit mask of REQUEST3 field.              */
  #define GRTC_KEEPRUNNING_REQUEST3_Min (0x0UL)      /*!< Min enumerator value of REQUEST3 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST3_Max (0x1UL)      /*!< Max enumerator value of REQUEST3 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST3_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST3_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST4 @Bit 4 : Request from index [4] */
  #define GRTC_KEEPRUNNING_REQUEST4_Pos (4UL)        /*!< Position of REQUEST4 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST4_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST4_Pos) /*!< Bit mask of REQUEST4 field.              */
  #define GRTC_KEEPRUNNING_REQUEST4_Min (0x0UL)      /*!< Min enumerator value of REQUEST4 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST4_Max (0x1UL)      /*!< Max enumerator value of REQUEST4 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST4_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST4_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST5 @Bit 5 : Request from index [5] */
  #define GRTC_KEEPRUNNING_REQUEST5_Pos (5UL)        /*!< Position of REQUEST5 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST5_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST5_Pos) /*!< Bit mask of REQUEST5 field.              */
  #define GRTC_KEEPRUNNING_REQUEST5_Min (0x0UL)      /*!< Min enumerator value of REQUEST5 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST5_Max (0x1UL)      /*!< Max enumerator value of REQUEST5 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST5_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST5_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST6 @Bit 6 : Request from index [6] */
  #define GRTC_KEEPRUNNING_REQUEST6_Pos (6UL)        /*!< Position of REQUEST6 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST6_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST6_Pos) /*!< Bit mask of REQUEST6 field.              */
  #define GRTC_KEEPRUNNING_REQUEST6_Min (0x0UL)      /*!< Min enumerator value of REQUEST6 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST6_Max (0x1UL)      /*!< Max enumerator value of REQUEST6 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST6_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST6_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST7 @Bit 7 : Request from index [7] */
  #define GRTC_KEEPRUNNING_REQUEST7_Pos (7UL)        /*!< Position of REQUEST7 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST7_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST7_Pos) /*!< Bit mask of REQUEST7 field.              */
  #define GRTC_KEEPRUNNING_REQUEST7_Min (0x0UL)      /*!< Min enumerator value of REQUEST7 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST7_Max (0x1UL)      /*!< Max enumerator value of REQUEST7 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST7_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST7_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST8 @Bit 8 : Request from index [8] */
  #define GRTC_KEEPRUNNING_REQUEST8_Pos (8UL)        /*!< Position of REQUEST8 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST8_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST8_Pos) /*!< Bit mask of REQUEST8 field.              */
  #define GRTC_KEEPRUNNING_REQUEST8_Min (0x0UL)      /*!< Min enumerator value of REQUEST8 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST8_Max (0x1UL)      /*!< Max enumerator value of REQUEST8 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST8_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST8_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST9 @Bit 9 : Request from index [9] */
  #define GRTC_KEEPRUNNING_REQUEST9_Pos (9UL)        /*!< Position of REQUEST9 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST9_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST9_Pos) /*!< Bit mask of REQUEST9 field.              */
  #define GRTC_KEEPRUNNING_REQUEST9_Min (0x0UL)      /*!< Min enumerator value of REQUEST9 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST9_Max (0x1UL)      /*!< Max enumerator value of REQUEST9 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST9_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST9_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST10 @Bit 10 : Request from index [10] */
  #define GRTC_KEEPRUNNING_REQUEST10_Pos (10UL)      /*!< Position of REQUEST10 field.                                         */
  #define GRTC_KEEPRUNNING_REQUEST10_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST10_Pos) /*!< Bit mask of REQUEST10 field.           */
  #define GRTC_KEEPRUNNING_REQUEST10_Min (0x0UL)     /*!< Min enumerator value of REQUEST10 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST10_Max (0x1UL)     /*!< Max enumerator value of REQUEST10 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST10_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                    */
  #define GRTC_KEEPRUNNING_REQUEST10_Active (0x1UL)  /*!< Keep SYSCOUNTER active                                               */

/* REQUEST11 @Bit 11 : Request from index [11] */
  #define GRTC_KEEPRUNNING_REQUEST11_Pos (11UL)      /*!< Position of REQUEST11 field.                                         */
  #define GRTC_KEEPRUNNING_REQUEST11_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST11_Pos) /*!< Bit mask of REQUEST11 field.           */
  #define GRTC_KEEPRUNNING_REQUEST11_Min (0x0UL)     /*!< Min enumerator value of REQUEST11 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST11_Max (0x1UL)     /*!< Max enumerator value of REQUEST11 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST11_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                    */
  #define GRTC_KEEPRUNNING_REQUEST11_Active (0x1UL)  /*!< Keep SYSCOUNTER active                                               */

/* REQUEST12 @Bit 12 : Request from index [12] */
  #define GRTC_KEEPRUNNING_REQUEST12_Pos (12UL)      /*!< Position of REQUEST12 field.                                         */
  #define GRTC_KEEPRUNNING_REQUEST12_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST12_Pos) /*!< Bit mask of REQUEST12 field.           */
  #define GRTC_KEEPRUNNING_REQUEST12_Min (0x0UL)     /*!< Min enumerator value of REQUEST12 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST12_Max (0x1UL)     /*!< Max enumerator value of REQUEST12 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST12_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                    */
  #define GRTC_KEEPRUNNING_REQUEST12_Active (0x1UL)  /*!< Keep SYSCOUNTER active                                               */

