adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CLKOUTFAST @Bit 1 : Enable fast clock output on pin */
  #define GRTC_CLKOUT_CLKOUTFAST_Pos (1UL)           /*!< Position of CLKOUTFAST field.                                        */
  #define GRTC_CLKOUT_CLKOUTFAST_Msk (0x1UL << GRTC_CLKOUT_CLKOUTFAST_Pos) /*!< Bit mask of CLKOUTFAST field.                  */
  #define GRTC_CLKOUT_CLKOUTFAST_Min (0x0UL)         /*!< Min enumerator value of CLKOUTFAST field.                            */
  #define GRTC_CLKOUT_CLKOUTFAST_Max (0x1UL)         /*!< Max enumerator value of CLKOUTFAST field.                            */
  #define GRTC_CLKOUT_CLKOUTFAST_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define GRTC_CLKOUT_CLKOUTFAST_Enabled (0x1UL)     /*!< Enabled                                                              */


/* GRTC_CLKCFG: Clock Configuration */
  #define GRTC_CLKCFG_ResetValue (0x00010001UL)      /*!< Reset value of CLKCFG register.                                      */

/* CLKFASTDIV @Bits 0..7 : Fast clock divisor value of clock output */
  #define GRTC_CLKCFG_CLKFASTDIV_Pos (0UL)           /*!< Position of CLKFASTDIV field.                                        */
  #define GRTC_CLKCFG_CLKFASTDIV_Msk (0xFFUL << GRTC_CLKCFG_CLKFASTDIV_Pos) /*!< Bit mask of CLKFASTDIV field.                 */
  #define GRTC_CLKCFG_CLKFASTDIV_Min (0x01UL)        /*!< Min value of CLKFASTDIV field.                                       */
  #define GRTC_CLKCFG_CLKFASTDIV_Max (0xFFUL)        /*!< Max size of CLKFASTDIV field.                                        */

/* CLKSEL @Bits 16..17 : GRTC LFCLK clock source selection */
  #define GRTC_CLKCFG_CLKSEL_Pos (16UL)              /*!< Position of CLKSEL field.                                            */
  #define GRTC_CLKCFG_CLKSEL_Msk (0x3UL << GRTC_CLKCFG_CLKSEL_Pos) /*!< Bit mask of CLKSEL field.                              */
  #define GRTC_CLKCFG_CLKSEL_Min (0x0UL)             /*!< Min enumerator value of CLKSEL field.                                */
  #define GRTC_CLKCFG_CLKSEL_Max (0x2UL)             /*!< Max enumerator value of CLKSEL field.                                */
  #define GRTC_CLKCFG_CLKSEL_LFXO (0x0UL)            /*!< GRTC LFCLK clock source is LFXO                                      */
  #define GRTC_CLKCFG_CLKSEL_SystemLFCLK (0x1UL)     /*!< GRTC LFCLK clock source is system LFCLK                              */
  #define GRTC_CLKCFG_CLKSEL_LFLPRC (0x2UL)          /*!< GRTC LFCLK clock source is LFLPRC                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           HFXO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct HFXO_CONFIG ==================================================== */
/**
  * @brief CONFIG [HFXO_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) HFXO static CFG configuration                         */
  __IM  uint32_t  RESERVED;
} NRF_HFXO_CONFIG_Type;                              /*!< Size = 8 (0x008)                                                     */

/* HFXO_CONFIG_CFGSTATIC: HFXO static CFG configuration */
  #define HFXO_CONFIG_CFGSTATIC_ResetValue (0x00000000UL) /*!< Reset value of CFGSTATIC register.                              */

/* CFGTRG @Bit 0 : Config bus for HFXO32M */
  #define HFXO_CONFIG_CFGSTATIC_CFGTRG_Pos (0UL)     /*!< Position of CFGTRG field.                                            */
  #define HFXO_CONFIG_CFGSTATIC_CFGTRG_Msk (0x1UL << HFXO_CONFIG_CFGSTATIC_CFGTRG_Pos) /*!< Bit mask of CFGTRG field.          */
  #define HFXO_CONFIG_CFGSTATIC_CFGTRG_Min (0x0UL)   /*!< Min enumerator value of CFGTRG field.                                */
  #define HFXO_CONFIG_CFGSTATIC_CFGTRG_Max (0x1UL)   /*!< Max enumerator value of CFGTRG field.                                */
  #define HFXO_CONFIG_CFGSTATIC_CFGTRG_Enabled (0x1UL) /*!< trigger one-pulse kick-start of XTAL                               */
  #define HFXO_CONFIG_CFGSTATIC_CFGTRG_Disabled (0x0UL) /*!< Normal Operation                                                  */

/* UNUSED @Bits 1..2 : Future use */
  #define HFXO_CONFIG_CFGSTATIC_UNUSED_Pos (1UL)     /*!< Position of UNUSED field.                                            */
  #define HFXO_CONFIG_CFGSTATIC_UNUSED_Msk (0x3UL << HFXO_CONFIG_CFGSTATIC_UNUSED_Pos) /*!< Bit mask of UNUSED field.          */



/* ==================================================== Struct HFXO_TRIM ===================================================== */
/**
  * @brief TRIM [HFXO_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  AREG;                              /*!< (@ 0x00000000) Trim for Pierce AREG mode                             */
  __IOM uint32_t  IBIAS;                             /*!< (@ 0x00000004) Internal bias generator trim                          */
  __IOM uint32_t  PIXO;                              /*!< (@ 0x00000008) PIXO high pulse supply trim                           */
  __IOM uint32_t  PDTHR;                             /*!< (@ 0x0000000C) Peak detector threshold trimming                      */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  VREF;                              /*!< (@ 0x00000018) Voltage reference trimming                            */
  __IOM uint32_t  MULT2;                             /*!< (@ 0x0000001C) Trimming the duty cycle of the frequency doubler      */
} NRF_HFXO_TRIM_Type;                                /*!< Size = 32 (0x020)                                                    */

/* HFXO_TRIM_AREG: Trim for Pierce AREG mode */
  #define HFXO_TRIM_AREG_ResetValue (0x00000000UL)   /*!< Reset value of AREG register.                                        */

/* VAL @Bits 0..4 : Trimming value for Pierce AREG mode */
  #define HFXO_TRIM_AREG_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define HFXO_TRIM_AREG_VAL_Msk (0x1FUL << HFXO_TRIM_AREG_VAL_Pos) /*!< Bit mask of VAL field.                                */


/* HFXO_TRIM_IBIAS: Internal bias generator trim */
  #define HFXO_TRIM_IBIAS_ResetValue (0x00000000UL)  /*!< Reset value of IBIAS register.                                       */

