adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 4 : Enable IDAC check */
  #define HFXO_IDAC_CHECKPERIOD_EN_Pos (4UL)         /*!< Position of EN field.                                                */
  #define HFXO_IDAC_CHECKPERIOD_EN_Msk (0x1UL << HFXO_IDAC_CHECKPERIOD_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO_IDAC_CHECKPERIOD_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO_IDAC_CHECKPERIOD_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO_IDAC_CHECKPERIOD_EN_Disable (0x0UL)   /*!< IDAC check disabled                                                  */
  #define HFXO_IDAC_CHECKPERIOD_EN_Enable (0x1UL)    /*!< IDAC check enabled                                                   */

/* ICMPDIS @Bit 5 : Disable ICMP alarm. */
  #define HFXO_IDAC_CHECKPERIOD_ICMPDIS_Pos (5UL)    /*!< Position of ICMPDIS field.                                           */
  #define HFXO_IDAC_CHECKPERIOD_ICMPDIS_Msk (0x1UL << HFXO_IDAC_CHECKPERIOD_ICMPDIS_Pos) /*!< Bit mask of ICMPDIS field.       */
  #define HFXO_IDAC_CHECKPERIOD_ICMPDIS_Min (0x0UL)  /*!< Min enumerator value of ICMPDIS field.                               */
  #define HFXO_IDAC_CHECKPERIOD_ICMPDIS_Max (0x1UL)  /*!< Max enumerator value of ICMPDIS field.                               */
  #define HFXO_IDAC_CHECKPERIOD_ICMPDIS_Enabled (0x0UL) /*!< ICMP alarm enabled                                                */
  #define HFXO_IDAC_CHECKPERIOD_ICMPDIS_Disabled (0x1UL) /*!< ICMP alarm disabled                                              */


/* HFXO_IDAC_SETTLETIME: Settling time for IDAC current changes */
  #define HFXO_IDAC_SETTLETIME_ResetValue (0x00000007UL) /*!< Reset value of SETTLETIME register.                              */

/* VAL @Bits 0..2 : Value */
  #define HFXO_IDAC_SETTLETIME_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HFXO_IDAC_SETTLETIME_VAL_Msk (0x7UL << HFXO_IDAC_SETTLETIME_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define HFXO_IDAC_SETTLETIME_VAL_Min (0x0UL)       /*!< Min enumerator value of VAL field.                                   */
  #define HFXO_IDAC_SETTLETIME_VAL_Max (0x7UL)       /*!< Max enumerator value of VAL field.                                   */
  #define HFXO_IDAC_SETTLETIME_VAL_val5us (0x0UL)    /*!< Settling time is 5us                                                 */
  #define HFXO_IDAC_SETTLETIME_VAL_val10us (0x1UL)   /*!< Settling time is 10us                                                */
  #define HFXO_IDAC_SETTLETIME_VAL_val25us (0x2UL)   /*!< Settling time is 25us                                                */
  #define HFXO_IDAC_SETTLETIME_VAL_val50us (0x3UL)   /*!< Settling time is 50us                                                */
  #define HFXO_IDAC_SETTLETIME_VAL_val100us (0x4UL)  /*!< Settling time is 100us                                               */
  #define HFXO_IDAC_SETTLETIME_VAL_val200us (0x5UL)  /*!< Settling time is 200us                                               */
  #define HFXO_IDAC_SETTLETIME_VAL_val400us (0x6UL)  /*!< Settling time is 400us                                               */
  #define HFXO_IDAC_SETTLETIME_VAL_val800us (0x7UL)  /*!< Settling time is 800us                                               */



/* ================================================== Struct HFXO_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [HFXO_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  AREG;                              /*!< (@ 0x00000008) Override the AREG signal to the analog module         */
  __IOM uint32_t  IBIAS;                             /*!< (@ 0x0000000C) Override the IBIAS signal to the analog module        */
  __IOM uint32_t  ICMP;                              /*!< (@ 0x00000010) Override the ICMP signal to the analog module         */
  __IOM uint32_t  IDACCURR;                          /*!< (@ 0x00000014) Override the IDAC_CURR signal to the analog module    */
  __IOM uint32_t  IDAC;                              /*!< (@ 0x00000018) Override the IDAC signal to the analog module         */
  __IOM uint32_t  OSCPIXO;                           /*!< (@ 0x0000001C) Override the OSC_PIXO signal to the analog module     */
  __IOM uint32_t  OUTBUFF;                           /*!< (@ 0x00000020) Override the OUT_BUFF signal to the analog module     */
  __IOM uint32_t  OUTSEL;                            /*!< (@ 0x00000024) Override the OUT_SEL signal to the analog module      */
  __IOM uint32_t  PIXOPWRUP;                         /*!< (@ 0x00000028) Override the PIXO_PWRUP signal to the analog module   */
  __IOM uint32_t  PIXOSTARTUP;                       /*!< (@ 0x0000002C) Override the PIXO_STARTUP signal to the analog module */
  __IOM uint32_t  PKDMUTE;                           /*!< (@ 0x00000030) Override the PKD_MUTE signal to the analog module     */
  __IOM uint32_t  PKD;                               /*!< (@ 0x00000034) Override the PKD signal to the analog module          */
  __IOM uint32_t  REG0V8;                            /*!< (@ 0x00000038) Override the REG0V8 signal to the analog module       */
  __IOM uint32_t  REG1V5;                            /*!< (@ 0x0000003C) Override the REG1V5 signal to the analog module       */
  __IOM uint32_t  STUPINJ;                           /*!< (@ 0x00000040) Override the STUP_INJ signal to the analog module     */
  __IOM uint32_t  STUP;                              /*!< (@ 0x00000044) Override the STUP signal to the analog module         */
  __IOM uint32_t  VREF;                              /*!< (@ 0x00000048) Override the VREF signal to the analog module         */
  __IOM uint32_t  S2S;                               /*!< (@ 0x0000004C) Override the S2S signal to the analog module          */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000050) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000054) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  ICMPOUT;                           /*!< (@ 0x00000058) Override the ICMP signal from the analog module       */
  __IOM uint32_t  PIXOACK;                           /*!< (@ 0x0000005C) Override the PIXO_ACK signal from the analog module   */
  __IOM uint32_t  PKDOUT;                            /*!< (@ 0x00000060) Override the PKD_OUT signal from the analog module    */
  __IOM uint32_t  CK16EN;                            /*!< (@ 0x00000064) Override the MMI's internal 16MHz injection clock
                                                                         enable.*/
} NRF_HFXO_OVERRIDE_Type;                            /*!< Size = 104 (0x068)                                                   */

/* HFXO_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define HFXO_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                    */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_PWRUP_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_PWRUP_VAL_Msk (0x1UL << HFXO_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_PWRUP_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_PWRUP_EN_Msk (0x1UL << HFXO_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                          */
  #define HFXO_OVERRIDE_PWRUP_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PWRUP_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PWRUP_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_PWRUP_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define HFXO_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_RETAIN_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_RETAIN_VAL_Msk (0x1UL << HFXO_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_RETAIN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_RETAIN_EN_Msk (0x1UL << HFXO_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HFXO_OVERRIDE_RETAIN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_RETAIN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_RETAIN_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_RETAIN_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


