adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HFXO_OVERRIDE_AREG: Override the AREG signal to the analog module */
  #define HFXO_OVERRIDE_AREG_ResetValue (0x00000000UL) /*!< Reset value of AREG register.                                      */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_AREG_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_AREG_VAL_Msk (0x1UL << HFXO_OVERRIDE_AREG_VAL_Pos) /*!< Bit mask of VAL field.                         */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_AREG_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_AREG_EN_Msk (0x1UL << HFXO_OVERRIDE_AREG_EN_Pos) /*!< Bit mask of EN field.                            */
  #define HFXO_OVERRIDE_AREG_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_AREG_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_AREG_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_AREG_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_IBIAS: Override the IBIAS signal to the analog module */
  #define HFXO_OVERRIDE_IBIAS_ResetValue (0x00000000UL) /*!< Reset value of IBIAS register.                                    */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_IBIAS_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_IBIAS_VAL_Msk (0x1UL << HFXO_OVERRIDE_IBIAS_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_IBIAS_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_IBIAS_EN_Msk (0x1UL << HFXO_OVERRIDE_IBIAS_EN_Pos) /*!< Bit mask of EN field.                          */
  #define HFXO_OVERRIDE_IBIAS_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_IBIAS_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_IBIAS_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_IBIAS_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_ICMP: Override the ICMP signal to the analog module */
  #define HFXO_OVERRIDE_ICMP_ResetValue (0x00000000UL) /*!< Reset value of ICMP register.                                      */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_ICMP_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_ICMP_VAL_Msk (0x1UL << HFXO_OVERRIDE_ICMP_VAL_Pos) /*!< Bit mask of VAL field.                         */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_ICMP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_ICMP_EN_Msk (0x1UL << HFXO_OVERRIDE_ICMP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define HFXO_OVERRIDE_ICMP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_ICMP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_ICMP_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_ICMP_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_IDACCURR: Override the IDAC_CURR signal to the analog module */
  #define HFXO_OVERRIDE_IDACCURR_ResetValue (0x00000000UL) /*!< Reset value of IDACCURR register.                              */

/* VAL @Bits 0..5 : Override value for the signal */
  #define HFXO_OVERRIDE_IDACCURR_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_IDACCURR_VAL_Msk (0x3FUL << HFXO_OVERRIDE_IDACCURR_VAL_Pos) /*!< Bit mask of VAL field.                */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_IDACCURR_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_IDACCURR_EN_Msk (0x1UL << HFXO_OVERRIDE_IDACCURR_EN_Pos) /*!< Bit mask of EN field.                    */
  #define HFXO_OVERRIDE_IDACCURR_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_IDACCURR_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_IDACCURR_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_IDACCURR_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_IDAC: Override the IDAC signal to the analog module */
  #define HFXO_OVERRIDE_IDAC_ResetValue (0x00000000UL) /*!< Reset value of IDAC register.                                      */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_IDAC_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_IDAC_VAL_Msk (0x1UL << HFXO_OVERRIDE_IDAC_VAL_Pos) /*!< Bit mask of VAL field.                         */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_IDAC_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_IDAC_EN_Msk (0x1UL << HFXO_OVERRIDE_IDAC_EN_Pos) /*!< Bit mask of EN field.                            */
  #define HFXO_OVERRIDE_IDAC_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_IDAC_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_IDAC_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_IDAC_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_OSCPIXO: Override the OSC_PIXO signal to the analog module */
  #define HFXO_OVERRIDE_OSCPIXO_ResetValue (0x00000000UL) /*!< Reset value of OSCPIXO register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_OSCPIXO_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_OSCPIXO_VAL_Msk (0x1UL << HFXO_OVERRIDE_OSCPIXO_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_OSCPIXO_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_OSCPIXO_EN_Msk (0x1UL << HFXO_OVERRIDE_OSCPIXO_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO_OVERRIDE_OSCPIXO_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_OSCPIXO_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_OSCPIXO_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_OSCPIXO_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


