adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HFXO_OVERRIDE_PKD: Override the PKD signal to the analog module */
  #define HFXO_OVERRIDE_PKD_ResetValue (0x00000000UL) /*!< Reset value of PKD register.                                        */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_PKD_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_PKD_VAL_Msk (0x1UL << HFXO_OVERRIDE_PKD_VAL_Pos) /*!< Bit mask of VAL field.                           */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_PKD_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_PKD_EN_Msk (0x1UL << HFXO_OVERRIDE_PKD_EN_Pos) /*!< Bit mask of EN field.                              */
  #define HFXO_OVERRIDE_PKD_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PKD_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PKD_EN_Disabled (0x0UL)      /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_PKD_EN_Enabled (0x1UL)       /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_REG0V8: Override the REG0V8 signal to the analog module */
  #define HFXO_OVERRIDE_REG0V8_ResetValue (0x00000000UL) /*!< Reset value of REG0V8 register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_REG0V8_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_REG0V8_VAL_Msk (0x1UL << HFXO_OVERRIDE_REG0V8_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_REG0V8_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_REG0V8_EN_Msk (0x1UL << HFXO_OVERRIDE_REG0V8_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HFXO_OVERRIDE_REG0V8_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_REG0V8_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_REG0V8_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_REG0V8_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_REG1V5: Override the REG1V5 signal to the analog module */
  #define HFXO_OVERRIDE_REG1V5_ResetValue (0x00000000UL) /*!< Reset value of REG1V5 register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_REG1V5_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_REG1V5_VAL_Msk (0x1UL << HFXO_OVERRIDE_REG1V5_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_REG1V5_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_REG1V5_EN_Msk (0x1UL << HFXO_OVERRIDE_REG1V5_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HFXO_OVERRIDE_REG1V5_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_REG1V5_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_REG1V5_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_REG1V5_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_STUPINJ: Override the STUP_INJ signal to the analog module */
  #define HFXO_OVERRIDE_STUPINJ_ResetValue (0x00000000UL) /*!< Reset value of STUPINJ register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_STUPINJ_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_STUPINJ_VAL_Msk (0x1UL << HFXO_OVERRIDE_STUPINJ_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_STUPINJ_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_STUPINJ_EN_Msk (0x1UL << HFXO_OVERRIDE_STUPINJ_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO_OVERRIDE_STUPINJ_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_STUPINJ_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_STUPINJ_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_STUPINJ_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_STUP: Override the STUP signal to the analog module */
  #define HFXO_OVERRIDE_STUP_ResetValue (0x00000000UL) /*!< Reset value of STUP register.                                      */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_STUP_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_STUP_VAL_Msk (0x1UL << HFXO_OVERRIDE_STUP_VAL_Pos) /*!< Bit mask of VAL field.                         */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_STUP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_STUP_EN_Msk (0x1UL << HFXO_OVERRIDE_STUP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define HFXO_OVERRIDE_STUP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_STUP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_STUP_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_STUP_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_VREF: Override the VREF signal to the analog module */
  #define HFXO_OVERRIDE_VREF_ResetValue (0x00000000UL) /*!< Reset value of VREF register.                                      */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_VREF_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_VREF_VAL_Msk (0x1UL << HFXO_OVERRIDE_VREF_VAL_Pos) /*!< Bit mask of VAL field.                         */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_VREF_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_VREF_EN_Msk (0x1UL << HFXO_OVERRIDE_VREF_EN_Pos) /*!< Bit mask of EN field.                            */
  #define HFXO_OVERRIDE_VREF_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_VREF_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_VREF_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_VREF_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_S2S: Override the S2S signal to the analog module */
  #define HFXO_OVERRIDE_S2S_ResetValue (0x00000000UL) /*!< Reset value of S2S register.                                        */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_S2S_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_S2S_VAL_Msk (0x1UL << HFXO_OVERRIDE_S2S_VAL_Pos) /*!< Bit mask of VAL field.                           */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_S2S_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_S2S_EN_Msk (0x1UL << HFXO_OVERRIDE_S2S_EN_Pos) /*!< Bit mask of EN field.                              */
  #define HFXO_OVERRIDE_S2S_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_S2S_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_S2S_EN_Disabled (0x0UL)      /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_S2S_EN_Enabled (0x1UL)       /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_READY: Override the READY signal from the analog module */
  #define HFXO_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                    */

/* VAL @Bit 0 : Current value of the signal */
  #define HFXO_OVERRIDE_READY_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_READY_VAL_Msk (0x1UL << HFXO_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_READY_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_READY_EN_Msk (0x1UL << HFXO_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                          */
  #define HFXO_OVERRIDE_READY_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_READY_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_READY_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_READY_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define HFXO_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                                */

/* VAL @Bit 0 : Current value of the signal */
  #define HFXO_OVERRIDE_SETTLED_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_SETTLED_VAL_Msk (0x1UL << HFXO_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_SETTLED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_SETTLED_EN_Msk (0x1UL << HFXO_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO_OVERRIDE_SETTLED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_SETTLED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_SETTLED_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_SETTLED_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_ICMPOUT: Override the ICMP signal from the analog module */
  #define HFXO_OVERRIDE_ICMPOUT_ResetValue (0x00000000UL) /*!< Reset value of ICMPOUT register.                                */

/* VAL @Bit 0 : Current value of the signal */
  #define HFXO_OVERRIDE_ICMPOUT_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_ICMPOUT_VAL_Msk (0x1UL << HFXO_OVERRIDE_ICMPOUT_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_ICMPOUT_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_ICMPOUT_EN_Msk (0x1UL << HFXO_OVERRIDE_ICMPOUT_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO_OVERRIDE_ICMPOUT_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_ICMPOUT_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_ICMPOUT_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_ICMPOUT_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_PIXOACK: Override the PIXO_ACK signal from the analog module */
  #define HFXO_OVERRIDE_PIXOACK_ResetValue (0x00000000UL) /*!< Reset value of PIXOACK register.                                */

/* VAL @Bits 0..1 : Current value of the signal */
  #define HFXO_OVERRIDE_PIXOACK_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_PIXOACK_VAL_Msk (0x3UL << HFXO_OVERRIDE_PIXOACK_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_PIXOACK_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_PIXOACK_EN_Msk (0x1UL << HFXO_OVERRIDE_PIXOACK_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO_OVERRIDE_PIXOACK_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PIXOACK_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PIXOACK_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_PIXOACK_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_PKDOUT: Override the PKD_OUT signal from the analog module */
  #define HFXO_OVERRIDE_PKDOUT_ResetValue (0x00000000UL) /*!< Reset value of PKDOUT register.                                  */

/* VAL @Bits 0..3 : Current value of the signal */
  #define HFXO_OVERRIDE_PKDOUT_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_PKDOUT_VAL_Msk (0xFUL << HFXO_OVERRIDE_PKDOUT_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_PKDOUT_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_PKDOUT_EN_Msk (0x1UL << HFXO_OVERRIDE_PKDOUT_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HFXO_OVERRIDE_PKDOUT_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PKDOUT_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PKDOUT_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_PKDOUT_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_CK16EN: Override the MMI's internal 16MHz injection clock enable. */
  #define HFXO_OVERRIDE_CK16EN_ResetValue (0x00000000UL) /*!< Reset value of CK16EN register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_CK16EN_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_CK16EN_VAL_Msk (0x1UL << HFXO_OVERRIDE_CK16EN_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_CK16EN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_CK16EN_EN_Msk (0x1UL << HFXO_OVERRIDE_CK16EN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HFXO_OVERRIDE_CK16EN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_CK16EN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_CK16EN_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_CK16EN_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */



/* ===================================================== Struct HFXO_DFT ===================================================== */
/**
  * @brief DFT [HFXO_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus configuration                        */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_HFXO_DFT_Type;                                 /*!< Size = 52 (0x034)                                                    */

/* HFXO_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define HFXO_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB0 */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_Msk (0x7UL << HFXO_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_Max (0x4UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_None (0x0UL)    /*!< None connected                                                       */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_VREGBIASVREF (0x1UL) /*!< VREG_BIAS_VREF                                                  */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_VDDSWREG1V5 (0x2UL) /*!< VDD_SW_REG_1V5                                                   */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_PKDVREF1 (0x3UL) /*!< PKD VREF1                                                           */
  #define HFXO_DFT_ATB0CONFIG_SELMUX_FORCEAREGVGN2 (0x4UL) /*!< FORCE AREG_VGN2                                                */

