adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define HFXO_DFT_ATB0CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define HFXO_DFT_ATB0CONFIG_EN_Msk (0x1UL << HFXO_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define HFXO_DFT_ATB0CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define HFXO_DFT_ATB0CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define HFXO_DFT_ATB0CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled(HiZ)                                     */
  #define HFXO_DFT_ATB0CONFIG_EN_Enabled (0x1UL)     /*!< Analog test bus is enabled                                           */


/* HFXO_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define HFXO_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB1 */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_Msk (0x7UL << HFXO_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_Max (0x7UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_None (0x0UL)    /*!< None connected                                                       */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_VREGBIASVREF (0x1UL) /*!< VREG_BIAS_VREF                                                  */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_PKDVCM (0x2UL)  /*!< PKD_VCM                                                              */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_PIXOHighSupply (0x3UL) /*!< PIXO HIGH SUPPLY                                              */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_IPIERCECPY (0x4UL) /*!< IPIERCE_CPY (TCFG to enable IDAC)                                 */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_PKDVREF4 (0x5UL) /*!< PKD VREF4                                                           */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_IBIASIBPP1U (0x6UL) /*!< IBIAS_IBPP1U                                                     */
  #define HFXO_DFT_ATB1CONFIG_SELMUX_PKDCLOADCAL (0x7UL) /*!< PKD_CLOAD_CAL                                                    */

/* EN @Bit 31 : Enable the analog test bus */
  #define HFXO_DFT_ATB1CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define HFXO_DFT_ATB1CONFIG_EN_Msk (0x1UL << HFXO_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define HFXO_DFT_ATB1CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define HFXO_DFT_ATB1CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define HFXO_DFT_ATB1CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled(HiZ)                                     */
  #define HFXO_DFT_ATB1CONFIG_EN_Enabled (0x1UL)     /*!< Analog test bus is enabled                                           */


/* HFXO_DFT_DTBCONFIG: Digital Test Bus configuration */
  #define HFXO_DFT_DTBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTBCONFIG register.                                 */

/* SELMUX @Bits 0..3 : Select multiplexer for DTB */
  #define HFXO_DFT_DTBCONFIG_SELMUX_Pos (0UL)        /*!< Position of SELMUX field.                                            */
  #define HFXO_DFT_DTBCONFIG_SELMUX_Msk (0xFUL << HFXO_DFT_DTBCONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.                */
  #define HFXO_DFT_DTBCONFIG_SELMUX_Min (0x0UL)      /*!< Min enumerator value of SELMUX field.                                */
  #define HFXO_DFT_DTBCONFIG_SELMUX_Max (0x4UL)      /*!< Max enumerator value of SELMUX field.                                */
  #define HFXO_DFT_DTBCONFIG_SELMUX_DTBSel0 (0x0UL)  /*!< DTB select 0                                                         */
  #define HFXO_DFT_DTBCONFIG_SELMUX_DTBSel1 (0x1UL)  /*!< DTB select 1                                                         */
  #define HFXO_DFT_DTBCONFIG_SELMUX_DTBSel2 (0x2UL)  /*!< DTB select 2                                                         */
  #define HFXO_DFT_DTBCONFIG_SELMUX_DTBSel3 (0x3UL)  /*!< DTB select 3                                                         */
  #define HFXO_DFT_DTBCONFIG_SELMUX_DTBSel4 (0x4UL)  /*!< DTB select 4                                                         */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define HFXO_DFT_DTBCONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                      */
  #define HFXO_DFT_DTBCONFIG_PWRUPDELTEST_Msk (0x1UL << HFXO_DFT_DTBCONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define HFXO_DFT_DTBCONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                         */
  #define HFXO_DFT_DTBCONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                         */
  #define HFXO_DFT_DTBCONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                           */
  #define HFXO_DFT_DTBCONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                             */

/* DTB0EN @Bit 28 : Enable digital test bus 0 */
  #define HFXO_DFT_DTBCONFIG_DTB0EN_Pos (28UL)       /*!< Position of DTB0EN field.                                            */
  #define HFXO_DFT_DTBCONFIG_DTB0EN_Msk (0x1UL << HFXO_DFT_DTBCONFIG_DTB0EN_Pos) /*!< Bit mask of DTB0EN field.                */
  #define HFXO_DFT_DTBCONFIG_DTB0EN_Min (0x0UL)      /*!< Min enumerator value of DTB0EN field.                                */
  #define HFXO_DFT_DTBCONFIG_DTB0EN_Max (0x1UL)      /*!< Max enumerator value of DTB0EN field.                                */
  #define HFXO_DFT_DTBCONFIG_DTB0EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define HFXO_DFT_DTBCONFIG_DTB0EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */

/* DTB1EN @Bit 29 : Enable digital test bus 1 */
  #define HFXO_DFT_DTBCONFIG_DTB1EN_Pos (29UL)       /*!< Position of DTB1EN field.                                            */
  #define HFXO_DFT_DTBCONFIG_DTB1EN_Msk (0x1UL << HFXO_DFT_DTBCONFIG_DTB1EN_Pos) /*!< Bit mask of DTB1EN field.                */
  #define HFXO_DFT_DTBCONFIG_DTB1EN_Min (0x0UL)      /*!< Min enumerator value of DTB1EN field.                                */
  #define HFXO_DFT_DTBCONFIG_DTB1EN_Max (0x1UL)      /*!< Max enumerator value of DTB1EN field.                                */
  #define HFXO_DFT_DTBCONFIG_DTB1EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define HFXO_DFT_DTBCONFIG_DTB1EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */

/* DTB2EN @Bit 30 : Enable digital test bus 2 */
  #define HFXO_DFT_DTBCONFIG_DTB2EN_Pos (30UL)       /*!< Position of DTB2EN field.                                            */
  #define HFXO_DFT_DTBCONFIG_DTB2EN_Msk (0x1UL << HFXO_DFT_DTBCONFIG_DTB2EN_Pos) /*!< Bit mask of DTB2EN field.                */
  #define HFXO_DFT_DTBCONFIG_DTB2EN_Min (0x0UL)      /*!< Min enumerator value of DTB2EN field.                                */
  #define HFXO_DFT_DTBCONFIG_DTB2EN_Max (0x1UL)      /*!< Max enumerator value of DTB2EN field.                                */
  #define HFXO_DFT_DTBCONFIG_DTB2EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define HFXO_DFT_DTBCONFIG_DTB2EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */

/* DTB3EN @Bit 31 : Enable digital test bus 3 */
  #define HFXO_DFT_DTBCONFIG_DTB3EN_Pos (31UL)       /*!< Position of DTB3EN field.                                            */
  #define HFXO_DFT_DTBCONFIG_DTB3EN_Msk (0x1UL << HFXO_DFT_DTBCONFIG_DTB3EN_Pos) /*!< Bit mask of DTB3EN field.                */
  #define HFXO_DFT_DTBCONFIG_DTB3EN_Min (0x0UL)      /*!< Min enumerator value of DTB3EN field.                                */
  #define HFXO_DFT_DTBCONFIG_DTB3EN_Max (0x1UL)      /*!< Max enumerator value of DTB3EN field.                                */
  #define HFXO_DFT_DTBCONFIG_DTB3EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define HFXO_DFT_DTBCONFIG_DTB3EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */


/* HFXO_DFT_TCFG: Test mode configuration */
  #define HFXO_DFT_TCFG_ResetValue (0x00000000UL)    /*!< Reset value of TCFG register.                                        */

/* CONFIG @Bits 0..2 : Configuration */
  #define HFXO_DFT_TCFG_CONFIG_Pos (0UL)             /*!< Position of CONFIG field.                                            */
  #define HFXO_DFT_TCFG_CONFIG_Msk (0x7UL << HFXO_DFT_TCFG_CONFIG_Pos) /*!< Bit mask of CONFIG field.                          */
  #define HFXO_DFT_TCFG_CONFIG_Min (0x0UL)           /*!< Min enumerator value of CONFIG field.                                */
  #define HFXO_DFT_TCFG_CONFIG_Max (0x7UL)           /*!< Max enumerator value of CONFIG field.                                */
  #define HFXO_DFT_TCFG_CONFIG_Default (0x0UL)       /*!< Normal operation                                                     */
  #define HFXO_DFT_TCFG_CONFIG_PKDThr50mv (0x1UL)    /*!< 50mV offset for PKD thresholds (not common mode)                     */
  #define HFXO_DFT_TCFG_CONFIG_BypassPierceInv (0x2UL) /*!< Bypass Pierce inverter for AREG calibration                        */
  #define HFXO_DFT_TCFG_CONFIG_PKDThr100mv (0x3UL)   /*!< 100mV offset for PKD thresholds (not common mode)                    */
  #define HFXO_DFT_TCFG_CONFIG_IDACATB (0x4UL)       /*!< Enable IDAC ATB pierce copy output                                   */
  #define HFXO_DFT_TCFG_CONFIG_PXDXC2 (0x5UL)        /*!< Connect PKD comparator to XC2, for CAPLOAD calibration               */
  #define HFXO_DFT_TCFG_CONFIG_Spare (0x6UL)         /*!< Spare                                                                */
  #define HFXO_DFT_TCFG_CONFIG_PXDXC2Capload (0x7UL) /*!< Connect PKD comparator to XC2, and enable CAPLOAD charge current. For
                                                          CAPLOAD calibration*/


/* ======================================================= Struct HFXO ======================================================= */
/**
  * @brief HFXO peripheral
  */
  typedef struct {                                   /*!< HFXO Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_MODECHANGED;               /*!< (@ 0x00000100) HFXO mode changed                                     */
    __IOM uint32_t EVENTS_ERRORPIERCE;               /*!< (@ 0x00000104) Error while starting the HFXO in PIERCE mode          */
    __IOM uint32_t EVENTS_ERRORRUNNING;              /*!< (@ 0x00000108) Error detected while HFXO was running                 */
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) HFXO status                                           */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_HFXO_CONFIG_Type CONFIG;               /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_HFXO_TRIM_Type TRIM;                   /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[8];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t CLOAD;                            /*!< (@ 0x00000484) Internal capacitive load                              */
    __IOM uint32_t AMPLITUDECTRL;                    /*!< (@ 0x00000488) Amplitude control                                     */
    __IOM uint32_t PWRUPCTRL;                        /*!< (@ 0x0000048C) Power up control                                      */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000490) HFXO mode                                             */
    __IOM uint32_t PDTHR;                            /*!< (@ 0x00000494) Peak detector threshold value                         */
    __IOM uint32_t STARTUPPULSES;                    /*!< (@ 0x00000498) Number of 16MHz clock pulses injected to go into Pierce
                                                                         mode during HFXO startup*/
    __IOM uint32_t POWERDOWNWAIT;                    /*!< (@ 0x0000049C) Enable a 250us wait period in shutdown to allow the
                                                                         crystal to settle down.*/
    __IOM NRF_HFXO_IDAC_Type IDAC;                   /*!< (@ 0x000004A0) (unspecified)                                         */
    __IM uint32_t RESERVED6[20];
    __IOM NRF_HFXO_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[38];
    __IOM NRF_HFXO_DFT_Type DFT;                     /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_HFXO_Type;                                   /*!< Size = 1588 (0x634)                                                  */

