adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HFXO_EVENTS_MODECHANGED: HFXO mode changed */
  #define HFXO_EVENTS_MODECHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MODECHANGED register.                   */

/* EVENTS_MODECHANGED @Bit 0 : HFXO mode changed */
  #define HFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Pos (0UL) /*!< Position of EVENTS_MODECHANGED field.                      */
  #define HFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Msk (0x1UL << HFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Pos) /*!< Bit mask
                                                                            of EVENTS_MODECHANGED field.*/
  #define HFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_MODECHANGED field.        */
  #define HFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_MODECHANGED field.        */
  #define HFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define HFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Generated (0x1UL) /*!< Event generated                                    */


/* HFXO_EVENTS_ERRORPIERCE: Error while starting the HFXO in PIERCE mode */
  #define HFXO_EVENTS_ERRORPIERCE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORPIERCE register.                   */

/* EVENTS_ERRORPIERCE @Bit 0 : Error while starting the HFXO in PIERCE mode */
  #define HFXO_EVENTS_ERRORPIERCE_EVENTS_ERRORPIERCE_Pos (0UL) /*!< Position of EVENTS_ERRORPIERCE field.                      */
  #define HFXO_EVENTS_ERRORPIERCE_EVENTS_ERRORPIERCE_Msk (0x1UL << HFXO_EVENTS_ERRORPIERCE_EVENTS_ERRORPIERCE_Pos) /*!< Bit mask
                                                                            of EVENTS_ERRORPIERCE field.*/
  #define HFXO_EVENTS_ERRORPIERCE_EVENTS_ERRORPIERCE_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORPIERCE field.        */
  #define HFXO_EVENTS_ERRORPIERCE_EVENTS_ERRORPIERCE_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORPIERCE field.        */
  #define HFXO_EVENTS_ERRORPIERCE_EVENTS_ERRORPIERCE_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define HFXO_EVENTS_ERRORPIERCE_EVENTS_ERRORPIERCE_Generated (0x1UL) /*!< Event generated                                    */


/* HFXO_EVENTS_ERRORRUNNING: Error detected while HFXO was running */
  #define HFXO_EVENTS_ERRORRUNNING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORRUNNING register.                 */

/* EVENTS_ERRORRUNNING @Bit 0 : Error detected while HFXO was running */
  #define HFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Pos (0UL) /*!< Position of EVENTS_ERRORRUNNING field.                   */
  #define HFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Msk (0x1UL << HFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Pos) /*!< Bit
                                                                            mask of EVENTS_ERRORRUNNING field.*/
  #define HFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORRUNNING field.     */
  #define HFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORRUNNING field.     */
  #define HFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define HFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Generated (0x1UL) /*!< Event generated                                  */


/* HFXO_INTEN: Enable or disable interrupt */
  #define HFXO_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* MODECHANGED @Bit 0 : Enable or disable interrupt for event MODECHANGED */
  #define HFXO_INTEN_MODECHANGED_Pos (0UL)           /*!< Position of MODECHANGED field.                                       */
  #define HFXO_INTEN_MODECHANGED_Msk (0x1UL << HFXO_INTEN_MODECHANGED_Pos) /*!< Bit mask of MODECHANGED field.                 */
  #define HFXO_INTEN_MODECHANGED_Min (0x0UL)         /*!< Min enumerator value of MODECHANGED field.                           */
  #define HFXO_INTEN_MODECHANGED_Max (0x1UL)         /*!< Max enumerator value of MODECHANGED field.                           */
  #define HFXO_INTEN_MODECHANGED_Disabled (0x0UL)    /*!< Disable                                                              */
  #define HFXO_INTEN_MODECHANGED_Enabled (0x1UL)     /*!< Enable                                                               */

/* ERRORPIERCE @Bit 1 : Enable or disable interrupt for event ERRORPIERCE */
  #define HFXO_INTEN_ERRORPIERCE_Pos (1UL)           /*!< Position of ERRORPIERCE field.                                       */
  #define HFXO_INTEN_ERRORPIERCE_Msk (0x1UL << HFXO_INTEN_ERRORPIERCE_Pos) /*!< Bit mask of ERRORPIERCE field.                 */
  #define HFXO_INTEN_ERRORPIERCE_Min (0x0UL)         /*!< Min enumerator value of ERRORPIERCE field.                           */
  #define HFXO_INTEN_ERRORPIERCE_Max (0x1UL)         /*!< Max enumerator value of ERRORPIERCE field.                           */
  #define HFXO_INTEN_ERRORPIERCE_Disabled (0x0UL)    /*!< Disable                                                              */
  #define HFXO_INTEN_ERRORPIERCE_Enabled (0x1UL)     /*!< Enable                                                               */

/* ERRORRUNNING @Bit 2 : Enable or disable interrupt for event ERRORRUNNING */
  #define HFXO_INTEN_ERRORRUNNING_Pos (2UL)          /*!< Position of ERRORRUNNING field.                                      */
  #define HFXO_INTEN_ERRORRUNNING_Msk (0x1UL << HFXO_INTEN_ERRORRUNNING_Pos) /*!< Bit mask of ERRORRUNNING field.              */
  #define HFXO_INTEN_ERRORRUNNING_Min (0x0UL)        /*!< Min enumerator value of ERRORRUNNING field.                          */
  #define HFXO_INTEN_ERRORRUNNING_Max (0x1UL)        /*!< Max enumerator value of ERRORRUNNING field.                          */
  #define HFXO_INTEN_ERRORRUNNING_Disabled (0x0UL)   /*!< Disable                                                              */
  #define HFXO_INTEN_ERRORRUNNING_Enabled (0x1UL)    /*!< Enable                                                               */


/* HFXO_INTENSET: Enable interrupt */
  #define HFXO_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* MODECHANGED @Bit 0 : Write '1' to enable interrupt for event MODECHANGED */
  #define HFXO_INTENSET_MODECHANGED_Pos (0UL)        /*!< Position of MODECHANGED field.                                       */
  #define HFXO_INTENSET_MODECHANGED_Msk (0x1UL << HFXO_INTENSET_MODECHANGED_Pos) /*!< Bit mask of MODECHANGED field.           */
  #define HFXO_INTENSET_MODECHANGED_Min (0x0UL)      /*!< Min enumerator value of MODECHANGED field.                           */
  #define HFXO_INTENSET_MODECHANGED_Max (0x1UL)      /*!< Max enumerator value of MODECHANGED field.                           */
  #define HFXO_INTENSET_MODECHANGED_Set (0x1UL)      /*!< Enable                                                               */
  #define HFXO_INTENSET_MODECHANGED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define HFXO_INTENSET_MODECHANGED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ERRORPIERCE @Bit 1 : Write '1' to enable interrupt for event ERRORPIERCE */
  #define HFXO_INTENSET_ERRORPIERCE_Pos (1UL)        /*!< Position of ERRORPIERCE field.                                       */
  #define HFXO_INTENSET_ERRORPIERCE_Msk (0x1UL << HFXO_INTENSET_ERRORPIERCE_Pos) /*!< Bit mask of ERRORPIERCE field.           */
  #define HFXO_INTENSET_ERRORPIERCE_Min (0x0UL)      /*!< Min enumerator value of ERRORPIERCE field.                           */
  #define HFXO_INTENSET_ERRORPIERCE_Max (0x1UL)      /*!< Max enumerator value of ERRORPIERCE field.                           */
  #define HFXO_INTENSET_ERRORPIERCE_Set (0x1UL)      /*!< Enable                                                               */
  #define HFXO_INTENSET_ERRORPIERCE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define HFXO_INTENSET_ERRORPIERCE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ERRORRUNNING @Bit 2 : Write '1' to enable interrupt for event ERRORRUNNING */
  #define HFXO_INTENSET_ERRORRUNNING_Pos (2UL)       /*!< Position of ERRORRUNNING field.                                      */
  #define HFXO_INTENSET_ERRORRUNNING_Msk (0x1UL << HFXO_INTENSET_ERRORRUNNING_Pos) /*!< Bit mask of ERRORRUNNING field.        */
  #define HFXO_INTENSET_ERRORRUNNING_Min (0x0UL)     /*!< Min enumerator value of ERRORRUNNING field.                          */
  #define HFXO_INTENSET_ERRORRUNNING_Max (0x1UL)     /*!< Max enumerator value of ERRORRUNNING field.                          */
  #define HFXO_INTENSET_ERRORRUNNING_Set (0x1UL)     /*!< Enable                                                               */
  #define HFXO_INTENSET_ERRORRUNNING_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define HFXO_INTENSET_ERRORRUNNING_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* HFXO_INTENCLR: Disable interrupt */
  #define HFXO_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* MODECHANGED @Bit 0 : Write '1' to disable interrupt for event MODECHANGED */
  #define HFXO_INTENCLR_MODECHANGED_Pos (0UL)        /*!< Position of MODECHANGED field.                                       */
  #define HFXO_INTENCLR_MODECHANGED_Msk (0x1UL << HFXO_INTENCLR_MODECHANGED_Pos) /*!< Bit mask of MODECHANGED field.           */
  #define HFXO_INTENCLR_MODECHANGED_Min (0x0UL)      /*!< Min enumerator value of MODECHANGED field.                           */
  #define HFXO_INTENCLR_MODECHANGED_Max (0x1UL)      /*!< Max enumerator value of MODECHANGED field.                           */
  #define HFXO_INTENCLR_MODECHANGED_Clear (0x1UL)    /*!< Disable                                                              */
  #define HFXO_INTENCLR_MODECHANGED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define HFXO_INTENCLR_MODECHANGED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ERRORPIERCE @Bit 1 : Write '1' to disable interrupt for event ERRORPIERCE */
  #define HFXO_INTENCLR_ERRORPIERCE_Pos (1UL)        /*!< Position of ERRORPIERCE field.                                       */
  #define HFXO_INTENCLR_ERRORPIERCE_Msk (0x1UL << HFXO_INTENCLR_ERRORPIERCE_Pos) /*!< Bit mask of ERRORPIERCE field.           */
  #define HFXO_INTENCLR_ERRORPIERCE_Min (0x0UL)      /*!< Min enumerator value of ERRORPIERCE field.                           */
  #define HFXO_INTENCLR_ERRORPIERCE_Max (0x1UL)      /*!< Max enumerator value of ERRORPIERCE field.                           */
  #define HFXO_INTENCLR_ERRORPIERCE_Clear (0x1UL)    /*!< Disable                                                              */
  #define HFXO_INTENCLR_ERRORPIERCE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define HFXO_INTENCLR_ERRORPIERCE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ERRORRUNNING @Bit 2 : Write '1' to disable interrupt for event ERRORRUNNING */
  #define HFXO_INTENCLR_ERRORRUNNING_Pos (2UL)       /*!< Position of ERRORRUNNING field.                                      */
  #define HFXO_INTENCLR_ERRORRUNNING_Msk (0x1UL << HFXO_INTENCLR_ERRORRUNNING_Pos) /*!< Bit mask of ERRORRUNNING field.        */
  #define HFXO_INTENCLR_ERRORRUNNING_Min (0x0UL)     /*!< Min enumerator value of ERRORRUNNING field.                          */
  #define HFXO_INTENCLR_ERRORRUNNING_Max (0x1UL)     /*!< Max enumerator value of ERRORRUNNING field.                          */
  #define HFXO_INTENCLR_ERRORRUNNING_Clear (0x1UL)   /*!< Disable                                                              */
  #define HFXO_INTENCLR_ERRORRUNNING_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define HFXO_INTENCLR_ERRORRUNNING_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* HFXO_INTPEND: Pending interrupts */
  #define HFXO_INTPEND_ResetValue (0x00000000UL)     /*!< Reset value of INTPEND register.                                     */

