adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HFXO_CLOAD: Internal capacitive load */
  #define HFXO_CLOAD_ResetValue (0x00000000UL)       /*!< Reset value of CLOAD register.                                       */

/* VAL0 @Bits 0..5 : Capacitive load value 0 */
  #define HFXO_CLOAD_VAL0_Pos (0UL)                  /*!< Position of VAL0 field.                                              */
  #define HFXO_CLOAD_VAL0_Msk (0x3FUL << HFXO_CLOAD_VAL0_Pos) /*!< Bit mask of VAL0 field.                                     */

/* VAL1 @Bit 6 : Capacitive load value 1 */
  #define HFXO_CLOAD_VAL1_Pos (6UL)                  /*!< Position of VAL1 field.                                              */
  #define HFXO_CLOAD_VAL1_Msk (0x1UL << HFXO_CLOAD_VAL1_Pos) /*!< Bit mask of VAL1 field.                                      */


/* HFXO_AMPLITUDECTRL: Amplitude control */
  #define HFXO_AMPLITUDECTRL_ResetValue (0x00000000UL) /*!< Reset value of AMPLITUDECTRL register.                             */

/* VOLT @Bits 0..2 : Voltage amplitude setting for Pierce AREG mode */
  #define HFXO_AMPLITUDECTRL_VOLT_Pos (0UL)          /*!< Position of VOLT field.                                              */
  #define HFXO_AMPLITUDECTRL_VOLT_Msk (0x7UL << HFXO_AMPLITUDECTRL_VOLT_Pos) /*!< Bit mask of VOLT field.                      */


/* HFXO_PWRUPCTRL: Power up control */
  #define HFXO_PWRUPCTRL_ResetValue (0x00000000UL)   /*!< Reset value of PWRUPCTRL register.                                   */

/* CTRL @Bits 0..1 : Power up control */
  #define HFXO_PWRUPCTRL_CTRL_Pos (0UL)              /*!< Position of CTRL field.                                              */
  #define HFXO_PWRUPCTRL_CTRL_Msk (0x3UL << HFXO_PWRUPCTRL_CTRL_Pos) /*!< Bit mask of CTRL field.                              */
  #define HFXO_PWRUPCTRL_CTRL_Min (0x0UL)            /*!< Min enumerator value of CTRL field.                                  */
  #define HFXO_PWRUPCTRL_CTRL_Max (0x2UL)            /*!< Max enumerator value of CTRL field.                                  */
  #define HFXO_PWRUPCTRL_CTRL_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define HFXO_PWRUPCTRL_CTRL_PowerUp (0x1UL)        /*!< Power up                                                             */
  #define HFXO_PWRUPCTRL_CTRL_PowerDown (0x2UL)      /*!< Power down                                                           */

/* BYPASSREG0V8 @Bit 4 : Bypass 0.8V voltage regulator */
  #define HFXO_PWRUPCTRL_BYPASSREG0V8_Pos (4UL)      /*!< Position of BYPASSREG0V8 field.                                      */
  #define HFXO_PWRUPCTRL_BYPASSREG0V8_Msk (0x1UL << HFXO_PWRUPCTRL_BYPASSREG0V8_Pos) /*!< Bit mask of BYPASSREG0V8 field.      */
  #define HFXO_PWRUPCTRL_BYPASSREG0V8_Min (0x0UL)    /*!< Min enumerator value of BYPASSREG0V8 field.                          */
  #define HFXO_PWRUPCTRL_BYPASSREG0V8_Max (0x1UL)    /*!< Max enumerator value of BYPASSREG0V8 field.                          */
  #define HFXO_PWRUPCTRL_BYPASSREG0V8_Disable (0x0UL) /*!< Bypass 0.8V voltage regulator disabled                              */
  #define HFXO_PWRUPCTRL_BYPASSREG0V8_Enable (0x1UL) /*!< Bypass 0.8V voltage regulator enabled                                */

/* BYPASSREG1V5 @Bit 5 : Bypass 1.5V voltage regulator */
  #define HFXO_PWRUPCTRL_BYPASSREG1V5_Pos (5UL)      /*!< Position of BYPASSREG1V5 field.                                      */
  #define HFXO_PWRUPCTRL_BYPASSREG1V5_Msk (0x1UL << HFXO_PWRUPCTRL_BYPASSREG1V5_Pos) /*!< Bit mask of BYPASSREG1V5 field.      */
  #define HFXO_PWRUPCTRL_BYPASSREG1V5_Min (0x0UL)    /*!< Min enumerator value of BYPASSREG1V5 field.                          */
  #define HFXO_PWRUPCTRL_BYPASSREG1V5_Max (0x1UL)    /*!< Max enumerator value of BYPASSREG1V5 field.                          */
  #define HFXO_PWRUPCTRL_BYPASSREG1V5_Disable (0x0UL) /*!< Bypass 1.5V voltage regulator disabled                              */
  #define HFXO_PWRUPCTRL_BYPASSREG1V5_Enable (0x1UL) /*!< Bypass 1.5V voltage regulator enabled                                */


/* HFXO_MODE: HFXO mode */
  #define HFXO_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..2 : Mode */
  #define HFXO_MODE_MODE_Pos (0UL)                   /*!< Position of MODE field.                                              */
  #define HFXO_MODE_MODE_Msk (0x7UL << HFXO_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                        */
  #define HFXO_MODE_MODE_Min (0x0UL)                 /*!< Min enumerator value of MODE field.                                  */
  #define HFXO_MODE_MODE_Max (0x4UL)                 /*!< Max enumerator value of MODE field.                                  */
  #define HFXO_MODE_MODE_Auto (0x0UL)                /*!< Automatically handled by the peripheral                              */
  #define HFXO_MODE_MODE_Pierce (0x1UL)              /*!< Pierce mode                                                          */
  #define HFXO_MODE_MODE_Pixo (0x2UL)                /*!< PIXO mode                                                            */
  #define HFXO_MODE_MODE_ExternalSine (0x3UL)        /*!< External sine wave clock                                             */
  #define HFXO_MODE_MODE_ExternalSquare (0x4UL)      /*!< External square wave clock                                           */


/* HFXO_PDTHR: Peak detector threshold value */
  #define HFXO_PDTHR_ResetValue (0x00000003UL)       /*!< Reset value of PDTHR register.                                       */

/* VAL @Bits 0..3 : Value */
  #define HFXO_PDTHR_VAL_Pos (0UL)                   /*!< Position of VAL field.                                               */
  #define HFXO_PDTHR_VAL_Msk (0xFUL << HFXO_PDTHR_VAL_Pos) /*!< Bit mask of VAL field.                                         */
  #define HFXO_PDTHR_VAL_Min (0x0UL)                 /*!< Min value of VAL field.                                              */
  #define HFXO_PDTHR_VAL_Max (0xFUL)                 /*!< Max size of VAL field.                                               */


/* HFXO_STARTUPPULSES: Number of 16MHz clock pulses injected to go into Pierce mode during HFXO startup */
  #define HFXO_STARTUPPULSES_ResetValue (0x00000009UL) /*!< Reset value of STARTUPPULSES register.                             */

/* VAL @Bits 0..8 : Value */
  #define HFXO_STARTUPPULSES_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define HFXO_STARTUPPULSES_VAL_Msk (0x1FFUL << HFXO_STARTUPPULSES_VAL_Pos) /*!< Bit mask of VAL field.                       */
  #define HFXO_STARTUPPULSES_VAL_Min (0x000UL)       /*!< Min value of VAL field.                                              */
  #define HFXO_STARTUPPULSES_VAL_Max (0x1FFUL)       /*!< Max size of VAL field.                                               */


/* HFXO_POWERDOWNWAIT: Enable a 250us wait period in shutdown to allow the crystal to settle down. */
  #define HFXO_POWERDOWNWAIT_ResetValue (0x00000000UL) /*!< Reset value of POWERDOWNWAIT register.                             */

/* EN @Bit 0 : Enable */
  #define HFXO_POWERDOWNWAIT_EN_Pos (0UL)            /*!< Position of EN field.                                                */
  #define HFXO_POWERDOWNWAIT_EN_Msk (0x1UL << HFXO_POWERDOWNWAIT_EN_Pos) /*!< Bit mask of EN field.                            */
  #define HFXO_POWERDOWNWAIT_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define HFXO_POWERDOWNWAIT_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define HFXO_POWERDOWNWAIT_EN_Disabled (0x0UL)     /*!< Power down delay disabled                                            */
  #define HFXO_POWERDOWNWAIT_EN_Enabled (0x1UL)      /*!< Power down delay enabled                                             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           HSFLL                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct HSFLL_CONFIG =================================================== */
/**
  * @brief CONFIG [HSFLL_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) HSFLL configuration                                   */
} NRF_HSFLL_CONFIG_Type;                             /*!< Size = 4 (0x004)                                                     */

/* HSFLL_CONFIG_CFG: HSFLL configuration */
  #define HSFLL_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                         */

/* CFG @Bits 0..3 : Signal CFG[3:0] of analog module */
  #define HSFLL_CONFIG_CFG_CFG_Pos (0UL)             /*!< Position of CFG field.                                               */
  #define HSFLL_CONFIG_CFG_CFG_Msk (0xFUL << HSFLL_CONFIG_CFG_CFG_Pos) /*!< Bit mask of CFG field.                             */



/* =================================================== Struct HSFLL_FREQM ==================================================== */
/**
  * @brief FREQM [HSFLL_FREQM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  DONE;                              /*!< (@ 0x00000000) Frequency measurement done status                     */
  __IM  uint32_t  ERROR;                             /*!< (@ 0x00000004) Frequency measurement error status                    */
  __IM  uint32_t  MEAS;                              /*!< (@ 0x00000008) Frequency measurement                                 */
} NRF_HSFLL_FREQM_Type;                              /*!< Size = 12 (0x00C)                                                    */

/* HSFLL_FREQM_DONE: Frequency measurement done status */
  #define HSFLL_FREQM_DONE_ResetValue (0x00000000UL) /*!< Reset value of DONE register.                                        */

/* DONE @Bit 0 : Measurement done. */
  #define HSFLL_FREQM_DONE_DONE_Pos (0UL)            /*!< Position of DONE field.                                              */
  #define HSFLL_FREQM_DONE_DONE_Msk (0x1UL << HSFLL_FREQM_DONE_DONE_Pos) /*!< Bit mask of DONE field.                          */
  #define HSFLL_FREQM_DONE_DONE_Min (0x0UL)          /*!< Min enumerator value of DONE field.                                  */
  #define HSFLL_FREQM_DONE_DONE_Max (0x1UL)          /*!< Max enumerator value of DONE field.                                  */
  #define HSFLL_FREQM_DONE_DONE_InProgress (0x0UL)   /*!< Frequency measurement is in progress.                                */
  #define HSFLL_FREQM_DONE_DONE_Completed (0x1UL)    /*!< Frequency measurement is completed.                                  */


/* HSFLL_FREQM_ERROR: Frequency measurement error status */
  #define HSFLL_FREQM_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                                      */

/* ERROR @Bit 0 : Trim error status. */
  #define HSFLL_FREQM_ERROR_ERROR_Pos (0UL)          /*!< Position of ERROR field.                                             */
  #define HSFLL_FREQM_ERROR_ERROR_Msk (0x1UL << HSFLL_FREQM_ERROR_ERROR_Pos) /*!< Bit mask of ERROR field.                     */
  #define HSFLL_FREQM_ERROR_ERROR_Min (0x0UL)        /*!< Min enumerator value of ERROR field.                                 */
  #define HSFLL_FREQM_ERROR_ERROR_Max (0x1UL)        /*!< Max enumerator value of ERROR field.                                 */
  #define HSFLL_FREQM_ERROR_ERROR_OutsideLimit (0x1UL) /*!< Frequency exceeded the accuracy 2 percent in closed loop mode.     */
  #define HSFLL_FREQM_ERROR_ERROR_WithinLimit (0x0UL) /*!< Frequency stayed within accuracy 2 percent in closed loop mode.     */

/* TRIMUNDERFLOW @Bit 1 : Underflow error status. */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Pos (1UL)  /*!< Position of TRIMUNDERFLOW field.                                     */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Msk (0x1UL << HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Pos) /*!< Bit mask of TRIMUNDERFLOW
                                                                            field.*/
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Min (0x0UL) /*!< Min enumerator value of TRIMUNDERFLOW field.                        */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Max (0x1UL) /*!< Max enumerator value of TRIMUNDERFLOW field.                        */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_OutsideLimit (0x1UL) /*!< Underflow                                                  */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_WithinLimit (0x0UL) /*!< No underflow                                                */

/* TRIMOVERFLOW @Bit 2 : Overflow error status. */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Pos (2UL)   /*!< Position of TRIMOVERFLOW field.                                      */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Msk (0x1UL << HSFLL_FREQM_ERROR_TRIMOVERFLOW_Pos) /*!< Bit mask of TRIMOVERFLOW field.*/
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Min (0x0UL) /*!< Min enumerator value of TRIMOVERFLOW field.                          */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Max (0x1UL) /*!< Max enumerator value of TRIMOVERFLOW field.                          */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_OutsideLimit (0x1UL) /*!< Overflow                                                    */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_WithinLimit (0x0UL) /*!< No overflow                                                  */


/* HSFLL_FREQM_MEAS: Frequency measurement */
  #define HSFLL_FREQM_MEAS_ResetValue (0x00000000UL) /*!< Reset value of MEAS register.                                        */

/* VALUE @Bits 0..7 : Last frequency measurement value. */
  #define HSFLL_FREQM_MEAS_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define HSFLL_FREQM_MEAS_VALUE_Msk (0xFFUL << HSFLL_FREQM_MEAS_VALUE_Pos) /*!< Bit mask of VALUE field.                      */



