adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Msk (0x1UL << HSFLL_CLOCKCTRL_DITHERING_EN_Pos) /*!< Bit mask of EN field.              */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Disabled (0x0UL) /*!< Clock dithering is disabled                                       */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Enabled (0x1UL) /*!< Clock dithering is enabled                                         */


/* HSFLL_CLOCKCTRL_MULT: Multiplication factor */
  #define HSFLL_CLOCKCTRL_MULT_ResetValue (0x00000004UL) /*!< Reset value of MULT register.                                    */

/* VAL @Bits 0..4 : Multiplication factor value. Valid range: 4 to 25. Output frequency is a multiplication of 16 MHz reference
                    and the multiplication factor. */

  #define HSFLL_CLOCKCTRL_MULT_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HSFLL_CLOCKCTRL_MULT_VAL_Msk (0x1FUL << HSFLL_CLOCKCTRL_MULT_VAL_Pos) /*!< Bit mask of VAL field.                    */


/* HSFLL_CLOCKCTRL_SLEEP: Sleep configuration */
  #define HSFLL_CLOCKCTRL_SLEEP_ResetValue (0x00000001UL) /*!< Reset value of SLEEP register.                                  */

/* MODE @Bit 0 : HSFLL sleep mode. */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Pos (0UL)       /*!< Position of MODE field.                                              */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Msk (0x1UL << HSFLL_CLOCKCTRL_SLEEP_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Max (0x1UL)     /*!< Max enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Normal (0x0UL)  /*!< Normal mode operation                                                */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Sleep (0x1UL)   /*!< Power down the HSFLL core                                            */

/* RETAIN @Bit 1 : Retain. */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Pos (1UL)     /*!< Position of RETAIN field.                                            */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Msk (0x1UL << HSFLL_CLOCKCTRL_SLEEP_RETAIN_Pos) /*!< Bit mask of RETAIN field.          */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Min (0x0UL)   /*!< Min enumerator value of RETAIN field.                                */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Max (0x1UL)   /*!< Max enumerator value of RETAIN field.                                */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Disabled (0x0UL) /*!< No retention while powered down                                   */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Enabled (0x1UL) /*!< Retain all inputs while powered down                               */


/* HSFLL_CLOCKCTRL_RETAINFINETRIM: Fine trim retain control */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_ResetValue (0x00000000UL) /*!< Reset value of RETAINFINETRIM register.                */

/* RETAIN @Bit 0 : Retain control */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos (0UL) /*!< Position of RETAIN field.                                       */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Msk (0x1UL << HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos) /*!< Bit mask of RETAIN
                                                                            field.*/
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Min (0x0UL) /*!< Min enumerator value of RETAIN field.                         */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Max (0x1UL) /*!< Max enumerator value of RETAIN field.                         */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_NoRetain (0x0UL) /*!< No retain.                                               */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Retain (0x1UL) /*!< Retain control when HSFLL goes to open-loop mode.          */


/* HSFLL_CLOCKCTRL_OVERRIDELOCKED: Override the LOCKED signal */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDELOCKED register.                */

/* OVERRIDE @Bit 0 : Override */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos (0UL) /*!< Position of OVERRIDE field.                                   */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos) /*!< Bit mask of
                                                                            OVERRIDE field.*/
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Min (0x0UL) /*!< Min enumerator value of OVERRIDE field.                     */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Max (0x1UL) /*!< Max enumerator value of OVERRIDE field.                     */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_NoOperation (0x0UL) /*!< No Operation.                                       */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Override (0x1UL) /*!< Override                                               */


/* HSFLL_CLOCKCTRL_DITHERINIT: Clock dithering, configurable seed */
  #define HSFLL_CLOCKCTRL_DITHERINIT_ResetValue (0x00000000UL) /*!< Reset value of DITHERINIT register.                        */

/* SEED @Bits 0..31 : Initial value for the PRBS */
  #define HSFLL_CLOCKCTRL_DITHERINIT_SEED_Pos (0UL)  /*!< Position of SEED field.                                              */
  #define HSFLL_CLOCKCTRL_DITHERINIT_SEED_Msk (0xFFFFFFFFUL << HSFLL_CLOCKCTRL_DITHERINIT_SEED_Pos) /*!< Bit mask of SEED
                                                                            field.*/



/* ================================================== Struct HSFLL_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [HSFLL_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  SLEEP;                             /*!< (@ 0x00000004) Override the SLEEP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000008) Override the RETAIN signal to the analog module       */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  READY;                             /*!< (@ 0x00000010) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000014) Override the SETTLED signal from the analog module    */
} NRF_HSFLL_OVERRIDE_Type;                           /*!< Size = 24 (0x018)                                                    */

/* HSFLL_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define HSFLL_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                   */

/* VAL @Bit 0 : Override value for the signal */
  #define HSFLL_OVERRIDE_PWRUP_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HSFLL_OVERRIDE_PWRUP_VAL_Msk (0x1UL << HSFLL_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HSFLL_OVERRIDE_PWRUP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_OVERRIDE_PWRUP_EN_Msk (0x1UL << HSFLL_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_OVERRIDE_PWRUP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_PWRUP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_PWRUP_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HSFLL_OVERRIDE_PWRUP_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* HSFLL_OVERRIDE_SLEEP: Override the SLEEP signal to the analog module */
  #define HSFLL_OVERRIDE_SLEEP_ResetValue (0x00000000UL) /*!< Reset value of SLEEP register.                                   */

/* VAL @Bit 0 : Override value for the signal */
  #define HSFLL_OVERRIDE_SLEEP_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HSFLL_OVERRIDE_SLEEP_VAL_Msk (0x1UL << HSFLL_OVERRIDE_SLEEP_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HSFLL_OVERRIDE_SLEEP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_OVERRIDE_SLEEP_EN_Msk (0x1UL << HSFLL_OVERRIDE_SLEEP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_OVERRIDE_SLEEP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_SLEEP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_SLEEP_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HSFLL_OVERRIDE_SLEEP_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* HSFLL_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define HSFLL_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                 */

/* VAL @Bit 0 : Override value for the signal */
  #define HSFLL_OVERRIDE_RETAIN_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HSFLL_OVERRIDE_RETAIN_VAL_Msk (0x1UL << HSFLL_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define HSFLL_OVERRIDE_RETAIN_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HSFLL_OVERRIDE_RETAIN_EN_Msk (0x1UL << HSFLL_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HSFLL_OVERRIDE_RETAIN_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_RETAIN_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_RETAIN_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define HSFLL_OVERRIDE_RETAIN_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* HSFLL_OVERRIDE_READY: Override the READY signal from the analog module */
  #define HSFLL_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                   */

/* VAL @Bit 0 : Current value of the signal */
  #define HSFLL_OVERRIDE_READY_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HSFLL_OVERRIDE_READY_VAL_Msk (0x1UL << HSFLL_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HSFLL_OVERRIDE_READY_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_OVERRIDE_READY_EN_Msk (0x1UL << HSFLL_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_OVERRIDE_READY_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_READY_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_READY_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HSFLL_OVERRIDE_READY_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


