adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HSFLL_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define HSFLL_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                               */

/* VAL @Bit 0 : Current value of the signal */
  #define HSFLL_OVERRIDE_SETTLED_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define HSFLL_OVERRIDE_SETTLED_VAL_Msk (0x1UL << HSFLL_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define HSFLL_OVERRIDE_SETTLED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define HSFLL_OVERRIDE_SETTLED_EN_Msk (0x1UL << HSFLL_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define HSFLL_OVERRIDE_SETTLED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_SETTLED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define HSFLL_OVERRIDE_SETTLED_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */



/* ==================================================== Struct HSFLL_DFT ===================================================== */
/**
  * @brief DFT [HSFLL_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_HSFLL_DFT_Type;                                /*!< Size = 52 (0x034)                                                    */

/* HSFLL_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define HSFLL_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define HSFLL_DFT_ATB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define HSFLL_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << HSFLL_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define HSFLL_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_ATB0CONFIG_SELMUX_Max (0x0UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_ATB0CONFIG_SELMUX_HiZ (0x0UL)    /*!< HiZ                                                                  */

/* EN @Bit 31 : Enable the analog test bus */
  #define HSFLL_DFT_ATB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_DFT_ATB0CONFIG_EN_Msk (0x1UL << HSFLL_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_DFT_ATB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_DFT_ATB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_DFT_ATB0CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define HSFLL_DFT_ATB0CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* HSFLL_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define HSFLL_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define HSFLL_DFT_ATB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define HSFLL_DFT_ATB1CONFIG_SELMUX_Msk (0x3UL << HSFLL_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define HSFLL_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_ATB1CONFIG_SELMUX_Max (0x1UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_ATB1CONFIG_SELMUX_HiZ (0x0UL)    /*!< HiZ                                                                  */
  #define HSFLL_DFT_ATB1CONFIG_SELMUX_VREGOUT (0x1UL) /*!< VREG_OUT                                                            */

/* EN @Bit 31 : Enable the analog test bus */
  #define HSFLL_DFT_ATB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_DFT_ATB1CONFIG_EN_Msk (0x1UL << HSFLL_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_DFT_ATB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_DFT_ATB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_DFT_ATB1CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define HSFLL_DFT_ATB1CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* HSFLL_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define HSFLL_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB0 */
  #define HSFLL_DFT_DTB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define HSFLL_DFT_DTB0CONFIG_SELMUX_Msk (0x3UL << HSFLL_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define HSFLL_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_DTB0CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_DTB0CONFIG_SELMUX_VSS (0x0UL)    /*!< VSS                                                                  */
  #define HSFLL_DFT_DTB0CONFIG_SELMUX_OSCDIV256INT (0x1UL) /*!< OSC_DIV256_INT_0V8 selected                                    */
  #define HSFLL_DFT_DTB0CONFIG_SELMUX_SETTLEDDCO400M (0x2UL) /*!< SETTLED_DCO400M_AO_0V8 selected                              */
  #define HSFLL_DFT_DTB0CONFIG_SELMUX_PWRUPDCO400M (0x3UL) /*!< PWRUP_DCO400M_AO_0V8 selected                                  */

