adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define HSFLL_DFT_DTB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_DFT_DTB0CONFIG_EN_Msk (0x1UL << HSFLL_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_DFT_DTB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_DFT_DTB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_DFT_DTB0CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define HSFLL_DFT_DTB0CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* HSFLL_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define HSFLL_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB1 */
  #define HSFLL_DFT_DTB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define HSFLL_DFT_DTB1CONFIG_SELMUX_Msk (0x3UL << HSFLL_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define HSFLL_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_DTB1CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_DTB1CONFIG_SELMUX_VSS (0x0UL)    /*!< VSS                                                                  */
  #define HSFLL_DFT_DTB1CONFIG_SELMUX_RETAINDCO400M (0x1UL) /*!< RETAIN_DCO400M_AO_0V8 selected                                */
  #define HSFLL_DFT_DTB1CONFIG_SELMUX_SETTLEDDCO400M (0x2UL) /*!< SETTLED_DCO400M_AO_0V8 selected                              */
  #define HSFLL_DFT_DTB1CONFIG_SELMUX_OSCDCO400M (0x3UL) /*!< OSC_DCO400M_0V8 selected                                         */

/* EN @Bit 31 : Enable the digital test bus */
  #define HSFLL_DFT_DTB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_DFT_DTB1CONFIG_EN_Msk (0x1UL << HSFLL_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_DFT_DTB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_DFT_DTB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_DFT_DTB1CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define HSFLL_DFT_DTB1CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* HSFLL_DFT_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define HSFLL_DFT_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB2 */
  #define HSFLL_DFT_DTB2CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define HSFLL_DFT_DTB2CONFIG_SELMUX_Msk (0x3UL << HSFLL_DFT_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define HSFLL_DFT_DTB2CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_DTB2CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_DTB2CONFIG_SELMUX_VSS (0x0UL)    /*!< VSS                                                                  */
  #define HSFLL_DFT_DTB2CONFIG_SELMUX_SETTLEDDCO400M (0x1UL) /*!< SETTLED_DCO400M_AO_0V8 selected                              */
  #define HSFLL_DFT_DTB2CONFIG_SELMUX_READYDCO400M (0x2UL) /*!< READY_DCO400M_AO_0V8 selected                                  */
  #define HSFLL_DFT_DTB2CONFIG_SELMUX_OSCDIV128INT (0x3UL) /*!< OSC_DIV128_INT_0V8 selected                                    */

/* EN @Bit 31 : Enable the digital test bus */
  #define HSFLL_DFT_DTB2CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_DFT_DTB2CONFIG_EN_Msk (0x1UL << HSFLL_DFT_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_DFT_DTB2CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_DFT_DTB2CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_DFT_DTB2CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define HSFLL_DFT_DTB2CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* HSFLL_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define HSFLL_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                              */

/* SELMUX @Bit 0 : Select multiplexer for DTB3 */
  #define HSFLL_DFT_DTB3CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define HSFLL_DFT_DTB3CONFIG_SELMUX_Msk (0x1UL << HSFLL_DFT_DTB3CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define HSFLL_DFT_DTB3CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_DTB3CONFIG_SELMUX_Max (0x1UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define HSFLL_DFT_DTB3CONFIG_SELMUX_VSS (0x0UL)    /*!< VSS                                                                  */
  #define HSFLL_DFT_DTB3CONFIG_SELMUX_SETTLEDDCO400M (0x1UL) /*!< SETTLED_DCO400M_AO_0V8 selected                              */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define HSFLL_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                    */
  #define HSFLL_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << HSFLL_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define HSFLL_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                       */
  #define HSFLL_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                       */
  #define HSFLL_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                         */
  #define HSFLL_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                           */

