adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define HSFLL_DFT_DTB3CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HSFLL_DFT_DTB3CONFIG_EN_Msk (0x1UL << HSFLL_DFT_DTB3CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HSFLL_DFT_DTB3CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_DFT_DTB3CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_DFT_DTB3CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define HSFLL_DFT_DTB3CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* HSFLL_DFT_TCFG: Test mode configuration */
  #define HSFLL_DFT_TCFG_ResetValue (0x00000000UL)   /*!< Reset value of TCFG register.                                        */

/* FORCEHPSWITCH @Bit 0 : Force HP switch in regulator ON */
  #define HSFLL_DFT_TCFG_FORCEHPSWITCH_Pos (0UL)     /*!< Position of FORCEHPSWITCH field.                                     */
  #define HSFLL_DFT_TCFG_FORCEHPSWITCH_Msk (0x1UL << HSFLL_DFT_TCFG_FORCEHPSWITCH_Pos) /*!< Bit mask of FORCEHPSWITCH field.   */
  #define HSFLL_DFT_TCFG_FORCEHPSWITCH_Min (0x0UL)   /*!< Min enumerator value of FORCEHPSWITCH field.                         */
  #define HSFLL_DFT_TCFG_FORCEHPSWITCH_Max (0x1UL)   /*!< Max enumerator value of FORCEHPSWITCH field.                         */
  #define HSFLL_DFT_TCFG_FORCEHPSWITCH_Disabled (0x0UL) /*!< Force HP switch is disabled                                       */
  #define HSFLL_DFT_TCFG_FORCEHPSWITCH_Enabled (0x1UL) /*!< Force HP switch is enabled                                         */

/* DISABLESETTLED @Bit 1 : Disable settled signal to mute output clock */
  #define HSFLL_DFT_TCFG_DISABLESETTLED_Pos (1UL)    /*!< Position of DISABLESETTLED field.                                    */
  #define HSFLL_DFT_TCFG_DISABLESETTLED_Msk (0x1UL << HSFLL_DFT_TCFG_DISABLESETTLED_Pos) /*!< Bit mask of DISABLESETTLED field.*/
  #define HSFLL_DFT_TCFG_DISABLESETTLED_Min (0x0UL)  /*!< Min enumerator value of DISABLESETTLED field.                        */
  #define HSFLL_DFT_TCFG_DISABLESETTLED_Max (0x1UL)  /*!< Max enumerator value of DISABLESETTLED field.                        */
  #define HSFLL_DFT_TCFG_DISABLESETTLED_Disabled (0x0UL) /*!< Disable settled signal is disabled                               */
  #define HSFLL_DFT_TCFG_DISABLESETTLED_Enabled (0x1UL) /*!< Disable settled signal is enabled                                 */


/* ====================================================== Struct HSFLL ======================================================= */
/**
  * @brief HSFLL
  */
  typedef struct {                                   /*!< HSFLL Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the HSFLL                                       */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop the HSFLL                                        */
    __OM uint32_t TASKS_SLEEP;                       /*!< (@ 0x00000008) Request the HSFLL into sleep mode                     */
    __OM uint32_t TASKS_WAKEUP;                      /*!< (@ 0x0000000C) Wakeup the HSFLL from sleep mode                      */
    __OM uint32_t TASKS_FREQMEAS;                    /*!< (@ 0x00000010) Start frequency measurement in software-controlled
                                                                         mode*/
    __OM uint32_t TASKS_FREQCHANGE;                  /*!< (@ 0x00000014) Trigger frequency change                              */
    __IM uint32_t RESERVED[58];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) HSFLL started                                         */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) HSFLL stopped                                         */
    __IOM uint32_t EVENTS_WOKEUP;                    /*!< (@ 0x00000108) HSFLL woke up                                         */
    __IOM uint32_t EVENTS_FREQMDONE;                 /*!< (@ 0x0000010C) Frequency measurement done                            */
    __IOM uint32_t EVENTS_FREQCHANGED;               /*!< (@ 0x00000110) Frequency change done                                 */
    __IM uint32_t RESERVED1[187];
    __IM uint32_t CLOCKSTATUS;                       /*!< (@ 0x00000400) Clock status                                          */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED2[2];
    __IOM NRF_HSFLL_CONFIG_Type CONFIG;              /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED3[3];
    __IOM NRF_HSFLL_FREQM_Type FREQM;                /*!< (@ 0x00000420) (unspecified)                                         */
    __IM uint32_t RESERVED4[5];
    __IOM NRF_HSFLL_TRIM_Type TRIM;                  /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[3];
    __IOM NRF_HSFLL_CLOCKCTRL_Type CLOCKCTRL;        /*!< (@ 0x00000460) (unspecified)                                         */
    __IM uint32_t RESERVED6;
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IM uint32_t RESERVED7[31];
    __IOM NRF_HSFLL_OVERRIDE_Type OVERRIDE;          /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED8[58];
    __IOM NRF_HSFLL_DFT_Type DFT;                    /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_HSFLL_Type;                                  /*!< Size = 1588 (0x634)                                                  */

/* HSFLL_TASKS_START: Start the HSFLL */
  #define HSFLL_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the HSFLL */
  #define HSFLL_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define HSFLL_TASKS_START_TASKS_START_Msk (0x1UL << HSFLL_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define HSFLL_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define HSFLL_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define HSFLL_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* HSFLL_TASKS_STOP: Stop the HSFLL */
  #define HSFLL_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

