adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HSFLL_EVENTS_WOKEUP: HSFLL woke up */
  #define HSFLL_EVENTS_WOKEUP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WOKEUP register.                            */

/* EVENTS_WOKEUP @Bit 0 : HSFLL woke up */
  #define HSFLL_EVENTS_WOKEUP_EVENTS_WOKEUP_Pos (0UL) /*!< Position of EVENTS_WOKEUP field.                                    */
  #define HSFLL_EVENTS_WOKEUP_EVENTS_WOKEUP_Msk (0x1UL << HSFLL_EVENTS_WOKEUP_EVENTS_WOKEUP_Pos) /*!< Bit mask of EVENTS_WOKEUP
                                                                            field.*/
  #define HSFLL_EVENTS_WOKEUP_EVENTS_WOKEUP_Min (0x0UL) /*!< Min enumerator value of EVENTS_WOKEUP field.                      */
  #define HSFLL_EVENTS_WOKEUP_EVENTS_WOKEUP_Max (0x1UL) /*!< Max enumerator value of EVENTS_WOKEUP field.                      */
  #define HSFLL_EVENTS_WOKEUP_EVENTS_WOKEUP_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define HSFLL_EVENTS_WOKEUP_EVENTS_WOKEUP_Generated (0x1UL) /*!< Event generated                                             */


/* HSFLL_EVENTS_FREQMDONE: Frequency measurement done */
  #define HSFLL_EVENTS_FREQMDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FREQMDONE register.                      */

/* EVENTS_FREQMDONE @Bit 0 : Frequency measurement done */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Pos (0UL) /*!< Position of EVENTS_FREQMDONE field.                           */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Msk (0x1UL << HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_FREQMDONE field.*/
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQMDONE field.             */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQMDONE field.             */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Generated (0x1UL) /*!< Event generated                                       */


/* HSFLL_EVENTS_FREQCHANGED: Frequency change done */
  #define HSFLL_EVENTS_FREQCHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FREQCHANGED register.                  */

/* EVENTS_FREQCHANGED @Bit 0 : Frequency change done */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos (0UL) /*!< Position of EVENTS_FREQCHANGED field.                     */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Msk (0x1UL << HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos) /*!< Bit
                                                                            mask of EVENTS_FREQCHANGED field.*/
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQCHANGED field.       */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQCHANGED field.       */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Generated (0x1UL) /*!< Event generated                                   */


/* HSFLL_CLOCKSTATUS: Clock status */
  #define HSFLL_CLOCKSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CLOCKSTATUS register.                                */

/* MODE @Bits 0..1 : The HSFLL operating mode. */
  #define HSFLL_CLOCKSTATUS_MODE_Pos (0UL)           /*!< Position of MODE field.                                              */
  #define HSFLL_CLOCKSTATUS_MODE_Msk (0x3UL << HSFLL_CLOCKSTATUS_MODE_Pos) /*!< Bit mask of MODE field.                        */
  #define HSFLL_CLOCKSTATUS_MODE_Min (0x0UL)         /*!< Min enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKSTATUS_MODE_Max (0x2UL)         /*!< Max enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKSTATUS_MODE_OpenLoop (0x0UL)    /*!< Open loop mode.                                                      */
  #define HSFLL_CLOCKSTATUS_MODE_ClosedLoop (0x1UL)  /*!< Closed loop mode.                                                    */
  #define HSFLL_CLOCKSTATUS_MODE_Bypass (0x2UL)      /*!< Bypass mode.                                                         */

/* OVERRIDE @Bit 4 : HSFLL Override mode. */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Pos (4UL)       /*!< Position of OVERRIDE field.                                          */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKSTATUS_OVERRIDE_Pos) /*!< Bit mask of OVERRIDE field.            */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Min (0x0UL)     /*!< Min enumerator value of OVERRIDE field.                              */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Max (0x1UL)     /*!< Max enumerator value of OVERRIDE field.                              */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Disabled (0x0UL) /*!< Override mode disabled.                                             */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Enabled (0x1UL) /*!< Override mode enabled.                                               */

/* ACCURACY @Bit 9 : Clock accuracy. */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Pos (9UL)       /*!< Position of ACCURACY field.                                          */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Msk (0x1UL << HSFLL_CLOCKSTATUS_ACCURACY_Pos) /*!< Bit mask of ACCURACY field.            */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Min (0x0UL)     /*!< Min enumerator value of ACCURACY field.                              */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Max (0x1UL)     /*!< Max enumerator value of ACCURACY field.                              */
  #define HSFLL_CLOCKSTATUS_ACCURACY_OutsideLimit (0x0UL) /*!< Clock accuracy is outside 2 percent.                            */
  #define HSFLL_CLOCKSTATUS_ACCURACY_WithinLimit (0x1UL) /*!< Clock accuracy is within 2 percent.                              */

/* LOCKED @Bit 10 : The HSFLL lock status. */
  #define HSFLL_CLOCKSTATUS_LOCKED_Pos (10UL)        /*!< Position of LOCKED field.                                            */
  #define HSFLL_CLOCKSTATUS_LOCKED_Msk (0x1UL << HSFLL_CLOCKSTATUS_LOCKED_Pos) /*!< Bit mask of LOCKED field.                  */
  #define HSFLL_CLOCKSTATUS_LOCKED_Min (0x0UL)       /*!< Min enumerator value of LOCKED field.                                */
  #define HSFLL_CLOCKSTATUS_LOCKED_Max (0x1UL)       /*!< Max enumerator value of LOCKED field.                                */
  #define HSFLL_CLOCKSTATUS_LOCKED_NotLocked (0x0UL) /*!< Not locked to reference clock                                        */
  #define HSFLL_CLOCKSTATUS_LOCKED_Locked (0x1UL)    /*!< Locked to reference clock.                                           */


/* HSFLL_STATUSANA: Status of analog module output signals */
  #define HSFLL_STATUSANA_ResetValue (0x00000000UL)  /*!< Reset value of STATUSANA register.                                   */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define HSFLL_STATUSANA_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define HSFLL_STATUSANA_READY_Msk (0x1UL << HSFLL_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                         */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define HSFLL_STATUSANA_SETTLED_Pos (1UL)          /*!< Position of SETTLED field.                                           */
  #define HSFLL_STATUSANA_SETTLED_Msk (0x1UL << HSFLL_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.                   */


/* HSFLL_MIRROR: Enable LOCK for mirrored registers */
  #define HSFLL_MIRROR_ResetValue (0x00000001UL)     /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define HSFLL_MIRROR_LOCK_Pos (0UL)                /*!< Position of LOCK field.                                              */
  #define HSFLL_MIRROR_LOCK_Msk (0x1UL << HSFLL_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Min (0x0UL)              /*!< Min enumerator value of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Max (0x1UL)              /*!< Max enumerator value of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Disabled (0x0UL)         /*!< Lock disabled                                                        */
  #define HSFLL_MIRROR_LOCK_Enabled (0x1UL)          /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            I3C                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

