adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define I3C_INTENSET_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define I3C_INTENSET_CORE_Msk (0x1UL << I3C_INTENSET_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define I3C_INTENSET_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define I3C_INTENSET_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define I3C_INTENSET_CORE_Set (0x1UL)              /*!< Enable                                                               */
  #define I3C_INTENSET_CORE_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define I3C_INTENSET_CORE_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* DMA @Bit 1 : Write '1' to enable interrupt for event DMA */
  #define I3C_INTENSET_DMA_Pos (1UL)                 /*!< Position of DMA field.                                               */
  #define I3C_INTENSET_DMA_Msk (0x1UL << I3C_INTENSET_DMA_Pos) /*!< Bit mask of DMA field.                                     */
  #define I3C_INTENSET_DMA_Min (0x0UL)               /*!< Min enumerator value of DMA field.                                   */
  #define I3C_INTENSET_DMA_Max (0x1UL)               /*!< Max enumerator value of DMA field.                                   */
  #define I3C_INTENSET_DMA_Set (0x1UL)               /*!< Enable                                                               */
  #define I3C_INTENSET_DMA_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define I3C_INTENSET_DMA_Enabled (0x1UL)           /*!< Read: Enabled                                                        */


/* I3C_INTENCLR: Disable interrupt */
  #define I3C_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define I3C_INTENCLR_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define I3C_INTENCLR_CORE_Msk (0x1UL << I3C_INTENCLR_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define I3C_INTENCLR_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define I3C_INTENCLR_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define I3C_INTENCLR_CORE_Clear (0x1UL)            /*!< Disable                                                              */
  #define I3C_INTENCLR_CORE_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define I3C_INTENCLR_CORE_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* DMA @Bit 1 : Write '1' to disable interrupt for event DMA */
  #define I3C_INTENCLR_DMA_Pos (1UL)                 /*!< Position of DMA field.                                               */
  #define I3C_INTENCLR_DMA_Msk (0x1UL << I3C_INTENCLR_DMA_Pos) /*!< Bit mask of DMA field.                                     */
  #define I3C_INTENCLR_DMA_Min (0x0UL)               /*!< Min enumerator value of DMA field.                                   */
  #define I3C_INTENCLR_DMA_Max (0x1UL)               /*!< Max enumerator value of DMA field.                                   */
  #define I3C_INTENCLR_DMA_Clear (0x1UL)             /*!< Disable                                                              */
  #define I3C_INTENCLR_DMA_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define I3C_INTENCLR_DMA_Enabled (0x1UL)           /*!< Read: Enabled                                                        */


/* I3C_INTPEND: Pending interrupts */
  #define I3C_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define I3C_INTPEND_CORE_Pos (0UL)                 /*!< Position of CORE field.                                              */
  #define I3C_INTPEND_CORE_Msk (0x1UL << I3C_INTPEND_CORE_Pos) /*!< Bit mask of CORE field.                                    */
  #define I3C_INTPEND_CORE_Min (0x0UL)               /*!< Min enumerator value of CORE field.                                  */
  #define I3C_INTPEND_CORE_Max (0x1UL)               /*!< Max enumerator value of CORE field.                                  */
  #define I3C_INTPEND_CORE_NotPending (0x0UL)        /*!< Read: Not pending                                                    */
  #define I3C_INTPEND_CORE_Pending (0x1UL)           /*!< Read: Pending                                                        */

/* DMA @Bit 1 : Read pending status of interrupt for event DMA */
  #define I3C_INTPEND_DMA_Pos (1UL)                  /*!< Position of DMA field.                                               */
  #define I3C_INTPEND_DMA_Msk (0x1UL << I3C_INTPEND_DMA_Pos) /*!< Bit mask of DMA field.                                       */
  #define I3C_INTPEND_DMA_Min (0x0UL)                /*!< Min enumerator value of DMA field.                                   */
  #define I3C_INTPEND_DMA_Max (0x1UL)                /*!< Max enumerator value of DMA field.                                   */
  #define I3C_INTPEND_DMA_NotPending (0x0UL)         /*!< Read: Not pending                                                    */
  #define I3C_INTPEND_DMA_Pending (0x1UL)            /*!< Read: Pending                                                        */


/* I3C_ENABLE: Enable I3C peripheral. */
  #define I3C_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* EN @Bit 0 : Enable */
  #define I3C_ENABLE_EN_Pos (0UL)                    /*!< Position of EN field.                                                */
  #define I3C_ENABLE_EN_Msk (0x1UL << I3C_ENABLE_EN_Pos) /*!< Bit mask of EN field.                                            */
  #define I3C_ENABLE_EN_Min (0x0UL)                  /*!< Min enumerator value of EN field.                                    */
  #define I3C_ENABLE_EN_Max (0x1UL)                  /*!< Max enumerator value of EN field.                                    */
  #define I3C_ENABLE_EN_Disabled (0x0UL)             /*!< I3C peripheral disabled.                                             */
  #define I3C_ENABLE_EN_Enabled (0x1UL)              /*!< I3C peripheral enabled.                                              */


/* I3C_SLAVEIF0: I3C slave interface 0 */
  #define I3C_SLAVEIF0_ResetValue (0x00000000UL)     /*!< Reset value of SLAVEIF0 register.                                    */

