adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* I3C_SLAVEPID1: Slave Device Provisioned ID 1 */
  #define I3C_SLAVEPID1_ResetValue (0x00000000UL)    /*!< Reset value of SLAVEPID1 register.                                   */

/* PROVID @Bit 0 : Provisional ID Type Selector */
  #define I3C_SLAVEPID1_PROVID_Pos (0UL)             /*!< Position of PROVID field.                                            */
  #define I3C_SLAVEPID1_PROVID_Msk (0x1UL << I3C_SLAVEPID1_PROVID_Pos) /*!< Bit mask of PROVID field.                          */

/* MIPIMID @Bits 1..15 : MIPI Manufacturer ID */
  #define I3C_SLAVEPID1_MIPIMID_Pos (1UL)            /*!< Position of MIPIMID field.                                           */
  #define I3C_SLAVEPID1_MIPIMID_Msk (0x7FFFUL << I3C_SLAVEPID1_MIPIMID_Pos) /*!< Bit mask of MIPIMID field.                    */


/* I3C_KEEPSDA: Enable or disable the SDA high-keeper used for Master-to-Slave and Slave-to-Master bus hand-off. */
  #define I3C_KEEPSDA_ResetValue (0x00000000UL)      /*!< Reset value of KEEPSDA register.                                     */

/* ENABLE @Bit 0 : Enable or disable the SDA high-keeper */
  #define I3C_KEEPSDA_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define I3C_KEEPSDA_ENABLE_Msk (0x1UL << I3C_KEEPSDA_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define I3C_KEEPSDA_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define I3C_KEEPSDA_ENABLE_Max (0x1UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define I3C_KEEPSDA_ENABLE_Disabled (0x0UL)        /*!< High-keeper disabled.                                                */
  #define I3C_KEEPSDA_ENABLE_Enabled (0x1UL)         /*!< High-keeper enabled.                                                 */


/* I3C_KEEPSCL: Enable or disable the SCL high-keeper used for Master-to-Slave and Slave-to-Master bus hand-off. */
  #define I3C_KEEPSCL_ResetValue (0x00000000UL)      /*!< Reset value of KEEPSCL register.                                     */

/* ENABLE @Bit 0 : Enable or disable the SCL high-keeper */
  #define I3C_KEEPSCL_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define I3C_KEEPSCL_ENABLE_Msk (0x1UL << I3C_KEEPSCL_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define I3C_KEEPSCL_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define I3C_KEEPSCL_ENABLE_Max (0x1UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define I3C_KEEPSCL_ENABLE_Disabled (0x0UL)        /*!< High-keeper disabled.                                                */
  #define I3C_KEEPSCL_ENABLE_Enabled (0x1UL)         /*!< High-keeper enabled.                                                 */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          I3CCORE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================ Struct I3CCORE_CORE_DEVCHARTABLE ============================================= */
/**
  * @brief DEVCHARTABLE [I3CCORE_CORE_DEVCHARTABLE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LOC1;                              /*!< (@ 0x00000000) Device Characteristic Table Location-1 of Device [n]  */
  __IOM uint32_t  LOC2;                              /*!< (@ 0x00000004) Device Characteristic Table Location-2 of Device [n]  */
  __IOM uint32_t  LOC3;                              /*!< (@ 0x00000008) Device Characteristic Table Location-3 of Device [n]  */
  __IOM uint32_t  LOC4;                              /*!< (@ 0x0000000C) Device Characteristic Table Location-4 of Device [n]  */
} NRF_I3CCORE_CORE_DEVCHARTABLE_Type;                /*!< Size = 16 (0x010)                                                    */
  #define I3CCORE_CORE_DEVCHARTABLE_MaxCount (10UL)  /*!< Size of DEVCHARTABLE[10] array.                                      */
  #define I3CCORE_CORE_DEVCHARTABLE_MaxIndex (9UL)   /*!< Max index of DEVCHARTABLE[10] array.                                 */
  #define I3CCORE_CORE_DEVCHARTABLE_MinIndex (0UL)   /*!< Min index of DEVCHARTABLE[10] array.                                 */

/* I3CCORE_CORE_DEVCHARTABLE_LOC1: Device Characteristic Table Location-1 of Device [n] */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC1_ResetValue (0x00000000UL) /*!< Reset value of LOC1 register.                          */

/* LSBPROVISIONALID @Bits 0..31 : The LSB 32-bit value of Provisional-ID */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC1_LSBPROVISIONALID_Pos (0UL) /*!< Position of LSBPROVISIONALID field.                   */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC1_LSBPROVISIONALID_Msk (0xFFFFFFFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC1_LSBPROVISIONALID_Pos)
                                                                            /*!< Bit mask of LSBPROVISIONALID field.*/


/* I3CCORE_CORE_DEVCHARTABLE_LOC2: Device Characteristic Table Location-2 of Device [n] */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC2_ResetValue (0x00000000UL) /*!< Reset value of LOC2 register.                          */

/* MSBPROVISIONALID @Bits 0..15 : The MSB 16-bit value of Provisional-ID */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC2_MSBPROVISIONALID_Pos (0UL) /*!< Position of MSBPROVISIONALID field.                   */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC2_MSBPROVISIONALID_Msk (0xFFFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC2_MSBPROVISIONALID_Pos)
                                                                            /*!< Bit mask of MSBPROVISIONALID field.*/


/* I3CCORE_CORE_DEVCHARTABLE_LOC3: Device Characteristic Table Location-3 of Device [n] */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_ResetValue (0x00000000UL) /*!< Reset value of LOC3 register.                          */

