adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* I3CCORE_CORE_IBIQUEUECTRL: This Register is used to control whether or not to intimate the application if an IBI request is
                               rejected (Nacked). */

  #define I3CCORE_CORE_IBIQUEUECTRL_ResetValue (0x00000000UL) /*!< Reset value of IBIQUEUECTRL register.                       */

/* NOTIFYHJREJECTED @Bit 0 : Notify Rejected Hot-Join Control. */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Pos (0UL) /*!< Position of NOTIFYHJREJECTED field.                        */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Msk (0x1UL << I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Pos) /*!< Bit mask
                                                                            of NOTIFYHJREJECTED field.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Min (0x0UL) /*!< Min enumerator value of NOTIFYHJREJECTED field.          */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Max (0x1UL) /*!< Max enumerator value of NOTIFYHJREJECTED field.          */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_DISABLED (0x0UL) /*!< (unspecified)                                       */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_ENABLED (0x1UL) /*!< (unspecified)                                        */

/* NOTIFYMRREJECTED @Bit 1 : Notify Rejected Master Request Control. */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Pos (1UL) /*!< Position of NOTIFYMRREJECTED field.                        */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Msk (0x1UL << I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Pos) /*!< Bit mask
                                                                            of NOTIFYMRREJECTED field.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Min (0x0UL) /*!< Min enumerator value of NOTIFYMRREJECTED field.          */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Max (0x1UL) /*!< Max enumerator value of NOTIFYMRREJECTED field.          */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_DISABLED (0x0UL) /*!< Suppress passing the IBI Status to the IBI FIFO
                                                                           (hence not notifying the application) when a MR
                                                                           Request is NACKed and auto-disabled based on the
                                                                           IBI_MR_REQ_REJECT Register.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_ENABLED (0x1UL) /*!< Writes IBI Status to the IBI FIFO (hence notifying the
                                                                          application) when a MR Request is NACKed and
                                                                          auto-disabled based on the IBI_MR_REQ_REJECT
                                                                          Register.*/

/* NOTIFYSIRREJECTED @Bit 3 : Notify Rejected Slave Interrupt Request Control. */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Pos (3UL) /*!< Position of NOTIFYSIRREJECTED field.                      */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Msk (0x1UL << I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Pos) /*!< Bit
                                                                            mask of NOTIFYSIRREJECTED field.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Min (0x0UL) /*!< Min enumerator value of NOTIFYSIRREJECTED field.        */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Max (0x1UL) /*!< Max enumerator value of NOTIFYSIRREJECTED field.        */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_DISABLED (0x0UL) /*!< Suppress passing the IBI Status to the IBI FIFO
                                                                            (hence not notifying the application) when a Slave
                                                                            Interrupt Request is NACKed and auto-disabled based
                                                                            on the IBI_SIR_REQ_REJECT Register.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_ENABLED (0x1UL) /*!< Writes IBI Status to the IBI FIFO (hence notifying
                                                                           the application) when a Slave Interrupt Request is
                                                                           NACKed and auto-disabled based on the
                                                                           IBI_SIR_REQ_REJECT Register.*/


/* I3CCORE_CORE_IBIMRREQREJECT: IBI Master Request Rejection Control Register. */
  #define I3CCORE_CORE_IBIMRREQREJECT_ResetValue (0x00000000UL) /*!< Reset value of IBIMRREQREJECT register.                   */

/* MRREQREJECT @Bits 0..31 : In-band Master Request Reject. */
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Pos (0UL) /*!< Position of MRREQREJECT field.                                */
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Msk (0xFFFFFFFFUL << I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Pos) /*!< Bit
                                                                            mask of MRREQREJECT field.*/
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Min (0x0UL) /*!< Min enumerator value of MRREQREJECT field.                  */
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Max (0x1UL) /*!< Max enumerator value of MRREQREJECT field.                  */
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_ACK (0x00000000UL) /*!< ACK Master Request.                                  */
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_NACK (0x00000001UL) /*!< NACK and send Directed DISEC CCC to disable the
                                                                           interrupting slave.*/


/* I3CCORE_CORE_IBISIRREQREJECT: IBI SIR Request Rejection Control */
  #define I3CCORE_CORE_IBISIRREQREJECT_ResetValue (0x00000000UL) /*!< Reset value of IBISIRREQREJECT register.                 */

