adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TXTHLDSIGNALEN @Bit 0 : Transmit Buffer Threshold Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_TXTHLDSIGNALEN_Pos (0UL) /*!< Position of TXTHLDSIGNALEN field.                            */
  #define I3CCORE_CORE_INTRSIGNALEN_TXTHLDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_TXTHLDSIGNALEN_Pos) /*!< Bit mask of
                                                                            TXTHLDSIGNALEN field.*/

/* RXTHLDSIGNALEN @Bit 1 : Receive Buffer Threshold Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_RXTHLDSIGNALEN_Pos (1UL) /*!< Position of RXTHLDSIGNALEN field.                            */
  #define I3CCORE_CORE_INTRSIGNALEN_RXTHLDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_RXTHLDSIGNALEN_Pos) /*!< Bit mask of
                                                                            RXTHLDSIGNALEN field.*/

/* IBITHLDSIGNALEN @Bit 2 : IBI Buffer Threshold Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_IBITHLDSIGNALEN_Pos (2UL) /*!< Position of IBITHLDSIGNALEN field.                          */
  #define I3CCORE_CORE_INTRSIGNALEN_IBITHLDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_IBITHLDSIGNALEN_Pos) /*!< Bit mask
                                                                            of IBITHLDSIGNALEN field.*/

/* CMDQUEUEREADYSIGNALEN @Bit 3 : Command Queue Ready Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_CMDQUEUEREADYSIGNALEN_Pos (3UL) /*!< Position of CMDQUEUEREADYSIGNALEN field.              */
  #define I3CCORE_CORE_INTRSIGNALEN_CMDQUEUEREADYSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_CMDQUEUEREADYSIGNALEN_Pos)
                                                                            /*!< Bit mask of CMDQUEUEREADYSIGNALEN field.*/

/* RESPREADYSIGNALEN @Bit 4 : Response Queue Ready Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_RESPREADYSIGNALEN_Pos (4UL) /*!< Position of RESPREADYSIGNALEN field.                      */
  #define I3CCORE_CORE_INTRSIGNALEN_RESPREADYSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_RESPREADYSIGNALEN_Pos) /*!< Bit
                                                                            mask of RESPREADYSIGNALEN field.*/

/* TRANSFERABORTSIGNALEN @Bit 5 : Transfer Abort Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_TRANSFERABORTSIGNALEN_Pos (5UL) /*!< Position of TRANSFERABORTSIGNALEN field.              */
  #define I3CCORE_CORE_INTRSIGNALEN_TRANSFERABORTSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_TRANSFERABORTSIGNALEN_Pos)
                                                                            /*!< Bit mask of TRANSFERABORTSIGNALEN field.*/

/* CCCUPDATEDSIGNALEN @Bit 6 : CCC Table Updated Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_CCCUPDATEDSIGNALEN_Pos (6UL) /*!< Position of CCCUPDATEDSIGNALEN field.                    */
  #define I3CCORE_CORE_INTRSIGNALEN_CCCUPDATEDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_CCCUPDATEDSIGNALEN_Pos) /*!< Bit
                                                                            mask of CCCUPDATEDSIGNALEN field.*/

/* DYNADDRASSGNSIGNALEN @Bit 8 : Dynamic Address Assigned Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_DYNADDRASSGNSIGNALEN_Pos (8UL) /*!< Position of DYNADDRASSGNSIGNALEN field.                */
  #define I3CCORE_CORE_INTRSIGNALEN_DYNADDRASSGNSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_DYNADDRASSGNSIGNALEN_Pos) /*!<
                                                                            Bit mask of DYNADDRASSGNSIGNALEN field.*/

/* TRANSFERERRSIGNALEN @Bit 9 : Transfer Error Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_TRANSFERERRSIGNALEN_Pos (9UL) /*!< Position of TRANSFERERRSIGNALEN field.                  */
  #define I3CCORE_CORE_INTRSIGNALEN_TRANSFERERRSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_TRANSFERERRSIGNALEN_Pos) /*!<
                                                                            Bit mask of TRANSFERERRSIGNALEN field.*/

/* DEFSLVSIGNALEN @Bit 10 : Define Slave CCC Received Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_DEFSLVSIGNALEN_Pos (10UL) /*!< Position of DEFSLVSIGNALEN field.                           */
  #define I3CCORE_CORE_INTRSIGNALEN_DEFSLVSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_DEFSLVSIGNALEN_Pos) /*!< Bit mask of
                                                                            DEFSLVSIGNALEN field.*/

/* READREQRECVSIGNALEN @Bit 11 : Read Request Received Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_READREQRECVSIGNALEN_Pos (11UL) /*!< Position of READREQRECVSIGNALEN field.                 */
  #define I3CCORE_CORE_INTRSIGNALEN_READREQRECVSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_READREQRECVSIGNALEN_Pos) /*!<
                                                                            Bit mask of READREQRECVSIGNALEN field.*/

/* IBIUPDATEDSIGNALEN @Bit 12 : IBI Updated Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_IBIUPDATEDSIGNALEN_Pos (12UL) /*!< Position of IBIUPDATEDSIGNALEN field.                   */
  #define I3CCORE_CORE_INTRSIGNALEN_IBIUPDATEDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_IBIUPDATEDSIGNALEN_Pos) /*!< Bit
                                                                            mask of IBIUPDATEDSIGNALEN field.*/

/* BUSOWNERUPDATEDSIGNALEN @Bit 13 : Bus owner Updated Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_BUSOWNERUPDATEDSIGNALEN_Pos (13UL) /*!< Position of BUSOWNERUPDATEDSIGNALEN field.         */
  #define I3CCORE_CORE_INTRSIGNALEN_BUSOWNERUPDATEDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_BUSOWNERUPDATEDSIGNALEN_Pos)
                                                                            /*!< Bit mask of BUSOWNERUPDATEDSIGNALEN field.*/

/* BUSRESETDONESIGNALEN @Bit 15 : Bus Reset Pattern Generation Done Signal Enable. */
  #define I3CCORE_CORE_INTRSIGNALEN_BUSRESETDONESIGNALEN_Pos (15UL) /*!< Position of BUSRESETDONESIGNALEN field.               */
  #define I3CCORE_CORE_INTRSIGNALEN_BUSRESETDONESIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_BUSRESETDONESIGNALEN_Pos) /*!<
                                                                            Bit mask of BUSRESETDONESIGNALEN field.*/


/* I3CCORE_CORE_INTRFORCE: Interrupt Force Enable Register */
  #define I3CCORE_CORE_INTRFORCE_ResetValue (0x00000000UL) /*!< Reset value of INTRFORCE register.                             */

/* TXTHLDFORCEEN @Bit 0 : Transmit Buffer Threshold Force Enable */
  #define I3CCORE_CORE_INTRFORCE_TXTHLDFORCEEN_Pos (0UL) /*!< Position of TXTHLDFORCEEN field.                                 */
  #define I3CCORE_CORE_INTRFORCE_TXTHLDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_TXTHLDFORCEEN_Pos) /*!< Bit mask of
                                                                            TXTHLDFORCEEN field.*/

/* RXTHLDFORCEEN @Bit 1 : Receive Buffer Threshold Force Enable */
  #define I3CCORE_CORE_INTRFORCE_RXTHLDFORCEEN_Pos (1UL) /*!< Position of RXTHLDFORCEEN field.                                 */
  #define I3CCORE_CORE_INTRFORCE_RXTHLDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_RXTHLDFORCEEN_Pos) /*!< Bit mask of
                                                                            RXTHLDFORCEEN field.*/

/* IBITHLDFORCEEN @Bit 2 : IBI Buffer Threshold Force Enable */
  #define I3CCORE_CORE_INTRFORCE_IBITHLDFORCEEN_Pos (2UL) /*!< Position of IBITHLDFORCEEN field.                               */
  #define I3CCORE_CORE_INTRFORCE_IBITHLDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_IBITHLDFORCEEN_Pos) /*!< Bit mask of
                                                                            IBITHLDFORCEEN field.*/

/* CMDQUEUEREADYFORCEEN @Bit 3 : Command Queue Ready Force Enable */
  #define I3CCORE_CORE_INTRFORCE_CMDQUEUEREADYFORCEEN_Pos (3UL) /*!< Position of CMDQUEUEREADYFORCEEN field.                   */
  #define I3CCORE_CORE_INTRFORCE_CMDQUEUEREADYFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_CMDQUEUEREADYFORCEEN_Pos) /*!< Bit
                                                                            mask of CMDQUEUEREADYFORCEEN field.*/

/* RESPREADYFORCEEN @Bit 4 : Response Queue Ready Force Enable */
  #define I3CCORE_CORE_INTRFORCE_RESPREADYFORCEEN_Pos (4UL) /*!< Position of RESPREADYFORCEEN field.                           */
  #define I3CCORE_CORE_INTRFORCE_RESPREADYFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_RESPREADYFORCEEN_Pos) /*!< Bit mask of
                                                                            RESPREADYFORCEEN field.*/

