adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RESPBUFSIZE @Bits 12..15 : Response Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Pos (12UL) /*!< Position of RESPBUFSIZE field.                          */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Pos) /*!< Bit
                                                                            mask of RESPBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Min (0x0UL) /*!< Min enumerator value of RESPBUFSIZE field.             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Max (0x3UL) /*!< Max enumerator value of RESPBUFSIZE field.             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                          */

/* IBIBUFSIZE @Bits 16..19 : IBI Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Pos (16UL) /*!< Position of IBIBUFSIZE field.                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Pos) /*!< Bit
                                                                            mask of IBIBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Min (0x0UL) /*!< Min enumerator value of IBIBUFSIZE field.               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Max (0x3UL) /*!< Max enumerator value of IBIBUFSIZE field.               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                           */


/* I3CCORE_CORE_SECDEVCHARTABLE: Secondary Master Device Characteristic Table Location of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_MaxCount (32UL) /*!< Max size of SECDEVCHARTABLE[32] array.                             */
  #define I3CCORE_CORE_SECDEVCHARTABLE_MaxIndex (31UL) /*!< Max index of SECDEVCHARTABLE[32] array.                            */
  #define I3CCORE_CORE_SECDEVCHARTABLE_MinIndex (0UL) /*!< Min index of SECDEVCHARTABLE[32] array.                             */
  #define I3CCORE_CORE_SECDEVCHARTABLE_ResetValue (0x00000000UL) /*!< Reset value of SECDEVCHARTABLE[32] register.             */

/* DYNAMICADDR @Bits 0..7 : The Dynamic Addr of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Pos (0UL) /*!< Position of DYNAMICADDR field.                               */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Pos) /*!< Bit mask of
                                                                            DYNAMICADDR field.*/

/* DCRTYPE @Bits 8..15 : The DCR TYPE of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Pos (8UL) /*!< Position of DCRTYPE field.                                       */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Pos) /*!< Bit mask of DCRTYPE
                                                                            field.*/

/* BCRTYPE @Bits 16..23 : The BCR TYPE of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Pos (16UL) /*!< Position of BCRTYPE field.                                      */
  #define I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Pos) /*!< Bit mask of BCRTYPE
                                                                            field.*/

/* STATICADDR @Bits 24..31 : The Static Addr of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Pos (24UL) /*!< Position of STATICADDR field.                                */
  #define I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Pos) /*!< Bit mask of
                                                                            STATICADDR field.*/


/* I3CCORE_CORE_DEVADDRTABLELOC: Device Address Table of Device [n] */
  #define I3CCORE_CORE_DEVADDRTABLELOC_MaxCount (10UL) /*!< Max size of DEVADDRTABLELOC[10] array.                             */
  #define I3CCORE_CORE_DEVADDRTABLELOC_MaxIndex (9UL) /*!< Max index of DEVADDRTABLELOC[10] array.                             */
  #define I3CCORE_CORE_DEVADDRTABLELOC_MinIndex (0UL) /*!< Min index of DEVADDRTABLELOC[10] array.                             */
  #define I3CCORE_CORE_DEVADDRTABLELOC_ResetValue (0x00000000UL) /*!< Reset value of DEVADDRTABLELOC[10] register.             */

/* DEVSTATICADDR @Bits 0..6 : Device Static Address. */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVSTATICADDR_Pos (0UL) /*!< Position of DEVSTATICADDR field.                           */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVSTATICADDR_Msk (0x7FUL << I3CCORE_CORE_DEVADDRTABLELOC_DEVSTATICADDR_Pos) /*!< Bit
                                                                            mask of DEVSTATICADDR field.*/

/* DEVDYNAMICADDR @Bits 16..23 : Device Dynamic Address with parity. */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVDYNAMICADDR_Pos (16UL) /*!< Position of DEVDYNAMICADDR field.                        */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVDYNAMICADDR_Msk (0xFFUL << I3CCORE_CORE_DEVADDRTABLELOC_DEVDYNAMICADDR_Pos) /*!< Bit
                                                                            mask of DEVDYNAMICADDR field.*/

