adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DEVNACKRETRYCNT @Bits 29..30 : This field is used to set the Device NACK Retry count for the particular device. */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVNACKRETRYCNT_Pos (29UL) /*!< Position of DEVNACKRETRYCNT field.                      */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVNACKRETRYCNT_Msk (0x3UL << I3CCORE_CORE_DEVADDRTABLELOC_DEVNACKRETRYCNT_Pos) /*!< Bit
                                                                            mask of DEVNACKRETRYCNT field.*/

/* LEGACYI2CDEVICE @Bit 31 : Legacy I2C device or not. */
  #define I3CCORE_CORE_DEVADDRTABLELOC_LEGACYI2CDEVICE_Pos (31UL) /*!< Position of LEGACYI2CDEVICE field.                      */
  #define I3CCORE_CORE_DEVADDRTABLELOC_LEGACYI2CDEVICE_Msk (0x1UL << I3CCORE_CORE_DEVADDRTABLELOC_LEGACYI2CDEVICE_Pos) /*!< Bit
                                                                            mask of LEGACYI2CDEVICE field.*/



/* ================================================= Struct I3CCORE_DMA_CH0 ================================================== */
/**
  * @brief CH0 [I3CCORE_DMA_CH0] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SAR0;                              /*!< (@ 0x00000000) This register contains the source address of the DMA
                                                                         transfer.*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DAR0;                              /*!< (@ 0x00000008) This register contains the destination address of the
                                                                         DMA transfer.*/
  __IM  uint32_t  RESERVED1[3];
  __IOM uint32_t  CTL00;                             /*!< (@ 0x00000018) This register contains fields that control the DMA
                                                                         transfer.*/
  __IOM uint32_t  CTL01;                             /*!< (@ 0x0000001C) This register contains fields that control the DMA
                                                                         transfer.*/
  __IM  uint32_t  RESERVED2[8];
  __IOM uint32_t  CFG0L;                             /*!< (@ 0x00000040) This register contains fields that configure the DMA
                                                                         transfer.*/
  __IOM uint32_t  CFG0H;                             /*!< (@ 0x00000044) This register contains fields that configure the DMA
                                                                         transfer.*/
  __IM  uint32_t  RESERVED3[2];
  __IOM uint32_t  DSR0;                              /*!< (@ 0x00000050) Destination Scatter register.                         */
} NRF_I3CCORE_DMA_CH0_Type;                          /*!< Size = 84 (0x054)                                                    */

/* I3CCORE_DMA_CH0_SAR0: This register contains the source address of the DMA transfer. */
  #define I3CCORE_DMA_CH0_SAR0_ResetValue (0x00000000UL) /*!< Reset value of SAR0 register.                                    */

/* SAR @Bits 0..31 : Current Source Address of DMA transfer. */
  #define I3CCORE_DMA_CH0_SAR0_SAR_Pos (0UL)         /*!< Position of SAR field.                                               */
  #define I3CCORE_DMA_CH0_SAR0_SAR_Msk (0xFFFFFFFFUL << I3CCORE_DMA_CH0_SAR0_SAR_Pos) /*!< Bit mask of SAR field.              */


/* I3CCORE_DMA_CH0_DAR0: This register contains the destination address of the DMA transfer. */
  #define I3CCORE_DMA_CH0_DAR0_ResetValue (0x00000000UL) /*!< Reset value of DAR0 register.                                    */

/* DAR @Bits 0..31 : Current Destination address of DMA transfer. */
  #define I3CCORE_DMA_CH0_DAR0_DAR_Pos (0UL)         /*!< Position of DAR field.                                               */
  #define I3CCORE_DMA_CH0_DAR0_DAR_Msk (0xFFFFFFFFUL << I3CCORE_DMA_CH0_DAR0_DAR_Pos) /*!< Bit mask of DAR field.              */


/* I3CCORE_DMA_CH0_CTL00: This register contains fields that control the DMA transfer. */
  #define I3CCORE_DMA_CH0_CTL00_ResetValue (0x02504821UL) /*!< Reset value of CTL00 register.                                  */

/* INTEN @Bit 0 : Interrupt Enable Bit. */
  #define I3CCORE_DMA_CH0_CTL00_INTEN_Pos (0UL)      /*!< Position of INTEN field.                                             */
  #define I3CCORE_DMA_CH0_CTL00_INTEN_Msk (0x1UL << I3CCORE_DMA_CH0_CTL00_INTEN_Pos) /*!< Bit mask of INTEN field.             */
  #define I3CCORE_DMA_CH0_CTL00_INTEN_Min (0x0UL)    /*!< Min enumerator value of INTEN field.                                 */
  #define I3CCORE_DMA_CH0_CTL00_INTEN_Max (0x1UL)    /*!< Max enumerator value of INTEN field.                                 */
  #define I3CCORE_DMA_CH0_CTL00_INTEN_INTERRUPT_DISABLE (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_CH0_CTL00_INTEN_INTERRUPT_ENABLE (0x1UL) /*!< (unspecified)                                              */

/* DSTTRWIDTH @Bits 1..3 : Destination Transfer Width. */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_Pos (1UL) /*!< Position of DSTTRWIDTH field.                                        */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_Msk (0x7UL << I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_Pos) /*!< Bit mask of DSTTRWIDTH
                                                                            field.*/
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_Min (0x0UL) /*!< Min enumerator value of DSTTRWIDTH field.                          */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_Max (0x7UL) /*!< Max enumerator value of DSTTRWIDTH field.                          */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_DST_TR_WIDTH_0 (0x0UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_DST_TR_WIDTH_1 (0x1UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_DST_TR_WIDTH_2 (0x2UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_DST_TR_WIDTH_3 (0x3UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_DST_TR_WIDTH_4 (0x4UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_DST_TR_WIDTH_5 (0x5UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_DST_TR_WIDTH_6 (0x6UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH0_CTL00_DSTTRWIDTH_DST_TR_WIDTH_7 (0x7UL) /*!< (unspecified)                                           */

/* RSVDSRCTRWIDTH @Bits 4..6 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL00_RSVDSRCTRWIDTH_Pos (4UL) /*!< Position of RSVDSRCTRWIDTH field.                                */
  #define I3CCORE_DMA_CH0_CTL00_RSVDSRCTRWIDTH_Msk (0x7UL << I3CCORE_DMA_CH0_CTL00_RSVDSRCTRWIDTH_Pos) /*!< Bit mask of
                                                                            RSVDSRCTRWIDTH field.*/

/* DINC @Bits 7..8 : Destination Address Increment. */
  #define I3CCORE_DMA_CH0_CTL00_DINC_Pos (7UL)       /*!< Position of DINC field.                                              */
  #define I3CCORE_DMA_CH0_CTL00_DINC_Msk (0x3UL << I3CCORE_DMA_CH0_CTL00_DINC_Pos) /*!< Bit mask of DINC field.                */
  #define I3CCORE_DMA_CH0_CTL00_DINC_Min (0x0UL)     /*!< Min enumerator value of DINC field.                                  */
  #define I3CCORE_DMA_CH0_CTL00_DINC_Max (0x3UL)     /*!< Max enumerator value of DINC field.                                  */
  #define I3CCORE_DMA_CH0_CTL00_DINC_DINC_0 (0x0UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH0_CTL00_DINC_DINC_1 (0x1UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH0_CTL00_DINC_DINC_2 (0x2UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH0_CTL00_DINC_DINC_3 (0x3UL)  /*!< (unspecified)                                                        */

/* SINC @Bits 9..10 : Source Address Increment. */
  #define I3CCORE_DMA_CH0_CTL00_SINC_Pos (9UL)       /*!< Position of SINC field.                                              */
  #define I3CCORE_DMA_CH0_CTL00_SINC_Msk (0x3UL << I3CCORE_DMA_CH0_CTL00_SINC_Pos) /*!< Bit mask of SINC field.                */
  #define I3CCORE_DMA_CH0_CTL00_SINC_Min (0x0UL)     /*!< Min enumerator value of SINC field.                                  */
  #define I3CCORE_DMA_CH0_CTL00_SINC_Max (0x3UL)     /*!< Max enumerator value of SINC field.                                  */
  #define I3CCORE_DMA_CH0_CTL00_SINC_SINC_0 (0x0UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH0_CTL00_SINC_SINC_1 (0x1UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH0_CTL00_SINC_SINC_2 (0x2UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH0_CTL00_SINC_SINC_3 (0x3UL)  /*!< (unspecified)                                                        */

/* DESTMSIZE @Bits 11..13 : Destination Burst Transaction Length. */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_Pos (11UL) /*!< Position of DESTMSIZE field.                                         */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_Msk (0x7UL << I3CCORE_DMA_CH0_CTL00_DESTMSIZE_Pos) /*!< Bit mask of DESTMSIZE field. */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_Min (0x0UL) /*!< Min enumerator value of DESTMSIZE field.                            */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_Max (0x7UL) /*!< Max enumerator value of DESTMSIZE field.                            */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_DEST_MSIZE_0 (0x0UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_DEST_MSIZE_1 (0x1UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_DEST_MSIZE_2 (0x2UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_DEST_MSIZE_3 (0x3UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_DEST_MSIZE_4 (0x4UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_DEST_MSIZE_5 (0x5UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_DEST_MSIZE_6 (0x6UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH0_CTL00_DESTMSIZE_DEST_MSIZE_7 (0x7UL) /*!< (unspecified)                                              */

/* SRCMSIZE @Bits 14..16 : Source Burst Transaction Length. */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_Pos (14UL)  /*!< Position of SRCMSIZE field.                                          */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_Msk (0x7UL << I3CCORE_DMA_CH0_CTL00_SRCMSIZE_Pos) /*!< Bit mask of SRCMSIZE field.    */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_Min (0x0UL) /*!< Min enumerator value of SRCMSIZE field.                              */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_Max (0x7UL) /*!< Max enumerator value of SRCMSIZE field.                              */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_SRC_MSIZE_0 (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_SRC_MSIZE_1 (0x1UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_SRC_MSIZE_2 (0x2UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_SRC_MSIZE_3 (0x3UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_SRC_MSIZE_4 (0x4UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_SRC_MSIZE_5 (0x5UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_SRC_MSIZE_6 (0x6UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CTL00_SRCMSIZE_SRC_MSIZE_7 (0x7UL) /*!< (unspecified)                                                */

/* RSVDSRCGATHEREN @Bit 17 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL00_RSVDSRCGATHEREN_Pos (17UL) /*!< Position of RSVDSRCGATHEREN field.                             */
  #define I3CCORE_DMA_CH0_CTL00_RSVDSRCGATHEREN_Msk (0x1UL << I3CCORE_DMA_CH0_CTL00_RSVDSRCGATHEREN_Pos) /*!< Bit mask of
                                                                            RSVDSRCGATHEREN field.*/

