adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SRCHSPOL @Bit 19 : Source Handshaking Interface Polarity. */
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Pos (19UL)  /*!< Position of SRCHSPOL field.                                          */
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Pos) /*!< Bit mask of SRCHSPOL field.    */
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Min (0x0UL) /*!< Min enumerator value of SRCHSPOL field.                              */
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Max (0x1UL) /*!< Max enumerator value of SRCHSPOL field.                              */
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_ACTIVE_HIGH (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_ACTIVE_LOW (0x1UL) /*!< (unspecified)                                                 */

/* MAXABRST @Bits 20..29 : Maximum AMBA Burst Length. */
  #define I3CCORE_DMA_CH0_CFG0L_MAXABRST_Pos (20UL)  /*!< Position of MAXABRST field.                                          */
  #define I3CCORE_DMA_CH0_CFG0L_MAXABRST_Msk (0x3FFUL << I3CCORE_DMA_CH0_CFG0L_MAXABRST_Pos) /*!< Bit mask of MAXABRST field.  */

/* RSVDRELOADSRC @Bit 30 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDRELOADSRC_Pos (30UL) /*!< Position of RSVDRELOADSRC field.                                 */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDRELOADSRC_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_RSVDRELOADSRC_Pos) /*!< Bit mask of
                                                                            RSVDRELOADSRC field.*/

/* RSVDRELOADDST @Bit 31 : Reserved field- read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDRELOADDST_Pos (31UL) /*!< Position of RSVDRELOADDST field.                                 */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDRELOADDST_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_RSVDRELOADDST_Pos) /*!< Bit mask of
                                                                            RSVDRELOADDST field.*/


/* I3CCORE_DMA_CH0_CFG0H: This register contains fields that configure the DMA transfer. */
  #define I3CCORE_DMA_CH0_CFG0H_ResetValue (0x00000004UL) /*!< Reset value of CFG0H register.                                  */

/* FCMODE @Bit 0 : Flow Control Mode. */
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_Pos (0UL)     /*!< Position of FCMODE field.                                            */
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_FCMODE_Pos) /*!< Bit mask of FCMODE field.          */
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_Min (0x0UL)   /*!< Min enumerator value of FCMODE field.                                */
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_Max (0x1UL)   /*!< Max enumerator value of FCMODE field.                                */
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_FCMODE_0 (0x0UL) /*!< (unspecified)                                                     */
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_FCMODE_1 (0x1UL) /*!< (unspecified)                                                     */

/* FIFOMODE @Bit 1 : FIFO Mode Select. */
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Pos (1UL)   /*!< Position of FIFOMODE field.                                          */
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Pos) /*!< Bit mask of FIFOMODE field.    */
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Min (0x0UL) /*!< Min enumerator value of FIFOMODE field.                              */
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Max (0x1UL) /*!< Max enumerator value of FIFOMODE field.                              */
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_FIFO_MODE_0 (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_FIFO_MODE_1 (0x1UL) /*!< (unspecified)                                                */

/* PROTCTL @Bits 2..4 : Protection Control bits used to drive the AHB HPROT[3:1] bus. */
  #define I3CCORE_DMA_CH0_CFG0H_PROTCTL_Pos (2UL)    /*!< Position of PROTCTL field.                                           */
  #define I3CCORE_DMA_CH0_CFG0H_PROTCTL_Msk (0x7UL << I3CCORE_DMA_CH0_CFG0H_PROTCTL_Pos) /*!< Bit mask of PROTCTL field.       */

/* RSVDDSUPDEN @Bit 5 : Reserved field- read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVDDSUPDEN_Pos (5UL) /*!< Position of RSVDDSUPDEN field.                                      */
  #define I3CCORE_DMA_CH0_CFG0H_RSVDDSUPDEN_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_RSVDDSUPDEN_Pos) /*!< Bit mask of RSVDDSUPDEN
                                                                            field.*/

/* RSVDSSUPDEN @Bit 6 : Reserved field- read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVDSSUPDEN_Pos (6UL) /*!< Position of RSVDSSUPDEN field.                                      */
  #define I3CCORE_DMA_CH0_CFG0H_RSVDSSUPDEN_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_RSVDSSUPDEN_Pos) /*!< Bit mask of RSVDSSUPDEN
                                                                            field.*/

/* SRCPER @Bit 7 : Source Hardware Interface. */
  #define I3CCORE_DMA_CH0_CFG0H_SRCPER_Pos (7UL)     /*!< Position of SRCPER field.                                            */
  #define I3CCORE_DMA_CH0_CFG0H_SRCPER_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_SRCPER_Pos) /*!< Bit mask of SRCPER field.          */

/* RSVD1CFG @Bits 8..10 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD1CFG_Pos (8UL)   /*!< Position of RSVD1CFG field.                                          */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD1CFG_Msk (0x7UL << I3CCORE_DMA_CH0_CFG0H_RSVD1CFG_Pos) /*!< Bit mask of RSVD1CFG field.    */

/* DESTPER @Bit 11 : Destination hardware interface. */
  #define I3CCORE_DMA_CH0_CFG0H_DESTPER_Pos (11UL)   /*!< Position of DESTPER field.                                           */
  #define I3CCORE_DMA_CH0_CFG0H_DESTPER_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_DESTPER_Pos) /*!< Bit mask of DESTPER field.       */

/* RSVD2CFG @Bits 12..14 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD2CFG_Pos (12UL)  /*!< Position of RSVD2CFG field.                                          */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD2CFG_Msk (0x7UL << I3CCORE_DMA_CH0_CFG0H_RSVD2CFG_Pos) /*!< Bit mask of RSVD2CFG field.    */

