adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HSSELDST @Bit 10 : Destination Software or Hardware Handshaking Select. */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Pos (10UL)  /*!< Position of HSSELDST field.                                          */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_HSSELDST_Pos) /*!< Bit mask of HSSELDST field.    */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Min (0x0UL) /*!< Min enumerator value of HSSELDST field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Max (0x1UL) /*!< Max enumerator value of HSSELDST field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_HARDWARE_HS (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_SOFTWARE_HS (0x1UL) /*!< (unspecified)                                                */

/* HSSELSRC @Bit 11 : Source Software or Hardware Handshaking Select. */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Pos (11UL)  /*!< Position of HSSELSRC field.                                          */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Pos) /*!< Bit mask of HSSELSRC field.    */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Min (0x0UL) /*!< Min enumerator value of HSSELSRC field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Max (0x1UL) /*!< Max enumerator value of HSSELSRC field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_HARDWARE_HS (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_SOFTWARE_HS (0x1UL) /*!< (unspecified)                                                */

/* RSVDLOCKCHL @Bits 12..13 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Pos (12UL) /*!< Position of RSVDLOCKCHL field.                                     */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Msk (0x3UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Pos) /*!< Bit mask of RSVDLOCKCHL
                                                                            field.*/

/* RSVDLOCKBL @Bits 14..15 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Pos (14UL) /*!< Position of RSVDLOCKBL field.                                       */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Msk (0x3UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Pos) /*!< Bit mask of RSVDLOCKBL
                                                                            field.*/

/* RSVDLOCKCH @Bit 16 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Pos (16UL) /*!< Position of RSVDLOCKCH field.                                       */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Pos) /*!< Bit mask of RSVDLOCKCH
                                                                            field.*/

/* RSVDLOCKB @Bit 17 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Pos (17UL) /*!< Position of RSVDLOCKB field.                                         */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Pos) /*!< Bit mask of RSVDLOCKB field. */

/* DSTHSPOL @Bit 18 : Destination Handshaking Interface Polarity. */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Pos (18UL)  /*!< Position of DSTHSPOL field.                                          */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Pos) /*!< Bit mask of DSTHSPOL field.    */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Min (0x0UL) /*!< Min enumerator value of DSTHSPOL field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Max (0x1UL) /*!< Max enumerator value of DSTHSPOL field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_ACTIVE_HIGH (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_ACTIVE_LOW (0x1UL) /*!< (unspecified)                                                 */

/* SRCHSPOL @Bit 19 : Source Handshaking Interface Polarity. */
  #define I3CCORE_DMA_CH1_CFG1L_SRCHSPOL_Pos (19UL)  /*!< Position of SRCHSPOL field.                                          */
  #define I3CCORE_DMA_CH1_CFG1L_SRCHSPOL_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_SRCHSPOL_Pos) /*!< Bit mask of SRCHSPOL field.    */
  #define I3CCORE_DMA_CH1_CFG1L_SRCHSPOL_Min (0x0UL) /*!< Min enumerator value of SRCHSPOL field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_SRCHSPOL_Max (0x1UL) /*!< Max enumerator value of SRCHSPOL field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_SRCHSPOL_ACTIVE_HIGH (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1L_SRCHSPOL_ACTIVE_LOW (0x1UL) /*!< (unspecified)                                                 */

/* MAXABRST @Bits 20..29 : Maximum AMBA Burst Length. */
  #define I3CCORE_DMA_CH1_CFG1L_MAXABRST_Pos (20UL)  /*!< Position of MAXABRST field.                                          */
  #define I3CCORE_DMA_CH1_CFG1L_MAXABRST_Msk (0x3FFUL << I3CCORE_DMA_CH1_CFG1L_MAXABRST_Pos) /*!< Bit mask of MAXABRST field.  */

/* RSVDRELOADSRC @Bit 30 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDRELOADSRC_Pos (30UL) /*!< Position of RSVDRELOADSRC field.                                 */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDRELOADSRC_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_RSVDRELOADSRC_Pos) /*!< Bit mask of
                                                                            RSVDRELOADSRC field.*/

/* RSVDRELOADDST @Bit 31 : Reserved field- read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDRELOADDST_Pos (31UL) /*!< Position of RSVDRELOADDST field.                                 */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDRELOADDST_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_RSVDRELOADDST_Pos) /*!< Bit mask of
                                                                            RSVDRELOADDST field.*/


