adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STATUS @Bits 0..1 : Status for IntDstTran Interrupt */
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Pos (0UL) /*!< Position of STATUS field.                                        */
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Pos) /*!< Bit mask of STATUS
                                                                            field.*/
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Min (0x0UL) /*!< Min enumerator value of STATUS field.                          */
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Max (0x1UL) /*!< Max enumerator value of STATUS field.                          */
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_INACTIVE (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_ACTIVE (0x1UL) /*!< (unspecified)                                               */


/* I3CCORE_DMA_INT_STATUSERR: Channel Error interrupt event from all channels is stored in this Interrupt Status register after
                               masking. */

  #define I3CCORE_DMA_INT_STATUSERR_ResetValue (0x00000000UL) /*!< Reset value of STATUSERR register.                          */

/* STATUS @Bits 0..1 : Status for IntErr Interrupt */
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_Pos (0UL) /*!< Position of STATUS field.                                            */
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSERR_STATUS_Pos) /*!< Bit mask of STATUS field.  */
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_Min (0x0UL) /*!< Min enumerator value of STATUS field.                              */
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_Max (0x1UL) /*!< Max enumerator value of STATUS field.                              */
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */


/* I3CCORE_DMA_INT_MASKTFR: The contents of the Raw Status register RawTfr is masked with the contents of the Mask register
                             MaskTfr. */

  #define I3CCORE_DMA_INT_MASKTFR_ResetValue (0x00000000UL) /*!< Reset value of MASKTFR register.                              */

/* INTMASK @Bits 0..1 : Mask for IntTfr Interrupt */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_Pos (0UL)  /*!< Position of INTMASK field.                                           */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKTFR_INTMASK_Pos) /*!< Bit mask of INTMASK field.   */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_Min (0x0UL) /*!< Min enumerator value of INTMASK field.                              */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_Max (0x1UL) /*!< Max enumerator value of INTMASK field.                              */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_MASK (0x0UL) /*!< (unspecified)                                                      */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_UNMASK (0x1UL) /*!< (unspecified)                                                    */

/* RSVDMASKTFR @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_INT_MASKTFR_RSVDMASKTFR_Pos (2UL) /*!< Position of RSVDMASKTFR field.                                    */
  #define I3CCORE_DMA_INT_MASKTFR_RSVDMASKTFR_Msk (0x3FUL << I3CCORE_DMA_INT_MASKTFR_RSVDMASKTFR_Pos) /*!< Bit mask of
                                                                            RSVDMASKTFR field.*/

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Pos (8UL) /*!< Position of INTMASKWE field.                                        */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Pos) /*!< Bit mask of INTMASKWE
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Min (0x0UL) /*!< Min enumerator value of INTMASKWE field.                          */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Max (0x1UL) /*!< Max enumerator value of INTMASKWE field.                          */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_DISABLED (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_ENABLED (0x1UL) /*!< (unspecified)                                                 */


/* I3CCORE_DMA_INT_MASKBLOCK: The contents of the Raw Status register RawBlock is masked with the contents of the Mask register
                               MaskBlock. */

  #define I3CCORE_DMA_INT_MASKBLOCK_ResetValue (0x00000000UL) /*!< Reset value of MASKBLOCK register.                          */

/* INTMASK @Bits 0..1 : Mask for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Pos (0UL) /*!< Position of INTMASK field.                                          */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Pos) /*!< Bit mask of INTMASK
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Min (0x0UL) /*!< Min enumerator value of INTMASK field.                            */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Max (0x1UL) /*!< Max enumerator value of INTMASK field.                            */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_MASK (0x0UL) /*!< (unspecified)                                                    */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_UNMASK (0x1UL) /*!< (unspecified)                                                  */

/* RSVDMASKBLOCK @Bits 2..7 : Reserved field- read-only */
  #define I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Pos (2UL) /*!< Position of RSVDMASKBLOCK field.                              */
  #define I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Msk (0x3FUL << I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Pos) /*!< Bit mask of
                                                                            RSVDMASKBLOCK field.*/

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Pos (8UL) /*!< Position of INTMASKWE field.                                      */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Pos) /*!< Bit mask of INTMASKWE
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Min (0x0UL) /*!< Min enumerator value of INTMASKWE field.                        */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Max (0x1UL) /*!< Max enumerator value of INTMASKWE field.                        */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_DISABLED (0x0UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_ENABLED (0x1UL) /*!< (unspecified)                                               */


/* I3CCORE_DMA_INT_MASKSRCTRAN: The contents of the Raw Status register RawSrcTran is masked with the contents of the Mask
                                 register MaskSrcTran. */

