adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHEN @Bits 0..1 : Channel Enable. */
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_Pos (0UL)    /*!< Position of CHEN field.                                              */
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_Msk (0x3UL << I3CCORE_DMA_MISC_CHENREG_CHEN_Pos) /*!< Bit mask of CHEN field.          */
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_Min (0x0UL)  /*!< Min enumerator value of CHEN field.                                  */
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_Max (0x1UL)  /*!< Max enumerator value of CHEN field.                                  */
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_DISABLED (0x0UL) /*!< (unspecified)                                                    */
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_ENABLED (0x1UL) /*!< (unspecified)                                                     */

/* RSVDCHENREG @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_MISC_CHENREG_RSVDCHENREG_Pos (2UL) /*!< Position of RSVDCHENREG field.                                   */
  #define I3CCORE_DMA_MISC_CHENREG_RSVDCHENREG_Msk (0x3FUL << I3CCORE_DMA_MISC_CHENREG_RSVDCHENREG_Pos) /*!< Bit mask of
                                                                            RSVDCHENREG field.*/

/* CHENWE @Bits 8..9 : Channel enable register */
  #define I3CCORE_DMA_MISC_CHENREG_CHENWE_Pos (8UL)  /*!< Position of CHENWE field.                                            */
  #define I3CCORE_DMA_MISC_CHENREG_CHENWE_Msk (0x3UL << I3CCORE_DMA_MISC_CHENREG_CHENWE_Pos) /*!< Bit mask of CHENWE field.    */


/* I3CCORE_DMA_MISC_DMAIDREG: This is the DW_ahb_dmac ID register, which is a read-only register that reads back the
                               coreConsultant-configured hardcoded ID number, DMAH_ID_NUM. */

  #define I3CCORE_DMA_MISC_DMAIDREG_ResetValue (0x00000000UL) /*!< Reset value of DMAIDREG register.                           */

/* DMAID @Bits 0..31 : Hardcoded DW_ahb_dmac peripheral ID. */
  #define I3CCORE_DMA_MISC_DMAIDREG_DMAID_Pos (0UL)  /*!< Position of DMAID field.                                             */
  #define I3CCORE_DMA_MISC_DMAIDREG_DMAID_Msk (0xFFFFFFFFUL << I3CCORE_DMA_MISC_DMAIDREG_DMAID_Pos) /*!< Bit mask of DMAID
                                                                            field.*/


/* I3CCORE_DMA_MISC_DMATESTREG: This register is used to put the AHB slave interface into test mode, during which the readback
                                 value of the writable registers match the value written, assuming the DW_ahb_dmac configuration
                                 has not optimized the same registers. */

  #define I3CCORE_DMA_MISC_DMATESTREG_ResetValue (0x00000000UL) /*!< Reset value of DMATESTREG register.                       */

/* TESTSLVIF @Bit 0 : DMA Test register */
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Pos (0UL) /*!< Position of TESTSLVIF field.                                    */
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Msk (0x1UL << I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Pos) /*!< Bit mask of
                                                                            TESTSLVIF field.*/
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Min (0x0UL) /*!< Min enumerator value of TESTSLVIF field.                      */
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Max (0x1UL) /*!< Max enumerator value of TESTSLVIF field.                      */
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_NORMAL_MODE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_TEST_MODE (0x1UL) /*!< (unspecified)                                           */


/* I3CCORE_DMA_MISC_DMALPTIMEOUTREG: This register holds the timeout value of Low Power Counter. */
  #define I3CCORE_DMA_MISC_DMALPTIMEOUTREG_ResetValue (0x00000008UL) /*!< Reset value of DMALPTIMEOUTREG register.             */

/* DMALPTIMEOUT @Bits 0..3 : This field holds timeout value of low power counter register. */
  #define I3CCORE_DMA_MISC_DMALPTIMEOUTREG_DMALPTIMEOUT_Pos (0UL) /*!< Position of DMALPTIMEOUT field.                         */
  #define I3CCORE_DMA_MISC_DMALPTIMEOUTREG_DMALPTIMEOUT_Msk (0xFUL << I3CCORE_DMA_MISC_DMALPTIMEOUTREG_DMALPTIMEOUT_Pos) /*!<
                                                                            Bit mask of DMALPTIMEOUT field.*/


/* I3CCORE_DMA_MISC_DMACOMPPARAMS6L: DMA_COMP_PARAMS_6L is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 7. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_ResetValue (0x00000000UL) /*!< Reset value of DMACOMPPARAMS6L register.             */

/* CH7DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH7_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Pos (0UL) /*!< Position of CH7DTW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Pos) /*!< Bit mask of
                                                                            CH7DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Min (0x0UL) /*!< Min enumerator value of CH7DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Max (0x6UL) /*!< Max enumerator value of CH7DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_NO_HARDCODE (0x0UL) /*!< (unspecified)                                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_8 (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_16 (0x2UL) /*!< (unspecified)                                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_32 (0x3UL) /*!< (unspecified)                                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_64 (0x4UL) /*!< (unspecified)                                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_128 (0x5UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_256 (0x6UL) /*!< (unspecified)                                           */

/* CH7STW @Bits 3..5 : The value of this register is derived from the DMAH_CH7_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Pos (3UL) /*!< Position of CH7STW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Pos) /*!< Bit mask of
                                                                            CH7STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Min (0x0UL) /*!< Min enumerator value of CH7STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Max (0x6UL) /*!< Max enumerator value of CH7STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_NO_HARDCODE (0x0UL) /*!< (unspecified)                                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_8 (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_16 (0x2UL) /*!< (unspecified)                                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_32 (0x3UL) /*!< (unspecified)                                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_64 (0x4UL) /*!< (unspecified)                                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_128 (0x5UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_256 (0x6UL) /*!< (unspecified)                                           */

/* CH7STATDST @Bit 6 : The value of this register is derived from the DMAH_CH7_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Pos (6UL) /*!< Position of CH7STATDST field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Pos) /*!< Bit
                                                                            mask of CH7STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Min (0x0UL) /*!< Min enumerator value of CH7STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Max (0x1UL) /*!< Max enumerator value of CH7STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH7STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH7_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Pos (7UL) /*!< Position of CH7STATSRC field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Pos) /*!< Bit
                                                                            mask of CH7STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Min (0x0UL) /*!< Min enumerator value of CH7STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Max (0x1UL) /*!< Max enumerator value of CH7STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH7DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH7_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Pos (8UL) /*!< Position of CH7DSTSCAEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH7DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Min (0x0UL) /*!< Min enumerator value of CH7DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Max (0x1UL) /*!< Max enumerator value of CH7DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH7SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH7_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Pos (9UL) /*!< Position of CH7SRCGATEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH7SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Min (0x0UL) /*!< Min enumerator value of CH7SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Max (0x1UL) /*!< Max enumerator value of CH7SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_TRUE (0x1UL) /*!< (unspecified)                                         */

