adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH5LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH5_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Pos (10UL) /*!< Position of CH5LOCKEN field.                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Pos) /*!< Bit mask
                                                                            of CH5LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Min (0x0UL) /*!< Min enumerator value of CH5LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Max (0x1UL) /*!< Max enumerator value of CH5LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_FALSE (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_TRUE (0x1UL) /*!< (unspecified)                                           */

/* CH5MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH5_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Pos (11UL) /*!< Position of CH5MULTIBLKEN field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH5MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Min (0x0UL) /*!< Min enumerator value of CH5MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Max (0x1UL) /*!< Max enumerator value of CH5MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_FALSE (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_TRUE (0x1UL) /*!< (unspecified)                                       */

/* CH5CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH5_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Pos (12UL) /*!< Position of CH5CTLWBEN field.                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH5CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Min (0x0UL) /*!< Min enumerator value of CH5CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Max (0x1UL) /*!< Max enumerator value of CH5CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH5HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH5_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Pos (13UL) /*!< Position of CH5HCLLP field.                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Pos) /*!< Bit mask
                                                                            of CH5HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Min (0x0UL) /*!< Min enumerator value of CH5HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Max (0x1UL) /*!< Max enumerator value of CH5HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_PROGRAMMABLE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_HARDCODED (0x1UL) /*!< (unspecified)                                       */

/* CH5FC @Bits 14..15 : The value of this register is derived from the DMAH_CH5_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Pos (14UL) /*!< Position of CH5FC field.                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Pos) /*!< Bit mask of
                                                                            CH5FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Min (0x0UL) /*!< Min enumerator value of CH5FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Max (0x3UL) /*!< Max enumerator value of CH5FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_FC_DMA (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_FC_SRC (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_FC_DST (0x2UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_FC_ANY (0x3UL) /*!< (unspecified)                                             */

/* CH5MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH5_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Pos (16UL) /*!< Position of CH5MAXMULTSIZE field.                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH5MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Min (0x0UL) /*!< Min enumerator value of CH5MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Max (0x6UL) /*!< Max enumerator value of CH5MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL) /*!< (unspecified)                         */

/* CH5DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH5_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Pos (19UL) /*!< Position of CH5DMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Pos) /*!< Bit mask of
                                                                            CH5DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Min (0x0UL) /*!< Min enumerator value of CH5DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Max (0x4UL) /*!< Max enumerator value of CH5DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH5LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH5_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Pos (22UL) /*!< Position of CH5LMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Pos) /*!< Bit mask of
                                                                            CH5LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Min (0x0UL) /*!< Min enumerator value of CH5LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Max (0x4UL) /*!< Max enumerator value of CH5LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH5SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH5_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Pos (25UL) /*!< Position of CH5SMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Pos) /*!< Bit mask of
                                                                            CH5SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Min (0x0UL) /*!< Min enumerator value of CH5SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Max (0x4UL) /*!< Max enumerator value of CH5SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH5FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH5_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Pos (28UL) /*!< Position of CH5FIFODEPTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH5FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Min (0x0UL) /*!< Min enumerator value of CH5FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Max (0x5UL) /*!< Max enumerator value of CH5FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_8 (0x0UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_16 (0x1UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_32 (0x2UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_64 (0x3UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_128 (0x4UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_256 (0x5UL) /*!< (unspecified)                              */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS4L: DMA_COMP_PARAMS_4 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 3 and Channel 4. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_ResetValue (0x00000000UL) /*!< Reset value of DMACOMPPARAMS4L register.             */

/* CH4DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH4_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Pos (0UL) /*!< Position of CH4DTW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Pos) /*!< Bit mask of
                                                                            CH4DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Min (0x0UL) /*!< Min enumerator value of CH4DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Max (0x6UL) /*!< Max enumerator value of CH4DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

