adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH1DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH1_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Pos (19UL) /*!< Position of CH1DMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Pos) /*!< Bit mask of
                                                                            CH1DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Min (0x0UL) /*!< Min enumerator value of CH1DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Max (0x4UL) /*!< Max enumerator value of CH1DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH1LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH1_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Pos (22UL) /*!< Position of CH1LMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Pos) /*!< Bit mask of
                                                                            CH1LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Min (0x0UL) /*!< Min enumerator value of CH1LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Max (0x4UL) /*!< Max enumerator value of CH1LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH1SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH1_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Pos (25UL) /*!< Position of CH1SMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Pos) /*!< Bit mask of
                                                                            CH1SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Min (0x0UL) /*!< Min enumerator value of CH1SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Max (0x4UL) /*!< Max enumerator value of CH1SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH1FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH1_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Pos (28UL) /*!< Position of CH1FIFODEPTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH1FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Min (0x0UL) /*!< Min enumerator value of CH1FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Max (0x5UL) /*!< Max enumerator value of CH1FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_8 (0x0UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_16 (0x1UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_32 (0x2UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_64 (0x3UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_128 (0x4UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_256 (0x5UL) /*!< (unspecified)                              */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS2L: DMA_COMP_PARAMS_2 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_ResetValue (0x13016118UL) /*!< Reset value of DMACOMPPARAMS2L register.             */

/* CH0DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH0_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Pos (0UL) /*!< Position of CH0DTW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Pos) /*!< Bit mask of
                                                                            CH0DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Min (0x0UL) /*!< Min enumerator value of CH0DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Max (0x6UL) /*!< Max enumerator value of CH0DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH0STW @Bits 3..5 : The value of this register is derived from the DMAH_CH0_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Pos (3UL) /*!< Position of CH0STW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Pos) /*!< Bit mask of
                                                                            CH0STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Min (0x0UL) /*!< Min enumerator value of CH0STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Max (0x6UL) /*!< Max enumerator value of CH0STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH0STATDST @Bit 6 : The value of this register is derived from the DMAH_CH0_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Pos (6UL) /*!< Position of CH0STATDST field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Pos) /*!< Bit
                                                                            mask of CH0STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Min (0x0UL) /*!< Min enumerator value of CH0STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Max (0x1UL) /*!< Max enumerator value of CH0STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH0STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH0_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Pos (7UL) /*!< Position of CH0STATSRC field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Pos) /*!< Bit
                                                                            mask of CH0STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Min (0x0UL) /*!< Min enumerator value of CH0STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Max (0x1UL) /*!< Max enumerator value of CH0STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH0DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH0_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Pos (8UL) /*!< Position of CH0DSTSCAEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH0DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Min (0x0UL) /*!< Min enumerator value of CH0DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Max (0x1UL) /*!< Max enumerator value of CH0DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_TRUE (0x1UL) /*!< (unspecified)                                         */

