adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH0SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH0_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Pos (9UL) /*!< Position of CH0SRCGATEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH0SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Min (0x0UL) /*!< Min enumerator value of CH0SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Max (0x1UL) /*!< Max enumerator value of CH0SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH0LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH0_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Pos (10UL) /*!< Position of CH0LOCKEN field.                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Pos) /*!< Bit mask
                                                                            of CH0LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Min (0x0UL) /*!< Min enumerator value of CH0LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Max (0x1UL) /*!< Max enumerator value of CH0LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_FALSE (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_TRUE (0x1UL) /*!< (unspecified)                                           */

/* CH0MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH0_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Pos (11UL) /*!< Position of CH0MULTIBLKEN field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH0MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Min (0x0UL) /*!< Min enumerator value of CH0MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Max (0x1UL) /*!< Max enumerator value of CH0MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_FALSE (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_TRUE (0x1UL) /*!< (unspecified)                                       */

/* CH0CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH0_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Pos (12UL) /*!< Position of CH0CTLWBEN field.                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH0CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Min (0x0UL) /*!< Min enumerator value of CH0CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Max (0x1UL) /*!< Max enumerator value of CH0CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH0HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH0_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Pos (13UL) /*!< Position of CH0HCLLP field.                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Pos) /*!< Bit mask
                                                                            of CH0HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Min (0x0UL) /*!< Min enumerator value of CH0HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Max (0x1UL) /*!< Max enumerator value of CH0HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_PROGRAMMABLE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_HARDCODED (0x1UL) /*!< (unspecified)                                       */

/* CH0FC @Bits 14..15 : The value of this register is derived from the DMAH_CH0_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Pos (14UL) /*!< Position of CH0FC field.                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Pos) /*!< Bit mask of
                                                                            CH0FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Min (0x0UL) /*!< Min enumerator value of CH0FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Max (0x3UL) /*!< Max enumerator value of CH0FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_FC_DMA (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_FC_SRC (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_FC_DST (0x2UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_FC_ANY (0x3UL) /*!< (unspecified)                                             */

/* CH0MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH0_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Pos (16UL) /*!< Position of CH0MAXMULTSIZE field.                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH0MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Min (0x0UL) /*!< Min enumerator value of CH0MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Max (0x6UL) /*!< Max enumerator value of CH0MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL) /*!< (unspecified)                         */

/* CH0DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH0_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Pos (19UL) /*!< Position of CH0DMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Pos) /*!< Bit mask of
                                                                            CH0DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Min (0x0UL) /*!< Min enumerator value of CH0DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Max (0x4UL) /*!< Max enumerator value of CH0DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH0LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH0_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Pos (22UL) /*!< Position of CH0LMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Pos) /*!< Bit mask of
                                                                            CH0LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Min (0x0UL) /*!< Min enumerator value of CH0LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Max (0x4UL) /*!< Max enumerator value of CH0LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH0SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH0_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Pos (25UL) /*!< Position of CH0SMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Pos) /*!< Bit mask of
                                                                            CH0SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Min (0x0UL) /*!< Min enumerator value of CH0SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Max (0x4UL) /*!< Max enumerator value of CH0SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

