adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* I3CCORE_DMA_MISC_DMACOMPPARAMS1H: DMA_COMP_PARAMS_1 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ResetValue (0x3120090CUL) /*!< Reset value of DMACOMPPARAMS1H register.             */

/* BIGENDIAN @Bit 0 : The value of this register is derived from the DMAH_BIG_ENDIAN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Pos (0UL) /*!< Position of BIGENDIAN field.                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Pos) /*!< Bit mask
                                                                            of BIGENDIAN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Min (0x0UL) /*!< Min enumerator value of BIGENDIAN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Max (0x1UL) /*!< Max enumerator value of BIGENDIAN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_FALSE (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_TRUE (0x1UL) /*!< (unspecified)                                           */

/* INTRIO @Bits 1..2 : The value of this register is derived from the DMAH_INTR_IO coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Pos (1UL) /*!< Position of INTRIO field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Pos) /*!< Bit mask of
                                                                            INTRIO field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Min (0x0UL) /*!< Min enumerator value of INTRIO field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Max (0x2UL) /*!< Max enumerator value of INTRIO field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_ALL_INT (0x0UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_TYPE_INT (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_COMBINED_INT (0x2UL) /*!< (unspecified)                                      */

/* MAXABRST @Bit 3 : The value of this register is derived from the DMAH_MABRST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Pos (3UL) /*!< Position of MAXABRST field.                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Pos) /*!< Bit mask
                                                                            of MAXABRST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Min (0x0UL) /*!< Min enumerator value of MAXABRST field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Max (0x1UL) /*!< Max enumerator value of MAXABRST field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_FALSE (0x0UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_TRUE (0x1UL) /*!< (unspecified)                                            */

/* RSVDDMACOMPPARAMS1 @Bits 4..7 : Reserved field- read-only */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_RSVDDMACOMPPARAMS1_Pos (4UL) /*!< Position of RSVDDMACOMPPARAMS1 field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_RSVDDMACOMPPARAMS1_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_RSVDDMACOMPPARAMS1_Pos)
                                                                            /*!< Bit mask of RSVDDMACOMPPARAMS1 field.*/

/* NUMCHANNELS @Bits 8..10 : The value of this register is derived from the DMAH_NUM_CHANNELS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Pos (8UL) /*!< Position of NUMCHANNELS field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Pos) /*!< Bit
                                                                            mask of NUMCHANNELS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Min (0x0UL) /*!< Min enumerator value of NUMCHANNELS field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Max (0x7UL) /*!< Max enumerator value of NUMCHANNELS field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_1 (0x0UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_2 (0x1UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_3 (0x2UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_4 (0x3UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_5 (0x4UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_6 (0x5UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_7 (0x6UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_8 (0x7UL) /*!< (unspecified)                                */

/* NUMMASTERINT @Bits 11..12 : The value of this register is derived from the DMAH_NUM_MASTER_INT coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Pos (11UL) /*!< Position of NUMMASTERINT field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Pos) /*!<
                                                                            Bit mask of NUMMASTERINT field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Min (0x0UL) /*!< Min enumerator value of NUMMASTERINT field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Max (0x3UL) /*!< Max enumerator value of NUMMASTERINT field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_NUM_MST_INTERFACE_1 (0x0UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_NUM_MST_INTERFACE_2 (0x1UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_NUM_MST_INTERFACE_3 (0x2UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_NUM_MST_INTERFACE_4 (0x3UL) /*!< (unspecified)                         */

/* SHDATAWIDTH @Bits 13..14 : The value of this register is derived from the DMAH_S_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Pos (13UL) /*!< Position of SHDATAWIDTH field.                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Pos) /*!< Bit
                                                                            mask of SHDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Min (0x0UL) /*!< Min enumerator value of SHDATAWIDTH field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Max (0x3UL) /*!< Max enumerator value of SHDATAWIDTH field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL) /*!< (unspecified)                           */

/* M4HDATAWIDTH @Bits 15..16 : The value of this register is derived from the DMAH_M4_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Pos (15UL) /*!< Position of M4HDATAWIDTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Pos) /*!<
                                                                            Bit mask of M4HDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Min (0x0UL) /*!< Min enumerator value of M4HDATAWIDTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Max (0x3UL) /*!< Max enumerator value of M4HDATAWIDTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL) /*!< (unspecified)                          */

/* M3HDATAWIDTH @Bits 17..18 : The value of this register is derived from the DMAH_M3_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Pos (17UL) /*!< Position of M3HDATAWIDTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Pos) /*!<
                                                                            Bit mask of M3HDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Min (0x0UL) /*!< Min enumerator value of M3HDATAWIDTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Max (0x3UL) /*!< Max enumerator value of M3HDATAWIDTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL) /*!< (unspecified)                          */

/* M2HDATAWIDTH @Bits 19..20 : The value of this register is derived from the DMAH_M2_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Pos (19UL) /*!< Position of M2HDATAWIDTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Pos) /*!<
                                                                            Bit mask of M2HDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Min (0x0UL) /*!< Min enumerator value of M2HDATAWIDTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Max (0x3UL) /*!< Max enumerator value of M2HDATAWIDTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL) /*!< (unspecified)                          */

