adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================== Struct ICACHEDATA_SET ================================================== */
/**
  * @brief SET [ICACHEDATA_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_ICACHEDATA_SET_WAY_Type WAY[2];          /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_ICACHEDATA_SET_Type;                           /*!< Size = 64 (0x040)                                                    */
  #define ICACHEDATA_SET_MaxCount (512UL)            /*!< Size of SET[512] array.                                              */
  #define ICACHEDATA_SET_MaxIndex (511UL)            /*!< Max index of SET[512] array.                                         */
  #define ICACHEDATA_SET_MinIndex (0UL)              /*!< Min index of SET[512] array.                                         */

/* ==================================================== Struct ICACHEDATA ==================================================== */
/**
  * @brief CACHEDATA
  */
  typedef struct {                                   /*!< ICACHEDATA Structure                                                 */
    __IOM NRF_ICACHEDATA_SET_Type SET[512];          /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_ICACHEDATA_Type;                             /*!< Size = 32768 (0x8000)                                                */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        ICACHEINFO                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct ICACHEINFO_SET_WAY ================================================ */
/**
  * @brief WAY [ICACHEINFO_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INFO;                              /*!< (@ 0x00000000) Cache information for SET[n], WAY[o].                 */
} NRF_ICACHEINFO_SET_WAY_Type;                       /*!< Size = 4 (0x004)                                                     */
  #define ICACHEINFO_SET_WAY_MaxCount (2UL)          /*!< Size of WAY[2] array.                                                */
  #define ICACHEINFO_SET_WAY_MaxIndex (1UL)          /*!< Max index of WAY[2] array.                                           */
  #define ICACHEINFO_SET_WAY_MinIndex (0UL)          /*!< Min index of WAY[2] array.                                           */

/* ICACHEINFO_SET_WAY_INFO: Cache information for SET[n], WAY[o]. */
  #define ICACHEINFO_SET_WAY_INFO_ResetValue (0x00000000UL) /*!< Reset value of INFO register.                                 */

/* TAG @Bits 0..19 : Cache tag. */
  #define ICACHEINFO_SET_WAY_INFO_TAG_Pos (0UL)      /*!< Position of TAG field.                                               */
  #define ICACHEINFO_SET_WAY_INFO_TAG_Msk (0xFFFFFUL << ICACHEINFO_SET_WAY_INFO_TAG_Pos) /*!< Bit mask of TAG field.           */

/* DUV0 @Bit 24 : Data unit valid info. */
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Pos (24UL)    /*!< Position of DUV0 field.                                              */
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_DUV0_Pos) /*!< Bit mask of DUV0 field.            */
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Min (0x0UL)   /*!< Min enumerator value of DUV0 field.                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Max (0x1UL)   /*!< Max enumerator value of DUV0 field.                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Invalid (0x0UL) /*!< Invalid data unit                                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Valid (0x1UL) /*!< Valid data unit                                                      */

/* DUV1 @Bit 25 : Data unit valid info. */
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Pos (25UL)    /*!< Position of DUV1 field.                                              */
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_DUV1_Pos) /*!< Bit mask of DUV1 field.            */
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Min (0x0UL)   /*!< Min enumerator value of DUV1 field.                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Max (0x1UL)   /*!< Max enumerator value of DUV1 field.                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Invalid (0x0UL) /*!< Invalid data unit                                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Valid (0x1UL) /*!< Valid data unit                                                      */

/* DUV2 @Bit 26 : Data unit valid info. */
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Pos (26UL)    /*!< Position of DUV2 field.                                              */
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_DUV2_Pos) /*!< Bit mask of DUV2 field.            */
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Min (0x0UL)   /*!< Min enumerator value of DUV2 field.                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Max (0x1UL)   /*!< Max enumerator value of DUV2 field.                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Invalid (0x0UL) /*!< Invalid data unit                                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Valid (0x1UL) /*!< Valid data unit                                                      */

/* DUV3 @Bit 27 : Data unit valid info. */
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Pos (27UL)    /*!< Position of DUV3 field.                                              */
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_DUV3_Pos) /*!< Bit mask of DUV3 field.            */
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Min (0x0UL)   /*!< Min enumerator value of DUV3 field.                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Max (0x1UL)   /*!< Max enumerator value of DUV3 field.                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Invalid (0x0UL) /*!< Invalid data unit                                                  */
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Valid (0x1UL) /*!< Valid data unit                                                      */

/* D0 @Bit 28 : Dirty status of combined data unit 0 and 1. */
  #define ICACHEINFO_SET_WAY_INFO_D0_Pos (28UL)      /*!< Position of D0 field.                                                */
  #define ICACHEINFO_SET_WAY_INFO_D0_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_D0_Pos) /*!< Bit mask of D0 field.                  */
  #define ICACHEINFO_SET_WAY_INFO_D0_Min (0x0UL)     /*!< Min enumerator value of D0 field.                                    */
  #define ICACHEINFO_SET_WAY_INFO_D0_Max (0x1UL)     /*!< Max enumerator value of D0 field.                                    */
  #define ICACHEINFO_SET_WAY_INFO_D0_Clean (0x0UL)   /*!< Clean data unit                                                      */
  #define ICACHEINFO_SET_WAY_INFO_D0_Dirty (0x1UL)   /*!< Dirty data unit                                                      */

