adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* D1 @Bit 29 : Dirty status of combined data unit 2 and 3. */
  #define ICACHEINFO_SET_WAY_INFO_D1_Pos (29UL)      /*!< Position of D1 field.                                                */
  #define ICACHEINFO_SET_WAY_INFO_D1_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_D1_Pos) /*!< Bit mask of D1 field.                  */
  #define ICACHEINFO_SET_WAY_INFO_D1_Min (0x0UL)     /*!< Min enumerator value of D1 field.                                    */
  #define ICACHEINFO_SET_WAY_INFO_D1_Max (0x1UL)     /*!< Max enumerator value of D1 field.                                    */
  #define ICACHEINFO_SET_WAY_INFO_D1_Clean (0x0UL)   /*!< Clean data unit                                                      */
  #define ICACHEINFO_SET_WAY_INFO_D1_Dirty (0x1UL)   /*!< Dirty data unit                                                      */

/* V @Bit 30 : Line valid bit. */
  #define ICACHEINFO_SET_WAY_INFO_V_Pos (30UL)       /*!< Position of V field.                                                 */
  #define ICACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_V_Pos) /*!< Bit mask of V field.                     */
  #define ICACHEINFO_SET_WAY_INFO_V_Min (0x0UL)      /*!< Min enumerator value of V field.                                     */
  #define ICACHEINFO_SET_WAY_INFO_V_Max (0x1UL)      /*!< Max enumerator value of V field.                                     */
  #define ICACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL)  /*!< Invalid cache line                                                   */
  #define ICACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)    /*!< Valid cache line                                                     */

/* MRU @Bit 31 : Most recently used way. */
  #define ICACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)     /*!< Position of MRU field.                                               */
  #define ICACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_MRU_Pos) /*!< Bit mask of MRU field.               */
  #define ICACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)    /*!< Min enumerator value of MRU field.                                   */
  #define ICACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)    /*!< Max enumerator value of MRU field.                                   */
  #define ICACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)   /*!< Way0 was most recently used                                          */
  #define ICACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)   /*!< Way1 was most recently used                                          */



/* ================================================== Struct ICACHEINFO_SET ================================================== */
/**
  * @brief SET [ICACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_ICACHEINFO_SET_WAY_Type WAY[2];          /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_ICACHEINFO_SET_Type;                           /*!< Size = 8 (0x008)                                                     */
  #define ICACHEINFO_SET_MaxCount (512UL)            /*!< Size of SET[512] array.                                              */
  #define ICACHEINFO_SET_MaxIndex (511UL)            /*!< Max index of SET[512] array.                                         */
  #define ICACHEINFO_SET_MinIndex (0UL)              /*!< Min index of SET[512] array.                                         */

/* ==================================================== Struct ICACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {                                   /*!< ICACHEINFO Structure                                                 */
    __IOM NRF_ICACHEINFO_SET_Type SET[512];          /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_ICACHEINFO_Type;                             /*!< Size = 4096 (0x1000)                                                 */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          IPCMAP                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct IPCMAP_CHANNEL ================================================== */
/**
  * @brief CHANNEL [IPCMAP_CHANNEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SOURCE;                            /*!< (@ 0x00000000) The IPCT source configuration for the channel [n] from
                                                                         a ICPT.*/
  __IOM uint32_t  SINK;                              /*!< (@ 0x00000004) The IPCT sink configuration for the channel [n] to
                                                                         another ICPT.*/
} NRF_IPCMAP_CHANNEL_Type;                           /*!< Size = 8 (0x008)                                                     */
  #define IPCMAP_CHANNEL_MaxCount (16UL)             /*!< Size of CHANNEL[16] array.                                           */
  #define IPCMAP_CHANNEL_MaxIndex (15UL)             /*!< Max index of CHANNEL[16] array.                                      */
  #define IPCMAP_CHANNEL_MinIndex (0UL)              /*!< Min index of CHANNEL[16] array.                                      */

/* IPCMAP_CHANNEL_SOURCE: The IPCT source configuration for the channel [n] from a ICPT. */
  #define IPCMAP_CHANNEL_SOURCE_ResetValue (0x00000000UL) /*!< Reset value of SOURCE register.                                 */

/* SOURCE @Bits 0..3 : Source identification for IPC mapping. */
  #define IPCMAP_CHANNEL_SOURCE_SOURCE_Pos (0UL)     /*!< Position of SOURCE field.                                            */
  #define IPCMAP_CHANNEL_SOURCE_SOURCE_Msk (0xFUL << IPCMAP_CHANNEL_SOURCE_SOURCE_Pos) /*!< Bit mask of SOURCE field.          */

/* DOMAIN @Bits 8..11 : Domain identifier. */
  #define IPCMAP_CHANNEL_SOURCE_DOMAIN_Pos (8UL)     /*!< Position of DOMAIN field.                                            */
  #define IPCMAP_CHANNEL_SOURCE_DOMAIN_Msk (0xFUL << IPCMAP_CHANNEL_SOURCE_DOMAIN_Pos) /*!< Bit mask of DOMAIN field.          */

/* ENABLE @Bit 31 : Channel enable. */
  #define IPCMAP_CHANNEL_SOURCE_ENABLE_Pos (31UL)    /*!< Position of ENABLE field.                                            */
  #define IPCMAP_CHANNEL_SOURCE_ENABLE_Msk (0x1UL << IPCMAP_CHANNEL_SOURCE_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */
  #define IPCMAP_CHANNEL_SOURCE_ENABLE_Min (0x0UL)   /*!< Min enumerator value of ENABLE field.                                */
  #define IPCMAP_CHANNEL_SOURCE_ENABLE_Max (0x1UL)   /*!< Max enumerator value of ENABLE field.                                */
  #define IPCMAP_CHANNEL_SOURCE_ENABLE_Disabled (0x0UL) /*!< Disable channel.                                                  */
  #define IPCMAP_CHANNEL_SOURCE_ENABLE_Enabled (0x1UL) /*!< Enable channel.                                                    */


