adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* IPCMAP_CHANNEL_SINK: The IPCT sink configuration for the channel [n] to another ICPT. */
  #define IPCMAP_CHANNEL_SINK_ResetValue (0x00000000UL) /*!< Reset value of SINK register.                                     */

/* SINK @Bits 0..3 : Sink identifiation for IPC mapping. */
  #define IPCMAP_CHANNEL_SINK_SINK_Pos (0UL)         /*!< Position of SINK field.                                              */
  #define IPCMAP_CHANNEL_SINK_SINK_Msk (0xFUL << IPCMAP_CHANNEL_SINK_SINK_Pos) /*!< Bit mask of SINK field.                    */

/* DOMAIN @Bits 8..11 : Domain identifier. */
  #define IPCMAP_CHANNEL_SINK_DOMAIN_Pos (8UL)       /*!< Position of DOMAIN field.                                            */
  #define IPCMAP_CHANNEL_SINK_DOMAIN_Msk (0xFUL << IPCMAP_CHANNEL_SINK_DOMAIN_Pos) /*!< Bit mask of DOMAIN field.              */


/* ====================================================== Struct IPCMAP ====================================================== */
/**
  * @brief IPCMAP APB registers
  */
  typedef struct {                                   /*!< IPCMAP Structure                                                     */
    __IM uint32_t RESERVED[256];
    __IOM NRF_IPCMAP_CHANNEL_Type CHANNEL[16];       /*!< (@ 0x00000400) (unspecified)                                         */
  } NRF_IPCMAP_Type;                                 /*!< Size = 1152 (0x480)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           IPCT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct IPCT_OVERFLOW =================================================== */
/**
  * @brief OVERFLOW [IPCT_OVERFLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEND;                              /*!< (@ 0x00000000) Overflow status for SEND tasks Write 0 to clear       */
} NRF_IPCT_OVERFLOW_Type;                            /*!< Size = 4 (0x004)                                                     */

/* IPCT_OVERFLOW_SEND: Overflow status for SEND tasks Write 0 to clear */
  #define IPCT_OVERFLOW_SEND_ResetValue (0x00000000UL) /*!< Reset value of SEND register.                                      */

/* SEND0 @Bit 0 : Overflow status for SEND[0] task */
  #define IPCT_OVERFLOW_SEND_SEND0_Pos (0UL)         /*!< Position of SEND0 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND0_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND0_Pos) /*!< Bit mask of SEND0 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND0_Min (0x0UL)       /*!< Min enumerator value of SEND0 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND0_Max (0x1UL)       /*!< Max enumerator value of SEND0 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND0_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND0_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND1 @Bit 1 : Overflow status for SEND[1] task */
  #define IPCT_OVERFLOW_SEND_SEND1_Pos (1UL)         /*!< Position of SEND1 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND1_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND1_Pos) /*!< Bit mask of SEND1 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND1_Min (0x0UL)       /*!< Min enumerator value of SEND1 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND1_Max (0x1UL)       /*!< Max enumerator value of SEND1 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND1_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND1_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND2 @Bit 2 : Overflow status for SEND[2] task */
  #define IPCT_OVERFLOW_SEND_SEND2_Pos (2UL)         /*!< Position of SEND2 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND2_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND2_Pos) /*!< Bit mask of SEND2 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND2_Min (0x0UL)       /*!< Min enumerator value of SEND2 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND2_Max (0x1UL)       /*!< Max enumerator value of SEND2 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND2_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND2_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND3 @Bit 3 : Overflow status for SEND[3] task */
  #define IPCT_OVERFLOW_SEND_SEND3_Pos (3UL)         /*!< Position of SEND3 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND3_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND3_Pos) /*!< Bit mask of SEND3 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND3_Min (0x0UL)       /*!< Min enumerator value of SEND3 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND3_Max (0x1UL)       /*!< Max enumerator value of SEND3 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND3_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND3_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

