adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RECEIVE8_FLUSH8 @Bit 8 : Shortcut between event RECEIVE[8] and task FLUSH[8] */
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Pos (8UL)      /*!< Position of RECEIVE8_FLUSH8 field.                                   */
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Msk (0x1UL << IPCT_SHORTS_RECEIVE8_FLUSH8_Pos) /*!< Bit mask of RECEIVE8_FLUSH8 field.   */
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Min (0x0UL)    /*!< Min enumerator value of RECEIVE8_FLUSH8 field.                       */
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Max (0x1UL)    /*!< Max enumerator value of RECEIVE8_FLUSH8 field.                       */
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE9_FLUSH9 @Bit 9 : Shortcut between event RECEIVE[9] and task FLUSH[9] */
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Pos (9UL)      /*!< Position of RECEIVE9_FLUSH9 field.                                   */
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Msk (0x1UL << IPCT_SHORTS_RECEIVE9_FLUSH9_Pos) /*!< Bit mask of RECEIVE9_FLUSH9 field.   */
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Min (0x0UL)    /*!< Min enumerator value of RECEIVE9_FLUSH9 field.                       */
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Max (0x1UL)    /*!< Max enumerator value of RECEIVE9_FLUSH9 field.                       */
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE10_FLUSH10 @Bit 10 : Shortcut between event RECEIVE[10] and task FLUSH[10] */
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Pos (10UL)   /*!< Position of RECEIVE10_FLUSH10 field.                                 */
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Msk (0x1UL << IPCT_SHORTS_RECEIVE10_FLUSH10_Pos) /*!< Bit mask of RECEIVE10_FLUSH10
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Min (0x0UL)  /*!< Min enumerator value of RECEIVE10_FLUSH10 field.                     */
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Max (0x1UL)  /*!< Max enumerator value of RECEIVE10_FLUSH10 field.                     */
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* RECEIVE11_FLUSH11 @Bit 11 : Shortcut between event RECEIVE[11] and task FLUSH[11] */
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Pos (11UL)   /*!< Position of RECEIVE11_FLUSH11 field.                                 */
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Msk (0x1UL << IPCT_SHORTS_RECEIVE11_FLUSH11_Pos) /*!< Bit mask of RECEIVE11_FLUSH11
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Min (0x0UL)  /*!< Min enumerator value of RECEIVE11_FLUSH11 field.                     */
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Max (0x1UL)  /*!< Max enumerator value of RECEIVE11_FLUSH11 field.                     */
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* RECEIVE12_FLUSH12 @Bit 12 : Shortcut between event RECEIVE[12] and task FLUSH[12] */
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Pos (12UL)   /*!< Position of RECEIVE12_FLUSH12 field.                                 */
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Msk (0x1UL << IPCT_SHORTS_RECEIVE12_FLUSH12_Pos) /*!< Bit mask of RECEIVE12_FLUSH12
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Min (0x0UL)  /*!< Min enumerator value of RECEIVE12_FLUSH12 field.                     */
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Max (0x1UL)  /*!< Max enumerator value of RECEIVE12_FLUSH12 field.                     */
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* RECEIVE13_FLUSH13 @Bit 13 : Shortcut between event RECEIVE[13] and task FLUSH[13] */
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Pos (13UL)   /*!< Position of RECEIVE13_FLUSH13 field.                                 */
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Msk (0x1UL << IPCT_SHORTS_RECEIVE13_FLUSH13_Pos) /*!< Bit mask of RECEIVE13_FLUSH13
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Min (0x0UL)  /*!< Min enumerator value of RECEIVE13_FLUSH13 field.                     */
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Max (0x1UL)  /*!< Max enumerator value of RECEIVE13_FLUSH13 field.                     */
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* RECEIVE14_FLUSH14 @Bit 14 : Shortcut between event RECEIVE[14] and task FLUSH[14] */
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Pos (14UL)   /*!< Position of RECEIVE14_FLUSH14 field.                                 */
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Msk (0x1UL << IPCT_SHORTS_RECEIVE14_FLUSH14_Pos) /*!< Bit mask of RECEIVE14_FLUSH14
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Min (0x0UL)  /*!< Min enumerator value of RECEIVE14_FLUSH14 field.                     */
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Max (0x1UL)  /*!< Max enumerator value of RECEIVE14_FLUSH14 field.                     */
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Enabled (0x1UL) /*!< Enable shortcut                                                   */

