adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RECEIVE15_FLUSH15 @Bit 15 : Shortcut between event RECEIVE[15] and task FLUSH[15] */
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Pos (15UL)   /*!< Position of RECEIVE15_FLUSH15 field.                                 */
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Msk (0x1UL << IPCT_SHORTS_RECEIVE15_FLUSH15_Pos) /*!< Bit mask of RECEIVE15_FLUSH15
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Min (0x0UL)  /*!< Min enumerator value of RECEIVE15_FLUSH15 field.                     */
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Max (0x1UL)  /*!< Max enumerator value of RECEIVE15_FLUSH15 field.                     */
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Enabled (0x1UL) /*!< Enable shortcut                                                   */


/* IPCT_INTEN0: Enable or disable interrupt */
  #define IPCT_INTEN0_ResetValue (0x00000000UL)      /*!< Reset value of INTEN0 register.                                      */

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN0_RECEIVE0_Pos (0UL)             /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTEN0_RECEIVE0_Msk (0x1UL << IPCT_INTEN0_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                        */
  #define IPCT_INTEN0_RECEIVE0_Min (0x0UL)           /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN0_RECEIVE0_Max (0x1UL)           /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN0_RECEIVE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN0_RECEIVE1_Pos (1UL)             /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTEN0_RECEIVE1_Msk (0x1UL << IPCT_INTEN0_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                        */
  #define IPCT_INTEN0_RECEIVE1_Min (0x0UL)           /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN0_RECEIVE1_Max (0x1UL)           /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN0_RECEIVE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN0_RECEIVE2_Pos (2UL)             /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTEN0_RECEIVE2_Msk (0x1UL << IPCT_INTEN0_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                        */
  #define IPCT_INTEN0_RECEIVE2_Min (0x0UL)           /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN0_RECEIVE2_Max (0x1UL)           /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN0_RECEIVE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN0_RECEIVE3_Pos (3UL)             /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTEN0_RECEIVE3_Msk (0x1UL << IPCT_INTEN0_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                        */
  #define IPCT_INTEN0_RECEIVE3_Min (0x0UL)           /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN0_RECEIVE3_Max (0x1UL)           /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN0_RECEIVE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE3_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE4 @Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
  #define IPCT_INTEN0_RECEIVE4_Pos (4UL)             /*!< Position of RECEIVE4 field.                                          */
  #define IPCT_INTEN0_RECEIVE4_Msk (0x1UL << IPCT_INTEN0_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field.                        */
  #define IPCT_INTEN0_RECEIVE4_Min (0x0UL)           /*!< Min enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTEN0_RECEIVE4_Max (0x1UL)           /*!< Max enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTEN0_RECEIVE4_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE4_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE5 @Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
  #define IPCT_INTEN0_RECEIVE5_Pos (5UL)             /*!< Position of RECEIVE5 field.                                          */
  #define IPCT_INTEN0_RECEIVE5_Msk (0x1UL << IPCT_INTEN0_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field.                        */
  #define IPCT_INTEN0_RECEIVE5_Min (0x0UL)           /*!< Min enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTEN0_RECEIVE5_Max (0x1UL)           /*!< Max enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTEN0_RECEIVE5_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE5_Enabled (0x1UL)       /*!< Enable                                                               */

