adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* IPCT_INTEN1: Enable or disable interrupt */
  #define IPCT_INTEN1_ResetValue (0x00000000UL)      /*!< Reset value of INTEN1 register.                                      */

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN1_RECEIVE0_Pos (0UL)             /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTEN1_RECEIVE0_Msk (0x1UL << IPCT_INTEN1_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                        */
  #define IPCT_INTEN1_RECEIVE0_Min (0x0UL)           /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN1_RECEIVE0_Max (0x1UL)           /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN1_RECEIVE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN1_RECEIVE1_Pos (1UL)             /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTEN1_RECEIVE1_Msk (0x1UL << IPCT_INTEN1_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                        */
  #define IPCT_INTEN1_RECEIVE1_Min (0x0UL)           /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN1_RECEIVE1_Max (0x1UL)           /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN1_RECEIVE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN1_RECEIVE2_Pos (2UL)             /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTEN1_RECEIVE2_Msk (0x1UL << IPCT_INTEN1_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                        */
  #define IPCT_INTEN1_RECEIVE2_Min (0x0UL)           /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN1_RECEIVE2_Max (0x1UL)           /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN1_RECEIVE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN1_RECEIVE3_Pos (3UL)             /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTEN1_RECEIVE3_Msk (0x1UL << IPCT_INTEN1_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                        */
  #define IPCT_INTEN1_RECEIVE3_Min (0x0UL)           /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN1_RECEIVE3_Max (0x1UL)           /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN1_RECEIVE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE3_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE4 @Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
  #define IPCT_INTEN1_RECEIVE4_Pos (4UL)             /*!< Position of RECEIVE4 field.                                          */
  #define IPCT_INTEN1_RECEIVE4_Msk (0x1UL << IPCT_INTEN1_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field.                        */
  #define IPCT_INTEN1_RECEIVE4_Min (0x0UL)           /*!< Min enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTEN1_RECEIVE4_Max (0x1UL)           /*!< Max enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTEN1_RECEIVE4_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE4_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE5 @Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
  #define IPCT_INTEN1_RECEIVE5_Pos (5UL)             /*!< Position of RECEIVE5 field.                                          */
  #define IPCT_INTEN1_RECEIVE5_Msk (0x1UL << IPCT_INTEN1_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field.                        */
  #define IPCT_INTEN1_RECEIVE5_Min (0x0UL)           /*!< Min enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTEN1_RECEIVE5_Max (0x1UL)           /*!< Max enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTEN1_RECEIVE5_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE5_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE6 @Bit 6 : Enable or disable interrupt for event RECEIVE[6] */
  #define IPCT_INTEN1_RECEIVE6_Pos (6UL)             /*!< Position of RECEIVE6 field.                                          */
  #define IPCT_INTEN1_RECEIVE6_Msk (0x1UL << IPCT_INTEN1_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field.                        */
  #define IPCT_INTEN1_RECEIVE6_Min (0x0UL)           /*!< Min enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTEN1_RECEIVE6_Max (0x1UL)           /*!< Max enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTEN1_RECEIVE6_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE6_Enabled (0x1UL)       /*!< Enable                                                               */

