adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READY2 @Bit 18 : Write '1' to enable interrupt for event READY[2] */
  #define IPCT_INTENSET2_READY2_Pos (18UL)           /*!< Position of READY2 field.                                            */
  #define IPCT_INTENSET2_READY2_Msk (0x1UL << IPCT_INTENSET2_READY2_Pos) /*!< Bit mask of READY2 field.                        */
  #define IPCT_INTENSET2_READY2_Min (0x0UL)          /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTENSET2_READY2_Max (0x1UL)          /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTENSET2_READY2_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY3 @Bit 19 : Write '1' to enable interrupt for event READY[3] */
  #define IPCT_INTENSET2_READY3_Pos (19UL)           /*!< Position of READY3 field.                                            */
  #define IPCT_INTENSET2_READY3_Msk (0x1UL << IPCT_INTENSET2_READY3_Pos) /*!< Bit mask of READY3 field.                        */
  #define IPCT_INTENSET2_READY3_Min (0x0UL)          /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTENSET2_READY3_Max (0x1UL)          /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTENSET2_READY3_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY4 @Bit 20 : Write '1' to enable interrupt for event READY[4] */
  #define IPCT_INTENSET2_READY4_Pos (20UL)           /*!< Position of READY4 field.                                            */
  #define IPCT_INTENSET2_READY4_Msk (0x1UL << IPCT_INTENSET2_READY4_Pos) /*!< Bit mask of READY4 field.                        */
  #define IPCT_INTENSET2_READY4_Min (0x0UL)          /*!< Min enumerator value of READY4 field.                                */
  #define IPCT_INTENSET2_READY4_Max (0x1UL)          /*!< Max enumerator value of READY4 field.                                */
  #define IPCT_INTENSET2_READY4_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY4_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY4_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY5 @Bit 21 : Write '1' to enable interrupt for event READY[5] */
  #define IPCT_INTENSET2_READY5_Pos (21UL)           /*!< Position of READY5 field.                                            */
  #define IPCT_INTENSET2_READY5_Msk (0x1UL << IPCT_INTENSET2_READY5_Pos) /*!< Bit mask of READY5 field.                        */
  #define IPCT_INTENSET2_READY5_Min (0x0UL)          /*!< Min enumerator value of READY5 field.                                */
  #define IPCT_INTENSET2_READY5_Max (0x1UL)          /*!< Max enumerator value of READY5 field.                                */
  #define IPCT_INTENSET2_READY5_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY5_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY5_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY6 @Bit 22 : Write '1' to enable interrupt for event READY[6] */
  #define IPCT_INTENSET2_READY6_Pos (22UL)           /*!< Position of READY6 field.                                            */
  #define IPCT_INTENSET2_READY6_Msk (0x1UL << IPCT_INTENSET2_READY6_Pos) /*!< Bit mask of READY6 field.                        */
  #define IPCT_INTENSET2_READY6_Min (0x0UL)          /*!< Min enumerator value of READY6 field.                                */
  #define IPCT_INTENSET2_READY6_Max (0x1UL)          /*!< Max enumerator value of READY6 field.                                */
  #define IPCT_INTENSET2_READY6_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY6_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY6_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY7 @Bit 23 : Write '1' to enable interrupt for event READY[7] */
  #define IPCT_INTENSET2_READY7_Pos (23UL)           /*!< Position of READY7 field.                                            */
  #define IPCT_INTENSET2_READY7_Msk (0x1UL << IPCT_INTENSET2_READY7_Pos) /*!< Bit mask of READY7 field.                        */
  #define IPCT_INTENSET2_READY7_Min (0x0UL)          /*!< Min enumerator value of READY7 field.                                */
  #define IPCT_INTENSET2_READY7_Max (0x1UL)          /*!< Max enumerator value of READY7 field.                                */
  #define IPCT_INTENSET2_READY7_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY7_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY7_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY8 @Bit 24 : Write '1' to enable interrupt for event READY[8] */
  #define IPCT_INTENSET2_READY8_Pos (24UL)           /*!< Position of READY8 field.                                            */
  #define IPCT_INTENSET2_READY8_Msk (0x1UL << IPCT_INTENSET2_READY8_Pos) /*!< Bit mask of READY8 field.                        */
  #define IPCT_INTENSET2_READY8_Min (0x0UL)          /*!< Min enumerator value of READY8 field.                                */
  #define IPCT_INTENSET2_READY8_Max (0x1UL)          /*!< Max enumerator value of READY8 field.                                */
  #define IPCT_INTENSET2_READY8_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY8_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY8_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY9 @Bit 25 : Write '1' to enable interrupt for event READY[9] */
  #define IPCT_INTENSET2_READY9_Pos (25UL)           /*!< Position of READY9 field.                                            */
  #define IPCT_INTENSET2_READY9_Msk (0x1UL << IPCT_INTENSET2_READY9_Pos) /*!< Bit mask of READY9 field.                        */
  #define IPCT_INTENSET2_READY9_Min (0x0UL)          /*!< Min enumerator value of READY9 field.                                */
  #define IPCT_INTENSET2_READY9_Max (0x1UL)          /*!< Max enumerator value of READY9 field.                                */
  #define IPCT_INTENSET2_READY9_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY9_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY9_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY10 @Bit 26 : Write '1' to enable interrupt for event READY[10] */
  #define IPCT_INTENSET2_READY10_Pos (26UL)          /*!< Position of READY10 field.                                           */
  #define IPCT_INTENSET2_READY10_Msk (0x1UL << IPCT_INTENSET2_READY10_Pos) /*!< Bit mask of READY10 field.                     */
  #define IPCT_INTENSET2_READY10_Min (0x0UL)         /*!< Min enumerator value of READY10 field.                               */
  #define IPCT_INTENSET2_READY10_Max (0x1UL)         /*!< Max enumerator value of READY10 field.                               */
  #define IPCT_INTENSET2_READY10_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET2_READY10_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET2_READY10_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

