adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RECEIVE6 @Bit 6 : Enable or disable interrupt for event RECEIVE[6] */
  #define IPCT_INTEN4_RECEIVE6_Pos (6UL)             /*!< Position of RECEIVE6 field.                                          */
  #define IPCT_INTEN4_RECEIVE6_Msk (0x1UL << IPCT_INTEN4_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field.                        */
  #define IPCT_INTEN4_RECEIVE6_Min (0x0UL)           /*!< Min enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTEN4_RECEIVE6_Max (0x1UL)           /*!< Max enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTEN4_RECEIVE6_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE6_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE7 @Bit 7 : Enable or disable interrupt for event RECEIVE[7] */
  #define IPCT_INTEN4_RECEIVE7_Pos (7UL)             /*!< Position of RECEIVE7 field.                                          */
  #define IPCT_INTEN4_RECEIVE7_Msk (0x1UL << IPCT_INTEN4_RECEIVE7_Pos) /*!< Bit mask of RECEIVE7 field.                        */
  #define IPCT_INTEN4_RECEIVE7_Min (0x0UL)           /*!< Min enumerator value of RECEIVE7 field.                              */
  #define IPCT_INTEN4_RECEIVE7_Max (0x1UL)           /*!< Max enumerator value of RECEIVE7 field.                              */
  #define IPCT_INTEN4_RECEIVE7_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE7_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE8 @Bit 8 : Enable or disable interrupt for event RECEIVE[8] */
  #define IPCT_INTEN4_RECEIVE8_Pos (8UL)             /*!< Position of RECEIVE8 field.                                          */
  #define IPCT_INTEN4_RECEIVE8_Msk (0x1UL << IPCT_INTEN4_RECEIVE8_Pos) /*!< Bit mask of RECEIVE8 field.                        */
  #define IPCT_INTEN4_RECEIVE8_Min (0x0UL)           /*!< Min enumerator value of RECEIVE8 field.                              */
  #define IPCT_INTEN4_RECEIVE8_Max (0x1UL)           /*!< Max enumerator value of RECEIVE8 field.                              */
  #define IPCT_INTEN4_RECEIVE8_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE8_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE9 @Bit 9 : Enable or disable interrupt for event RECEIVE[9] */
  #define IPCT_INTEN4_RECEIVE9_Pos (9UL)             /*!< Position of RECEIVE9 field.                                          */
  #define IPCT_INTEN4_RECEIVE9_Msk (0x1UL << IPCT_INTEN4_RECEIVE9_Pos) /*!< Bit mask of RECEIVE9 field.                        */
  #define IPCT_INTEN4_RECEIVE9_Min (0x0UL)           /*!< Min enumerator value of RECEIVE9 field.                              */
  #define IPCT_INTEN4_RECEIVE9_Max (0x1UL)           /*!< Max enumerator value of RECEIVE9 field.                              */
  #define IPCT_INTEN4_RECEIVE9_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE9_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE10 @Bit 10 : Enable or disable interrupt for event RECEIVE[10] */
  #define IPCT_INTEN4_RECEIVE10_Pos (10UL)           /*!< Position of RECEIVE10 field.                                         */
  #define IPCT_INTEN4_RECEIVE10_Msk (0x1UL << IPCT_INTEN4_RECEIVE10_Pos) /*!< Bit mask of RECEIVE10 field.                     */
  #define IPCT_INTEN4_RECEIVE10_Min (0x0UL)          /*!< Min enumerator value of RECEIVE10 field.                             */
  #define IPCT_INTEN4_RECEIVE10_Max (0x1UL)          /*!< Max enumerator value of RECEIVE10 field.                             */
  #define IPCT_INTEN4_RECEIVE10_Disabled (0x0UL)     /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE10_Enabled (0x1UL)      /*!< Enable                                                               */

/* RECEIVE11 @Bit 11 : Enable or disable interrupt for event RECEIVE[11] */
  #define IPCT_INTEN4_RECEIVE11_Pos (11UL)           /*!< Position of RECEIVE11 field.                                         */
  #define IPCT_INTEN4_RECEIVE11_Msk (0x1UL << IPCT_INTEN4_RECEIVE11_Pos) /*!< Bit mask of RECEIVE11 field.                     */
  #define IPCT_INTEN4_RECEIVE11_Min (0x0UL)          /*!< Min enumerator value of RECEIVE11 field.                             */
  #define IPCT_INTEN4_RECEIVE11_Max (0x1UL)          /*!< Max enumerator value of RECEIVE11 field.                             */
  #define IPCT_INTEN4_RECEIVE11_Disabled (0x0UL)     /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE11_Enabled (0x1UL)      /*!< Enable                                                               */

/* RECEIVE12 @Bit 12 : Enable or disable interrupt for event RECEIVE[12] */
  #define IPCT_INTEN4_RECEIVE12_Pos (12UL)           /*!< Position of RECEIVE12 field.                                         */
  #define IPCT_INTEN4_RECEIVE12_Msk (0x1UL << IPCT_INTEN4_RECEIVE12_Pos) /*!< Bit mask of RECEIVE12 field.                     */
  #define IPCT_INTEN4_RECEIVE12_Min (0x0UL)          /*!< Min enumerator value of RECEIVE12 field.                             */
  #define IPCT_INTEN4_RECEIVE12_Max (0x1UL)          /*!< Max enumerator value of RECEIVE12 field.                             */
  #define IPCT_INTEN4_RECEIVE12_Disabled (0x0UL)     /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE12_Enabled (0x1UL)      /*!< Enable                                                               */

/* RECEIVE13 @Bit 13 : Enable or disable interrupt for event RECEIVE[13] */
  #define IPCT_INTEN4_RECEIVE13_Pos (13UL)           /*!< Position of RECEIVE13 field.                                         */
  #define IPCT_INTEN4_RECEIVE13_Msk (0x1UL << IPCT_INTEN4_RECEIVE13_Pos) /*!< Bit mask of RECEIVE13 field.                     */
  #define IPCT_INTEN4_RECEIVE13_Min (0x0UL)          /*!< Min enumerator value of RECEIVE13 field.                             */
  #define IPCT_INTEN4_RECEIVE13_Max (0x1UL)          /*!< Max enumerator value of RECEIVE13 field.                             */
  #define IPCT_INTEN4_RECEIVE13_Disabled (0x0UL)     /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE13_Enabled (0x1UL)      /*!< Enable                                                               */

