adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READY11 @Bit 27 : Write '1' to enable interrupt for event READY[11] */
  #define IPCT_INTENSET4_READY11_Pos (27UL)          /*!< Position of READY11 field.                                           */
  #define IPCT_INTENSET4_READY11_Msk (0x1UL << IPCT_INTENSET4_READY11_Pos) /*!< Bit mask of READY11 field.                     */
  #define IPCT_INTENSET4_READY11_Min (0x0UL)         /*!< Min enumerator value of READY11 field.                               */
  #define IPCT_INTENSET4_READY11_Max (0x1UL)         /*!< Max enumerator value of READY11 field.                               */
  #define IPCT_INTENSET4_READY11_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET4_READY11_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET4_READY11_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY12 @Bit 28 : Write '1' to enable interrupt for event READY[12] */
  #define IPCT_INTENSET4_READY12_Pos (28UL)          /*!< Position of READY12 field.                                           */
  #define IPCT_INTENSET4_READY12_Msk (0x1UL << IPCT_INTENSET4_READY12_Pos) /*!< Bit mask of READY12 field.                     */
  #define IPCT_INTENSET4_READY12_Min (0x0UL)         /*!< Min enumerator value of READY12 field.                               */
  #define IPCT_INTENSET4_READY12_Max (0x1UL)         /*!< Max enumerator value of READY12 field.                               */
  #define IPCT_INTENSET4_READY12_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET4_READY12_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET4_READY12_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY13 @Bit 29 : Write '1' to enable interrupt for event READY[13] */
  #define IPCT_INTENSET4_READY13_Pos (29UL)          /*!< Position of READY13 field.                                           */
  #define IPCT_INTENSET4_READY13_Msk (0x1UL << IPCT_INTENSET4_READY13_Pos) /*!< Bit mask of READY13 field.                     */
  #define IPCT_INTENSET4_READY13_Min (0x0UL)         /*!< Min enumerator value of READY13 field.                               */
  #define IPCT_INTENSET4_READY13_Max (0x1UL)         /*!< Max enumerator value of READY13 field.                               */
  #define IPCT_INTENSET4_READY13_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET4_READY13_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET4_READY13_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY14 @Bit 30 : Write '1' to enable interrupt for event READY[14] */
  #define IPCT_INTENSET4_READY14_Pos (30UL)          /*!< Position of READY14 field.                                           */
  #define IPCT_INTENSET4_READY14_Msk (0x1UL << IPCT_INTENSET4_READY14_Pos) /*!< Bit mask of READY14 field.                     */
  #define IPCT_INTENSET4_READY14_Min (0x0UL)         /*!< Min enumerator value of READY14 field.                               */
  #define IPCT_INTENSET4_READY14_Max (0x1UL)         /*!< Max enumerator value of READY14 field.                               */
  #define IPCT_INTENSET4_READY14_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET4_READY14_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET4_READY14_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY15 @Bit 31 : Write '1' to enable interrupt for event READY[15] */
  #define IPCT_INTENSET4_READY15_Pos (31UL)          /*!< Position of READY15 field.                                           */
  #define IPCT_INTENSET4_READY15_Msk (0x1UL << IPCT_INTENSET4_READY15_Pos) /*!< Bit mask of READY15 field.                     */
  #define IPCT_INTENSET4_READY15_Min (0x0UL)         /*!< Min enumerator value of READY15 field.                               */
  #define IPCT_INTENSET4_READY15_Max (0x1UL)         /*!< Max enumerator value of READY15 field.                               */
  #define IPCT_INTENSET4_READY15_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET4_READY15_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET4_READY15_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* IPCT_INTENCLR4: Disable interrupt */
  #define IPCT_INTENCLR4_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR4 register.                                   */

/* RECEIVE0 @Bit 0 : Write '1' to disable interrupt for event RECEIVE[0] */
  #define IPCT_INTENCLR4_RECEIVE0_Pos (0UL)          /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTENCLR4_RECEIVE0_Msk (0x1UL << IPCT_INTENCLR4_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                  */
  #define IPCT_INTENCLR4_RECEIVE0_Min (0x0UL)        /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTENCLR4_RECEIVE0_Max (0x1UL)        /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTENCLR4_RECEIVE0_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR4_RECEIVE0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_RECEIVE0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE1 @Bit 1 : Write '1' to disable interrupt for event RECEIVE[1] */
  #define IPCT_INTENCLR4_RECEIVE1_Pos (1UL)          /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTENCLR4_RECEIVE1_Msk (0x1UL << IPCT_INTENCLR4_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                  */
  #define IPCT_INTENCLR4_RECEIVE1_Min (0x0UL)        /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTENCLR4_RECEIVE1_Max (0x1UL)        /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTENCLR4_RECEIVE1_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR4_RECEIVE1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_RECEIVE1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE2 @Bit 2 : Write '1' to disable interrupt for event RECEIVE[2] */
  #define IPCT_INTENCLR4_RECEIVE2_Pos (2UL)          /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTENCLR4_RECEIVE2_Msk (0x1UL << IPCT_INTENCLR4_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                  */
  #define IPCT_INTENCLR4_RECEIVE2_Min (0x0UL)        /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTENCLR4_RECEIVE2_Max (0x1UL)        /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTENCLR4_RECEIVE2_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR4_RECEIVE2_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_RECEIVE2_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

