adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RECEIVE6 @Bit 6 : Write '1' to enable interrupt for event RECEIVE[6] */
  #define IPCT_INTENSET5_RECEIVE6_Pos (6UL)          /*!< Position of RECEIVE6 field.                                          */
  #define IPCT_INTENSET5_RECEIVE6_Msk (0x1UL << IPCT_INTENSET5_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field.                  */
  #define IPCT_INTENSET5_RECEIVE6_Min (0x0UL)        /*!< Min enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTENSET5_RECEIVE6_Max (0x1UL)        /*!< Max enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTENSET5_RECEIVE6_Set (0x1UL)        /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE6_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE6_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE7 @Bit 7 : Write '1' to enable interrupt for event RECEIVE[7] */
  #define IPCT_INTENSET5_RECEIVE7_Pos (7UL)          /*!< Position of RECEIVE7 field.                                          */
  #define IPCT_INTENSET5_RECEIVE7_Msk (0x1UL << IPCT_INTENSET5_RECEIVE7_Pos) /*!< Bit mask of RECEIVE7 field.                  */
  #define IPCT_INTENSET5_RECEIVE7_Min (0x0UL)        /*!< Min enumerator value of RECEIVE7 field.                              */
  #define IPCT_INTENSET5_RECEIVE7_Max (0x1UL)        /*!< Max enumerator value of RECEIVE7 field.                              */
  #define IPCT_INTENSET5_RECEIVE7_Set (0x1UL)        /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE7_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE7_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE8 @Bit 8 : Write '1' to enable interrupt for event RECEIVE[8] */
  #define IPCT_INTENSET5_RECEIVE8_Pos (8UL)          /*!< Position of RECEIVE8 field.                                          */
  #define IPCT_INTENSET5_RECEIVE8_Msk (0x1UL << IPCT_INTENSET5_RECEIVE8_Pos) /*!< Bit mask of RECEIVE8 field.                  */
  #define IPCT_INTENSET5_RECEIVE8_Min (0x0UL)        /*!< Min enumerator value of RECEIVE8 field.                              */
  #define IPCT_INTENSET5_RECEIVE8_Max (0x1UL)        /*!< Max enumerator value of RECEIVE8 field.                              */
  #define IPCT_INTENSET5_RECEIVE8_Set (0x1UL)        /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE8_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE8_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE9 @Bit 9 : Write '1' to enable interrupt for event RECEIVE[9] */
  #define IPCT_INTENSET5_RECEIVE9_Pos (9UL)          /*!< Position of RECEIVE9 field.                                          */
  #define IPCT_INTENSET5_RECEIVE9_Msk (0x1UL << IPCT_INTENSET5_RECEIVE9_Pos) /*!< Bit mask of RECEIVE9 field.                  */
  #define IPCT_INTENSET5_RECEIVE9_Min (0x0UL)        /*!< Min enumerator value of RECEIVE9 field.                              */
  #define IPCT_INTENSET5_RECEIVE9_Max (0x1UL)        /*!< Max enumerator value of RECEIVE9 field.                              */
  #define IPCT_INTENSET5_RECEIVE9_Set (0x1UL)        /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE9_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE9_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE10 @Bit 10 : Write '1' to enable interrupt for event RECEIVE[10] */
  #define IPCT_INTENSET5_RECEIVE10_Pos (10UL)        /*!< Position of RECEIVE10 field.                                         */
  #define IPCT_INTENSET5_RECEIVE10_Msk (0x1UL << IPCT_INTENSET5_RECEIVE10_Pos) /*!< Bit mask of RECEIVE10 field.               */
  #define IPCT_INTENSET5_RECEIVE10_Min (0x0UL)       /*!< Min enumerator value of RECEIVE10 field.                             */
  #define IPCT_INTENSET5_RECEIVE10_Max (0x1UL)       /*!< Max enumerator value of RECEIVE10 field.                             */
  #define IPCT_INTENSET5_RECEIVE10_Set (0x1UL)       /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE10_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE10_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE11 @Bit 11 : Write '1' to enable interrupt for event RECEIVE[11] */
  #define IPCT_INTENSET5_RECEIVE11_Pos (11UL)        /*!< Position of RECEIVE11 field.                                         */
  #define IPCT_INTENSET5_RECEIVE11_Msk (0x1UL << IPCT_INTENSET5_RECEIVE11_Pos) /*!< Bit mask of RECEIVE11 field.               */
  #define IPCT_INTENSET5_RECEIVE11_Min (0x0UL)       /*!< Min enumerator value of RECEIVE11 field.                             */
  #define IPCT_INTENSET5_RECEIVE11_Max (0x1UL)       /*!< Max enumerator value of RECEIVE11 field.                             */
  #define IPCT_INTENSET5_RECEIVE11_Set (0x1UL)       /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE11_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE11_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE12 @Bit 12 : Write '1' to enable interrupt for event RECEIVE[12] */
  #define IPCT_INTENSET5_RECEIVE12_Pos (12UL)        /*!< Position of RECEIVE12 field.                                         */
  #define IPCT_INTENSET5_RECEIVE12_Msk (0x1UL << IPCT_INTENSET5_RECEIVE12_Pos) /*!< Bit mask of RECEIVE12 field.               */
  #define IPCT_INTENSET5_RECEIVE12_Min (0x0UL)       /*!< Min enumerator value of RECEIVE12 field.                             */
  #define IPCT_INTENSET5_RECEIVE12_Max (0x1UL)       /*!< Max enumerator value of RECEIVE12 field.                             */
  #define IPCT_INTENSET5_RECEIVE12_Set (0x1UL)       /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE12_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE12_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE13 @Bit 13 : Write '1' to enable interrupt for event RECEIVE[13] */
  #define IPCT_INTENSET5_RECEIVE13_Pos (13UL)        /*!< Position of RECEIVE13 field.                                         */
  #define IPCT_INTENSET5_RECEIVE13_Msk (0x1UL << IPCT_INTENSET5_RECEIVE13_Pos) /*!< Bit mask of RECEIVE13 field.               */
  #define IPCT_INTENSET5_RECEIVE13_Min (0x0UL)       /*!< Min enumerator value of RECEIVE13 field.                             */
  #define IPCT_INTENSET5_RECEIVE13_Max (0x1UL)       /*!< Max enumerator value of RECEIVE13 field.                             */
  #define IPCT_INTENSET5_RECEIVE13_Set (0x1UL)       /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE13_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE13_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE14 @Bit 14 : Write '1' to enable interrupt for event RECEIVE[14] */
  #define IPCT_INTENSET5_RECEIVE14_Pos (14UL)        /*!< Position of RECEIVE14 field.                                         */
  #define IPCT_INTENSET5_RECEIVE14_Msk (0x1UL << IPCT_INTENSET5_RECEIVE14_Pos) /*!< Bit mask of RECEIVE14 field.               */
  #define IPCT_INTENSET5_RECEIVE14_Min (0x0UL)       /*!< Min enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTENSET5_RECEIVE14_Max (0x1UL)       /*!< Max enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTENSET5_RECEIVE14_Set (0x1UL)       /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE14_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE14_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE15 @Bit 15 : Write '1' to enable interrupt for event RECEIVE[15] */
  #define IPCT_INTENSET5_RECEIVE15_Pos (15UL)        /*!< Position of RECEIVE15 field.                                         */
  #define IPCT_INTENSET5_RECEIVE15_Msk (0x1UL << IPCT_INTENSET5_RECEIVE15_Pos) /*!< Bit mask of RECEIVE15 field.               */
  #define IPCT_INTENSET5_RECEIVE15_Min (0x0UL)       /*!< Min enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTENSET5_RECEIVE15_Max (0x1UL)       /*!< Max enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTENSET5_RECEIVE15_Set (0x1UL)       /*!< Enable                                                               */
  #define IPCT_INTENSET5_RECEIVE15_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_RECEIVE15_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* READY0 @Bit 16 : Write '1' to enable interrupt for event READY[0] */
  #define IPCT_INTENSET5_READY0_Pos (16UL)           /*!< Position of READY0 field.                                            */
  #define IPCT_INTENSET5_READY0_Msk (0x1UL << IPCT_INTENSET5_READY0_Pos) /*!< Bit mask of READY0 field.                        */
  #define IPCT_INTENSET5_READY0_Min (0x0UL)          /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTENSET5_READY0_Max (0x1UL)          /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTENSET5_READY0_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_READY0_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_READY0_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY1 @Bit 17 : Write '1' to enable interrupt for event READY[1] */
  #define IPCT_INTENSET5_READY1_Pos (17UL)           /*!< Position of READY1 field.                                            */
  #define IPCT_INTENSET5_READY1_Msk (0x1UL << IPCT_INTENSET5_READY1_Pos) /*!< Bit mask of READY1 field.                        */
  #define IPCT_INTENSET5_READY1_Min (0x0UL)          /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTENSET5_READY1_Max (0x1UL)          /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTENSET5_READY1_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_READY1_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_READY1_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

