adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READY12 @Bit 28 : Write '1' to disable interrupt for event READY[12] */
  #define IPCT_INTENCLR6_READY12_Pos (28UL)          /*!< Position of READY12 field.                                           */
  #define IPCT_INTENCLR6_READY12_Msk (0x1UL << IPCT_INTENCLR6_READY12_Pos) /*!< Bit mask of READY12 field.                     */
  #define IPCT_INTENCLR6_READY12_Min (0x0UL)         /*!< Min enumerator value of READY12 field.                               */
  #define IPCT_INTENCLR6_READY12_Max (0x1UL)         /*!< Max enumerator value of READY12 field.                               */
  #define IPCT_INTENCLR6_READY12_Clear (0x1UL)       /*!< Disable                                                              */
  #define IPCT_INTENCLR6_READY12_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR6_READY12_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY13 @Bit 29 : Write '1' to disable interrupt for event READY[13] */
  #define IPCT_INTENCLR6_READY13_Pos (29UL)          /*!< Position of READY13 field.                                           */
  #define IPCT_INTENCLR6_READY13_Msk (0x1UL << IPCT_INTENCLR6_READY13_Pos) /*!< Bit mask of READY13 field.                     */
  #define IPCT_INTENCLR6_READY13_Min (0x0UL)         /*!< Min enumerator value of READY13 field.                               */
  #define IPCT_INTENCLR6_READY13_Max (0x1UL)         /*!< Max enumerator value of READY13 field.                               */
  #define IPCT_INTENCLR6_READY13_Clear (0x1UL)       /*!< Disable                                                              */
  #define IPCT_INTENCLR6_READY13_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR6_READY13_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY14 @Bit 30 : Write '1' to disable interrupt for event READY[14] */
  #define IPCT_INTENCLR6_READY14_Pos (30UL)          /*!< Position of READY14 field.                                           */
  #define IPCT_INTENCLR6_READY14_Msk (0x1UL << IPCT_INTENCLR6_READY14_Pos) /*!< Bit mask of READY14 field.                     */
  #define IPCT_INTENCLR6_READY14_Min (0x0UL)         /*!< Min enumerator value of READY14 field.                               */
  #define IPCT_INTENCLR6_READY14_Max (0x1UL)         /*!< Max enumerator value of READY14 field.                               */
  #define IPCT_INTENCLR6_READY14_Clear (0x1UL)       /*!< Disable                                                              */
  #define IPCT_INTENCLR6_READY14_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR6_READY14_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY15 @Bit 31 : Write '1' to disable interrupt for event READY[15] */
  #define IPCT_INTENCLR6_READY15_Pos (31UL)          /*!< Position of READY15 field.                                           */
  #define IPCT_INTENCLR6_READY15_Msk (0x1UL << IPCT_INTENCLR6_READY15_Pos) /*!< Bit mask of READY15 field.                     */
  #define IPCT_INTENCLR6_READY15_Min (0x0UL)         /*!< Min enumerator value of READY15 field.                               */
  #define IPCT_INTENCLR6_READY15_Max (0x1UL)         /*!< Max enumerator value of READY15 field.                               */
  #define IPCT_INTENCLR6_READY15_Clear (0x1UL)       /*!< Disable                                                              */
  #define IPCT_INTENCLR6_READY15_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR6_READY15_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* IPCT_INTPEND6: Pending interrupts */
  #define IPCT_INTPEND6_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND6 register.                                    */

/* RECEIVE0 @Bit 0 : Read pending status of interrupt for event RECEIVE[0] */
  #define IPCT_INTPEND6_RECEIVE0_Pos (0UL)           /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTPEND6_RECEIVE0_Msk (0x1UL << IPCT_INTPEND6_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                    */
  #define IPCT_INTPEND6_RECEIVE0_Min (0x0UL)         /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTPEND6_RECEIVE0_Max (0x1UL)         /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTPEND6_RECEIVE0_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_RECEIVE0_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE1 @Bit 1 : Read pending status of interrupt for event RECEIVE[1] */
  #define IPCT_INTPEND6_RECEIVE1_Pos (1UL)           /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTPEND6_RECEIVE1_Msk (0x1UL << IPCT_INTPEND6_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                    */
  #define IPCT_INTPEND6_RECEIVE1_Min (0x0UL)         /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTPEND6_RECEIVE1_Max (0x1UL)         /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTPEND6_RECEIVE1_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_RECEIVE1_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE2 @Bit 2 : Read pending status of interrupt for event RECEIVE[2] */
  #define IPCT_INTPEND6_RECEIVE2_Pos (2UL)           /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTPEND6_RECEIVE2_Msk (0x1UL << IPCT_INTPEND6_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                    */
  #define IPCT_INTPEND6_RECEIVE2_Min (0x0UL)         /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTPEND6_RECEIVE2_Max (0x1UL)         /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTPEND6_RECEIVE2_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_RECEIVE2_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE3 @Bit 3 : Read pending status of interrupt for event RECEIVE[3] */
  #define IPCT_INTPEND6_RECEIVE3_Pos (3UL)           /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTPEND6_RECEIVE3_Msk (0x1UL << IPCT_INTPEND6_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                    */
  #define IPCT_INTPEND6_RECEIVE3_Min (0x0UL)         /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTPEND6_RECEIVE3_Max (0x1UL)         /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTPEND6_RECEIVE3_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_RECEIVE3_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE4 @Bit 4 : Read pending status of interrupt for event RECEIVE[4] */
  #define IPCT_INTPEND6_RECEIVE4_Pos (4UL)           /*!< Position of RECEIVE4 field.                                          */
  #define IPCT_INTPEND6_RECEIVE4_Msk (0x1UL << IPCT_INTPEND6_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field.                    */
  #define IPCT_INTPEND6_RECEIVE4_Min (0x0UL)         /*!< Min enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTPEND6_RECEIVE4_Max (0x1UL)         /*!< Max enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTPEND6_RECEIVE4_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_RECEIVE4_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE5 @Bit 5 : Read pending status of interrupt for event RECEIVE[5] */
  #define IPCT_INTPEND6_RECEIVE5_Pos (5UL)           /*!< Position of RECEIVE5 field.                                          */
  #define IPCT_INTPEND6_RECEIVE5_Msk (0x1UL << IPCT_INTPEND6_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field.                    */
  #define IPCT_INTPEND6_RECEIVE5_Min (0x0UL)         /*!< Min enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTPEND6_RECEIVE5_Max (0x1UL)         /*!< Max enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTPEND6_RECEIVE5_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_RECEIVE5_Pending (0x1UL)     /*!< Read: Pending                                                        */

