adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RECEIVE14 @Bit 14 : Read pending status of interrupt for event RECEIVE[14] */
  #define IPCT_INTPEND6_RECEIVE14_Pos (14UL)         /*!< Position of RECEIVE14 field.                                         */
  #define IPCT_INTPEND6_RECEIVE14_Msk (0x1UL << IPCT_INTPEND6_RECEIVE14_Pos) /*!< Bit mask of RECEIVE14 field.                 */
  #define IPCT_INTPEND6_RECEIVE14_Min (0x0UL)        /*!< Min enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTPEND6_RECEIVE14_Max (0x1UL)        /*!< Max enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTPEND6_RECEIVE14_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_RECEIVE14_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RECEIVE15 @Bit 15 : Read pending status of interrupt for event RECEIVE[15] */
  #define IPCT_INTPEND6_RECEIVE15_Pos (15UL)         /*!< Position of RECEIVE15 field.                                         */
  #define IPCT_INTPEND6_RECEIVE15_Msk (0x1UL << IPCT_INTPEND6_RECEIVE15_Pos) /*!< Bit mask of RECEIVE15 field.                 */
  #define IPCT_INTPEND6_RECEIVE15_Min (0x0UL)        /*!< Min enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTPEND6_RECEIVE15_Max (0x1UL)        /*!< Max enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTPEND6_RECEIVE15_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_RECEIVE15_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* READY0 @Bit 16 : Read pending status of interrupt for event READY[0] */
  #define IPCT_INTPEND6_READY0_Pos (16UL)            /*!< Position of READY0 field.                                            */
  #define IPCT_INTPEND6_READY0_Msk (0x1UL << IPCT_INTPEND6_READY0_Pos) /*!< Bit mask of READY0 field.                          */
  #define IPCT_INTPEND6_READY0_Min (0x0UL)           /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTPEND6_READY0_Max (0x1UL)           /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTPEND6_READY0_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_READY0_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY1 @Bit 17 : Read pending status of interrupt for event READY[1] */
  #define IPCT_INTPEND6_READY1_Pos (17UL)            /*!< Position of READY1 field.                                            */
  #define IPCT_INTPEND6_READY1_Msk (0x1UL << IPCT_INTPEND6_READY1_Pos) /*!< Bit mask of READY1 field.                          */
  #define IPCT_INTPEND6_READY1_Min (0x0UL)           /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTPEND6_READY1_Max (0x1UL)           /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTPEND6_READY1_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_READY1_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY2 @Bit 18 : Read pending status of interrupt for event READY[2] */
  #define IPCT_INTPEND6_READY2_Pos (18UL)            /*!< Position of READY2 field.                                            */
  #define IPCT_INTPEND6_READY2_Msk (0x1UL << IPCT_INTPEND6_READY2_Pos) /*!< Bit mask of READY2 field.                          */
  #define IPCT_INTPEND6_READY2_Min (0x0UL)           /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTPEND6_READY2_Max (0x1UL)           /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTPEND6_READY2_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_READY2_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY3 @Bit 19 : Read pending status of interrupt for event READY[3] */
  #define IPCT_INTPEND6_READY3_Pos (19UL)            /*!< Position of READY3 field.                                            */
  #define IPCT_INTPEND6_READY3_Msk (0x1UL << IPCT_INTPEND6_READY3_Pos) /*!< Bit mask of READY3 field.                          */
  #define IPCT_INTPEND6_READY3_Min (0x0UL)           /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTPEND6_READY3_Max (0x1UL)           /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTPEND6_READY3_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_READY3_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY4 @Bit 20 : Read pending status of interrupt for event READY[4] */
  #define IPCT_INTPEND6_READY4_Pos (20UL)            /*!< Position of READY4 field.                                            */
  #define IPCT_INTPEND6_READY4_Msk (0x1UL << IPCT_INTPEND6_READY4_Pos) /*!< Bit mask of READY4 field.                          */
  #define IPCT_INTPEND6_READY4_Min (0x0UL)           /*!< Min enumerator value of READY4 field.                                */
  #define IPCT_INTPEND6_READY4_Max (0x1UL)           /*!< Max enumerator value of READY4 field.                                */
  #define IPCT_INTPEND6_READY4_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND6_READY4_Pending (0x1UL)       /*!< Read: Pending                                                        */

