adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READY5 @Bit 21 : Read pending status of interrupt for event READY[5] */
  #define IPCT_INTPEND7_READY5_Pos (21UL)            /*!< Position of READY5 field.                                            */
  #define IPCT_INTPEND7_READY5_Msk (0x1UL << IPCT_INTPEND7_READY5_Pos) /*!< Bit mask of READY5 field.                          */
  #define IPCT_INTPEND7_READY5_Min (0x0UL)           /*!< Min enumerator value of READY5 field.                                */
  #define IPCT_INTPEND7_READY5_Max (0x1UL)           /*!< Max enumerator value of READY5 field.                                */
  #define IPCT_INTPEND7_READY5_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY5_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY6 @Bit 22 : Read pending status of interrupt for event READY[6] */
  #define IPCT_INTPEND7_READY6_Pos (22UL)            /*!< Position of READY6 field.                                            */
  #define IPCT_INTPEND7_READY6_Msk (0x1UL << IPCT_INTPEND7_READY6_Pos) /*!< Bit mask of READY6 field.                          */
  #define IPCT_INTPEND7_READY6_Min (0x0UL)           /*!< Min enumerator value of READY6 field.                                */
  #define IPCT_INTPEND7_READY6_Max (0x1UL)           /*!< Max enumerator value of READY6 field.                                */
  #define IPCT_INTPEND7_READY6_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY6_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY7 @Bit 23 : Read pending status of interrupt for event READY[7] */
  #define IPCT_INTPEND7_READY7_Pos (23UL)            /*!< Position of READY7 field.                                            */
  #define IPCT_INTPEND7_READY7_Msk (0x1UL << IPCT_INTPEND7_READY7_Pos) /*!< Bit mask of READY7 field.                          */
  #define IPCT_INTPEND7_READY7_Min (0x0UL)           /*!< Min enumerator value of READY7 field.                                */
  #define IPCT_INTPEND7_READY7_Max (0x1UL)           /*!< Max enumerator value of READY7 field.                                */
  #define IPCT_INTPEND7_READY7_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY7_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY8 @Bit 24 : Read pending status of interrupt for event READY[8] */
  #define IPCT_INTPEND7_READY8_Pos (24UL)            /*!< Position of READY8 field.                                            */
  #define IPCT_INTPEND7_READY8_Msk (0x1UL << IPCT_INTPEND7_READY8_Pos) /*!< Bit mask of READY8 field.                          */
  #define IPCT_INTPEND7_READY8_Min (0x0UL)           /*!< Min enumerator value of READY8 field.                                */
  #define IPCT_INTPEND7_READY8_Max (0x1UL)           /*!< Max enumerator value of READY8 field.                                */
  #define IPCT_INTPEND7_READY8_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY8_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY9 @Bit 25 : Read pending status of interrupt for event READY[9] */
  #define IPCT_INTPEND7_READY9_Pos (25UL)            /*!< Position of READY9 field.                                            */
  #define IPCT_INTPEND7_READY9_Msk (0x1UL << IPCT_INTPEND7_READY9_Pos) /*!< Bit mask of READY9 field.                          */
  #define IPCT_INTPEND7_READY9_Min (0x0UL)           /*!< Min enumerator value of READY9 field.                                */
  #define IPCT_INTPEND7_READY9_Max (0x1UL)           /*!< Max enumerator value of READY9 field.                                */
  #define IPCT_INTPEND7_READY9_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY9_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY10 @Bit 26 : Read pending status of interrupt for event READY[10] */
  #define IPCT_INTPEND7_READY10_Pos (26UL)           /*!< Position of READY10 field.                                           */
  #define IPCT_INTPEND7_READY10_Msk (0x1UL << IPCT_INTPEND7_READY10_Pos) /*!< Bit mask of READY10 field.                       */
  #define IPCT_INTPEND7_READY10_Min (0x0UL)          /*!< Min enumerator value of READY10 field.                               */
  #define IPCT_INTPEND7_READY10_Max (0x1UL)          /*!< Max enumerator value of READY10 field.                               */
  #define IPCT_INTPEND7_READY10_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY10_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* READY11 @Bit 27 : Read pending status of interrupt for event READY[11] */
  #define IPCT_INTPEND7_READY11_Pos (27UL)           /*!< Position of READY11 field.                                           */
  #define IPCT_INTPEND7_READY11_Msk (0x1UL << IPCT_INTPEND7_READY11_Pos) /*!< Bit mask of READY11 field.                       */
  #define IPCT_INTPEND7_READY11_Min (0x0UL)          /*!< Min enumerator value of READY11 field.                               */
  #define IPCT_INTPEND7_READY11_Max (0x1UL)          /*!< Max enumerator value of READY11 field.                               */
  #define IPCT_INTPEND7_READY11_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY11_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* READY12 @Bit 28 : Read pending status of interrupt for event READY[12] */
  #define IPCT_INTPEND7_READY12_Pos (28UL)           /*!< Position of READY12 field.                                           */
  #define IPCT_INTPEND7_READY12_Msk (0x1UL << IPCT_INTPEND7_READY12_Pos) /*!< Bit mask of READY12 field.                       */
  #define IPCT_INTPEND7_READY12_Min (0x0UL)          /*!< Min enumerator value of READY12 field.                               */
  #define IPCT_INTPEND7_READY12_Max (0x1UL)          /*!< Max enumerator value of READY12 field.                               */
  #define IPCT_INTPEND7_READY12_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY12_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* READY13 @Bit 29 : Read pending status of interrupt for event READY[13] */
  #define IPCT_INTPEND7_READY13_Pos (29UL)           /*!< Position of READY13 field.                                           */
  #define IPCT_INTPEND7_READY13_Msk (0x1UL << IPCT_INTPEND7_READY13_Pos) /*!< Bit mask of READY13 field.                       */
  #define IPCT_INTPEND7_READY13_Min (0x0UL)          /*!< Min enumerator value of READY13 field.                               */
  #define IPCT_INTPEND7_READY13_Max (0x1UL)          /*!< Max enumerator value of READY13 field.                               */
  #define IPCT_INTPEND7_READY13_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY13_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* READY14 @Bit 30 : Read pending status of interrupt for event READY[14] */
  #define IPCT_INTPEND7_READY14_Pos (30UL)           /*!< Position of READY14 field.                                           */
  #define IPCT_INTPEND7_READY14_Msk (0x1UL << IPCT_INTPEND7_READY14_Pos) /*!< Bit mask of READY14 field.                       */
  #define IPCT_INTPEND7_READY14_Min (0x0UL)          /*!< Min enumerator value of READY14 field.                               */
  #define IPCT_INTPEND7_READY14_Max (0x1UL)          /*!< Max enumerator value of READY14 field.                               */
  #define IPCT_INTPEND7_READY14_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY14_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* READY15 @Bit 31 : Read pending status of interrupt for event READY[15] */
  #define IPCT_INTPEND7_READY15_Pos (31UL)           /*!< Position of READY15 field.                                           */
  #define IPCT_INTPEND7_READY15_Msk (0x1UL << IPCT_INTPEND7_READY15_Pos) /*!< Bit mask of READY15 field.                       */
  #define IPCT_INTPEND7_READY15_Min (0x0UL)          /*!< Min enumerator value of READY15 field.                               */
  #define IPCT_INTPEND7_READY15_Max (0x1UL)          /*!< Max enumerator value of READY15 field.                               */
  #define IPCT_INTPEND7_READY15_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_READY15_Pending (0x1UL)      /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          IRQMAP                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct IRQMAP_IRQ ==================================================== */
/**
  * @brief IRQ [IRQMAP_IRQ] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SINK;                              /*!< (@ 0x00000000) The interrupt sink configuration for interrupt [n] to a
                                                                         processor.*/
} NRF_IRQMAP_IRQ_Type;                               /*!< Size = 4 (0x004)                                                     */
  #define IRQMAP_IRQ_MaxCount (480UL)                /*!< Size of IRQ[480] array.                                              */
  #define IRQMAP_IRQ_MaxIndex (479UL)                /*!< Max index of IRQ[480] array.                                         */
  #define IRQMAP_IRQ_MinIndex (0UL)                  /*!< Min index of IRQ[480] array.                                         */

