adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* IRQMAP_IRQ_SINK: The interrupt sink configuration for interrupt [n] to a processor. */
  #define IRQMAP_IRQ_SINK_ResetValue (0x00000000UL)  /*!< Reset value of SINK register.                                        */

/* PROCESSORID @Bits 8..11 : Processor identifier. */
  #define IRQMAP_IRQ_SINK_PROCESSORID_Pos (8UL)      /*!< Position of PROCESSORID field.                                       */
  #define IRQMAP_IRQ_SINK_PROCESSORID_Msk (0xFUL << IRQMAP_IRQ_SINK_PROCESSORID_Pos) /*!< Bit mask of PROCESSORID field.       */


/* ====================================================== Struct IRQMAP ====================================================== */
/**
  * @brief IRQMAP APB registers
  */
  typedef struct {                                   /*!< IRQMAP Structure                                                     */
    __IM uint32_t RESERVED[256];
    __IOM NRF_IRQMAP_IRQ_Type IRQ[480];              /*!< (@ 0x00000400) (unspecified)                                         */
  } NRF_IRQMAP_Type;                                 /*!< Size = 2944 (0xB80)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        L2CACHEDATA                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct L2CACHEDATA_SET_WAY_DU ============================================== */
/**
  * @brief DU [L2CACHEDATA_SET_WAY_DU] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[4];                           /*!< (@ 0x00000000) Cache data bits for DATA[q] in DU[p] (DataUnit) of
                                                                         SET[n], WAY[o].*/
} NRF_L2CACHEDATA_SET_WAY_DU_Type;                   /*!< Size = 16 (0x010)                                                    */
  #define L2CACHEDATA_SET_WAY_DU_MaxCount (4UL)      /*!< Size of DU[4] array.                                                 */
  #define L2CACHEDATA_SET_WAY_DU_MaxIndex (3UL)      /*!< Max index of DU[4] array.                                            */
  #define L2CACHEDATA_SET_WAY_DU_MinIndex (0UL)      /*!< Min index of DU[4] array.                                            */

/* L2CACHEDATA_SET_WAY_DU_DATA: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o]. */
  #define L2CACHEDATA_SET_WAY_DU_DATA_MaxCount (4UL) /*!< Max size of DATA[4] array.                                           */
  #define L2CACHEDATA_SET_WAY_DU_DATA_MaxIndex (3UL) /*!< Max index of DATA[4] array.                                          */
  #define L2CACHEDATA_SET_WAY_DU_DATA_MinIndex (0UL) /*!< Min index of DATA[4] array.                                          */
  #define L2CACHEDATA_SET_WAY_DU_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA[4] register.                          */

/* Data @Bits 0..31 : Data */
  #define L2CACHEDATA_SET_WAY_DU_DATA_Data_Pos (0UL) /*!< Position of Data field.                                              */
  #define L2CACHEDATA_SET_WAY_DU_DATA_Data_Msk (0xFFFFFFFFUL << L2CACHEDATA_SET_WAY_DU_DATA_Data_Pos) /*!< Bit mask of Data
                                                                            field.*/



/* =============================================== Struct L2CACHEDATA_SET_WAY ================================================ */
/**
  * @brief WAY [L2CACHEDATA_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM NRF_L2CACHEDATA_SET_WAY_DU_Type DU[4];       /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_L2CACHEDATA_SET_WAY_Type;                      /*!< Size = 64 (0x040)                                                    */
  #define L2CACHEDATA_SET_WAY_MaxCount (2UL)         /*!< Size of WAY[2] array.                                                */
  #define L2CACHEDATA_SET_WAY_MaxIndex (1UL)         /*!< Max index of WAY[2] array.                                           */
  #define L2CACHEDATA_SET_WAY_MinIndex (0UL)         /*!< Min index of WAY[2] array.                                           */


/* ================================================= Struct L2CACHEDATA_SET ================================================== */
/**
  * @brief SET [L2CACHEDATA_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_L2CACHEDATA_SET_WAY_Type WAY[2];         /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_L2CACHEDATA_SET_Type;                          /*!< Size = 128 (0x080)                                                   */
  #define L2CACHEDATA_SET_MaxCount (1024UL)          /*!< Size of SET[1024] array.                                             */
  #define L2CACHEDATA_SET_MaxIndex (1023UL)          /*!< Max index of SET[1024] array.                                        */
  #define L2CACHEDATA_SET_MinIndex (0UL)             /*!< Min index of SET[1024] array.                                        */

/* =================================================== Struct L2CACHEDATA ==================================================== */
/**
  * @brief CACHEDATA
  */
  typedef struct {                                   /*!< L2CACHEDATA Structure                                                */
    __IOM NRF_L2CACHEDATA_SET_Type SET[1024];        /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_L2CACHEDATA_Type;                            /*!< Size = 131072 (0x20000)                                              */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        L2CACHEINFO                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct L2CACHEINFO_SET_WAY ================================================ */
/**
  * @brief WAY [L2CACHEINFO_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INFO;                              /*!< (@ 0x00000000) Cache information for SET[n], WAY[o].                 */
} NRF_L2CACHEINFO_SET_WAY_Type;                      /*!< Size = 4 (0x004)                                                     */
  #define L2CACHEINFO_SET_WAY_MaxCount (2UL)         /*!< Size of WAY[2] array.                                                */
  #define L2CACHEINFO_SET_WAY_MaxIndex (1UL)         /*!< Max index of WAY[2] array.                                           */
  #define L2CACHEINFO_SET_WAY_MinIndex (0UL)         /*!< Min index of WAY[2] array.                                           */

/* L2CACHEINFO_SET_WAY_INFO: Cache information for SET[n], WAY[o]. */
  #define L2CACHEINFO_SET_WAY_INFO_ResetValue (0x00000000UL) /*!< Reset value of INFO register.                                */

/* TAG @Bits 0..15 : Cache tag. */
  #define L2CACHEINFO_SET_WAY_INFO_TAG_Pos (0UL)     /*!< Position of TAG field.                                               */
  #define L2CACHEINFO_SET_WAY_INFO_TAG_Msk (0xFFFFUL << L2CACHEINFO_SET_WAY_INFO_TAG_Pos) /*!< Bit mask of TAG field.          */

/* DUV0 @Bit 24 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Pos (24UL)   /*!< Position of DUV0 field.                                              */
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV0_Pos) /*!< Bit mask of DUV0 field.          */
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Min (0x0UL)  /*!< Min enumerator value of DUV0 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Max (0x1UL)  /*!< Max enumerator value of DUV0 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Invalid (0x0UL) /*!< Invalid data unit                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Valid (0x1UL) /*!< Valid data unit                                                     */

/* DUV1 @Bit 25 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Pos (25UL)   /*!< Position of DUV1 field.                                              */
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV1_Pos) /*!< Bit mask of DUV1 field.          */
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Min (0x0UL)  /*!< Min enumerator value of DUV1 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Max (0x1UL)  /*!< Max enumerator value of DUV1 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Invalid (0x0UL) /*!< Invalid data unit                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Valid (0x1UL) /*!< Valid data unit                                                     */

