adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DUV2 @Bit 26 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Pos (26UL)   /*!< Position of DUV2 field.                                              */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV2_Pos) /*!< Bit mask of DUV2 field.          */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Min (0x0UL)  /*!< Min enumerator value of DUV2 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Max (0x1UL)  /*!< Max enumerator value of DUV2 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Invalid (0x0UL) /*!< Invalid data unit                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Valid (0x1UL) /*!< Valid data unit                                                     */

/* DUV3 @Bit 27 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Pos (27UL)   /*!< Position of DUV3 field.                                              */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV3_Pos) /*!< Bit mask of DUV3 field.          */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Min (0x0UL)  /*!< Min enumerator value of DUV3 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Max (0x1UL)  /*!< Max enumerator value of DUV3 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Invalid (0x0UL) /*!< Invalid data unit                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Valid (0x1UL) /*!< Valid data unit                                                     */

/* D0 @Bit 28 : Dirty status of combined data unit 0 and 1. */
  #define L2CACHEINFO_SET_WAY_INFO_D0_Pos (28UL)     /*!< Position of D0 field.                                                */
  #define L2CACHEINFO_SET_WAY_INFO_D0_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_D0_Pos) /*!< Bit mask of D0 field.                */
  #define L2CACHEINFO_SET_WAY_INFO_D0_Min (0x0UL)    /*!< Min enumerator value of D0 field.                                    */
  #define L2CACHEINFO_SET_WAY_INFO_D0_Max (0x1UL)    /*!< Max enumerator value of D0 field.                                    */
  #define L2CACHEINFO_SET_WAY_INFO_D0_Clean (0x0UL)  /*!< Clean data unit                                                      */
  #define L2CACHEINFO_SET_WAY_INFO_D0_Dirty (0x1UL)  /*!< Dirty data unit                                                      */

/* D1 @Bit 29 : Dirty status of combined data unit 2 and 3. */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Pos (29UL)     /*!< Position of D1 field.                                                */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_D1_Pos) /*!< Bit mask of D1 field.                */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Min (0x0UL)    /*!< Min enumerator value of D1 field.                                    */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Max (0x1UL)    /*!< Max enumerator value of D1 field.                                    */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Clean (0x0UL)  /*!< Clean data unit                                                      */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Dirty (0x1UL)  /*!< Dirty data unit                                                      */

/* V @Bit 30 : Line valid bit. */
  #define L2CACHEINFO_SET_WAY_INFO_V_Pos (30UL)      /*!< Position of V field.                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_V_Pos) /*!< Bit mask of V field.                   */
  #define L2CACHEINFO_SET_WAY_INFO_V_Min (0x0UL)     /*!< Min enumerator value of V field.                                     */
  #define L2CACHEINFO_SET_WAY_INFO_V_Max (0x1UL)     /*!< Max enumerator value of V field.                                     */
  #define L2CACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL) /*!< Invalid cache line                                                   */
  #define L2CACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)   /*!< Valid cache line                                                     */

/* MRU @Bit 31 : Most recently used way. */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)    /*!< Position of MRU field.                                               */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_MRU_Pos) /*!< Bit mask of MRU field.             */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)   /*!< Min enumerator value of MRU field.                                   */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)   /*!< Max enumerator value of MRU field.                                   */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)  /*!< Way0 was most recently used                                          */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)  /*!< Way1 was most recently used                                          */



/* ================================================= Struct L2CACHEINFO_SET ================================================== */
/**
  * @brief SET [L2CACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_L2CACHEINFO_SET_WAY_Type WAY[2];         /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_L2CACHEINFO_SET_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define L2CACHEINFO_SET_MaxCount (1024UL)          /*!< Size of SET[1024] array.                                             */
  #define L2CACHEINFO_SET_MaxIndex (1023UL)          /*!< Max index of SET[1024] array.                                        */
  #define L2CACHEINFO_SET_MinIndex (0UL)             /*!< Min index of SET[1024] array.                                        */

/* =================================================== Struct L2CACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {                                   /*!< L2CACHEINFO Structure                                                */
    __IOM NRF_L2CACHEINFO_SET_Type SET[1024];        /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_L2CACHEINFO_Type;                            /*!< Size = 8192 (0x2000)                                                 */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          LFLPRC                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

