adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================== Struct LFLPRC_CONFIG =================================================== */
/**
  * @brief CONFIG [LFLPRC_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Oscillator configuration                              */
} NRF_LFLPRC_CONFIG_Type;                            /*!< Size = 4 (0x004)                                                     */

/* LFLPRC_CONFIG_CFG: Oscillator configuration */
  #define LFLPRC_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                        */

/* PWMCLKDIV @Bit 0 : PWM input clock divider ratio */
  #define LFLPRC_CONFIG_CFG_PWMCLKDIV_Pos (0UL)      /*!< Position of PWMCLKDIV field.                                         */
  #define LFLPRC_CONFIG_CFG_PWMCLKDIV_Msk (0x1UL << LFLPRC_CONFIG_CFG_PWMCLKDIV_Pos) /*!< Bit mask of PWMCLKDIV field.         */
  #define LFLPRC_CONFIG_CFG_PWMCLKDIV_Min (0x0UL)    /*!< Min enumerator value of PWMCLKDIV field.                             */
  #define LFLPRC_CONFIG_CFG_PWMCLKDIV_Max (0x1UL)    /*!< Max enumerator value of PWMCLKDIV field.                             */
  #define LFLPRC_CONFIG_CFG_PWMCLKDIV_Div2 (0x0UL)   /*!< PWM input clock divided by 2                                         */
  #define LFLPRC_CONFIG_CFG_PWMCLKDIV_Div1 (0x1UL)   /*!< PWM input clock divided by 1                                         */

/* SPARE @Bit 1 : Spare bit, for future use */
  #define LFLPRC_CONFIG_CFG_SPARE_Pos (1UL)          /*!< Position of SPARE field.                                             */
  #define LFLPRC_CONFIG_CFG_SPARE_Msk (0x1UL << LFLPRC_CONFIG_CFG_SPARE_Pos) /*!< Bit mask of SPARE field.                     */



/* =================================================== Struct LFLPRC_TRIM ==================================================== */
/**
  * @brief TRIM [LFLPRC_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VSUP;                              /*!< (@ 0x00000000) Internal reference current generator trim             */
  __IOM uint32_t  RCOARSE;                           /*!< (@ 0x00000004) Coarse frequency static R trimming                    */
  __IOM uint32_t  RFINE;                             /*!< (@ 0x00000008) Fine frequency static R trimming                      */
  __IOM uint32_t  PWMFINE;                           /*!< (@ 0x0000000C) Fine frequency dynamic PWM trim                       */
} NRF_LFLPRC_TRIM_Type;                              /*!< Size = 16 (0x010)                                                    */

/* LFLPRC_TRIM_VSUP: Internal reference current generator trim */
  #define LFLPRC_TRIM_VSUP_ResetValue (0x00000000UL) /*!< Reset value of VSUP register.                                        */

/* VALUE @Bits 0..3 : Trim value */
  #define LFLPRC_TRIM_VSUP_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define LFLPRC_TRIM_VSUP_VALUE_Msk (0xFUL << LFLPRC_TRIM_VSUP_VALUE_Pos) /*!< Bit mask of VALUE field.                       */


/* LFLPRC_TRIM_RCOARSE: Coarse frequency static R trimming */
  #define LFLPRC_TRIM_RCOARSE_ResetValue (0x00000000UL) /*!< Reset value of RCOARSE register.                                  */

/* VALUE @Bits 0..5 : Coarse frequency trimming of R in RC network */
  #define LFLPRC_TRIM_RCOARSE_VALUE_Pos (0UL)        /*!< Position of VALUE field.                                             */
  #define LFLPRC_TRIM_RCOARSE_VALUE_Msk (0x3FUL << LFLPRC_TRIM_RCOARSE_VALUE_Pos) /*!< Bit mask of VALUE field.                */


/* LFLPRC_TRIM_RFINE: Fine frequency static R trimming */
  #define LFLPRC_TRIM_RFINE_ResetValue (0x00000000UL) /*!< Reset value of RFINE register.                                      */

/* VALUE @Bits 0..5 : Fine frequency trimming of R in RC network */
  #define LFLPRC_TRIM_RFINE_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define LFLPRC_TRIM_RFINE_VALUE_Msk (0x3FUL << LFLPRC_TRIM_RFINE_VALUE_Pos) /*!< Bit mask of VALUE field.                    */


/* LFLPRC_TRIM_PWMFINE: Fine frequency dynamic PWM trim */
  #define LFLPRC_TRIM_PWMFINE_ResetValue (0x00000000UL) /*!< Reset value of PWMFINE register.                                  */

/* VALUE @Bits 0..3 : Duty cycle of PWM fine frequency LSB resistor */
  #define LFLPRC_TRIM_PWMFINE_VALUE_Pos (0UL)        /*!< Position of VALUE field.                                             */
  #define LFLPRC_TRIM_PWMFINE_VALUE_Msk (0xFUL << LFLPRC_TRIM_PWMFINE_VALUE_Pos) /*!< Bit mask of VALUE field.                 */



/* ================================================= Struct LFLPRC_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [LFLPRC_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
} NRF_LFLPRC_OVERRIDE_Type;                          /*!< Size = 8 (0x008)                                                     */

/* LFLPRC_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define LFLPRC_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define LFLPRC_OVERRIDE_PWRUP_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define LFLPRC_OVERRIDE_PWRUP_VAL_Msk (0x1UL << LFLPRC_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define LFLPRC_OVERRIDE_PWRUP_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFLPRC_OVERRIDE_PWRUP_EN_Msk (0x1UL << LFLPRC_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFLPRC_OVERRIDE_PWRUP_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFLPRC_OVERRIDE_PWRUP_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFLPRC_OVERRIDE_PWRUP_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define LFLPRC_OVERRIDE_PWRUP_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* LFLPRC_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define LFLPRC_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define LFLPRC_OVERRIDE_RETAIN_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define LFLPRC_OVERRIDE_RETAIN_VAL_Msk (0x1UL << LFLPRC_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define LFLPRC_OVERRIDE_RETAIN_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define LFLPRC_OVERRIDE_RETAIN_EN_Msk (0x1UL << LFLPRC_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                    */
  #define LFLPRC_OVERRIDE_RETAIN_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define LFLPRC_OVERRIDE_RETAIN_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define LFLPRC_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define LFLPRC_OVERRIDE_RETAIN_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */



/* ==================================================== Struct LFLPRC_DFT ==================================================== */
/**
  * @brief DFT [LFLPRC_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_LFLPRC_DFT_Type;                               /*!< Size = 52 (0x034)                                                    */

