adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LFLPRC_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define LFLPRC_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                             */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define LFLPRC_DFT_ATB0CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define LFLPRC_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << LFLPRC_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define LFLPRC_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_ATB0CONFIG_SELMUX_Max (0x3UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_ATB0CONFIG_SELMUX_VddInt1v8 (0x0UL) /*!< Connect ATB0 for external forcing of internal 1V8 supply         */
  #define LFLPRC_DFT_ATB0CONFIG_SELMUX_Spare0 (0x1UL) /*!< None selected, HiZ                                                  */
  #define LFLPRC_DFT_ATB0CONFIG_SELMUX_VddInt0v8 (0x2UL) /*!< Connect ATB0 for external forcing of internal 0V8 supply         */
  #define LFLPRC_DFT_ATB0CONFIG_SELMUX_Spare1 (0x3UL) /*!< None selected, HiZ                                                  */

/* EN @Bit 31 : Enable the analog test bus */
  #define LFLPRC_DFT_ATB0CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFLPRC_DFT_ATB0CONFIG_EN_Msk (0x1UL << LFLPRC_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFLPRC_DFT_ATB0CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFLPRC_DFT_ATB0CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFLPRC_DFT_ATB0CONFIG_EN_Disabled (0x0UL)  /*!< Analog test bus is disabled                                          */
  #define LFLPRC_DFT_ATB0CONFIG_EN_Enabled (0x1UL)   /*!< Analog test bus is enabled                                           */


/* LFLPRC_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define LFLPRC_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                             */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define LFLPRC_DFT_ATB1CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define LFLPRC_DFT_ATB1CONFIG_SELMUX_Msk (0x3UL << LFLPRC_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define LFLPRC_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_ATB1CONFIG_SELMUX_Max (0x3UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_ATB1CONFIG_SELMUX_VddSw1v8 (0x0UL) /*!< Sense voltage from charge pump                                    */
  #define LFLPRC_DFT_ATB1CONFIG_SELMUX_Vreg0v5 (0x1UL) /*!< Sense voltage from source follower                                 */
  #define LFLPRC_DFT_ATB1CONFIG_SELMUX_Spare0 (0x2UL) /*!< None selected, HiZ                                                  */
  #define LFLPRC_DFT_ATB1CONFIG_SELMUX_Spare1 (0x3UL) /*!< None selected, HiZ                                                  */

/* EN @Bit 31 : Enable the analog test bus */
  #define LFLPRC_DFT_ATB1CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFLPRC_DFT_ATB1CONFIG_EN_Msk (0x1UL << LFLPRC_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFLPRC_DFT_ATB1CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFLPRC_DFT_ATB1CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFLPRC_DFT_ATB1CONFIG_EN_Disabled (0x0UL)  /*!< Analog test bus is disabled                                          */
  #define LFLPRC_DFT_ATB1CONFIG_EN_Enabled (0x1UL)   /*!< Analog test bus is enabled                                           */


/* LFLPRC_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define LFLPRC_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                             */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB0 */
  #define LFLPRC_DFT_DTB0CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define LFLPRC_DFT_DTB0CONFIG_SELMUX_Msk (0x3UL << LFLPRC_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define LFLPRC_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_DTB0CONFIG_SELMUX_Max (0x3UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_DTB0CONFIG_SELMUX_Ready (0x0UL) /*!< Ready signal                                                         */
  #define LFLPRC_DFT_DTB0CONFIG_SELMUX_AfsmS0 (0x1UL) /*!< LSB of internal state                                               */
  #define LFLPRC_DFT_DTB0CONFIG_SELMUX_Settled (0x2UL) /*!< Settled signal                                                     */
  #define LFLPRC_DFT_DTB0CONFIG_SELMUX_Spare0 (0x3UL) /*!< None selected, logic 0                                              */

/* EN @Bit 31 : Enable the digital test bus */
  #define LFLPRC_DFT_DTB0CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFLPRC_DFT_DTB0CONFIG_EN_Msk (0x1UL << LFLPRC_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFLPRC_DFT_DTB0CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFLPRC_DFT_DTB0CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFLPRC_DFT_DTB0CONFIG_EN_Disabled (0x0UL)  /*!< Digital test bus is disabled                                         */
  #define LFLPRC_DFT_DTB0CONFIG_EN_Enabled (0x1UL)   /*!< Digital test bus is enabled                                          */


/* LFLPRC_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define LFLPRC_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                             */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB1 */
  #define LFLPRC_DFT_DTB1CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define LFLPRC_DFT_DTB1CONFIG_SELMUX_Msk (0x3UL << LFLPRC_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define LFLPRC_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_DTB1CONFIG_SELMUX_Max (0x3UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_DTB1CONFIG_SELMUX_Spare0 (0x0UL) /*!< None selected, logic 0                                              */
  #define LFLPRC_DFT_DTB1CONFIG_SELMUX_AfsmS1 (0x1UL) /*!< MSB of internal state                                               */
  #define LFLPRC_DFT_DTB1CONFIG_SELMUX_Pwm (0x2UL)   /*!< Fine trim PWM signal                                                 */
  #define LFLPRC_DFT_DTB1CONFIG_SELMUX_Spare1 (0x3UL) /*!< None selected, logic 0                                              */

