adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define LFLPRC_DFT_DTB1CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFLPRC_DFT_DTB1CONFIG_EN_Msk (0x1UL << LFLPRC_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFLPRC_DFT_DTB1CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFLPRC_DFT_DTB1CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFLPRC_DFT_DTB1CONFIG_EN_Disabled (0x0UL)  /*!< Digital test bus is disabled                                         */
  #define LFLPRC_DFT_DTB1CONFIG_EN_Enabled (0x1UL)   /*!< Digital test bus is enabled                                          */


/* LFLPRC_DFT_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define LFLPRC_DFT_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                             */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB2 */
  #define LFLPRC_DFT_DTB2CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define LFLPRC_DFT_DTB2CONFIG_SELMUX_Msk (0x3UL << LFLPRC_DFT_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define LFLPRC_DFT_DTB2CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_DTB2CONFIG_SELMUX_Max (0x3UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define LFLPRC_DFT_DTB2CONFIG_SELMUX_OscOut (0x0UL) /*!< Internal oscillator output                                          */
  #define LFLPRC_DFT_DTB2CONFIG_SELMUX_CntReady (0x1UL) /*!< Startup counter overflow                                          */
  #define LFLPRC_DFT_DTB2CONFIG_SELMUX_IrefReady (0x2UL) /*!< Reference current generator ready signal                         */
  #define LFLPRC_DFT_DTB2CONFIG_SELMUX_Spare0 (0x3UL) /*!< None selected, logic 0                                              */

/* EN @Bit 31 : Enable the digital test bus */
  #define LFLPRC_DFT_DTB2CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFLPRC_DFT_DTB2CONFIG_EN_Msk (0x1UL << LFLPRC_DFT_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFLPRC_DFT_DTB2CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFLPRC_DFT_DTB2CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFLPRC_DFT_DTB2CONFIG_EN_Disabled (0x0UL)  /*!< Digital test bus is disabled                                         */
  #define LFLPRC_DFT_DTB2CONFIG_EN_Enabled (0x1UL)   /*!< Digital test bus is enabled                                          */


/* LFLPRC_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define LFLPRC_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                             */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define LFLPRC_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                   */
  #define LFLPRC_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << LFLPRC_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define LFLPRC_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                      */
  #define LFLPRC_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                      */
  #define LFLPRC_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                        */
  #define LFLPRC_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                          */


/* LFLPRC_DFT_TCFG: Test mode configuration */
  #define LFLPRC_DFT_TCFG_ResetValue (0x00000000UL)  /*!< Reset value of TCFG register.                                        */

/* SUPPLYCLAMP @Bit 0 : Local supply clamp control */
  #define LFLPRC_DFT_TCFG_SUPPLYCLAMP_Pos (0UL)      /*!< Position of SUPPLYCLAMP field.                                       */
  #define LFLPRC_DFT_TCFG_SUPPLYCLAMP_Msk (0x1UL << LFLPRC_DFT_TCFG_SUPPLYCLAMP_Pos) /*!< Bit mask of SUPPLYCLAMP field.       */
  #define LFLPRC_DFT_TCFG_SUPPLYCLAMP_Min (0x0UL)    /*!< Min enumerator value of SUPPLYCLAMP field.                           */
  #define LFLPRC_DFT_TCFG_SUPPLYCLAMP_Max (0x1UL)    /*!< Max enumerator value of SUPPLYCLAMP field.                           */
  #define LFLPRC_DFT_TCFG_SUPPLYCLAMP_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define LFLPRC_DFT_TCFG_SUPPLYCLAMP_Enabled (0x1UL) /*!< (unspecified)                                                       */

/* CHARGEPUMP @Bit 1 : Chargepump control */
  #define LFLPRC_DFT_TCFG_CHARGEPUMP_Pos (1UL)       /*!< Position of CHARGEPUMP field.                                        */
  #define LFLPRC_DFT_TCFG_CHARGEPUMP_Msk (0x1UL << LFLPRC_DFT_TCFG_CHARGEPUMP_Pos) /*!< Bit mask of CHARGEPUMP field.          */
  #define LFLPRC_DFT_TCFG_CHARGEPUMP_Min (0x0UL)     /*!< Min enumerator value of CHARGEPUMP field.                            */
  #define LFLPRC_DFT_TCFG_CHARGEPUMP_Max (0x1UL)     /*!< Max enumerator value of CHARGEPUMP field.                            */
  #define LFLPRC_DFT_TCFG_CHARGEPUMP_Disabled (0x0UL) /*!< (unspecified)                                                       */
  #define LFLPRC_DFT_TCFG_CHARGEPUMP_Enabled (0x1UL) /*!< (unspecified)                                                        */

/* TCFGENABLE @Bit 2 : Enable TCFG control and force settled signal high */
  #define LFLPRC_DFT_TCFG_TCFGENABLE_Pos (2UL)       /*!< Position of TCFGENABLE field.                                        */
  #define LFLPRC_DFT_TCFG_TCFGENABLE_Msk (0x1UL << LFLPRC_DFT_TCFG_TCFGENABLE_Pos) /*!< Bit mask of TCFGENABLE field.          */
  #define LFLPRC_DFT_TCFG_TCFGENABLE_Min (0x0UL)     /*!< Min enumerator value of TCFGENABLE field.                            */
  #define LFLPRC_DFT_TCFG_TCFGENABLE_Max (0x1UL)     /*!< Max enumerator value of TCFGENABLE field.                            */
  #define LFLPRC_DFT_TCFG_TCFGENABLE_Disabled (0x0UL) /*!< (unspecified)                                                       */
  #define LFLPRC_DFT_TCFG_TCFGENABLE_Enabled (0x1UL) /*!< (unspecified)                                                        */


/* ====================================================== Struct LFLPRC ====================================================== */
/**
  * @brief LFLPRC peripheral
  */
  typedef struct {                                   /*!< LFLPRC Structure                                                     */
    __IM uint32_t RESERVED[256];
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000400) Status of analog module output signals                */
    __IM uint32_t RESERVED1[3];
    __IOM NRF_LFLPRC_CONFIG_Type CONFIG;             /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED2[11];
    __IOM NRF_LFLPRC_TRIM_Type TRIM;                 /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED3[12];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IM uint32_t RESERVED4[31];
    __IOM NRF_LFLPRC_OVERRIDE_Type OVERRIDE;         /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED5[62];
    __IOM NRF_LFLPRC_DFT_Type DFT;                   /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_LFLPRC_Type;                                 /*!< Size = 1588 (0x634)                                                  */

/* LFLPRC_STATUSANA: Status of analog module output signals */
  #define LFLPRC_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                   */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define LFLPRC_STATUSANA_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define LFLPRC_STATUSANA_READY_Msk (0x1UL << LFLPRC_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                       */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define LFLPRC_STATUSANA_SETTLED_Pos (1UL)         /*!< Position of SETTLED field.                                           */
  #define LFLPRC_STATUSANA_SETTLED_Msk (0x1UL << LFLPRC_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.                 */


/* LFLPRC_MIRROR: Enable LOCK for mirrored registers */
  #define LFLPRC_MIRROR_ResetValue (0x00000001UL)    /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define LFLPRC_MIRROR_LOCK_Pos (0UL)               /*!< Position of LOCK field.                                              */
  #define LFLPRC_MIRROR_LOCK_Msk (0x1UL << LFLPRC_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                */
  #define LFLPRC_MIRROR_LOCK_Min (0x0UL)             /*!< Min enumerator value of LOCK field.                                  */
  #define LFLPRC_MIRROR_LOCK_Max (0x1UL)             /*!< Max enumerator value of LOCK field.                                  */
  #define LFLPRC_MIRROR_LOCK_Disabled (0x0UL)        /*!< Lock disabled                                                        */
  #define LFLPRC_MIRROR_LOCK_Enabled (0x1UL)         /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           LFRC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct LFRC_CONFIG ==================================================== */
/**
  * @brief CONFIG [LFRC_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Override the configuration                            */
} NRF_LFRC_CONFIG_Type;                              /*!< Size = 4 (0x004)                                                     */

/* LFRC_CONFIG_CFG: Override the configuration */
  #define LFRC_CONFIG_CFG_ResetValue (0x00000000UL)  /*!< Reset value of CFG register.                                         */

/* DOUBLETAILCURRENT @Bit 0 : Double tail current in comparator CMPX_INT, only for debugging purposes. */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Pos (0UL) /*!< Position of DOUBLETAILCURRENT field.                                */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Msk (0x1UL << LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Pos) /*!< Bit mask of
                                                                            DOUBLETAILCURRENT field.*/
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Min (0x0UL) /*!< Min enumerator value of DOUBLETAILCURRENT field.                  */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Max (0x1UL) /*!< Max enumerator value of DOUBLETAILCURRENT field.                  */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Disabled (0x0UL) /*!< Disabled                                                     */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Enabled (0x1UL) /*!< Enabled                                                       */

/* CONTINUOUSTAILBIAS @Bit 1 : Enable continuous tail bias in comparator CMPX_INT, only for debugging purposes. */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Pos (1UL) /*!< Position of CONTINUOUSTAILBIAS field.                              */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Msk (0x1UL << LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Pos) /*!< Bit mask of
                                                                            CONTINUOUSTAILBIAS field.*/
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Min (0x0UL) /*!< Min enumerator value of CONTINUOUSTAILBIAS field.                */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Max (0x1UL) /*!< Max enumerator value of CONTINUOUSTAILBIAS field.                */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Disabled (0x0UL) /*!< Disabled                                                    */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Enabled (0x1UL) /*!< Enabled                                                      */

/* ENABLERETENTION @Bit 2 : Enable retention for CAL */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Pos (2UL)  /*!< Position of ENABLERETENTION field.                                   */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Msk (0x1UL << LFRC_CONFIG_CFG_ENABLERETENTION_Pos) /*!< Bit mask of ENABLERETENTION
                                                                            field.*/
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Min (0x0UL) /*!< Min enumerator value of ENABLERETENTION field.                      */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Max (0x1UL) /*!< Max enumerator value of ENABLERETENTION field.                      */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Disabled (0x0UL) /*!< Disabled                                                       */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Enabled (0x1UL) /*!< Enabled                                                         */

/* SPARE @Bit 3 : Spare general purpose configuration bits. Register in NVM. */
  #define LFRC_CONFIG_CFG_SPARE_Pos (3UL)            /*!< Position of SPARE field.                                             */
  #define LFRC_CONFIG_CFG_SPARE_Msk (0x1UL << LFRC_CONFIG_CFG_SPARE_Pos) /*!< Bit mask of SPARE field.                         */
  #define LFRC_CONFIG_CFG_SPARE_Min (0x0UL)          /*!< Min enumerator value of SPARE field.                                 */
  #define LFRC_CONFIG_CFG_SPARE_Max (0x1UL)          /*!< Max enumerator value of SPARE field.                                 */
  #define LFRC_CONFIG_CFG_SPARE_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define LFRC_CONFIG_CFG_SPARE_Enabled (0x1UL)      /*!< Enabled                                                              */



/* ===================================================== Struct LFRC_CAL ===================================================== */
/**
  * @brief CAL [LFRC_CAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LENGTH;                            /*!< (@ 0x00000000) Measurement cycle count length used while calibration */
  __IOM uint32_t  TRIMLIMITLO;                       /*!< (@ 0x00000004) Lower trim limit                                      */
  __IOM uint32_t  TRIMLIMITHI;                       /*!< (@ 0x00000008) Higher trim limit                                     */
  __IM  uint32_t  RESULT[2];                         /*!< (@ 0x0000000C) Calibration result from CAL=n                         */
  __IM  uint32_t  NHI;                               /*!< (@ 0x00000014) Number of cycles when the CAL signal is high          */
  __IOM uint32_t  LFRCOSCTRIM;                       /*!< (@ 0x00000018) Initial coarse frequency trimming value for the
                                                                         oscillator.*/
} NRF_LFRC_CAL_Type;                                 /*!< Size = 28 (0x01C)                                                    */

/* LFRC_CAL_LENGTH: Measurement cycle count length used while calibration */
  #define LFRC_CAL_LENGTH_ResetValue (0x00000002UL)  /*!< Reset value of LENGTH register.                                      */

/* LENGTH @Bits 0..2 : Number of cycles */
  #define LFRC_CAL_LENGTH_LENGTH_Pos (0UL)           /*!< Position of LENGTH field.                                            */
  #define LFRC_CAL_LENGTH_LENGTH_Msk (0x7UL << LFRC_CAL_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field.                      */
  #define LFRC_CAL_LENGTH_LENGTH_Min (0x0UL)         /*!< Min enumerator value of LENGTH field.                                */
  #define LFRC_CAL_LENGTH_LENGTH_Max (0x3UL)         /*!< Max enumerator value of LENGTH field.                                */
  #define LFRC_CAL_LENGTH_LENGTH_N64 (0x0UL)         /*!< 64 cycles                                                            */
  #define LFRC_CAL_LENGTH_LENGTH_N128 (0x1UL)        /*!< 128 cycles                                                           */
  #define LFRC_CAL_LENGTH_LENGTH_N256 (0x2UL)        /*!< 256 cycles                                                           */
  #define LFRC_CAL_LENGTH_LENGTH_N512 (0x3UL)        /*!< 512 cycles                                                           */


/* LFRC_CAL_TRIMLIMITLO: Lower trim limit */
  #define LFRC_CAL_TRIMLIMITLO_ResetValue (0x00000000UL) /*!< Reset value of TRIMLIMITLO register.                             */

/* VALUE @Bits 0..17 : TRIM limit value. */
  #define LFRC_CAL_TRIMLIMITLO_VALUE_Pos (0UL)       /*!< Position of VALUE field.                                             */
  #define LFRC_CAL_TRIMLIMITLO_VALUE_Msk (0x3FFFFUL << LFRC_CAL_TRIMLIMITLO_VALUE_Pos) /*!< Bit mask of VALUE field.           */


/* LFRC_CAL_TRIMLIMITHI: Higher trim limit */
  #define LFRC_CAL_TRIMLIMITHI_ResetValue (0x0003FFFFUL) /*!< Reset value of TRIMLIMITHI register.                             */

