adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENABLEDTB3 @Bit 31 : Enable the digital test bus 3 (DTB3) */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB3_Pos (31UL)   /*!< Position of ENABLEDTB3 field.                                        */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB3_Msk (0x1UL << LFRC_DFT_DTBCONFIG_ENABLEDTB3_Pos) /*!< Bit mask of ENABLEDTB3 field.    */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB3_Min (0x0UL)  /*!< Min enumerator value of ENABLEDTB3 field.                            */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB3_Max (0x1UL)  /*!< Max enumerator value of ENABLEDTB3 field.                            */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB3_Disabled (0x0UL) /*!< Digital test bus is disabled                                     */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB3_Enabled (0x1UL) /*!< Digital test bus is enabled                                       */


/* LFRC_DFT_TCFG: Test mode configuration */
  #define LFRC_DFT_TCFG_ResetValue (0x00000000UL)    /*!< Reset value of TCFG register.                                        */

/* DOUBLETAILCURRCOMP @Bit 0 : Enable double tail current in comparator */
  #define LFRC_DFT_TCFG_DOUBLETAILCURRCOMP_Pos (0UL) /*!< Position of DOUBLETAILCURRCOMP field.                                */
  #define LFRC_DFT_TCFG_DOUBLETAILCURRCOMP_Msk (0x1UL << LFRC_DFT_TCFG_DOUBLETAILCURRCOMP_Pos) /*!< Bit mask of
                                                                            DOUBLETAILCURRCOMP field.*/
  #define LFRC_DFT_TCFG_DOUBLETAILCURRCOMP_Min (0x0UL) /*!< Min enumerator value of DOUBLETAILCURRCOMP field.                  */
  #define LFRC_DFT_TCFG_DOUBLETAILCURRCOMP_Max (0x1UL) /*!< Max enumerator value of DOUBLETAILCURRCOMP field.                  */
  #define LFRC_DFT_TCFG_DOUBLETAILCURRCOMP_Disabled (0x0UL) /*!< Normal mode                                                   */
  #define LFRC_DFT_TCFG_DOUBLETAILCURRCOMP_Enabled (0x1UL) /*!< Double tail current in comparator enabled                      */

/* CONTINUOUSTAILBIAS @Bit 1 : Enable continuous tail bias in comparator CMPX_INT, only for debugging purposes. */
  #define LFRC_DFT_TCFG_CONTINUOUSTAILBIAS_Pos (1UL) /*!< Position of CONTINUOUSTAILBIAS field.                                */
  #define LFRC_DFT_TCFG_CONTINUOUSTAILBIAS_Msk (0x1UL << LFRC_DFT_TCFG_CONTINUOUSTAILBIAS_Pos) /*!< Bit mask of
                                                                            CONTINUOUSTAILBIAS field.*/
  #define LFRC_DFT_TCFG_CONTINUOUSTAILBIAS_Min (0x0UL) /*!< Min enumerator value of CONTINUOUSTAILBIAS field.                  */
  #define LFRC_DFT_TCFG_CONTINUOUSTAILBIAS_Max (0x1UL) /*!< Max enumerator value of CONTINUOUSTAILBIAS field.                  */
  #define LFRC_DFT_TCFG_CONTINUOUSTAILBIAS_Disabled (0x0UL) /*!< Disabled                                                      */
  #define LFRC_DFT_TCFG_CONTINUOUSTAILBIAS_Enabled (0x1UL) /*!< Enabled                                                        */


/* ======================================================= Struct LFRC ======================================================= */
/**
  * @brief LFRC peripheral
  */
  typedef struct {                                   /*!< LFRC Structure                                                       */
    __OM uint32_t TASKS_CAL;                         /*!< (@ 0x00000000) Start the calibration of RC oscillator                */
    __OM uint32_t TASKS_CANCELCAL;                   /*!< (@ 0x00000004) Cancel the calibration                                */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_CALDONE;                   /*!< (@ 0x00000100) Calibration done                                      */
    __IOM uint32_t EVENTS_TRIMDONE;                  /*!< (@ 0x00000104) Trim done                                             */
    __IOM uint32_t EVENTS_TRIMERROR;                 /*!< (@ 0x00000108) Trim error                                            */
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUSTRIM;                        /*!< (@ 0x00000400) Current LFRCOSC trimming value.                       */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_LFRC_CONFIG_Type CONFIG;               /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[3];
    __IOM NRF_LFRC_CAL_Type CAL;                     /*!< (@ 0x00000420) (unspecified)                                         */
    __IM uint32_t RESERVED5[17];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t PWRUPCTRL;                        /*!< (@ 0x00000484) Power up control                                      */
    __IM uint32_t RESERVED6[30];
    __IOM NRF_LFRC_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[57];
    __IOM NRF_LFRC_DFT_Type DFT;                     /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_LFRC_Type;                                   /*!< Size = 1588 (0x634)                                                  */

/* LFRC_TASKS_CAL: Start the calibration of RC oscillator */
  #define LFRC_TASKS_CAL_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_CAL register.                                   */

/* TASKS_CAL @Bit 0 : Start the calibration of RC oscillator */
  #define LFRC_TASKS_CAL_TASKS_CAL_Pos (0UL)         /*!< Position of TASKS_CAL field.                                         */
  #define LFRC_TASKS_CAL_TASKS_CAL_Msk (0x1UL << LFRC_TASKS_CAL_TASKS_CAL_Pos) /*!< Bit mask of TASKS_CAL field.               */
  #define LFRC_TASKS_CAL_TASKS_CAL_Min (0x1UL)       /*!< Min enumerator value of TASKS_CAL field.                             */
  #define LFRC_TASKS_CAL_TASKS_CAL_Max (0x1UL)       /*!< Max enumerator value of TASKS_CAL field.                             */
  #define LFRC_TASKS_CAL_TASKS_CAL_Trigger (0x1UL)   /*!< Trigger task                                                         */


/* LFRC_TASKS_CANCELCAL: Cancel the calibration */
  #define LFRC_TASKS_CANCELCAL_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CANCELCAL register.                         */

