adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_CANCELCAL @Bit 0 : Cancel the calibration */
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Pos (0UL) /*!< Position of TASKS_CANCELCAL field.                               */
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Msk (0x1UL << LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Pos) /*!< Bit mask of
                                                                            TASKS_CANCELCAL field.*/
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Min (0x1UL) /*!< Min enumerator value of TASKS_CANCELCAL field.                 */
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Max (0x1UL) /*!< Max enumerator value of TASKS_CANCELCAL field.                 */
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Trigger (0x1UL) /*!< Trigger task                                               */


/* LFRC_EVENTS_CALDONE: Calibration done */
  #define LFRC_EVENTS_CALDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CALDONE register.                           */

/* EVENTS_CALDONE @Bit 0 : Calibration done */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Pos (0UL) /*!< Position of EVENTS_CALDONE field.                                  */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Msk (0x1UL << LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_CALDONE field.*/
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_CALDONE field.                    */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_CALDONE field.                    */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Generated (0x1UL) /*!< Event generated                                            */


/* LFRC_EVENTS_TRIMDONE: Trim done */
  #define LFRC_EVENTS_TRIMDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIMDONE register.                         */

/* EVENTS_TRIMDONE @Bit 0 : Trim done */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Pos (0UL) /*!< Position of EVENTS_TRIMDONE field.                               */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Msk (0x1UL << LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_TRIMDONE field.*/
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIMDONE field.                 */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIMDONE field.                 */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Generated (0x1UL) /*!< Event generated                                          */


/* LFRC_EVENTS_TRIMERROR: Trim error */
  #define LFRC_EVENTS_TRIMERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIMERROR register.                       */

/* EVENTS_TRIMERROR @Bit 0 : Trim error */
  #define LFRC_EVENTS_TRIMERROR_EVENTS_TRIMERROR_Pos (0UL) /*!< Position of EVENTS_TRIMERROR field.                            */
  #define LFRC_EVENTS_TRIMERROR_EVENTS_TRIMERROR_Msk (0x1UL << LFRC_EVENTS_TRIMERROR_EVENTS_TRIMERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_TRIMERROR field.*/
  #define LFRC_EVENTS_TRIMERROR_EVENTS_TRIMERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIMERROR field.              */
  #define LFRC_EVENTS_TRIMERROR_EVENTS_TRIMERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIMERROR field.              */
  #define LFRC_EVENTS_TRIMERROR_EVENTS_TRIMERROR_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define LFRC_EVENTS_TRIMERROR_EVENTS_TRIMERROR_Generated (0x1UL) /*!< Event generated                                        */


/* LFRC_INTEN: Enable or disable interrupt */
  #define LFRC_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* CALDONE @Bit 0 : Enable or disable interrupt for event CALDONE */
  #define LFRC_INTEN_CALDONE_Pos (0UL)               /*!< Position of CALDONE field.                                           */
  #define LFRC_INTEN_CALDONE_Msk (0x1UL << LFRC_INTEN_CALDONE_Pos) /*!< Bit mask of CALDONE field.                             */
  #define LFRC_INTEN_CALDONE_Min (0x0UL)             /*!< Min enumerator value of CALDONE field.                               */
  #define LFRC_INTEN_CALDONE_Max (0x1UL)             /*!< Max enumerator value of CALDONE field.                               */
  #define LFRC_INTEN_CALDONE_Disabled (0x0UL)        /*!< Disable                                                              */
  #define LFRC_INTEN_CALDONE_Enabled (0x1UL)         /*!< Enable                                                               */

/* TRIMDONE @Bit 1 : Enable or disable interrupt for event TRIMDONE */
  #define LFRC_INTEN_TRIMDONE_Pos (1UL)              /*!< Position of TRIMDONE field.                                          */
  #define LFRC_INTEN_TRIMDONE_Msk (0x1UL << LFRC_INTEN_TRIMDONE_Pos) /*!< Bit mask of TRIMDONE field.                          */
  #define LFRC_INTEN_TRIMDONE_Min (0x0UL)            /*!< Min enumerator value of TRIMDONE field.                              */
  #define LFRC_INTEN_TRIMDONE_Max (0x1UL)            /*!< Max enumerator value of TRIMDONE field.                              */
  #define LFRC_INTEN_TRIMDONE_Disabled (0x0UL)       /*!< Disable                                                              */
  #define LFRC_INTEN_TRIMDONE_Enabled (0x1UL)        /*!< Enable                                                               */

/* TRIMERROR @Bit 2 : Enable or disable interrupt for event TRIMERROR */
  #define LFRC_INTEN_TRIMERROR_Pos (2UL)             /*!< Position of TRIMERROR field.                                         */
  #define LFRC_INTEN_TRIMERROR_Msk (0x1UL << LFRC_INTEN_TRIMERROR_Pos) /*!< Bit mask of TRIMERROR field.                       */
  #define LFRC_INTEN_TRIMERROR_Min (0x0UL)           /*!< Min enumerator value of TRIMERROR field.                             */
  #define LFRC_INTEN_TRIMERROR_Max (0x1UL)           /*!< Max enumerator value of TRIMERROR field.                             */
  #define LFRC_INTEN_TRIMERROR_Disabled (0x0UL)      /*!< Disable                                                              */
  #define LFRC_INTEN_TRIMERROR_Enabled (0x1UL)       /*!< Enable                                                               */


