adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TRIMDONE @Bit 1 : Read pending status of interrupt for event TRIMDONE */
  #define LFRC_INTPEND_TRIMDONE_Pos (1UL)            /*!< Position of TRIMDONE field.                                          */
  #define LFRC_INTPEND_TRIMDONE_Msk (0x1UL << LFRC_INTPEND_TRIMDONE_Pos) /*!< Bit mask of TRIMDONE field.                      */
  #define LFRC_INTPEND_TRIMDONE_Min (0x0UL)          /*!< Min enumerator value of TRIMDONE field.                              */
  #define LFRC_INTPEND_TRIMDONE_Max (0x1UL)          /*!< Max enumerator value of TRIMDONE field.                              */
  #define LFRC_INTPEND_TRIMDONE_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define LFRC_INTPEND_TRIMDONE_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* TRIMERROR @Bit 2 : Read pending status of interrupt for event TRIMERROR */
  #define LFRC_INTPEND_TRIMERROR_Pos (2UL)           /*!< Position of TRIMERROR field.                                         */
  #define LFRC_INTPEND_TRIMERROR_Msk (0x1UL << LFRC_INTPEND_TRIMERROR_Pos) /*!< Bit mask of TRIMERROR field.                   */
  #define LFRC_INTPEND_TRIMERROR_Min (0x0UL)         /*!< Min enumerator value of TRIMERROR field.                             */
  #define LFRC_INTPEND_TRIMERROR_Max (0x1UL)         /*!< Max enumerator value of TRIMERROR field.                             */
  #define LFRC_INTPEND_TRIMERROR_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define LFRC_INTPEND_TRIMERROR_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* LFRC_STATUSTRIM: Current LFRCOSC trimming value. */
  #define LFRC_STATUSTRIM_ResetValue (0x0000000AUL)  /*!< Reset value of STATUSTRIM register.                                  */

/* VAL @Bits 0..5 : TRIM value */
  #define LFRC_STATUSTRIM_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define LFRC_STATUSTRIM_VAL_Msk (0x3FUL << LFRC_STATUSTRIM_VAL_Pos) /*!< Bit mask of VAL field.                              */


/* LFRC_STATUSANA: Status of analog module output signals */
  #define LFRC_STATUSANA_ResetValue (0x00000000UL)   /*!< Reset value of STATUSANA register.                                   */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define LFRC_STATUSANA_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define LFRC_STATUSANA_READY_Msk (0x1UL << LFRC_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                           */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define LFRC_STATUSANA_SETTLED_Pos (1UL)           /*!< Position of SETTLED field.                                           */
  #define LFRC_STATUSANA_SETTLED_Msk (0x1UL << LFRC_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.                     */


/* LFRC_MIRROR: Enable LOCK for mirrored registers */
  #define LFRC_MIRROR_ResetValue (0x00000001UL)      /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define LFRC_MIRROR_LOCK_Pos (0UL)                 /*!< Position of LOCK field.                                              */
  #define LFRC_MIRROR_LOCK_Msk (0x1UL << LFRC_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                    */
  #define LFRC_MIRROR_LOCK_Min (0x0UL)               /*!< Min enumerator value of LOCK field.                                  */
  #define LFRC_MIRROR_LOCK_Max (0x1UL)               /*!< Max enumerator value of LOCK field.                                  */
  #define LFRC_MIRROR_LOCK_Disabled (0x0UL)          /*!< Lock disabled                                                        */
  #define LFRC_MIRROR_LOCK_Enabled (0x1UL)           /*!< Lock enabled                                                         */


/* LFRC_PWRUPCTRL: Power up control */
  #define LFRC_PWRUPCTRL_ResetValue (0x00000000UL)   /*!< Reset value of PWRUPCTRL register.                                   */

/* CTRL @Bits 0..1 : Power up control */
  #define LFRC_PWRUPCTRL_CTRL_Pos (0UL)              /*!< Position of CTRL field.                                              */
  #define LFRC_PWRUPCTRL_CTRL_Msk (0x3UL << LFRC_PWRUPCTRL_CTRL_Pos) /*!< Bit mask of CTRL field.                              */
  #define LFRC_PWRUPCTRL_CTRL_Min (0x0UL)            /*!< Min enumerator value of CTRL field.                                  */
  #define LFRC_PWRUPCTRL_CTRL_Max (0x2UL)            /*!< Max enumerator value of CTRL field.                                  */
  #define LFRC_PWRUPCTRL_CTRL_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define LFRC_PWRUPCTRL_CTRL_PowerUp (0x1UL)        /*!< Power up                                                             */
  #define LFRC_PWRUPCTRL_CTRL_PowerDown (0x2UL)      /*!< Power down                                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           LFXO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct LFXO_TRIM ===================================================== */
/**
  * @brief TRIM [LFXO_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PDLOWERTHR;                        /*!< (@ 0x00000000) Peak detector lower threshold trim                    */
  __IOM uint32_t  PDUPPERTHR;                        /*!< (@ 0x00000004) Peak detector upper threshold trim                    */
  __IOM uint32_t  BIAS;                              /*!< (@ 0x00000008) Internal bias generator trim                          */
  __IOM uint32_t  PIXO;                              /*!< (@ 0x0000000C) PIXO high pulse supply trim                           */
  __IOM uint32_t  TRIMBUS;                           /*!< (@ 0x00000010) Reserved trim bus                                     */
} NRF_LFXO_TRIM_Type;                                /*!< Size = 20 (0x014)                                                    */

/* LFXO_TRIM_PDLOWERTHR: Peak detector lower threshold trim */
  #define LFXO_TRIM_PDLOWERTHR_ResetValue (0x00000000UL) /*!< Reset value of PDLOWERTHR register.                              */

/* VAL @Bits 0..4 : Peak detector lower threshold trimming value */
  #define LFXO_TRIM_PDLOWERTHR_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define LFXO_TRIM_PDLOWERTHR_VAL_Msk (0x1FUL << LFXO_TRIM_PDLOWERTHR_VAL_Pos) /*!< Bit mask of VAL field.                    */


/* LFXO_TRIM_PDUPPERTHR: Peak detector upper threshold trim */
  #define LFXO_TRIM_PDUPPERTHR_ResetValue (0x00000000UL) /*!< Reset value of PDUPPERTHR register.                              */

/* VAL @Bits 0..4 : Peak detector upper threshold trimming value */
  #define LFXO_TRIM_PDUPPERTHR_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define LFXO_TRIM_PDUPPERTHR_VAL_Msk (0x1FUL << LFXO_TRIM_PDUPPERTHR_VAL_Pos) /*!< Bit mask of VAL field.                    */


