adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LFXO_TRIM_BIAS: Internal bias generator trim */
  #define LFXO_TRIM_BIAS_ResetValue (0x00000000UL)   /*!< Reset value of BIAS register.                                        */

/* VAL @Bits 0..3 : Internal bias generator trim */
  #define LFXO_TRIM_BIAS_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define LFXO_TRIM_BIAS_VAL_Msk (0xFUL << LFXO_TRIM_BIAS_VAL_Pos) /*!< Bit mask of VAL field.                                 */


/* LFXO_TRIM_PIXO: PIXO high pulse supply trim */
  #define LFXO_TRIM_PIXO_ResetValue (0x00000000UL)   /*!< Reset value of PIXO register.                                        */

/* VAL @Bits 0..4 : PIXO high pulse supply trim */
  #define LFXO_TRIM_PIXO_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define LFXO_TRIM_PIXO_VAL_Msk (0x1FUL << LFXO_TRIM_PIXO_VAL_Pos) /*!< Bit mask of VAL field.                                */


/* LFXO_TRIM_TRIMBUS: Reserved trim bus */
  #define LFXO_TRIM_TRIMBUS_ResetValue (0x00000000UL) /*!< Reset value of TRIMBUS register.                                    */

/* VAL @Bits 0..2 : Value */
  #define LFXO_TRIM_TRIMBUS_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define LFXO_TRIM_TRIMBUS_VAL_Msk (0x7UL << LFXO_TRIM_TRIMBUS_VAL_Pos) /*!< Bit mask of VAL field.                           */



/* ================================================== Struct LFXO_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [LFXO_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000008) Override the MODE signal to the analog module         */
  __IOM uint32_t  BYPASS;                            /*!< (@ 0x0000000C) Override the BYPASS signal to the analog module       */
  __IOM uint32_t  OUTSEL;                            /*!< (@ 0x00000010) Override the OUTSEL[1:0] signal to the analog module  */
  __IOM uint32_t  S2SHPMODE;                         /*!< (@ 0x00000014) Override the S2S_HPMODE signal to the analog module   */
  __IOM uint32_t  PIXOPWRUP;                         /*!< (@ 0x00000018) Override the PIXO_PWRUP signal to the analog module   */
  __IOM uint32_t  PIXOSTARTUP;                       /*!< (@ 0x0000001C) Override the PIXO_STARTUP signal to the analog module */
  __IOM uint32_t  PIERCESTARTUP;                     /*!< (@ 0x00000020) Override the PIERCE_STARTUP signal to the analog
                                                                         module*/
  __IOM uint32_t  PIERCEIDAC;                        /*!< (@ 0x00000024) Override the PIERCE_IDAC signal to the analog module  */
  __IOM uint32_t  PDEN;                              /*!< (@ 0x00000028) Override the PD_EN signal to the analog module        */
  __IOM uint32_t  CLOAD;                             /*!< (@ 0x0000002C) Override the CLOAD signal to the analog module        */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000030) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000034) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  PIXOACK;                           /*!< (@ 0x00000038) Override the PIXO_ACK signal from the analog module   */
  __IOM uint32_t  PDSETTLED;                         /*!< (@ 0x0000003C) Override the PD_SETTLED signal from the analog module */
  __IOM uint32_t  PDOUTLOWER;                        /*!< (@ 0x00000040) Override the PD_OUT_LOWER signal from the analog
                                                                         module*/
  __IOM uint32_t  PDOUTUPPER;                        /*!< (@ 0x00000044) Override the PD_OUT_UPPER signal from the analog
                                                                         module*/
} NRF_LFXO_OVERRIDE_Type;                            /*!< Size = 72 (0x048)                                                    */

/* LFXO_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define LFXO_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                    */

/* VAL @Bit 0 : Override value for the signal */
  #define LFXO_OVERRIDE_PWRUP_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PWRUP_VAL_Msk (0x1UL << LFXO_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PWRUP_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PWRUP_EN_Msk (0x1UL << LFXO_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFXO_OVERRIDE_PWRUP_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PWRUP_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PWRUP_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_PWRUP_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define LFXO_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define LFXO_OVERRIDE_RETAIN_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_RETAIN_VAL_Msk (0x1UL << LFXO_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_RETAIN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_RETAIN_EN_Msk (0x1UL << LFXO_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define LFXO_OVERRIDE_RETAIN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_RETAIN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_RETAIN_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_RETAIN_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


