adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define LFXO_DFT_ATB0CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFXO_DFT_ATB0CONFIG_EN_Msk (0x1UL << LFXO_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFXO_DFT_ATB0CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFXO_DFT_ATB0CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFXO_DFT_ATB0CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled(HiZ)                                     */
  #define LFXO_DFT_ATB0CONFIG_EN_Enabled (0x1UL)     /*!< Analog test bus is enabled                                           */


/* LFXO_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define LFXO_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB1 */
  #define LFXO_DFT_ATB1CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define LFXO_DFT_ATB1CONFIG_SELMUX_Msk (0x7UL << LFXO_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define LFXO_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define LFXO_DFT_ATB1CONFIG_SELMUX_Max (0x5UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define LFXO_DFT_ATB1CONFIG_SELMUX_XC2 (0x0UL)     /*!< Functional tests/main production test                                */
  #define LFXO_DFT_ATB1CONFIG_SELMUX_VPIU (0x1UL)    /*!< Test/trim upper PIXO supply                                          */
  #define LFXO_DFT_ATB1CONFIG_SELMUX_VDDINT0V8 (0x4UL) /*!< Measure current consumption VDD_INT_0V8.                           */
  #define LFXO_DFT_ATB1CONFIG_SELMUX_VDDINT1V8 (0x5UL) /*!< Measure current consumption VDD_INT_1V8.                           */

/* EN @Bit 31 : Enable the analog test bus */
  #define LFXO_DFT_ATB1CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFXO_DFT_ATB1CONFIG_EN_Msk (0x1UL << LFXO_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFXO_DFT_ATB1CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFXO_DFT_ATB1CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFXO_DFT_ATB1CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled(HiZ)                                     */
  #define LFXO_DFT_ATB1CONFIG_EN_Enabled (0x1UL)     /*!< Analog test bus is enabled                                           */


/* LFXO_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define LFXO_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << LFXO_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_Max (0x5UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_OSC32K (0x0UL)  /*!< OSC_32K                                                              */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_PDLOWER (0x1UL) /*!< PD_LOWER                                                             */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_PIXOPULSENEG (0x2UL) /*!< PIXO_PULSE_NEG                                                  */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_PIXOACK0 (0x3UL) /*!< PIXO_ACK[0]                                                         */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_IDAC3 (0x4UL)   /*!< Observe IDAC[3].                                                     */
  #define LFXO_DFT_DTB0CONFIG_SELMUX_IDAC0 (0x5UL)   /*!< Observe IDAC[0].                                                     */

/* EN @Bit 31 : Enable the digital test bus */
  #define LFXO_DFT_DTB0CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFXO_DFT_DTB0CONFIG_EN_Msk (0x1UL << LFXO_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFXO_DFT_DTB0CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFXO_DFT_DTB0CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFXO_DFT_DTB0CONFIG_EN_Disabled (0x0UL)    /*!< Digital test bus is disabled                                         */
  #define LFXO_DFT_DTB0CONFIG_EN_Enabled (0x1UL)     /*!< Digital test bus is enabled                                          */


/* LFXO_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define LFXO_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB1 */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_Msk (0x7UL << LFXO_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_Max (0x5UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_READY (0x0UL)   /*!< Ready                                                                */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_PDUPPER (0x1UL) /*!< PD_UPPER                                                             */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_PIXOPULSEPOS (0x2UL) /*!< PIXO_PULSE_POS                                                  */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_PIXOACK1 (0x3UL) /*!< PIXO_ACK[1]                                                         */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_IDAC4 (0x4UL)   /*!< Observe IDAC[4].                                                     */
  #define LFXO_DFT_DTB1CONFIG_SELMUX_IDAC1 (0x5UL)   /*!< Observe IDAC[1].                                                     */

