adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define LFXO_DFT_DTB1CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFXO_DFT_DTB1CONFIG_EN_Msk (0x1UL << LFXO_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFXO_DFT_DTB1CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFXO_DFT_DTB1CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFXO_DFT_DTB1CONFIG_EN_Disabled (0x0UL)    /*!< Digital test bus is disabled                                         */
  #define LFXO_DFT_DTB1CONFIG_EN_Enabled (0x1UL)     /*!< Digital test bus is enabled                                          */


/* LFXO_DFT_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define LFXO_DFT_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB2 */
  #define LFXO_DFT_DTB2CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define LFXO_DFT_DTB2CONFIG_SELMUX_Msk (0x7UL << LFXO_DFT_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define LFXO_DFT_DTB2CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define LFXO_DFT_DTB2CONFIG_SELMUX_Max (0x5UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define LFXO_DFT_DTB2CONFIG_SELMUX_SETTLED (0x0UL) /*!< Settled                                                              */
  #define LFXO_DFT_DTB2CONFIG_SELMUX_PIERCESTARTUP (0x4UL) /*!< Pierce startup                                                 */
  #define LFXO_DFT_DTB2CONFIG_SELMUX_IDAC2 (0x5UL)   /*!< Observe IDAC[2].                                                     */

/* EN @Bit 31 : Enable the digital test bus */
  #define LFXO_DFT_DTB2CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFXO_DFT_DTB2CONFIG_EN_Msk (0x1UL << LFXO_DFT_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFXO_DFT_DTB2CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFXO_DFT_DTB2CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFXO_DFT_DTB2CONFIG_EN_Disabled (0x0UL)    /*!< Digital test bus is disabled                                         */
  #define LFXO_DFT_DTB2CONFIG_EN_Enabled (0x1UL)     /*!< Digital test bus is enabled                                          */


/* LFXO_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define LFXO_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                               */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define LFXO_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                     */
  #define LFXO_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << LFXO_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define LFXO_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                        */
  #define LFXO_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                        */
  #define LFXO_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                          */
  #define LFXO_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                            */


/* LFXO_DFT_TCFG: Test mode configuration */
  #define LFXO_DFT_TCFG_ResetValue (0x00000000UL)    /*!< Reset value of TCFG register.                                        */

/* OSC32KAO0V8MUTE @Bit 0 : OSC_32K_AO_0V8 muted */
  #define LFXO_DFT_TCFG_OSC32KAO0V8MUTE_Pos (0UL)    /*!< Position of OSC32KAO0V8MUTE field.                                   */
  #define LFXO_DFT_TCFG_OSC32KAO0V8MUTE_Msk (0x1UL << LFXO_DFT_TCFG_OSC32KAO0V8MUTE_Pos) /*!< Bit mask of OSC32KAO0V8MUTE
                                                                            field.*/
  #define LFXO_DFT_TCFG_OSC32KAO0V8MUTE_Min (0x0UL)  /*!< Min enumerator value of OSC32KAO0V8MUTE field.                       */
  #define LFXO_DFT_TCFG_OSC32KAO0V8MUTE_Max (0x1UL)  /*!< Max enumerator value of OSC32KAO0V8MUTE field.                       */
  #define LFXO_DFT_TCFG_OSC32KAO0V8MUTE_Disabled (0x0UL) /*!< Override disabled                                                */
  #define LFXO_DFT_TCFG_OSC32KAO0V8MUTE_Enabled (0x1UL) /*!< Override enabled                                                  */

/* PIERCEINV @Bit 1 : Disable PIERCE inverter */
  #define LFXO_DFT_TCFG_PIERCEINV_Pos (1UL)          /*!< Position of PIERCEINV field.                                         */
  #define LFXO_DFT_TCFG_PIERCEINV_Msk (0x1UL << LFXO_DFT_TCFG_PIERCEINV_Pos) /*!< Bit mask of PIERCEINV field.                 */
  #define LFXO_DFT_TCFG_PIERCEINV_Min (0x0UL)        /*!< Min enumerator value of PIERCEINV field.                             */
  #define LFXO_DFT_TCFG_PIERCEINV_Max (0x1UL)        /*!< Max enumerator value of PIERCEINV field.                             */
  #define LFXO_DFT_TCFG_PIERCEINV_Enabled (0x0UL)    /*!< Pierce inverter enabled                                              */
  #define LFXO_DFT_TCFG_PIERCEINV_Disabled (0x1UL)   /*!< Pierce inverter disabled                                             */

/* SPARE @Bit 2 : Spare bit */
  #define LFXO_DFT_TCFG_SPARE_Pos (2UL)              /*!< Position of SPARE field.                                             */
  #define LFXO_DFT_TCFG_SPARE_Msk (0x1UL << LFXO_DFT_TCFG_SPARE_Pos) /*!< Bit mask of SPARE field.                             */


/* ======================================================= Struct LFXO ======================================================= */
/**
  * @brief LFXO peripheral
  */
  typedef struct {                                   /*!< LFXO Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_MODECHANGED;               /*!< (@ 0x00000100) LFXO mode changed                                     */
    __IOM uint32_t EVENTS_ERRORSTARTING;             /*!< (@ 0x00000104) Error while starting the LFXO in PIERCE mode          */
    __IOM uint32_t EVENTS_ERRORRUNNING;              /*!< (@ 0x00000108) Error detected while LFXO was running                 */
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) LFXO status                                           */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[14];
    __IOM NRF_LFXO_TRIM_Type TRIM;                   /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED4[11];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t CLOAD;                            /*!< (@ 0x00000484) Internal capacitive load                              */
    __IOM uint32_t AMPLITUDECTRL;                    /*!< (@ 0x00000488) Amplitude control                                     */
    __IOM uint32_t PWRUPCTRL;                        /*!< (@ 0x0000048C) Power up control                                      */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000490) LFXO mode                                             */
    __IM uint32_t RESERVED5[27];
    __IOM NRF_LFXO_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED6[46];
    __IOM NRF_LFXO_DFT_Type DFT;                     /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_LFXO_Type;                                   /*!< Size = 1588 (0x634)                                                  */

/* LFXO_EVENTS_MODECHANGED: LFXO mode changed */
  #define LFXO_EVENTS_MODECHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MODECHANGED register.                   */

/* EVENTS_MODECHANGED @Bit 0 : LFXO mode changed */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Pos (0UL) /*!< Position of EVENTS_MODECHANGED field.                      */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Msk (0x1UL << LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Pos) /*!< Bit mask
                                                                            of EVENTS_MODECHANGED field.*/
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_MODECHANGED field.        */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_MODECHANGED field.        */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Generated (0x1UL) /*!< Event generated                                    */


/* LFXO_EVENTS_ERRORSTARTING: Error while starting the LFXO in PIERCE mode */
  #define LFXO_EVENTS_ERRORSTARTING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORSTARTING register.               */

/* EVENTS_ERRORSTARTING @Bit 0 : Error while starting the LFXO in PIERCE mode */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Pos (0UL) /*!< Position of EVENTS_ERRORSTARTING field.                */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Msk (0x1UL << LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Pos) /*!<
                                                                            Bit mask of EVENTS_ERRORSTARTING field.*/
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORSTARTING field.  */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORSTARTING field.  */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Generated (0x1UL) /*!< Event generated                                */


/* LFXO_EVENTS_ERRORRUNNING: Error detected while LFXO was running */
  #define LFXO_EVENTS_ERRORRUNNING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORRUNNING register.                 */

/* EVENTS_ERRORRUNNING @Bit 0 : Error detected while LFXO was running */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Pos (0UL) /*!< Position of EVENTS_ERRORRUNNING field.                   */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Msk (0x1UL << LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Pos) /*!< Bit
                                                                            mask of EVENTS_ERRORRUNNING field.*/
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORRUNNING field.     */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORRUNNING field.     */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Generated (0x1UL) /*!< Event generated                                  */


/* LFXO_INTEN: Enable or disable interrupt */
  #define LFXO_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

