adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GPCMP @Bit 1 : Override value for PWRUP_GPCMP_AO_0V8 */
  #define LPCOMP_OVERRIDE_PWRUP_GPCMP_Pos (1UL)      /*!< Position of GPCMP field.                                             */
  #define LPCOMP_OVERRIDE_PWRUP_GPCMP_Msk (0x1UL << LPCOMP_OVERRIDE_PWRUP_GPCMP_Pos) /*!< Bit mask of GPCMP field.             */

/* EN @Bit 31 : Enable the overrides */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Msk (0x1UL << LPCOMP_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Disabled (0x0UL)  /*!< Overrides are disabled                                               */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Enabled (0x1UL)   /*!< Overrides are enabled                                                */


/* LPCOMP_OVERRIDE_CONFIGVOLTLVL: Override LPCMP_INSEL_RET_0V8 and GPCMP_CTRL_RET_0V8[0] */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_ResetValue (0x00000000UL) /*!< Reset value of CONFIGVOLTLVL register.                  */

/* VAL @Bit 0 : Override value for the signal */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_VAL_Msk (0x1UL << LPCOMP_OVERRIDE_CONFIGVOLTLVL_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Msk (0x1UL << LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Pos) /*!< Bit mask of EN field.      */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Enabled (0x1UL) /*!< Override is enabled                                            */



/* ==================================================== Struct LPCOMP_DFT ==================================================== */
/**
  * @brief DFT [LPCOMP_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus (DTB0-3) configuration               */
} NRF_LPCOMP_DFT_Type;                               /*!< Size = 20 (0x014)                                                    */

/* LPCOMP_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define LPCOMP_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                             */

/* EN @Bit 31 : Enable the analog test bus */
  #define LPCOMP_DFT_ATB0CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LPCOMP_DFT_ATB0CONFIG_EN_Msk (0x1UL << LPCOMP_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LPCOMP_DFT_ATB0CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LPCOMP_DFT_ATB0CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LPCOMP_DFT_ATB0CONFIG_EN_Disabled (0x0UL)  /*!< Analog test bus is disabled                                          */
  #define LPCOMP_DFT_ATB0CONFIG_EN_Enabled (0x1UL)   /*!< Analog test bus is enabled                                           */


/* LPCOMP_DFT_DTBCONFIG: Digital Test Bus (DTB0-3) configuration */
  #define LPCOMP_DFT_DTBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTBCONFIG register.                               */

/* SELMUX @Bit 0 : Select multiplexer for DTB0 */
  #define LPCOMP_DFT_DTBCONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define LPCOMP_DFT_DTBCONFIG_SELMUX_Msk (0x1UL << LPCOMP_DFT_DTBCONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define LPCOMP_DFT_DTBCONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define LPCOMP_DFT_DTBCONFIG_SELMUX_Max (0x1UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define LPCOMP_DFT_DTBCONFIG_SELMUX_Config0 (0x0UL) /*!< Configuration 0 selected                                            */
  #define LPCOMP_DFT_DTBCONFIG_SELMUX_Config1 (0x1UL) /*!< Configuration 1 selected                                            */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit on DTB3 */
  #define LPCOMP_DFT_DTBCONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                    */
  #define LPCOMP_DFT_DTBCONFIG_PWRUPDELTEST_Msk (0x1UL << LPCOMP_DFT_DTBCONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define LPCOMP_DFT_DTBCONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                       */
  #define LPCOMP_DFT_DTBCONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                       */
  #define LPCOMP_DFT_DTBCONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                         */
  #define LPCOMP_DFT_DTBCONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                           */

/* ENABLEDTB0 @Bit 28 : Enable the digital test bus 0 (DTB0) */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB0_Pos (28UL) /*!< Position of ENABLEDTB0 field.                                        */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB0_Msk (0x1UL << LPCOMP_DFT_DTBCONFIG_ENABLEDTB0_Pos) /*!< Bit mask of ENABLEDTB0 field.*/
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB0_Min (0x0UL) /*!< Min enumerator value of ENABLEDTB0 field.                           */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB0_Max (0x1UL) /*!< Max enumerator value of ENABLEDTB0 field.                           */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB0_Disabled (0x0UL) /*!< Digital test bus is disabled                                   */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB0_Enabled (0x1UL) /*!< Digital test bus is enabled                                     */

/* ENABLEDTB1 @Bit 29 : Enable the digital test bus */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB1_Pos (29UL) /*!< Position of ENABLEDTB1 field.                                        */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB1_Msk (0x1UL << LPCOMP_DFT_DTBCONFIG_ENABLEDTB1_Pos) /*!< Bit mask of ENABLEDTB1 field.*/
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB1_Min (0x0UL) /*!< Min enumerator value of ENABLEDTB1 field.                           */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB1_Max (0x1UL) /*!< Max enumerator value of ENABLEDTB1 field.                           */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB1_Disabled (0x0UL) /*!< Digital test bus is disabled                                   */
  #define LPCOMP_DFT_DTBCONFIG_ENABLEDTB1_Enabled (0x1UL) /*!< Digital test bus is enabled                                     */


