adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ====================================================== Struct LPCOMP ====================================================== */
/**
  * @brief Low-power comparator
  */
  typedef struct {                                   /*!< LPCOMP Structure                                                     */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start comparator                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop comparator                                       */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000008) Sample comparator value                               */
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000088) Subscribe configuration for task SAMPLE               */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) LPCOMP is ready and output is valid                   */
    __IOM uint32_t EVENTS_DOWN;                      /*!< (@ 0x00000104) Downward crossing                                     */
    __IOM uint32_t EVENTS_UP;                        /*!< (@ 0x00000108) Upward crossing                                       */
    __IOM uint32_t EVENTS_CROSS;                     /*!< (@ 0x0000010C) Downward or upward crossing                           */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_DOWN;                     /*!< (@ 0x00000184) Publish configuration for event DOWN                  */
    __IOM uint32_t PUBLISH_UP;                       /*!< (@ 0x00000188) Publish configuration for event UP                    */
    __IOM uint32_t PUBLISH_CROSS;                    /*!< (@ 0x0000018C) Publish configuration for event CROSS                 */
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED5[60];
    __IM uint32_t RESULT;                            /*!< (@ 0x00000400) Compare result                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable LPCOMP                                         */
    __IOM uint32_t PSEL;                             /*!< (@ 0x00000504) Input pin select                                      */
    __IOM uint32_t REFSEL;                           /*!< (@ 0x00000508) Reference select                                      */
    __IOM uint32_t EXTREFSEL;                        /*!< (@ 0x0000050C) External reference select                             */
    __IM uint32_t RESERVED7[4];
    __IOM uint32_t ANADETECT;                        /*!< (@ 0x00000520) Analog detect configuration                           */
    __IOM uint32_t RETAIN;                           /*!< (@ 0x00000524) Retain signal                                         */
    __IM uint32_t RESERVED8[4];
    __IOM uint32_t HYST;                             /*!< (@ 0x00000538) Comparator hysteresis enable                          */
    __IM uint32_t RESERVED9[17];
    __IOM NRF_LPCOMP_OVERRIDE_Type OVERRIDE;         /*!< (@ 0x00000580) (unspecified)                                         */
    __IM uint32_t RESERVED10[30];
    __IOM NRF_LPCOMP_DFT_Type DFT;                   /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_LPCOMP_Type;                                 /*!< Size = 1556 (0x614)                                                  */

/* LPCOMP_TASKS_START: Start comparator */
  #define LPCOMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                               */

/* TASKS_START @Bit 0 : Start comparator */
  #define LPCOMP_TASKS_START_TASKS_START_Pos (0UL)   /*!< Position of TASKS_START field.                                       */
  #define LPCOMP_TASKS_START_TASKS_START_Msk (0x1UL << LPCOMP_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
  #define LPCOMP_TASKS_START_TASKS_START_Min (0x1UL) /*!< Min enumerator value of TASKS_START field.                           */
  #define LPCOMP_TASKS_START_TASKS_START_Max (0x1UL) /*!< Max enumerator value of TASKS_START field.                           */
  #define LPCOMP_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                     */


/* LPCOMP_TASKS_STOP: Stop comparator */
  #define LPCOMP_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                 */

/* TASKS_STOP @Bit 0 : Stop comparator */
  #define LPCOMP_TASKS_STOP_TASKS_STOP_Pos (0UL)     /*!< Position of TASKS_STOP field.                                        */
  #define LPCOMP_TASKS_STOP_TASKS_STOP_Msk (0x1UL << LPCOMP_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.      */
  #define LPCOMP_TASKS_STOP_TASKS_STOP_Min (0x1UL)   /*!< Min enumerator value of TASKS_STOP field.                            */
  #define LPCOMP_TASKS_STOP_TASKS_STOP_Max (0x1UL)   /*!< Max enumerator value of TASKS_STOP field.                            */
  #define LPCOMP_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                       */


/* LPCOMP_TASKS_SAMPLE: Sample comparator value */
  #define LPCOMP_TASKS_SAMPLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SAMPLE register.                             */

