adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LRCCONF_TASKS_CONSTLAT_ENABLE: Enable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                         */

/* ENABLE @Bit 0 : Enable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                        */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Msk (0x1UL << LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Min (0x1UL) /*!< Min enumerator value of ENABLE field.                          */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                          */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Trigger (0x1UL) /*!< Trigger task                                               */


/* LRCCONF_TASKS_CONSTLAT_DISABLE: Disable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_ResetValue (0x00000000UL) /*!< Reset value of DISABLE register.                       */

/* DISABLE @Bit 0 : Disable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Pos (0UL) /*!< Position of DISABLE field.                                     */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Msk (0x1UL << LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Pos) /*!< Bit mask of
                                                                            DISABLE field.*/
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Min (0x1UL) /*!< Min enumerator value of DISABLE field.                       */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Max (0x1UL) /*!< Max enumerator value of DISABLE field.                       */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Trigger (0x1UL) /*!< Trigger task                                             */



/* ============================================= Struct LRCCONF_TASKS_SYSTEMOFF ============================================== */
/**
  * @brief TASKS_SYSTEMOFF [LRCCONF_TASKS_SYSTEMOFF] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  NOTREADY;                          /*!< (@ 0x00000000) Not ready to go to System OFF                         */
  __OM  uint32_t  READY;                             /*!< (@ 0x00000004) Ready to go to System OFF                             */
} NRF_LRCCONF_TASKS_SYSTEMOFF_Type;                  /*!< Size = 8 (0x008)                                                     */

/* LRCCONF_TASKS_SYSTEMOFF_NOTREADY: Not ready to go to System OFF */
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_ResetValue (0x00000000UL) /*!< Reset value of NOTREADY register.                    */

/* NOTREADY @Bit 0 : Not ready to go to System OFF */
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Pos (0UL) /*!< Position of NOTREADY field.                                 */
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Msk (0x1UL << LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Pos) /*!< Bit mask
                                                                            of NOTREADY field.*/
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Min (0x1UL) /*!< Min enumerator value of NOTREADY field.                   */
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Max (0x1UL) /*!< Max enumerator value of NOTREADY field.                   */
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Trigger (0x1UL) /*!< Trigger task                                          */


/* LRCCONF_TASKS_SYSTEMOFF_READY: Ready to go to System OFF */
  #define LRCCONF_TASKS_SYSTEMOFF_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                          */

/* READY @Bit 0 : Ready to go to System OFF */
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Pos (0UL) /*!< Position of READY field.                                          */
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Msk (0x1UL << LRCCONF_TASKS_SYSTEMOFF_READY_READY_Pos) /*!< Bit mask of READY
                                                                            field.*/
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Min (0x1UL) /*!< Min enumerator value of READY field.                            */
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Max (0x1UL) /*!< Max enumerator value of READY field.                            */
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Trigger (0x1UL) /*!< Trigger task                                                */



/* ================================================= Struct LRCCONF_CLKSTAT ================================================== */
/**
  * @brief CLKSTAT [LRCCONF_CLKSTAT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RUN;                               /*!< (@ 0x00000000) Status indicating that TASKS_REQCLKSRC task has been
                                                                         triggered for clock [n].*/
  __IOM uint32_t  SRC;                               /*!< (@ 0x00000004) Status indicating clock source for clock [n]          */
} NRF_LRCCONF_CLKSTAT_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define LRCCONF_CLKSTAT_MaxCount (8UL)             /*!< Size of CLKSTAT[8] array.                                            */
  #define LRCCONF_CLKSTAT_MaxIndex (7UL)             /*!< Max index of CLKSTAT[8] array.                                       */
  #define LRCCONF_CLKSTAT_MinIndex (0UL)             /*!< Min index of CLKSTAT[8] array.                                       */

/* LRCCONF_CLKSTAT_RUN: Status indicating that TASKS_REQCLKSRC task has been triggered for clock [n]. */
  #define LRCCONF_CLKSTAT_RUN_ResetValue (0x00000000UL) /*!< Reset value of RUN register.                                      */

/* STATUS @Bit 0 : Clock start task triggered or not */
  #define LRCCONF_CLKSTAT_RUN_STATUS_Pos (0UL)       /*!< Position of STATUS field.                                            */
  #define LRCCONF_CLKSTAT_RUN_STATUS_Msk (0x1UL << LRCCONF_CLKSTAT_RUN_STATUS_Pos) /*!< Bit mask of STATUS field.              */
  #define LRCCONF_CLKSTAT_RUN_STATUS_Min (0x0UL)     /*!< Min enumerator value of STATUS field.                                */
  #define LRCCONF_CLKSTAT_RUN_STATUS_Max (0x1UL)     /*!< Max enumerator value of STATUS field.                                */
  #define LRCCONF_CLKSTAT_RUN_STATUS_NotTriggered (0x0UL) /*!< Task not triggered                                              */
  #define LRCCONF_CLKSTAT_RUN_STATUS_Triggered (0x1UL) /*!< Task triggered                                                     */


/* LRCCONF_CLKSTAT_SRC: Status indicating clock source for clock [n] */
  #define LRCCONF_CLKSTAT_SRC_ResetValue (0x00000000UL) /*!< Reset value of SRC register.                                      */

/* SRC @Bit 0 : Clock source status */
  #define LRCCONF_CLKSTAT_SRC_SRC_Pos (0UL)          /*!< Position of SRC field.                                               */
  #define LRCCONF_CLKSTAT_SRC_SRC_Msk (0x1UL << LRCCONF_CLKSTAT_SRC_SRC_Pos) /*!< Bit mask of SRC field.                       */
  #define LRCCONF_CLKSTAT_SRC_SRC_Min (0x0UL)        /*!< Min enumerator value of SRC field.                                   */
  #define LRCCONF_CLKSTAT_SRC_SRC_Max (0x1UL)        /*!< Max enumerator value of SRC field.                                   */
  #define LRCCONF_CLKSTAT_SRC_SRC_OpenLoop (0x0UL)   /*!< Open loop.                                                           */
  #define LRCCONF_CLKSTAT_SRC_SRC_ClosedLoop (0x1UL) /*!< Closed loop.                                                         */

/* BYPASS @Bit 1 : Clock source bypass status */
  #define LRCCONF_CLKSTAT_SRC_BYPASS_Pos (1UL)       /*!< Position of BYPASS field.                                            */
  #define LRCCONF_CLKSTAT_SRC_BYPASS_Msk (0x1UL << LRCCONF_CLKSTAT_SRC_BYPASS_Pos) /*!< Bit mask of BYPASS field.              */
  #define LRCCONF_CLKSTAT_SRC_BYPASS_Min (0x0UL)     /*!< Min enumerator value of BYPASS field.                                */
  #define LRCCONF_CLKSTAT_SRC_BYPASS_Max (0x1UL)     /*!< Max enumerator value of BYPASS field.                                */
  #define LRCCONF_CLKSTAT_SRC_BYPASS_Disable (0x0UL) /*!< Clock source bypass is disabled.                                     */
  #define LRCCONF_CLKSTAT_SRC_BYPASS_Enable (0x1UL)  /*!< Clock source bypass is enabled.                                      */



/* ================================================= Struct LRCCONF_CLKCTRL ================================================== */
/**
  * @brief CLKCTRL [LRCCONF_CLKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ALWAYSRUN;                         /*!< (@ 0x00000000) Force the clock [n] and tree running always           */
  __IOM uint32_t  SRC;                               /*!< (@ 0x00000004) Select the clock source for clock [n]                 */
} NRF_LRCCONF_CLKCTRL_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define LRCCONF_CLKCTRL_MaxCount (8UL)             /*!< Size of CLKCTRL[8] array.                                            */
  #define LRCCONF_CLKCTRL_MaxIndex (7UL)             /*!< Max index of CLKCTRL[8] array.                                       */
  #define LRCCONF_CLKCTRL_MinIndex (0UL)             /*!< Min index of CLKCTRL[8] array.                                       */

