adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ACTIVE2 @Bit 6 : Retain the active power domain[2] */
  #define LRCCONF_RETAIN_ACTIVE2_Pos (6UL)           /*!< Position of ACTIVE2 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE2_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE2_Pos) /*!< Bit mask of ACTIVE2 field.                     */
  #define LRCCONF_RETAIN_ACTIVE2_Min (0x0UL)         /*!< Min enumerator value of ACTIVE2 field.                               */
  #define LRCCONF_RETAIN_ACTIVE2_Max (0x1UL)         /*!< Max enumerator value of ACTIVE2 field.                               */
  #define LRCCONF_RETAIN_ACTIVE2_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE2_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE3 @Bit 7 : Retain the active power domain[3] */
  #define LRCCONF_RETAIN_ACTIVE3_Pos (7UL)           /*!< Position of ACTIVE3 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE3_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE3_Pos) /*!< Bit mask of ACTIVE3 field.                     */
  #define LRCCONF_RETAIN_ACTIVE3_Min (0x0UL)         /*!< Min enumerator value of ACTIVE3 field.                               */
  #define LRCCONF_RETAIN_ACTIVE3_Max (0x1UL)         /*!< Max enumerator value of ACTIVE3 field.                               */
  #define LRCCONF_RETAIN_ACTIVE3_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE3_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE4 @Bit 8 : Retain the active power domain[4] */
  #define LRCCONF_RETAIN_ACTIVE4_Pos (8UL)           /*!< Position of ACTIVE4 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE4_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE4_Pos) /*!< Bit mask of ACTIVE4 field.                     */
  #define LRCCONF_RETAIN_ACTIVE4_Min (0x0UL)         /*!< Min enumerator value of ACTIVE4 field.                               */
  #define LRCCONF_RETAIN_ACTIVE4_Max (0x1UL)         /*!< Max enumerator value of ACTIVE4 field.                               */
  #define LRCCONF_RETAIN_ACTIVE4_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE4_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE5 @Bit 9 : Retain the active power domain[5] */
  #define LRCCONF_RETAIN_ACTIVE5_Pos (9UL)           /*!< Position of ACTIVE5 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE5_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE5_Pos) /*!< Bit mask of ACTIVE5 field.                     */
  #define LRCCONF_RETAIN_ACTIVE5_Min (0x0UL)         /*!< Min enumerator value of ACTIVE5 field.                               */
  #define LRCCONF_RETAIN_ACTIVE5_Max (0x1UL)         /*!< Max enumerator value of ACTIVE5 field.                               */
  #define LRCCONF_RETAIN_ACTIVE5_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE5_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE6 @Bit 10 : Retain the active power domain[6] */
  #define LRCCONF_RETAIN_ACTIVE6_Pos (10UL)          /*!< Position of ACTIVE6 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE6_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE6_Pos) /*!< Bit mask of ACTIVE6 field.                     */
  #define LRCCONF_RETAIN_ACTIVE6_Min (0x0UL)         /*!< Min enumerator value of ACTIVE6 field.                               */
  #define LRCCONF_RETAIN_ACTIVE6_Max (0x1UL)         /*!< Max enumerator value of ACTIVE6 field.                               */
  #define LRCCONF_RETAIN_ACTIVE6_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE6_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE7 @Bit 11 : Retain the active power domain[7] */
  #define LRCCONF_RETAIN_ACTIVE7_Pos (11UL)          /*!< Position of ACTIVE7 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE7_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE7_Pos) /*!< Bit mask of ACTIVE7 field.                     */
  #define LRCCONF_RETAIN_ACTIVE7_Min (0x0UL)         /*!< Min enumerator value of ACTIVE7 field.                               */
  #define LRCCONF_RETAIN_ACTIVE7_Max (0x1UL)         /*!< Max enumerator value of ACTIVE7 field.                               */
  #define LRCCONF_RETAIN_ACTIVE7_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE7_Enable (0x1UL)      /*!< Retain enabled                                                       */


/* LRCCONF_OTHERON: Request other domain ON */
  #define LRCCONF_OTHERON_ResetValue (0x00000000UL)  /*!< Reset value of OTHERON register.                                     */

/* ENABLE0 @Bit 0 : Request power domain[0] ON */
  #define LRCCONF_OTHERON_ENABLE0_Pos (0UL)          /*!< Position of ENABLE0 field.                                           */
  #define LRCCONF_OTHERON_ENABLE0_Msk (0x1UL << LRCCONF_OTHERON_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field.                   */
  #define LRCCONF_OTHERON_ENABLE0_Min (0x0UL)        /*!< Min enumerator value of ENABLE0 field.                               */
  #define LRCCONF_OTHERON_ENABLE0_Max (0x1UL)        /*!< Max enumerator value of ENABLE0 field.                               */
  #define LRCCONF_OTHERON_ENABLE0_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE0_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/

