adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* MBIAS_OVERRIDE_PWRUPIBPP: Override the PWRUP_IBPP signal to the analog module */
  #define MBIAS_OVERRIDE_PWRUPIBPP_ResetValue (0x00000000UL) /*!< Reset value of PWRUPIBPP register.                           */

/* VAL @Bit 0 : Override value for the signal */
  #define MBIAS_OVERRIDE_PWRUPIBPP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define MBIAS_OVERRIDE_PWRUPIBPP_VAL_Msk (0x1UL << MBIAS_OVERRIDE_PWRUPIBPP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define MBIAS_OVERRIDE_PWRUPIBPP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define MBIAS_OVERRIDE_PWRUPIBPP_EN_Msk (0x1UL << MBIAS_OVERRIDE_PWRUPIBPP_EN_Pos) /*!< Bit mask of EN field.                */
  #define MBIAS_OVERRIDE_PWRUPIBPP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_PWRUPIBPP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_PWRUPIBPP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define MBIAS_OVERRIDE_PWRUPIBPP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* MBIAS_OVERRIDE_PWRUPIBPSR: Override the PWRUP_IBPSR signal to the analog module */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_ResetValue (0x00000000UL) /*!< Reset value of PWRUPIBPSR register.                         */

/* VAL @Bit 0 : Override value for the signal */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_VAL_Msk (0x1UL << MBIAS_OVERRIDE_PWRUPIBPSR_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_EN_Msk (0x1UL << MBIAS_OVERRIDE_PWRUPIBPSR_EN_Pos) /*!< Bit mask of EN field.              */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define MBIAS_OVERRIDE_PWRUPIBPSR_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* MBIAS_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define MBIAS_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                 */

/* VAL @Bit 0 : Override value for the signal */
  #define MBIAS_OVERRIDE_RETAIN_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define MBIAS_OVERRIDE_RETAIN_VAL_Msk (0x1UL << MBIAS_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define MBIAS_OVERRIDE_RETAIN_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define MBIAS_OVERRIDE_RETAIN_EN_Msk (0x1UL << MBIAS_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                      */
  #define MBIAS_OVERRIDE_RETAIN_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_RETAIN_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_RETAIN_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define MBIAS_OVERRIDE_RETAIN_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* MBIAS_OVERRIDE_MODE: Override the MODE signal to the analog module */
  #define MBIAS_OVERRIDE_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                     */

/* VAL @Bit 0 : Override value for the signal */
  #define MBIAS_OVERRIDE_MODE_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define MBIAS_OVERRIDE_MODE_VAL_Msk (0x1UL << MBIAS_OVERRIDE_MODE_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define MBIAS_OVERRIDE_MODE_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define MBIAS_OVERRIDE_MODE_EN_Msk (0x1UL << MBIAS_OVERRIDE_MODE_EN_Pos) /*!< Bit mask of EN field.                          */
  #define MBIAS_OVERRIDE_MODE_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_MODE_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_MODE_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define MBIAS_OVERRIDE_MODE_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* MBIAS_OVERRIDE_READYIBPP: Override the READY_IBPP signal from the analog module */
  #define MBIAS_OVERRIDE_READYIBPP_ResetValue (0x00000000UL) /*!< Reset value of READYIBPP register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define MBIAS_OVERRIDE_READYIBPP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define MBIAS_OVERRIDE_READYIBPP_VAL_Msk (0x1UL << MBIAS_OVERRIDE_READYIBPP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define MBIAS_OVERRIDE_READYIBPP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define MBIAS_OVERRIDE_READYIBPP_EN_Msk (0x1UL << MBIAS_OVERRIDE_READYIBPP_EN_Pos) /*!< Bit mask of EN field.                */
  #define MBIAS_OVERRIDE_READYIBPP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_READYIBPP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_READYIBPP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define MBIAS_OVERRIDE_READYIBPP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* MBIAS_OVERRIDE_READYIBPSR: Override the READY_IBPSR signal from the analog module */
  #define MBIAS_OVERRIDE_READYIBPSR_ResetValue (0x00000000UL) /*!< Reset value of READYIBPSR register.                         */

/* VAL @Bit 0 : Current value of the signal */
  #define MBIAS_OVERRIDE_READYIBPSR_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define MBIAS_OVERRIDE_READYIBPSR_VAL_Msk (0x1UL << MBIAS_OVERRIDE_READYIBPSR_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define MBIAS_OVERRIDE_READYIBPSR_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define MBIAS_OVERRIDE_READYIBPSR_EN_Msk (0x1UL << MBIAS_OVERRIDE_READYIBPSR_EN_Pos) /*!< Bit mask of EN field.              */
  #define MBIAS_OVERRIDE_READYIBPSR_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_READYIBPSR_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_READYIBPSR_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define MBIAS_OVERRIDE_READYIBPSR_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* MBIAS_OVERRIDE_SETTLEDIBPSR: Override the SETTLED_IBPSR signal from the analog module */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_ResetValue (0x00000000UL) /*!< Reset value of SETTLEDIBPSR register.                     */

/* VAL @Bit 0 : Current value of the signal */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_VAL_Msk (0x1UL << MBIAS_OVERRIDE_SETTLEDIBPSR_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_EN_Msk (0x1UL << MBIAS_OVERRIDE_SETTLEDIBPSR_EN_Pos) /*!< Bit mask of EN field.          */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define MBIAS_OVERRIDE_SETTLEDIBPSR_EN_Enabled (0x1UL) /*!< Override is enabled                                              */



/* ==================================================== Struct MBIAS_DFT ===================================================== */
/**
  * @brief DFT [MBIAS_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_MBIAS_DFT_Type;                                /*!< Size = 52 (0x034)                                                    */

/* MBIAS_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define MBIAS_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                              */

