adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define MBIAS_DFT_DTB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define MBIAS_DFT_DTB1CONFIG_EN_Msk (0x1UL << MBIAS_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define MBIAS_DFT_DTB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_DFT_DTB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_DFT_DTB1CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define MBIAS_DFT_DTB1CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* MBIAS_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define MBIAS_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                              */

/* SELMUX @Bit 0 : Select multiplexer for DTB3 */
  #define MBIAS_DFT_DTB3CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define MBIAS_DFT_DTB3CONFIG_SELMUX_Msk (0x1UL << MBIAS_DFT_DTB3CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define MBIAS_DFT_DTB3CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_DTB3CONFIG_SELMUX_Max (0x1UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_DTB3CONFIG_SELMUX_PWRUPIBPP (0x0UL) /*!< PWRUPIBPP selected                                                */
  #define MBIAS_DFT_DTB3CONFIG_SELMUX_PWRUPIBPSR (0x1UL) /*!< PWRUPIBPSR selected                                              */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define MBIAS_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                    */
  #define MBIAS_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << MBIAS_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define MBIAS_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                       */
  #define MBIAS_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                       */
  #define MBIAS_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                         */
  #define MBIAS_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                           */

/* EN @Bit 31 : Enable the digital test bus */
  #define MBIAS_DFT_DTB3CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define MBIAS_DFT_DTB3CONFIG_EN_Msk (0x1UL << MBIAS_DFT_DTB3CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define MBIAS_DFT_DTB3CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_DFT_DTB3CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_DFT_DTB3CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define MBIAS_DFT_DTB3CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* MBIAS_DFT_TCFG: Test mode configuration */
  #define MBIAS_DFT_TCFG_ResetValue (0x00000000UL)   /*!< Reset value of TCFG register.                                        */

/* EXTERNALCURRENT @Bit 0 : Use 8uA external current on ATB0_1V8 as reference for IBPSR */
  #define MBIAS_DFT_TCFG_EXTERNALCURRENT_Pos (0UL)   /*!< Position of EXTERNALCURRENT field.                                   */
  #define MBIAS_DFT_TCFG_EXTERNALCURRENT_Msk (0x1UL << MBIAS_DFT_TCFG_EXTERNALCURRENT_Pos) /*!< Bit mask of EXTERNALCURRENT
                                                                            field.*/
  #define MBIAS_DFT_TCFG_EXTERNALCURRENT_Min (0x0UL) /*!< Min enumerator value of EXTERNALCURRENT field.                       */
  #define MBIAS_DFT_TCFG_EXTERNALCURRENT_Max (0x1UL) /*!< Max enumerator value of EXTERNALCURRENT field.                       */
  #define MBIAS_DFT_TCFG_EXTERNALCURRENT_Disabled (0x0UL) /*!< External current is disabled                                    */
  #define MBIAS_DFT_TCFG_EXTERNALCURRENT_Enabled (0x1UL) /*!< External current is enabled                                      */

/* VREF0V9OUTPUT @Bit 1 : Enable VREF_0V9 output */
  #define MBIAS_DFT_TCFG_VREF0V9OUTPUT_Pos (1UL)     /*!< Position of VREF0V9OUTPUT field.                                     */
  #define MBIAS_DFT_TCFG_VREF0V9OUTPUT_Msk (0x1UL << MBIAS_DFT_TCFG_VREF0V9OUTPUT_Pos) /*!< Bit mask of VREF0V9OUTPUT field.   */
  #define MBIAS_DFT_TCFG_VREF0V9OUTPUT_Min (0x0UL)   /*!< Min enumerator value of VREF0V9OUTPUT field.                         */
  #define MBIAS_DFT_TCFG_VREF0V9OUTPUT_Max (0x1UL)   /*!< Max enumerator value of VREF0V9OUTPUT field.                         */
  #define MBIAS_DFT_TCFG_VREF0V9OUTPUT_Disabled (0x0UL) /*!< VREF_0V9 output is disabled                                       */
  #define MBIAS_DFT_TCFG_VREF0V9OUTPUT_Enabled (0x1UL) /*!< VREF_0V9 output is enabled                                         */

/* IBPSRMIRROREXTN @Bit 2 : Disable IBPSR mirror extension */
  #define MBIAS_DFT_TCFG_IBPSRMIRROREXTN_Pos (2UL)   /*!< Position of IBPSRMIRROREXTN field.                                   */
  #define MBIAS_DFT_TCFG_IBPSRMIRROREXTN_Msk (0x1UL << MBIAS_DFT_TCFG_IBPSRMIRROREXTN_Pos) /*!< Bit mask of IBPSRMIRROREXTN
                                                                            field.*/
  #define MBIAS_DFT_TCFG_IBPSRMIRROREXTN_Min (0x0UL) /*!< Min enumerator value of IBPSRMIRROREXTN field.                       */
  #define MBIAS_DFT_TCFG_IBPSRMIRROREXTN_Max (0x1UL) /*!< Max enumerator value of IBPSRMIRROREXTN field.                       */
  #define MBIAS_DFT_TCFG_IBPSRMIRROREXTN_Enabled (0x0UL) /*!< IBPSR mirror extension is enabled                                */
  #define MBIAS_DFT_TCFG_IBPSRMIRROREXTN_Disabled (0x1UL) /*!< IBPSR mirror extension is disabled                              */


/* ====================================================== Struct MBIAS ======================================================= */
/**
  * @brief MBIAS peripheral
  */
  typedef struct {                                   /*!< MBIAS Structure                                                      */
    __OM uint32_t TASKS_PWRUPIBPP;                   /*!< (@ 0x00000000) Power up IBPP currents                                */
    __OM uint32_t TASKS_PWRUPIBPSR;                  /*!< (@ 0x00000004) Power up IBPSR currents                               */
    __OM uint32_t TASKS_PWRDOWNIBPP;                 /*!< (@ 0x00000008) Power down IBPP currents                              */
    __OM uint32_t TASKS_PWRDOWNIBPSR;                /*!< (@ 0x0000000C) Power down IBPSR currents                             */
    __IM uint32_t RESERVED[60];
    __IOM uint32_t EVENTS_READYIBPP;                 /*!< (@ 0x00000100) Power up for IBPP currents is done                    */
    __IOM uint32_t EVENTS_READYIBPSR;                /*!< (@ 0x00000104) Power up for IBPSR currents is done                   */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) MBIAS status                                          */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_MBIAS_CONFIG_Type CONFIG;              /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[11];
    __IOM NRF_MBIAS_TRIM_Type TRIM;                  /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[13];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000484) MBIAS mode                                            */
    __IM uint32_t RESERVED6[30];
    __IOM NRF_MBIAS_OVERRIDE_Type OVERRIDE;          /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[57];
    __IOM NRF_MBIAS_DFT_Type DFT;                    /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_MBIAS_Type;                                  /*!< Size = 1588 (0x634)                                                  */

/* MBIAS_TASKS_PWRUPIBPP: Power up IBPP currents */
  #define MBIAS_TASKS_PWRUPIBPP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUPIBPP register.                        */

/* TASKS_PWRUPIBPP @Bit 0 : Power up IBPP currents */
  #define MBIAS_TASKS_PWRUPIBPP_TASKS_PWRUPIBPP_Pos (0UL) /*!< Position of TASKS_PWRUPIBPP field.                              */
  #define MBIAS_TASKS_PWRUPIBPP_TASKS_PWRUPIBPP_Msk (0x1UL << MBIAS_TASKS_PWRUPIBPP_TASKS_PWRUPIBPP_Pos) /*!< Bit mask of
                                                                            TASKS_PWRUPIBPP field.*/
  #define MBIAS_TASKS_PWRUPIBPP_TASKS_PWRUPIBPP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRUPIBPP field.                */
  #define MBIAS_TASKS_PWRUPIBPP_TASKS_PWRUPIBPP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRUPIBPP field.                */
  #define MBIAS_TASKS_PWRUPIBPP_TASKS_PWRUPIBPP_Trigger (0x1UL) /*!< Trigger task                                              */


