adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* MBIAS_TASKS_PWRUPIBPSR: Power up IBPSR currents */
  #define MBIAS_TASKS_PWRUPIBPSR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUPIBPSR register.                      */

/* TASKS_PWRUPIBPSR @Bit 0 : Power up IBPSR currents */
  #define MBIAS_TASKS_PWRUPIBPSR_TASKS_PWRUPIBPSR_Pos (0UL) /*!< Position of TASKS_PWRUPIBPSR field.                           */
  #define MBIAS_TASKS_PWRUPIBPSR_TASKS_PWRUPIBPSR_Msk (0x1UL << MBIAS_TASKS_PWRUPIBPSR_TASKS_PWRUPIBPSR_Pos) /*!< Bit mask of
                                                                            TASKS_PWRUPIBPSR field.*/
  #define MBIAS_TASKS_PWRUPIBPSR_TASKS_PWRUPIBPSR_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRUPIBPSR field.             */
  #define MBIAS_TASKS_PWRUPIBPSR_TASKS_PWRUPIBPSR_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRUPIBPSR field.             */
  #define MBIAS_TASKS_PWRUPIBPSR_TASKS_PWRUPIBPSR_Trigger (0x1UL) /*!< Trigger task                                            */


/* MBIAS_TASKS_PWRDOWNIBPP: Power down IBPP currents */
  #define MBIAS_TASKS_PWRDOWNIBPP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWNIBPP register.                    */

/* TASKS_PWRDOWNIBPP @Bit 0 : Power down IBPP currents */
  #define MBIAS_TASKS_PWRDOWNIBPP_TASKS_PWRDOWNIBPP_Pos (0UL) /*!< Position of TASKS_PWRDOWNIBPP field.                        */
  #define MBIAS_TASKS_PWRDOWNIBPP_TASKS_PWRDOWNIBPP_Msk (0x1UL << MBIAS_TASKS_PWRDOWNIBPP_TASKS_PWRDOWNIBPP_Pos) /*!< Bit mask
                                                                            of TASKS_PWRDOWNIBPP field.*/
  #define MBIAS_TASKS_PWRDOWNIBPP_TASKS_PWRDOWNIBPP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWNIBPP field.          */
  #define MBIAS_TASKS_PWRDOWNIBPP_TASKS_PWRDOWNIBPP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWNIBPP field.          */
  #define MBIAS_TASKS_PWRDOWNIBPP_TASKS_PWRDOWNIBPP_Trigger (0x1UL) /*!< Trigger task                                          */


/* MBIAS_TASKS_PWRDOWNIBPSR: Power down IBPSR currents */
  #define MBIAS_TASKS_PWRDOWNIBPSR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWNIBPSR register.                  */

/* TASKS_PWRDOWNIBPSR @Bit 0 : Power down IBPSR currents */
  #define MBIAS_TASKS_PWRDOWNIBPSR_TASKS_PWRDOWNIBPSR_Pos (0UL) /*!< Position of TASKS_PWRDOWNIBPSR field.                     */
  #define MBIAS_TASKS_PWRDOWNIBPSR_TASKS_PWRDOWNIBPSR_Msk (0x1UL << MBIAS_TASKS_PWRDOWNIBPSR_TASKS_PWRDOWNIBPSR_Pos) /*!< Bit
                                                                            mask of TASKS_PWRDOWNIBPSR field.*/
  #define MBIAS_TASKS_PWRDOWNIBPSR_TASKS_PWRDOWNIBPSR_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWNIBPSR field.       */
  #define MBIAS_TASKS_PWRDOWNIBPSR_TASKS_PWRDOWNIBPSR_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWNIBPSR field.       */
  #define MBIAS_TASKS_PWRDOWNIBPSR_TASKS_PWRDOWNIBPSR_Trigger (0x1UL) /*!< Trigger task                                        */


/* MBIAS_EVENTS_READYIBPP: Power up for IBPP currents is done */
  #define MBIAS_EVENTS_READYIBPP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYIBPP register.                      */

/* EVENTS_READYIBPP @Bit 0 : Power up for IBPP currents is done */
  #define MBIAS_EVENTS_READYIBPP_EVENTS_READYIBPP_Pos (0UL) /*!< Position of EVENTS_READYIBPP field.                           */
  #define MBIAS_EVENTS_READYIBPP_EVENTS_READYIBPP_Msk (0x1UL << MBIAS_EVENTS_READYIBPP_EVENTS_READYIBPP_Pos) /*!< Bit mask of
                                                                            EVENTS_READYIBPP field.*/
  #define MBIAS_EVENTS_READYIBPP_EVENTS_READYIBPP_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYIBPP field.             */
  #define MBIAS_EVENTS_READYIBPP_EVENTS_READYIBPP_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYIBPP field.             */
  #define MBIAS_EVENTS_READYIBPP_EVENTS_READYIBPP_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define MBIAS_EVENTS_READYIBPP_EVENTS_READYIBPP_Generated (0x1UL) /*!< Event generated                                       */


/* MBIAS_EVENTS_READYIBPSR: Power up for IBPSR currents is done */
  #define MBIAS_EVENTS_READYIBPSR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYIBPSR register.                    */

/* EVENTS_READYIBPSR @Bit 0 : Power up for IBPSR currents is done */
  #define MBIAS_EVENTS_READYIBPSR_EVENTS_READYIBPSR_Pos (0UL) /*!< Position of EVENTS_READYIBPSR field.                        */
  #define MBIAS_EVENTS_READYIBPSR_EVENTS_READYIBPSR_Msk (0x1UL << MBIAS_EVENTS_READYIBPSR_EVENTS_READYIBPSR_Pos) /*!< Bit mask
                                                                            of EVENTS_READYIBPSR field.*/
  #define MBIAS_EVENTS_READYIBPSR_EVENTS_READYIBPSR_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYIBPSR field.          */
  #define MBIAS_EVENTS_READYIBPSR_EVENTS_READYIBPSR_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYIBPSR field.          */
  #define MBIAS_EVENTS_READYIBPSR_EVENTS_READYIBPSR_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define MBIAS_EVENTS_READYIBPSR_EVENTS_READYIBPSR_Generated (0x1UL) /*!< Event generated                                     */


/* MBIAS_INTEN: Enable or disable interrupt */
  #define MBIAS_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* READYIBPP @Bit 0 : Enable or disable interrupt for event READYIBPP */
  #define MBIAS_INTEN_READYIBPP_Pos (0UL)            /*!< Position of READYIBPP field.                                         */
  #define MBIAS_INTEN_READYIBPP_Msk (0x1UL << MBIAS_INTEN_READYIBPP_Pos) /*!< Bit mask of READYIBPP field.                     */
  #define MBIAS_INTEN_READYIBPP_Min (0x0UL)          /*!< Min enumerator value of READYIBPP field.                             */
  #define MBIAS_INTEN_READYIBPP_Max (0x1UL)          /*!< Max enumerator value of READYIBPP field.                             */
  #define MBIAS_INTEN_READYIBPP_Disabled (0x0UL)     /*!< Disable                                                              */
  #define MBIAS_INTEN_READYIBPP_Enabled (0x1UL)      /*!< Enable                                                               */

