adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READYIBPP @Bit 0 : Current value of the READY_IBPP signal from the analog module */
  #define MBIAS_STATUSANA_READYIBPP_Pos (0UL)        /*!< Position of READYIBPP field.                                         */
  #define MBIAS_STATUSANA_READYIBPP_Msk (0x1UL << MBIAS_STATUSANA_READYIBPP_Pos) /*!< Bit mask of READYIBPP field.             */

/* READYIBPSR @Bit 1 : Current value of the READY_IBPSR signal from the analog module */
  #define MBIAS_STATUSANA_READYIBPSR_Pos (1UL)       /*!< Position of READYIBPSR field.                                        */
  #define MBIAS_STATUSANA_READYIBPSR_Msk (0x1UL << MBIAS_STATUSANA_READYIBPSR_Pos) /*!< Bit mask of READYIBPSR field.          */

/* SETTLEDIBPSR @Bit 2 : Current value of the SETTLED_IBPSR signal from the analog module */
  #define MBIAS_STATUSANA_SETTLEDIBPSR_Pos (2UL)     /*!< Position of SETTLEDIBPSR field.                                      */
  #define MBIAS_STATUSANA_SETTLEDIBPSR_Msk (0x1UL << MBIAS_STATUSANA_SETTLEDIBPSR_Pos) /*!< Bit mask of SETTLEDIBPSR field.    */


/* MBIAS_MIRROR: Enable LOCK for mirrored registers */
  #define MBIAS_MIRROR_ResetValue (0x00000001UL)     /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define MBIAS_MIRROR_LOCK_Pos (0UL)                /*!< Position of LOCK field.                                              */
  #define MBIAS_MIRROR_LOCK_Msk (0x1UL << MBIAS_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                  */
  #define MBIAS_MIRROR_LOCK_Min (0x0UL)              /*!< Min enumerator value of LOCK field.                                  */
  #define MBIAS_MIRROR_LOCK_Max (0x1UL)              /*!< Max enumerator value of LOCK field.                                  */
  #define MBIAS_MIRROR_LOCK_Disabled (0x0UL)         /*!< Lock disabled                                                        */
  #define MBIAS_MIRROR_LOCK_Enabled (0x1UL)          /*!< Lock enabled                                                         */


/* MBIAS_MODE: MBIAS mode */
  #define MBIAS_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Mode */
  #define MBIAS_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define MBIAS_MODE_MODE_Msk (0x3UL << MBIAS_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define MBIAS_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define MBIAS_MODE_MODE_Max (0x2UL)                /*!< Max enumerator value of MODE field.                                  */
  #define MBIAS_MODE_MODE_Auto (0x0UL)               /*!< Automatically handled by the peripheral                              */
  #define MBIAS_MODE_MODE_Normal (0x1UL)             /*!< Normal mode - IBPSR current are continuous ON                        */
  #define MBIAS_MODE_MODE_Refresh (0x2UL)            /*!< Refresh mode - IBPSR currents are duty cycled                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MCAN                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct MCAN ======================================================= */
/**
  * @brief MCAN
  */
  typedef struct {                                   /*!< MCAN Structure                                                       */
    __IM uint32_t CREL;                              /*!< (@ 0x00000000) Core Release Register                                 */
    __IM uint32_t ENDN;                              /*!< (@ 0x00000004) Endian Register                                       */
    __IOM uint32_t CUST;                             /*!< (@ 0x00000008) Customer Register                                     */
    __IOM uint32_t DBTP;                             /*!< (@ 0x0000000C) Data Bit Timing and Prescaler Register                */
    __IOM uint32_t TEST;                             /*!< (@ 0x00000010) Test Register                                         */
    __IOM uint32_t RWD;                              /*!< (@ 0x00000014) RAM Watchdog                                          */
    __IOM uint32_t CCCR;                             /*!< (@ 0x00000018) CC Control Register                                   */
    __IOM uint32_t NBTP;                             /*!< (@ 0x0000001C) Nominal Bit Timing and Prescaler Register             */
    __IOM uint32_t TSCC;                             /*!< (@ 0x00000020) Timestamp Counter Configuration                       */
    __IOM uint32_t TSCV;                             /*!< (@ 0x00000024) Timestamp Counter Value                               */
    __IOM uint32_t TOCC;                             /*!< (@ 0x00000028) Timeout Counter Configuration                         */
    __IOM uint32_t TOCV;                             /*!< (@ 0x0000002C) Timeout Counter Value                                 */
    __IM uint32_t RESERVED[4];
    __IOM uint32_t ECR;                              /*!< (@ 0x00000040) Error Counter Register                                */
    __IOM uint32_t PSR;                              /*!< (@ 0x00000044) Protocol Status Register                              */
    __IOM uint32_t TDCR;                             /*!< (@ 0x00000048) Transmitter Delay Compensation Register               */
    __IM uint32_t RESERVED1;
    __IOM uint32_t IR;                               /*!< (@ 0x00000050) Interrupt Register                                    */
    __IOM uint32_t IE;                               /*!< (@ 0x00000054) Interrupt Enable                                      */
    __IOM uint32_t ILS;                              /*!< (@ 0x00000058) Interrupt Line Select                                 */
    __IOM uint32_t ILE;                              /*!< (@ 0x0000005C) Interrupt Line Enable                                 */
    __IM uint32_t RESERVED2[8];
    __IOM uint32_t GFC;                              /*!< (@ 0x00000080) Global Filter Configuration                           */
    __IOM uint32_t SIDFC;                            /*!< (@ 0x00000084) Standard ID Filter Configuration                      */
    __IOM uint32_t XIDFC;                            /*!< (@ 0x00000088) Extended ID Filter Configuration                      */
    __IM uint32_t RESERVED3;
    __IOM uint32_t XIDAM;                            /*!< (@ 0x00000090) Extended ID AND Mask                                  */
    __IM uint32_t HPMS;                              /*!< (@ 0x00000094) High Priority Message Status                          */
    __IOM uint32_t NDAT1;                            /*!< (@ 0x00000098) New Data 1                                            */
    __IOM uint32_t NDAT2;                            /*!< (@ 0x0000009C) New Data 2                                            */
    __IOM uint32_t RXF0C;                            /*!< (@ 0x000000A0) Rx FIFO 0 Configuration                               */
    __IM uint32_t RXF0S;                             /*!< (@ 0x000000A4) Rx FIFO 0 Status                                      */
    __IOM uint32_t RXF0A;                            /*!< (@ 0x000000A8) Rx FIFO 0 Acknowledge                                 */
    __IOM uint32_t RXBC;                             /*!< (@ 0x000000AC) Rx Buffer Configuration                               */
    __IOM uint32_t RXF1C;                            /*!< (@ 0x000000B0) Rx FIFO 1 Configuration                               */
    __IM uint32_t RXF1S;                             /*!< (@ 0x000000B4) Rx FIFO 1 Status                                      */
    __IOM uint32_t RXF1A;                            /*!< (@ 0x000000B8) Rx FIFO 1 Acknowledge                                 */
    __IOM uint32_t RXESC;                            /*!< (@ 0x000000BC) Rx Buffer / FIFO Element Size Configuration           */
    __IOM uint32_t TXBC;                             /*!< (@ 0x000000C0) Tx Buffer Configuration                               */
    __IM uint32_t TXFQS;                             /*!< (@ 0x000000C4) Tx FIFO/Queue Status                                  */
    __IOM uint32_t TXESC;                            /*!< (@ 0x000000C8) Tx Buffer Element Size Configuration                  */
    __IM uint32_t TXBRP;                             /*!< (@ 0x000000CC) Tx Buffer Request Pending                             */
    __IOM uint32_t TXBAR;                            /*!< (@ 0x000000D0) Tx Buffer Add Request                                 */
    __IOM uint32_t TXBCR;                            /*!< (@ 0x000000D4) Tx Buffer Cancellation Request                        */
    __IM uint32_t TXBTO;                             /*!< (@ 0x000000D8) Tx Buffer Transmission Occurred                       */
    __IM uint32_t TXBCF;                             /*!< (@ 0x000000DC) Tx Buffer Cancellation Finished                       */
    __IOM uint32_t TXBTIE;                           /*!< (@ 0x000000E0) Tx Buffer Transmission Interrupt Enable               */
    __IOM uint32_t TXBCIE;                           /*!< (@ 0x000000E4) Tx Buffer Cancellation Finished Interrupt Enable      */
    __IM uint32_t RESERVED4[2];
    __IOM uint32_t TXEFC;                            /*!< (@ 0x000000F0) Tx Event FIFO Configuration                           */
    __IM uint32_t TXEFS;                             /*!< (@ 0x000000F4) Tx Event FIFO Status                                  */
    __IOM uint32_t TXEFA;                            /*!< (@ 0x000000F8) Tx Event FIFO Acknowledge                             */
  } NRF_MCAN_Type;                                   /*!< Size = 252 (0x0FC)                                                   */

/* MCAN_CREL: Core Release Register */
  #define MCAN_CREL_ResetValue (0x00000000UL)        /*!< Reset value of CREL register.                                        */

