adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DAY @Bits 0..7 : Time Stamp Day */
  #define MCAN_CREL_DAY_Pos (0UL)                    /*!< Position of DAY field.                                               */
  #define MCAN_CREL_DAY_Msk (0xFFUL << MCAN_CREL_DAY_Pos) /*!< Bit mask of DAY field.                                          */

/* MON @Bits 8..15 : Time Stamp Month */
  #define MCAN_CREL_MON_Pos (8UL)                    /*!< Position of MON field.                                               */
  #define MCAN_CREL_MON_Msk (0xFFUL << MCAN_CREL_MON_Pos) /*!< Bit mask of MON field.                                          */

/* YEAR @Bits 16..19 : Time Stamp Year */
  #define MCAN_CREL_YEAR_Pos (16UL)                  /*!< Position of YEAR field.                                              */
  #define MCAN_CREL_YEAR_Msk (0xFUL << MCAN_CREL_YEAR_Pos) /*!< Bit mask of YEAR field.                                        */

/* SUBSTEP @Bits 20..23 : Sub-step of Core Release */
  #define MCAN_CREL_SUBSTEP_Pos (20UL)               /*!< Position of SUBSTEP field.                                           */
  #define MCAN_CREL_SUBSTEP_Msk (0xFUL << MCAN_CREL_SUBSTEP_Pos) /*!< Bit mask of SUBSTEP field.                               */

/* STEP @Bits 24..27 : Step of Core Release */
  #define MCAN_CREL_STEP_Pos (24UL)                  /*!< Position of STEP field.                                              */
  #define MCAN_CREL_STEP_Msk (0xFUL << MCAN_CREL_STEP_Pos) /*!< Bit mask of STEP field.                                        */

/* REL @Bits 28..31 : Core Release */
  #define MCAN_CREL_REL_Pos (28UL)                   /*!< Position of REL field.                                               */
  #define MCAN_CREL_REL_Msk (0xFUL << MCAN_CREL_REL_Pos) /*!< Bit mask of REL field.                                           */


/* MCAN_ENDN: Endian Register */
  #define MCAN_ENDN_ResetValue (0x00000000UL)        /*!< Reset value of ENDN register.                                        */

/* ETV @Bits 0..31 : Endianness Test Value */
  #define MCAN_ENDN_ETV_Pos (0UL)                    /*!< Position of ETV field.                                               */
  #define MCAN_ENDN_ETV_Msk (0xFFFFFFFFUL << MCAN_ENDN_ETV_Pos) /*!< Bit mask of ETV field.                                    */


/* MCAN_DBTP: Data Bit Timing and Prescaler Register */
  #define MCAN_DBTP_ResetValue (0x00000000UL)        /*!< Reset value of DBTP register.                                        */

/* DSJW @Bits 0..3 : Data (Re)Synchronization Jump Width */
  #define MCAN_DBTP_DSJW_Pos (0UL)                   /*!< Position of DSJW field.                                              */
  #define MCAN_DBTP_DSJW_Msk (0xFUL << MCAN_DBTP_DSJW_Pos) /*!< Bit mask of DSJW field.                                        */

/* DTSEG2 @Bits 4..7 : Data time segment after sample point */
  #define MCAN_DBTP_DTSEG2_Pos (4UL)                 /*!< Position of DTSEG2 field.                                            */
  #define MCAN_DBTP_DTSEG2_Msk (0xFUL << MCAN_DBTP_DTSEG2_Pos) /*!< Bit mask of DTSEG2 field.                                  */

/* DTSEG1 @Bits 8..12 : Data time segment before sample point */
  #define MCAN_DBTP_DTSEG1_Pos (8UL)                 /*!< Position of DTSEG1 field.                                            */
  #define MCAN_DBTP_DTSEG1_Msk (0x1FUL << MCAN_DBTP_DTSEG1_Pos) /*!< Bit mask of DTSEG1 field.                                 */

/* DBRP @Bits 16..20 : Data Bit Rate Prescaler */
  #define MCAN_DBTP_DBRP_Pos (16UL)                  /*!< Position of DBRP field.                                              */
  #define MCAN_DBTP_DBRP_Msk (0x1FUL << MCAN_DBTP_DBRP_Pos) /*!< Bit mask of DBRP field.                                       */

/* TDC @Bit 23 : Transmitter Delay Compensation */
  #define MCAN_DBTP_TDC_Pos (23UL)                   /*!< Position of TDC field.                                               */
  #define MCAN_DBTP_TDC_Msk (0x1UL << MCAN_DBTP_TDC_Pos) /*!< Bit mask of TDC field.                                           */
  #define MCAN_DBTP_TDC_Min (0x0UL)                  /*!< Min enumerator value of TDC field.                                   */
  #define MCAN_DBTP_TDC_Max (0x1UL)                  /*!< Max enumerator value of TDC field.                                   */
  #define MCAN_DBTP_TDC_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define MCAN_DBTP_TDC_Enabled (0x1UL)              /*!< (unspecified)                                                        */


/* MCAN_TEST: Test Register */
  #define MCAN_TEST_ResetValue (0x00000000UL)        /*!< Reset value of TEST register.                                        */

/* LBCK @Bit 4 : Loop Back Mode */
  #define MCAN_TEST_LBCK_Pos (4UL)                   /*!< Position of LBCK field.                                              */
  #define MCAN_TEST_LBCK_Msk (0x1UL << MCAN_TEST_LBCK_Pos) /*!< Bit mask of LBCK field.                                        */
  #define MCAN_TEST_LBCK_Min (0x0UL)                 /*!< Min enumerator value of LBCK field.                                  */
  #define MCAN_TEST_LBCK_Max (0x1UL)                 /*!< Max enumerator value of LBCK field.                                  */
  #define MCAN_TEST_LBCK_Disabled (0x0UL)            /*!< Loop Back Mode is disabled                                           */
  #define MCAN_TEST_LBCK_Enabled (0x1UL)             /*!< Loop Back Mode is enabled                                            */

/* TX @Bits 5..6 : Control of Transmit Pin */
  #define MCAN_TEST_TX_Pos (5UL)                     /*!< Position of TX field.                                                */
  #define MCAN_TEST_TX_Msk (0x3UL << MCAN_TEST_TX_Pos) /*!< Bit mask of TX field.                                              */
  #define MCAN_TEST_TX_Min (0x0UL)                   /*!< Min enumerator value of TX field.                                    */
  #define MCAN_TEST_TX_Max (0x3UL)                   /*!< Max enumerator value of TX field.                                    */
  #define MCAN_TEST_TX_CanCore (0x0UL)               /*!< controlled by the CAN Core, updated at the end of the CAN bit time   */
  #define MCAN_TEST_TX_Monitored (0x1UL)             /*!< Sample Point can be monitored at pin m_can_tx                        */
  #define MCAN_TEST_TX_Dominant (0x2UL)              /*!< Dominant (0) level at pin m_can_tx                                   */
  #define MCAN_TEST_TX_Recessive (0x3UL)             /*!< Recessive (1) at pin m_can_tx                                        */

/* RX @Bit 7 : Receive Pin */
  #define MCAN_TEST_RX_Pos (7UL)                     /*!< Position of RX field.                                                */
  #define MCAN_TEST_RX_Msk (0x1UL << MCAN_TEST_RX_Pos) /*!< Bit mask of RX field.                                              */
  #define MCAN_TEST_RX_Min (0x0UL)                   /*!< Min enumerator value of RX field.                                    */
  #define MCAN_TEST_RX_Max (0x1UL)                   /*!< Max enumerator value of RX field.                                    */
  #define MCAN_TEST_RX_Dominant (0x0UL)              /*!< The CAN bus is dominant (m_can_rx = 0)                               */
  #define MCAN_TEST_RX_Recessive (0x1UL)             /*!< The CAN bus is recessive (m_can_rx = '1')                            */

/* TXBNP @Bits 8..12 : Tx Buffer Number Prepared */
  #define MCAN_TEST_TXBNP_Pos (8UL)                  /*!< Position of TXBNP field.                                             */
  #define MCAN_TEST_TXBNP_Msk (0x1FUL << MCAN_TEST_TXBNP_Pos) /*!< Bit mask of TXBNP field.                                    */

