adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TOO @Bit 18 : Timeout Occurred */
  #define MCAN_IR_TOO_Pos (18UL)                     /*!< Position of TOO field.                                               */
  #define MCAN_IR_TOO_Msk (0x1UL << MCAN_IR_TOO_Pos) /*!< Bit mask of TOO field.                                               */
  #define MCAN_IR_TOO_Min (0x0UL)                    /*!< Min enumerator value of TOO field.                                   */
  #define MCAN_IR_TOO_Max (0x1UL)                    /*!< Max enumerator value of TOO field.                                   */
  #define MCAN_IR_TOO_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TOO_NotGenerated (0x0UL)           /*!< No timeout                                                           */
  #define MCAN_IR_TOO_Generated (0x1UL)              /*!< Timeout reached                                                      */

/* DRX @Bit 19 : Message stored to Dedicated Rx Buffer */
  #define MCAN_IR_DRX_Pos (19UL)                     /*!< Position of DRX field.                                               */
  #define MCAN_IR_DRX_Msk (0x1UL << MCAN_IR_DRX_Pos) /*!< Bit mask of DRX field.                                               */
  #define MCAN_IR_DRX_Min (0x0UL)                    /*!< Min enumerator value of DRX field.                                   */
  #define MCAN_IR_DRX_Max (0x1UL)                    /*!< Max enumerator value of DRX field.                                   */
  #define MCAN_IR_DRX_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_DRX_NotGenerated (0x0UL)           /*!< No Rx Buffer updated                                                 */
  #define MCAN_IR_DRX_Generated (0x1UL)              /*!< At least one received message stored into an Rx Buff er              */

/* BEC @Bit 20 : Bit Error Corrected */
  #define MCAN_IR_BEC_Pos (20UL)                     /*!< Position of BEC field.                                               */
  #define MCAN_IR_BEC_Msk (0x1UL << MCAN_IR_BEC_Pos) /*!< Bit mask of BEC field.                                               */
  #define MCAN_IR_BEC_Min (0x0UL)                    /*!< Min enumerator value of BEC field.                                   */
  #define MCAN_IR_BEC_Max (0x1UL)                    /*!< Max enumerator value of BEC field.                                   */
  #define MCAN_IR_BEC_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_BEC_NotGenerated (0x0UL)           /*!< No bit error detected when reading from Message RAM                  */
  #define MCAN_IR_BEC_Generated (0x1UL)              /*!< Bit error detected and corrected (e.g. ECC)                          */

/* BEU @Bit 21 : Bus Error Uncorrected */
  #define MCAN_IR_BEU_Pos (21UL)                     /*!< Position of BEU field.                                               */
  #define MCAN_IR_BEU_Msk (0x1UL << MCAN_IR_BEU_Pos) /*!< Bit mask of BEU field.                                               */
  #define MCAN_IR_BEU_Min (0x0UL)                    /*!< Min enumerator value of BEU field.                                   */
  #define MCAN_IR_BEU_Max (0x1UL)                    /*!< Max enumerator value of BEU field.                                   */
  #define MCAN_IR_BEU_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_BEU_NotGenerated (0x0UL)           /*!< No read slave error detected when reading from Message RAM           */
  #define MCAN_IR_BEU_Generated (0x1UL)              /*!< Read slave error detected                                            */

/* ELO @Bit 22 : Error Logging Overflow */
  #define MCAN_IR_ELO_Pos (22UL)                     /*!< Position of ELO field.                                               */
  #define MCAN_IR_ELO_Msk (0x1UL << MCAN_IR_ELO_Pos) /*!< Bit mask of ELO field.                                               */
  #define MCAN_IR_ELO_Min (0x0UL)                    /*!< Min enumerator value of ELO field.                                   */
  #define MCAN_IR_ELO_Max (0x1UL)                    /*!< Max enumerator value of ELO field.                                   */
  #define MCAN_IR_ELO_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_ELO_NotGenerated (0x0UL)           /*!< CAN Error Logging Counter did not overflow                           */
  #define MCAN_IR_ELO_Generated (0x1UL)              /*!< Overflow of CAN Error Logging Counter occurred                       */

/* EP @Bit 23 : Error Passive */
  #define MCAN_IR_EP_Pos (23UL)                      /*!< Position of EP field.                                                */
  #define MCAN_IR_EP_Msk (0x1UL << MCAN_IR_EP_Pos)   /*!< Bit mask of EP field.                                                */
  #define MCAN_IR_EP_Min (0x0UL)                     /*!< Min enumerator value of EP field.                                    */
  #define MCAN_IR_EP_Max (0x1UL)                     /*!< Max enumerator value of EP field.                                    */
  #define MCAN_IR_EP_Clear (0x1UL)                   /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_EP_NotGenerated (0x0UL)            /*!< Error_Passive status unchanged                                       */
  #define MCAN_IR_EP_Generated (0x1UL)               /*!< Error_Passive status changed                                         */

/* EW @Bit 24 : Warning Status */
  #define MCAN_IR_EW_Pos (24UL)                      /*!< Position of EW field.                                                */
  #define MCAN_IR_EW_Msk (0x1UL << MCAN_IR_EW_Pos)   /*!< Bit mask of EW field.                                                */
  #define MCAN_IR_EW_Min (0x0UL)                     /*!< Min enumerator value of EW field.                                    */
  #define MCAN_IR_EW_Max (0x1UL)                     /*!< Max enumerator value of EW field.                                    */
  #define MCAN_IR_EW_Clear (0x1UL)                   /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_EW_NotGenerated (0x0UL)            /*!< Error_Warning status unchanged                                       */
  #define MCAN_IR_EW_Generated (0x1UL)               /*!< Error_Warning status changed                                         */

/* BO @Bit 25 : Bus_Off Status */
  #define MCAN_IR_BO_Pos (25UL)                      /*!< Position of BO field.                                                */
  #define MCAN_IR_BO_Msk (0x1UL << MCAN_IR_BO_Pos)   /*!< Bit mask of BO field.                                                */
  #define MCAN_IR_BO_Min (0x0UL)                     /*!< Min enumerator value of BO field.                                    */
  #define MCAN_IR_BO_Max (0x1UL)                     /*!< Max enumerator value of BO field.                                    */
  #define MCAN_IR_BO_Clear (0x1UL)                   /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_BO_NotGenerated (0x0UL)            /*!< Bus_Off status unchanged                                             */
  #define MCAN_IR_BO_Generated (0x1UL)               /*!< Bus_Off status changed                                               */

