adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RF1FE @Bit 6 : Rx FIFO 1 Full Interrupt Enable */
  #define MCAN_IE_RF1FE_Pos (6UL)                    /*!< Position of RF1FE field.                                             */
  #define MCAN_IE_RF1FE_Msk (0x1UL << MCAN_IE_RF1FE_Pos) /*!< Bit mask of RF1FE field.                                         */
  #define MCAN_IE_RF1FE_Min (0x0UL)                  /*!< Min enumerator value of RF1FE field.                                 */
  #define MCAN_IE_RF1FE_Max (0x1UL)                  /*!< Max enumerator value of RF1FE field.                                 */
  #define MCAN_IE_RF1FE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_RF1FE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* RF1LE @Bit 7 : Rx FIFO 1 Message Lost Interrupt Enable */
  #define MCAN_IE_RF1LE_Pos (7UL)                    /*!< Position of RF1LE field.                                             */
  #define MCAN_IE_RF1LE_Msk (0x1UL << MCAN_IE_RF1LE_Pos) /*!< Bit mask of RF1LE field.                                         */
  #define MCAN_IE_RF1LE_Min (0x0UL)                  /*!< Min enumerator value of RF1LE field.                                 */
  #define MCAN_IE_RF1LE_Max (0x1UL)                  /*!< Max enumerator value of RF1LE field.                                 */
  #define MCAN_IE_RF1LE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_RF1LE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* HPME @Bit 8 : High Priority Message Interrupt Enable */
  #define MCAN_IE_HPME_Pos (8UL)                     /*!< Position of HPME field.                                              */
  #define MCAN_IE_HPME_Msk (0x1UL << MCAN_IE_HPME_Pos) /*!< Bit mask of HPME field.                                            */
  #define MCAN_IE_HPME_Min (0x0UL)                   /*!< Min enumerator value of HPME field.                                  */
  #define MCAN_IE_HPME_Max (0x1UL)                   /*!< Max enumerator value of HPME field.                                  */
  #define MCAN_IE_HPME_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_HPME_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* TCE @Bit 9 : Transmission Completed Interrupt Enable */
  #define MCAN_IE_TCE_Pos (9UL)                      /*!< Position of TCE field.                                               */
  #define MCAN_IE_TCE_Msk (0x1UL << MCAN_IE_TCE_Pos) /*!< Bit mask of TCE field.                                               */
  #define MCAN_IE_TCE_Min (0x0UL)                    /*!< Min enumerator value of TCE field.                                   */
  #define MCAN_IE_TCE_Max (0x1UL)                    /*!< Max enumerator value of TCE field.                                   */
  #define MCAN_IE_TCE_Disable (0x0UL)                /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TCE_Enable (0x1UL)                 /*!< Interrupt enabled.                                                   */

/* TCFE @Bit 10 : Transmission Cancellation Finished Interrupt Enable */
  #define MCAN_IE_TCFE_Pos (10UL)                    /*!< Position of TCFE field.                                              */
  #define MCAN_IE_TCFE_Msk (0x1UL << MCAN_IE_TCFE_Pos) /*!< Bit mask of TCFE field.                                            */
  #define MCAN_IE_TCFE_Min (0x0UL)                   /*!< Min enumerator value of TCFE field.                                  */
  #define MCAN_IE_TCFE_Max (0x1UL)                   /*!< Max enumerator value of TCFE field.                                  */
  #define MCAN_IE_TCFE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TCFE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* TFEE @Bit 11 : Tx FIFO Empty Interrupt Enable */
  #define MCAN_IE_TFEE_Pos (11UL)                    /*!< Position of TFEE field.                                              */
  #define MCAN_IE_TFEE_Msk (0x1UL << MCAN_IE_TFEE_Pos) /*!< Bit mask of TFEE field.                                            */
  #define MCAN_IE_TFEE_Min (0x0UL)                   /*!< Min enumerator value of TFEE field.                                  */
  #define MCAN_IE_TFEE_Max (0x1UL)                   /*!< Max enumerator value of TFEE field.                                  */
  #define MCAN_IE_TFEE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TFEE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* TEFNE @Bit 12 : Tx Event FIFO New Entry Interrupt Enable */
  #define MCAN_IE_TEFNE_Pos (12UL)                   /*!< Position of TEFNE field.                                             */
  #define MCAN_IE_TEFNE_Msk (0x1UL << MCAN_IE_TEFNE_Pos) /*!< Bit mask of TEFNE field.                                         */
  #define MCAN_IE_TEFNE_Min (0x0UL)                  /*!< Min enumerator value of TEFNE field.                                 */
  #define MCAN_IE_TEFNE_Max (0x1UL)                  /*!< Max enumerator value of TEFNE field.                                 */
  #define MCAN_IE_TEFNE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TEFNE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* TEFWE @Bit 13 : Tx Event FIFO Watermark Reached Interrupt Enable */
  #define MCAN_IE_TEFWE_Pos (13UL)                   /*!< Position of TEFWE field.                                             */
  #define MCAN_IE_TEFWE_Msk (0x1UL << MCAN_IE_TEFWE_Pos) /*!< Bit mask of TEFWE field.                                         */
  #define MCAN_IE_TEFWE_Min (0x0UL)                  /*!< Min enumerator value of TEFWE field.                                 */
  #define MCAN_IE_TEFWE_Max (0x1UL)                  /*!< Max enumerator value of TEFWE field.                                 */
  #define MCAN_IE_TEFWE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TEFWE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* TEFFE @Bit 14 : Tx Event FIFO Full Interrupt Enable */
  #define MCAN_IE_TEFFE_Pos (14UL)                   /*!< Position of TEFFE field.                                             */
  #define MCAN_IE_TEFFE_Msk (0x1UL << MCAN_IE_TEFFE_Pos) /*!< Bit mask of TEFFE field.                                         */
  #define MCAN_IE_TEFFE_Min (0x0UL)                  /*!< Min enumerator value of TEFFE field.                                 */
  #define MCAN_IE_TEFFE_Max (0x1UL)                  /*!< Max enumerator value of TEFFE field.                                 */
  #define MCAN_IE_TEFFE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TEFFE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* TEFLE @Bit 15 : Tx Event FIFO Event Lost Interrupt Enable */
  #define MCAN_IE_TEFLE_Pos (15UL)                   /*!< Position of TEFLE field.                                             */
  #define MCAN_IE_TEFLE_Msk (0x1UL << MCAN_IE_TEFLE_Pos) /*!< Bit mask of TEFLE field.                                         */
  #define MCAN_IE_TEFLE_Min (0x0UL)                  /*!< Min enumerator value of TEFLE field.                                 */
  #define MCAN_IE_TEFLE_Max (0x1UL)                  /*!< Max enumerator value of TEFLE field.                                 */
  #define MCAN_IE_TEFLE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TEFLE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

