adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCK_DET_ENABLE @Bit 4 : Override for LOCK_DET_ENABLE */
  #define MCPLL_OVERRIDE_MCPLLANA_LOCK_DET_ENABLE_Pos (4UL) /*!< Position of LOCK_DET_ENABLE field.                            */
  #define MCPLL_OVERRIDE_MCPLLANA_LOCK_DET_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLANA_LOCK_DET_ENABLE_Pos) /*!< Bit mask of
                                                                            LOCK_DET_ENABLE field.*/
  #define MCPLL_OVERRIDE_MCPLLANA_LOCK_DET_ENABLE_Min (0x0UL) /*!< Min enumerator value of LOCK_DET_ENABLE field.              */
  #define MCPLL_OVERRIDE_MCPLLANA_LOCK_DET_ENABLE_Max (0x1UL) /*!< Max enumerator value of LOCK_DET_ENABLE field.              */
  #define MCPLL_OVERRIDE_MCPLLANA_LOCK_DET_ENABLE_OFF (0x0UL) /*!< Force LOCK_DET_ENABLE low                                   */
  #define MCPLL_OVERRIDE_MCPLLANA_LOCK_DET_ENABLE_ON (0x1UL) /*!< Force LOCK_DET_ENABLE high                                   */

/* ARSTSD @Bit 5 : Override for MCPLL sigmadelta modulator reset */
  #define MCPLL_OVERRIDE_MCPLLANA_ARSTSD_Pos (5UL)   /*!< Position of ARSTSD field.                                            */
  #define MCPLL_OVERRIDE_MCPLLANA_ARSTSD_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLANA_ARSTSD_Pos) /*!< Bit mask of ARSTSD field.      */
  #define MCPLL_OVERRIDE_MCPLLANA_ARSTSD_Min (0x0UL) /*!< Min enumerator value of ARSTSD field.                                */
  #define MCPLL_OVERRIDE_MCPLLANA_ARSTSD_Max (0x1UL) /*!< Max enumerator value of ARSTSD field.                                */
  #define MCPLL_OVERRIDE_MCPLLANA_ARSTSD_OFF (0x0UL) /*!< Force ARSTSD low                                                     */
  #define MCPLL_OVERRIDE_MCPLLANA_ARSTSD_ON (0x1UL)  /*!< Force ARSTSD high                                                    */


/* MCPLL_OVERRIDE_MCPLLDIG: Override for MCPLL digital controls */
  #define MCPLL_OVERRIDE_MCPLLDIG_ResetValue (0x00000000UL) /*!< Reset value of MCPLLDIG register.                             */

/* ENABLE @Bit 0 : Enable override */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_Pos (0UL)   /*!< Position of ENABLE field.                                            */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLDIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_NoOverride (0x0UL) /*!< No override enabled                                           */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_Override (0x1UL) /*!< All overrides in this register are enabled                      */

/* READY_MCPLL @Bit 1 : Fsm readyMcpll override */
  #define MCPLL_OVERRIDE_MCPLLDIG_READY_MCPLL_Pos (1UL) /*!< Position of READY_MCPLL field.                                    */
  #define MCPLL_OVERRIDE_MCPLLDIG_READY_MCPLL_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLDIG_READY_MCPLL_Pos) /*!< Bit mask of
                                                                            READY_MCPLL field.*/
  #define MCPLL_OVERRIDE_MCPLLDIG_READY_MCPLL_Min (0x0UL) /*!< Min enumerator value of READY_MCPLL field.                      */
  #define MCPLL_OVERRIDE_MCPLLDIG_READY_MCPLL_Max (0x1UL) /*!< Max enumerator value of READY_MCPLL field.                      */
  #define MCPLL_OVERRIDE_MCPLLDIG_READY_MCPLL_LOW (0x0UL) /*!< Force readyMcpll low                                            */
  #define MCPLL_OVERRIDE_MCPLLDIG_READY_MCPLL_HIGH (0x1UL) /*!< Force readyMcpll high                                          */

/* ENABLE_OUTPUTS @Bit 2 : Fsm enableOutputs override */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_OUTPUTS_Pos (2UL) /*!< Position of ENABLE_OUTPUTS field.                              */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_OUTPUTS_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLDIG_ENABLE_OUTPUTS_Pos) /*!< Bit mask of
                                                                            ENABLE_OUTPUTS field.*/
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_OUTPUTS_Min (0x0UL) /*!< Min enumerator value of ENABLE_OUTPUTS field.                */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_OUTPUTS_Max (0x1UL) /*!< Max enumerator value of ENABLE_OUTPUTS field.                */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_OUTPUTS_Disabled (0x0UL) /*!< Force enableOutputs low                                 */
  #define MCPLL_OVERRIDE_MCPLLDIG_ENABLE_OUTPUTS_Enabled (0x1UL) /*!< Force enableOutputs high                                 */


/* ====================================================== Struct MCPLL ======================================================= */
/**
  * @brief Modem Clock PLL
  */
  typedef struct {                                   /*!< MCPLL Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start MCPLL                                           */
    __OM uint32_t TASKS_UPDATE;                      /*!< (@ 0x00000004) Update CONTROL.FRAC and CONTROL.INT values            */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000008) Cancels the START task. MCPLL may be still enabled if
                                                                         requested by HW.*/
    __IM uint32_t RESERVED[61];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) MCPLL start sequence completed. Clock is running.     */
    __IOM uint32_t EVENTS_LOCKTIMEOUT;               /*!< (@ 0x00000104) Error event, lock was not achieved in given timeout
                                                                         limit (LOCKTIMEOUT)*/
    __IOM uint32_t EVENTS_LOCKLOST;                  /*!< (@ 0x00000108) Error event, MCPLL no longer in lock                  */
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t INLOCK;                            /*!< (@ 0x00000400) Status bit for MCPLL inlock signal                    */
    __IM uint32_t REQ_MCPLL_STATUS;                  /*!< (@ 0x00000404) Status bit for REQ_MCPLL input signal                 */
    __IM uint32_t FSM_STATUS;                        /*!< (@ 0x00000408) Current state of MCPLL FSM                            */
    __IM uint32_t CLEANPWR_ACK;                      /*!< (@ 0x0000040C) Status of the clean power ack                         */
    __IM uint32_t HFXO_STATUS;                       /*!< (@ 0x00000410) Status of the HfXo                                    */
    __IM uint32_t RESERVED3[60];
    __IOM NRF_MCPLL_CONTROL_Type CONTROL;            /*!< (@ 0x00000504) (unspecified)                                         */
    __IM uint32_t RESERVED4;
    __IOM uint32_t MA;                               /*!< (@ 0x00000510) Post division ratio for OUTA (LTETIMER and CELLRF)    */
    __IOM uint32_t MB;                               /*!< (@ 0x00000514) Post division ratio for OUTB (TX DAC in CELLRF)       */
    __IOM uint32_t MC;                               /*!< (@ 0x00000518) Post division ratio for OUTC (RX ADC in CELLRF)       */
    __IOM uint32_t MD;                               /*!< (@ 0x0000051C) Post division ratio for OUTD (Unused)                 */
    __IOM uint32_t MTESTOUT;                         /*!< (@ 0x00000520) Post division ratio for Testout                       */
    __IOM uint32_t MCTRIG;                           /*!< (@ 0x00000524) MC register triggering setting                        */
    __IOM uint32_t REQUPDATE;                        /*!< (@ 0x00000528) REQ_UPDATE setting                                    */
    __IM uint32_t RESERVED5;
    __IOM uint32_t TRIM;                             /*!< (@ 0x00000530) MCPLL trimming                                        */
    __IOM NRF_MCPLL_OVERRIDE_Type OVERRIDE;          /*!< (@ 0x00000534) Override mechanism                                    */
    __IM uint32_t RESERVED6[2];
    __IOM uint32_t OUTA_DRV;                         /*!< (@ 0x00000550) Drive strength for OUTA                               */
    __IOM uint32_t OUTB_DRV;                         /*!< (@ 0x00000554) Drive strength for OUTB                               */
    __IOM uint32_t OUTC_DRV;                         /*!< (@ 0x00000558) Drive strength for OUTC                               */
    __IOM uint32_t OUTD_DRV;                         /*!< (@ 0x0000055C) Drive strength for OUTD                               */
    __IOM uint32_t OUTTEST_DRV;                      /*!< (@ 0x00000560) Drive strength for Testout                            */
    __IM uint32_t RESERVED7[3];
    __IOM uint32_t INTMODE;                          /*!< (@ 0x00000570) Integer mode                                          */
    __IM uint32_t RESERVED8[3];
    __IOM uint32_t LOCKTIMEOUT;                      /*!< (@ 0x00000580) Timeout value for locking                             */
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t EXTCLK;                           /*!< (@ 0x00000590) External clock control                                */
    __IM uint32_t RESERVED10[3];
    __IOM uint32_t DBG_DIG;                          /*!< (@ 0x000005A0) Mmi digital debug control                             */
    __IOM uint32_t OUTAEXT_ENA;                      /*!< (@ 0x000005A4) External clock enable (OUTA)                          */
    __IOM uint32_t OUTAEXT_SEL;                      /*!< (@ 0x000005A8) External clock (ckCore) multiplexing to OUTA          */
    __IOM uint32_t PWR_CONTROL;                      /*!< (@ 0x000005AC) Power supply control                                  */
    __IM uint32_t RESERVED11[20];
    __IOM uint32_t ATB;                              /*!< (@ 0x00000600) ATB test bus control                                  */
    __IM uint32_t RESERVED12[63];
    __IOM uint32_t SPARE;                            /*!< (@ 0x00000700) Spare signals                                         */
  } NRF_MCPLL_Type;                                  /*!< Size = 1796 (0x704)                                                  */

/* MCPLL_TASKS_START: Start MCPLL */
  #define MCPLL_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

