adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_START @Bit 0 : Start MCPLL */
  #define MCPLL_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define MCPLL_TASKS_START_TASKS_START_Msk (0x1UL << MCPLL_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define MCPLL_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define MCPLL_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define MCPLL_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* MCPLL_TASKS_UPDATE: Update CONTROL.FRAC and CONTROL.INT values */
  #define MCPLL_TASKS_UPDATE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_UPDATE register.                              */

/* TASKS_UPDATE @Bit 0 : Update CONTROL.FRAC and CONTROL.INT values */
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Pos (0UL)  /*!< Position of TASKS_UPDATE field.                                      */
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Msk (0x1UL << MCPLL_TASKS_UPDATE_TASKS_UPDATE_Pos) /*!< Bit mask of TASKS_UPDATE
                                                                            field.*/
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Min (0x1UL) /*!< Min enumerator value of TASKS_UPDATE field.                         */
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Max (0x1UL) /*!< Max enumerator value of TASKS_UPDATE field.                         */
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Trigger (0x1UL) /*!< Trigger task                                                    */


/* MCPLL_TASKS_STOP: Cancels the START task. MCPLL may be still enabled if requested by HW. */
  #define MCPLL_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Cancels the START task. MCPLL may be still enabled if requested by HW. */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << MCPLL_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* MCPLL_EVENTS_STARTED: MCPLL start sequence completed. Clock is running. */
  #define MCPLL_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                          */

/* EVENTS_STARTED @Bit 0 : MCPLL start sequence completed. Clock is running. */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                 */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << MCPLL_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                   */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                   */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                           */


/* MCPLL_EVENTS_LOCKTIMEOUT: Error event, lock was not achieved in given timeout limit (LOCKTIMEOUT) */
  #define MCPLL_EVENTS_LOCKTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LOCKTIMEOUT register.                  */

/* EVENTS_LOCKTIMEOUT @Bit 0 : Error event, lock was not achieved in given timeout limit (LOCKTIMEOUT) */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Pos (0UL) /*!< Position of EVENTS_LOCKTIMEOUT field.                     */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Msk (0x1UL << MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Pos) /*!< Bit
                                                                            mask of EVENTS_LOCKTIMEOUT field.*/
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Min (0x0UL) /*!< Min enumerator value of EVENTS_LOCKTIMEOUT field.       */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Max (0x1UL) /*!< Max enumerator value of EVENTS_LOCKTIMEOUT field.       */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Generated (0x1UL) /*!< Event generated                                   */


/* MCPLL_EVENTS_LOCKLOST: Error event, MCPLL no longer in lock */
  #define MCPLL_EVENTS_LOCKLOST_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LOCKLOST register.                        */

/* EVENTS_LOCKLOST @Bit 0 : Error event, MCPLL no longer in lock */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Pos (0UL) /*!< Position of EVENTS_LOCKLOST field.                              */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Msk (0x1UL << MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Pos) /*!< Bit mask of
                                                                            EVENTS_LOCKLOST field.*/
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Min (0x0UL) /*!< Min enumerator value of EVENTS_LOCKLOST field.                */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Max (0x1UL) /*!< Max enumerator value of EVENTS_LOCKLOST field.                */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Generated (0x1UL) /*!< Event generated                                         */


/* MCPLL_INTEN: Enable or disable interrupt */
  #define MCPLL_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define MCPLL_INTEN_STARTED_Pos (0UL)              /*!< Position of STARTED field.                                           */
  #define MCPLL_INTEN_STARTED_Msk (0x1UL << MCPLL_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                           */
  #define MCPLL_INTEN_STARTED_Min (0x0UL)            /*!< Min enumerator value of STARTED field.                               */
  #define MCPLL_INTEN_STARTED_Max (0x1UL)            /*!< Max enumerator value of STARTED field.                               */
  #define MCPLL_INTEN_STARTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MCPLL_INTEN_STARTED_Enabled (0x1UL)        /*!< Enable                                                               */

/* LOCKTIMEOUT @Bit 1 : Enable or disable interrupt for event LOCKTIMEOUT */
  #define MCPLL_INTEN_LOCKTIMEOUT_Pos (1UL)          /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_INTEN_LOCKTIMEOUT_Msk (0x1UL << MCPLL_INTEN_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.               */
  #define MCPLL_INTEN_LOCKTIMEOUT_Min (0x0UL)        /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTEN_LOCKTIMEOUT_Max (0x1UL)        /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTEN_LOCKTIMEOUT_Disabled (0x0UL)   /*!< Disable                                                              */
  #define MCPLL_INTEN_LOCKTIMEOUT_Enabled (0x1UL)    /*!< Enable                                                               */

