adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCKLOST @Bit 2 : Enable or disable interrupt for event LOCKLOST */
  #define MCPLL_INTEN_LOCKLOST_Pos (2UL)             /*!< Position of LOCKLOST field.                                          */
  #define MCPLL_INTEN_LOCKLOST_Msk (0x1UL << MCPLL_INTEN_LOCKLOST_Pos) /*!< Bit mask of LOCKLOST field.                        */
  #define MCPLL_INTEN_LOCKLOST_Min (0x0UL)           /*!< Min enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTEN_LOCKLOST_Max (0x1UL)           /*!< Max enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTEN_LOCKLOST_Disabled (0x0UL)      /*!< Disable                                                              */
  #define MCPLL_INTEN_LOCKLOST_Enabled (0x1UL)       /*!< Enable                                                               */


/* MCPLL_INTENSET: Enable interrupt */
  #define MCPLL_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define MCPLL_INTENSET_STARTED_Pos (0UL)           /*!< Position of STARTED field.                                           */
  #define MCPLL_INTENSET_STARTED_Msk (0x1UL << MCPLL_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define MCPLL_INTENSET_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define MCPLL_INTENSET_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define MCPLL_INTENSET_STARTED_Set (0x1UL)         /*!< Enable                                                               */
  #define MCPLL_INTENSET_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MCPLL_INTENSET_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* LOCKTIMEOUT @Bit 1 : Write '1' to enable interrupt for event LOCKTIMEOUT */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Pos (1UL)       /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Msk (0x1UL << MCPLL_INTENSET_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.         */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Min (0x0UL)     /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Max (0x1UL)     /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Set (0x1UL)     /*!< Enable                                                               */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* LOCKLOST @Bit 2 : Write '1' to enable interrupt for event LOCKLOST */
  #define MCPLL_INTENSET_LOCKLOST_Pos (2UL)          /*!< Position of LOCKLOST field.                                          */
  #define MCPLL_INTENSET_LOCKLOST_Msk (0x1UL << MCPLL_INTENSET_LOCKLOST_Pos) /*!< Bit mask of LOCKLOST field.                  */
  #define MCPLL_INTENSET_LOCKLOST_Min (0x0UL)        /*!< Min enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTENSET_LOCKLOST_Max (0x1UL)        /*!< Max enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTENSET_LOCKLOST_Set (0x1UL)        /*!< Enable                                                               */
  #define MCPLL_INTENSET_LOCKLOST_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MCPLL_INTENSET_LOCKLOST_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* MCPLL_INTENCLR: Disable interrupt */
  #define MCPLL_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define MCPLL_INTENCLR_STARTED_Pos (0UL)           /*!< Position of STARTED field.                                           */
  #define MCPLL_INTENCLR_STARTED_Msk (0x1UL << MCPLL_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define MCPLL_INTENCLR_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define MCPLL_INTENCLR_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define MCPLL_INTENCLR_STARTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define MCPLL_INTENCLR_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MCPLL_INTENCLR_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* LOCKTIMEOUT @Bit 1 : Write '1' to disable interrupt for event LOCKTIMEOUT */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Pos (1UL)       /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Msk (0x1UL << MCPLL_INTENCLR_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.         */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Min (0x0UL)     /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Max (0x1UL)     /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Clear (0x1UL)   /*!< Disable                                                              */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* LOCKLOST @Bit 2 : Write '1' to disable interrupt for event LOCKLOST */
  #define MCPLL_INTENCLR_LOCKLOST_Pos (2UL)          /*!< Position of LOCKLOST field.                                          */
  #define MCPLL_INTENCLR_LOCKLOST_Msk (0x1UL << MCPLL_INTENCLR_LOCKLOST_Pos) /*!< Bit mask of LOCKLOST field.                  */
  #define MCPLL_INTENCLR_LOCKLOST_Min (0x0UL)        /*!< Min enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTENCLR_LOCKLOST_Max (0x1UL)        /*!< Max enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTENCLR_LOCKLOST_Clear (0x1UL)      /*!< Disable                                                              */
  #define MCPLL_INTENCLR_LOCKLOST_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MCPLL_INTENCLR_LOCKLOST_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* MCPLL_INTPEND: Pending interrupts */
  #define MCPLL_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

