adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define MCPLL_INTPEND_STARTED_Pos (0UL)            /*!< Position of STARTED field.                                           */
  #define MCPLL_INTPEND_STARTED_Msk (0x1UL << MCPLL_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define MCPLL_INTPEND_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define MCPLL_INTPEND_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define MCPLL_INTPEND_STARTED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MCPLL_INTPEND_STARTED_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* LOCKTIMEOUT @Bit 1 : Read pending status of interrupt for event LOCKTIMEOUT */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Pos (1UL)        /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Msk (0x1UL << MCPLL_INTPEND_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.           */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Min (0x0UL)      /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Max (0x1UL)      /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTPEND_LOCKTIMEOUT_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* LOCKLOST @Bit 2 : Read pending status of interrupt for event LOCKLOST */
  #define MCPLL_INTPEND_LOCKLOST_Pos (2UL)           /*!< Position of LOCKLOST field.                                          */
  #define MCPLL_INTPEND_LOCKLOST_Msk (0x1UL << MCPLL_INTPEND_LOCKLOST_Pos) /*!< Bit mask of LOCKLOST field.                    */
  #define MCPLL_INTPEND_LOCKLOST_Min (0x0UL)         /*!< Min enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTPEND_LOCKLOST_Max (0x1UL)         /*!< Max enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTPEND_LOCKLOST_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define MCPLL_INTPEND_LOCKLOST_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* MCPLL_INLOCK: Status bit for MCPLL inlock signal */
  #define MCPLL_INLOCK_ResetValue (0x00000000UL)     /*!< Reset value of INLOCK register.                                      */

/* INLOCK @Bit 0 : MCPLL locked or not */
  #define MCPLL_INLOCK_INLOCK_Pos (0UL)              /*!< Position of INLOCK field.                                            */
  #define MCPLL_INLOCK_INLOCK_Msk (0x1UL << MCPLL_INLOCK_INLOCK_Pos) /*!< Bit mask of INLOCK field.                            */
  #define MCPLL_INLOCK_INLOCK_Min (0x0UL)            /*!< Min enumerator value of INLOCK field.                                */
  #define MCPLL_INLOCK_INLOCK_Max (0x1UL)            /*!< Max enumerator value of INLOCK field.                                */
  #define MCPLL_INLOCK_INLOCK_NotInLock (0x0UL)      /*!< MCPLL not locked                                                     */
  #define MCPLL_INLOCK_INLOCK_InLock (0x1UL)         /*!< MCPLL locked                                                         */


/* MCPLL_REQ_MCPLL_STATUS: Status bit for REQ_MCPLL input signal */
  #define MCPLL_REQ_MCPLL_STATUS_ResetValue (0x00000000UL) /*!< Reset value of REQ_MCPLL_STATUS register.                      */

/* REQ_MCPLL_STATUS @Bit 0 : MCPLL requested by HW or not */
  #define MCPLL_REQ_MCPLL_STATUS_REQ_MCPLL_STATUS_Pos (0UL) /*!< Position of REQ_MCPLL_STATUS field.                           */
  #define MCPLL_REQ_MCPLL_STATUS_REQ_MCPLL_STATUS_Msk (0x1UL << MCPLL_REQ_MCPLL_STATUS_REQ_MCPLL_STATUS_Pos) /*!< Bit mask of
                                                                            REQ_MCPLL_STATUS field.*/
  #define MCPLL_REQ_MCPLL_STATUS_REQ_MCPLL_STATUS_Min (0x0UL) /*!< Min enumerator value of REQ_MCPLL_STATUS field.             */
  #define MCPLL_REQ_MCPLL_STATUS_REQ_MCPLL_STATUS_Max (0x1UL) /*!< Max enumerator value of REQ_MCPLL_STATUS field.             */
  #define MCPLL_REQ_MCPLL_STATUS_REQ_MCPLL_STATUS_NoRequest (0x0UL) /*!< MCPLL not requested by HW                             */
  #define MCPLL_REQ_MCPLL_STATUS_REQ_MCPLL_STATUS_Requested (0x1UL) /*!< MCPLL requested by HW                                 */


/* MCPLL_FSM_STATUS: Current state of MCPLL FSM */
  #define MCPLL_FSM_STATUS_ResetValue (0x00000000UL) /*!< Reset value of FSM_STATUS register.                                  */

/* FSM_STATUS @Bits 0..4 : state */
  #define MCPLL_FSM_STATUS_FSM_STATUS_Pos (0UL)      /*!< Position of FSM_STATUS field.                                        */
  #define MCPLL_FSM_STATUS_FSM_STATUS_Msk (0x1FUL << MCPLL_FSM_STATUS_FSM_STATUS_Pos) /*!< Bit mask of FSM_STATUS field.       */
  #define MCPLL_FSM_STATUS_FSM_STATUS_Min (0x0UL)    /*!< Min enumerator value of FSM_STATUS field.                            */
  #define MCPLL_FSM_STATUS_FSM_STATUS_Max (0x10UL)   /*!< Max enumerator value of FSM_STATUS field.                            */
  #define MCPLL_FSM_STATUS_FSM_STATUS_Idle (0x00UL)  /*!< No request                                                           */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StartXo (0x01UL) /*!< Request crystal and wait until crystal is settled                  */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StartMcpll (0x02UL) /*!< Enable levelshifters and assert SDM digital reset               */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StartLdo (0x03UL) /*!< Enable LDO                                                        */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StartCore (0x04UL) /*!< Enable analog core                                               */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StartSdm (0x05UL) /*!< Enable sigmadelta modulator                                       */
  #define MCPLL_FSM_STATUS_FSM_STATUS_FCWUpdate (0x06UL) /*!< Fetch division word from register                                */
  #define MCPLL_FSM_STATUS_FSM_STATUS_FCWSettle (0x07UL) /*!< Wait frequency to settle                                         */
  #define MCPLL_FSM_STATUS_FSM_STATUS_EnaOutputs (0x08UL) /*!< Enable output buffers                                           */
  #define MCPLL_FSM_STATUS_FSM_STATUS_Run (0x09UL)   /*!< Enable lock detector                                                 */
  #define MCPLL_FSM_STATUS_FSM_STATUS_Ready (0x0AUL) /*!< Lock detected. Everything ready.                                     */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StopLockdet (0x0BUL) /*!< Disable lock detector                                          */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StopSdm (0x0CUL) /*!< Disable SDM                                                        */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StopLdo (0x0DUL) /*!< Disable LDO                                                        */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StopCore (0x0EUL) /*!< Disable analog core                                               */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StopMcpll (0x0FUL) /*!< Disable levelshifters and assert SDM digital reset               */
  #define MCPLL_FSM_STATUS_FSM_STATUS_StopXo (0x10UL) /*!< Stop requesting crystal                                             */


/* MCPLL_CLEANPWR_ACK: Status of the clean power ack */
  #define MCPLL_CLEANPWR_ACK_ResetValue (0x00000000UL) /*!< Reset value of CLEANPWR_ACK register.                              */

