adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CLEANPWR_ACK @Bit 0 : Status of the clean power ack. Clean power can be requested with CLEANPWR_REQ. */
  #define MCPLL_CLEANPWR_ACK_CLEANPWR_ACK_Pos (0UL)  /*!< Position of CLEANPWR_ACK field.                                      */
  #define MCPLL_CLEANPWR_ACK_CLEANPWR_ACK_Msk (0x1UL << MCPLL_CLEANPWR_ACK_CLEANPWR_ACK_Pos) /*!< Bit mask of CLEANPWR_ACK
                                                                            field.*/
  #define MCPLL_CLEANPWR_ACK_CLEANPWR_ACK_Min (0x0UL) /*!< Min enumerator value of CLEANPWR_ACK field.                         */
  #define MCPLL_CLEANPWR_ACK_CLEANPWR_ACK_Max (0x1UL) /*!< Max enumerator value of CLEANPWR_ACK field.                         */
  #define MCPLL_CLEANPWR_ACK_CLEANPWR_ACK_NACK (0x0UL) /*!< Clean power not yet available or not requested                     */
  #define MCPLL_CLEANPWR_ACK_CLEANPWR_ACK_ACK (0x1UL) /*!< Clean power available                                               */


/* MCPLL_HFXO_STATUS: Status of the HfXo */
  #define MCPLL_HFXO_STATUS_ResetValue (0x00000000UL) /*!< Reset value of HFXO_STATUS register.                                */

/* READY @Bit 0 : Status of the HfXo. */
  #define MCPLL_HFXO_STATUS_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define MCPLL_HFXO_STATUS_READY_Msk (0x1UL << MCPLL_HFXO_STATUS_READY_Pos) /*!< Bit mask of READY field.                     */
  #define MCPLL_HFXO_STATUS_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define MCPLL_HFXO_STATUS_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define MCPLL_HFXO_STATUS_READY_NotReady (0x0UL)   /*!< HfXo is not available.                                               */
  #define MCPLL_HFXO_STATUS_READY_Ready (0x1UL)      /*!< HfXo ready                                                           */


/* MCPLL_MA: Post division ratio for OUTA (LTETIMER and CELLRF) */
  #define MCPLL_MA_ResetValue (0x00000003UL)         /*!< Reset value of MA register.                                          */

/* MA @Bits 0..2 : Post division ratio for OUTA (LTETIMER and CELLRF) */
  #define MCPLL_MA_MA_Pos (0UL)                      /*!< Position of MA field.                                                */
  #define MCPLL_MA_MA_Msk (0x7UL << MCPLL_MA_MA_Pos) /*!< Bit mask of MA field.                                                */
  #define MCPLL_MA_MA_Min (0x0UL)                    /*!< Min enumerator value of MA field.                                    */
  #define MCPLL_MA_MA_Max (0x7UL)                    /*!< Max enumerator value of MA field.                                    */
  #define MCPLL_MA_MA_Nothing (0x0UL)                /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MA_MA_CLK307M2 (0x1UL)               /*!< Division by 16, output frequency is 307.2 MHz                        */
  #define MCPLL_MA_MA_Nothing2 (0x2UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MA_MA_CLK122M88 (0x3UL)              /*!< Division by 40, output frequency is 122.88 MHz                       */
  #define MCPLL_MA_MA_CLK153M6 (0x4UL)               /*!< Division by 32, output frequency is 153.6 MHz                        */
  #define MCPLL_MA_MA_ExtClk (0x5UL)                 /*!< External clock                                                       */
  #define MCPLL_MA_MA_Nothing3 (0x6UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MA_MA_Nothing4 (0x7UL)               /*!< Output grounded, constant logic low                                  */


/* MCPLL_MB: Post division ratio for OUTB (TX DAC in CELLRF) */
  #define MCPLL_MB_ResetValue (0x00000001UL)         /*!< Reset value of MB register.                                          */

/* MB @Bits 0..2 : Post division ratio for OUTB (TX DAC in CELLRF) */
  #define MCPLL_MB_MB_Pos (0UL)                      /*!< Position of MB field.                                                */
  #define MCPLL_MB_MB_Msk (0x7UL << MCPLL_MB_MB_Pos) /*!< Bit mask of MB field.                                                */
  #define MCPLL_MB_MB_Min (0x0UL)                    /*!< Min enumerator value of MB field.                                    */
  #define MCPLL_MB_MB_Max (0x7UL)                    /*!< Max enumerator value of MB field.                                    */
  #define MCPLL_MB_MB_Nothing (0x0UL)                /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MB_MB_CLK307M2 (0x1UL)               /*!< Division by 16, output frequency is 307.2 MHz                        */
  #define MCPLL_MB_MB_Nothing2 (0x2UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MB_MB_Nothing3 (0x3UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MB_MB_CLK153M6 (0x4UL)               /*!< Division by 32, output frequency is 153.6 MHz                        */
  #define MCPLL_MB_MB_ExtClk (0x5UL)                 /*!< External clock                                                       */
  #define MCPLL_MB_MB_Nothing4 (0x6UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MB_MB_Nothing5 (0x7UL)               /*!< Output grounded, constant logic low                                  */


/* MCPLL_MC: Post division ratio for OUTC (RX ADC in CELLRF) */
  #define MCPLL_MC_ResetValue (0x00000001UL)         /*!< Reset value of MC register.                                          */

/* MC @Bits 0..2 : Post division ratio for OUTC (RX ADC in CELLRF). Depending on MC_TRIG register a external trigger is
                   required. Changing the division factor between 15 and 16 on the fly is not glitch free. If division factor is
                   switched between 16 and 15 it must be ensured that the receiver of the clock is disabled at that moment. */

  #define MCPLL_MC_MC_Pos (0UL)                      /*!< Position of MC field.                                                */
  #define MCPLL_MC_MC_Msk (0x7UL << MCPLL_MC_MC_Pos) /*!< Bit mask of MC field.                                                */
  #define MCPLL_MC_MC_Min (0x0UL)                    /*!< Min enumerator value of MC field.                                    */
  #define MCPLL_MC_MC_Max (0x7UL)                    /*!< Max enumerator value of MC field.                                    */
  #define MCPLL_MC_MC_Nothing (0x0UL)                /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MC_MC_CLK307M2 (0x1UL)               /*!< Division by 16, output frequency is 307.2 MHz                        */
  #define MCPLL_MC_MC_CLK327M68 (0x2UL)              /*!< Division by 15, output frequency is 327.68 MHz                       */
  #define MCPLL_MC_MC_Nothing2 (0x3UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MC_MC_CLK153M6 (0x4UL)               /*!< Division by 32, output frequency is 153.6 MHz                        */
  #define MCPLL_MC_MC_ExtClk (0x5UL)                 /*!< External clock                                                       */
  #define MCPLL_MC_MC_Nothing3 (0x6UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MC_MC_Nothing4 (0x7UL)               /*!< Output grounded, constant logic low                                  */


