adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ERRORSOURCE @Bit 16 : Source of memory access error */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Pos (16UL)  /*!< Position of ERRORSOURCE field.                                       */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Msk (0x1UL << MPC_MEMACCERR_INFO_ERRORSOURCE_Pos) /*!< Bit mask of ERRORSOURCE field. */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Min (0x0UL) /*!< Min enumerator value of ERRORSOURCE field.                           */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Max (0x1UL) /*!< Max enumerator value of ERRORSOURCE field.                           */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_MPC (0x1UL) /*!< Error was triggered by MPC module                                    */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Slave (0x0UL) /*!< Error was triggered by an AXI slave                                */



/* ================================================= Struct MPC_GLOBALSLAVE ================================================== */
/**
  * @brief GLOBALSLAVE [MPC_GLOBALSLAVE] Global slave master port connection information
  */
typedef struct {
  __IOM uint32_t  MASTERPORT;                        /*!< (@ 0x00000000) Global slave connection information for master port   */
  __IOM uint32_t  LOCK;                              /*!< (@ 0x00000004) Lock global slave registers                           */
} NRF_MPC_GLOBALSLAVE_Type;                          /*!< Size = 8 (0x008)                                                     */

/* MPC_GLOBALSLAVE_MASTERPORT: Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_ResetValue (0x00000000UL) /*!< Reset value of MASTERPORT register.                        */

/* CONNECTION0 @Bit 0 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Pos (0UL) /*!< Position of CONNECTION0 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Pos) /*!< Bit mask of
                                                                            CONNECTION0 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Min (0x0UL) /*!< Min enumerator value of CONNECTION0 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Max (0x1UL) /*!< Max enumerator value of CONNECTION0 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Disabled (0x0UL) /*!< Master port 0 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Enabled (0x1UL) /*!< Master port 0 connection to global slave is enabled      */

/* CONNECTION1 @Bit 1 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Pos (1UL) /*!< Position of CONNECTION1 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Pos) /*!< Bit mask of
                                                                            CONNECTION1 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Min (0x0UL) /*!< Min enumerator value of CONNECTION1 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Max (0x1UL) /*!< Max enumerator value of CONNECTION1 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Disabled (0x0UL) /*!< Master port 1 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Enabled (0x1UL) /*!< Master port 1 connection to global slave is enabled      */

/* CONNECTION2 @Bit 2 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Pos (2UL) /*!< Position of CONNECTION2 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Pos) /*!< Bit mask of
                                                                            CONNECTION2 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Min (0x0UL) /*!< Min enumerator value of CONNECTION2 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Max (0x1UL) /*!< Max enumerator value of CONNECTION2 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Disabled (0x0UL) /*!< Master port 2 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Enabled (0x1UL) /*!< Master port 2 connection to global slave is enabled      */

/* CONNECTION3 @Bit 3 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Pos (3UL) /*!< Position of CONNECTION3 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Pos) /*!< Bit mask of
                                                                            CONNECTION3 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Min (0x0UL) /*!< Min enumerator value of CONNECTION3 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Max (0x1UL) /*!< Max enumerator value of CONNECTION3 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Disabled (0x0UL) /*!< Master port 3 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Enabled (0x1UL) /*!< Master port 3 connection to global slave is enabled      */

/* CONNECTION4 @Bit 4 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Pos (4UL) /*!< Position of CONNECTION4 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Pos) /*!< Bit mask of
                                                                            CONNECTION4 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Min (0x0UL) /*!< Min enumerator value of CONNECTION4 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Max (0x1UL) /*!< Max enumerator value of CONNECTION4 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Disabled (0x0UL) /*!< Master port 4 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Enabled (0x1UL) /*!< Master port 4 connection to global slave is enabled      */

