adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENABLE13 @Bit 13 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Pos (13UL) /*!< Position of ENABLE13 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE13_Pos) /*!< Bit mask of ENABLE13 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Min (0x0UL) /*!< Min enumerator value of ENABLE13 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Max (0x1UL) /*!< Max enumerator value of ENABLE13 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 13 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 13 Read Address
                                                              Channel*/

/* ENABLE14 @Bit 14 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Pos (14UL) /*!< Position of ENABLE14 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE14_Pos) /*!< Bit mask of ENABLE14 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Min (0x0UL) /*!< Min enumerator value of ENABLE14 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Max (0x1UL) /*!< Max enumerator value of ENABLE14 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 14 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 14 Read Address
                                                              Channel*/

/* ENABLE15 @Bit 15 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Pos (15UL) /*!< Position of ENABLE15 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE15_Pos) /*!< Bit mask of ENABLE15 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Min (0x0UL) /*!< Min enumerator value of ENABLE15 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Max (0x1UL) /*!< Max enumerator value of ENABLE15 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 15 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 15 Read Address
                                                              Channel*/

/* ENABLE16 @Bit 16 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Pos (16UL) /*!< Position of ENABLE16 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE16_Pos) /*!< Bit mask of ENABLE16 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Min (0x0UL) /*!< Min enumerator value of ENABLE16 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Max (0x1UL) /*!< Max enumerator value of ENABLE16 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 16 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 16 Read Address
                                                              Channel*/

/* ENABLE17 @Bit 17 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Pos (17UL) /*!< Position of ENABLE17 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE17_Pos) /*!< Bit mask of ENABLE17 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Min (0x0UL) /*!< Min enumerator value of ENABLE17 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Max (0x1UL) /*!< Max enumerator value of ENABLE17 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 17 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 17 Read Address
                                                              Channel*/

/* ENABLE18 @Bit 18 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Pos (18UL) /*!< Position of ENABLE18 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE18_Pos) /*!< Bit mask of ENABLE18 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Min (0x0UL) /*!< Min enumerator value of ENABLE18 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Max (0x1UL) /*!< Max enumerator value of ENABLE18 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 18 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 18 Read Address
                                                              Channel*/

/* ENABLE19 @Bit 19 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Pos (19UL) /*!< Position of ENABLE19 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE19_Pos) /*!< Bit mask of ENABLE19 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Min (0x0UL) /*!< Min enumerator value of ENABLE19 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Max (0x1UL) /*!< Max enumerator value of ENABLE19 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 19 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 19 Read Address
                                                              Channel*/

/* ENABLE20 @Bit 20 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Pos (20UL) /*!< Position of ENABLE20 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE20_Pos) /*!< Bit mask of ENABLE20 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Min (0x0UL) /*!< Min enumerator value of ENABLE20 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Max (0x1UL) /*!< Max enumerator value of ENABLE20 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 20 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 20 Read Address
                                                              Channel*/

/* ENABLE21 @Bit 21 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Pos (21UL) /*!< Position of ENABLE21 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE21_Pos) /*!< Bit mask of ENABLE21 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Min (0x0UL) /*!< Min enumerator value of ENABLE21 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Max (0x1UL) /*!< Max enumerator value of ENABLE21 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 21 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 21 Read Address
                                                              Channel*/

/* ENABLE22 @Bit 22 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Pos (22UL) /*!< Position of ENABLE22 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE22_Pos) /*!< Bit mask of ENABLE22 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Min (0x0UL) /*!< Min enumerator value of ENABLE22 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Max (0x1UL) /*!< Max enumerator value of ENABLE22 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 22 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 22 Read Address
                                                              Channel*/

