adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define MPC_REGION_MaxCount (32UL)                 /*!< Size of REGION[32] array.                                            */
  #define MPC_REGION_MaxIndex (31UL)                 /*!< Max index of REGION[32] array.                                       */
  #define MPC_REGION_MinIndex (0UL)                  /*!< Min index of REGION[32] array.                                       */

/* MPC_REGION_CONFIG: Slave region n Configuration register */
  #define MPC_REGION_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                     */

/* SLAVENUMBER @Bits 0..4 : Target slave number for region n accesses. Slave number 0 is reserved for default slave */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Pos (0UL)    /*!< Position of SLAVENUMBER field.                                       */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Msk (0x1FUL << MPC_REGION_CONFIG_SLAVENUMBER_Pos) /*!< Bit mask of SLAVENUMBER field.  */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Min (0x00UL) /*!< Min value of SLAVENUMBER field.                                      */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Max (0x1FUL) /*!< Max size of SLAVENUMBER field.                                       */

/* LOCK @Bit 8 : Locks the region n setting */
  #define MPC_REGION_CONFIG_LOCK_Pos (8UL)           /*!< Position of LOCK field.                                              */
  #define MPC_REGION_CONFIG_LOCK_Msk (0x1UL << MPC_REGION_CONFIG_LOCK_Pos) /*!< Bit mask of LOCK field.                        */
  #define MPC_REGION_CONFIG_LOCK_Min (0x0UL)         /*!< Min enumerator value of LOCK field.                                  */
  #define MPC_REGION_CONFIG_LOCK_Max (0x1UL)         /*!< Max enumerator value of LOCK field.                                  */
  #define MPC_REGION_CONFIG_LOCK_Unlocked (0x0UL)    /*!< Region n settings can be updated                                     */
  #define MPC_REGION_CONFIG_LOCK_Locked (0x1UL)      /*!< Region n settings can't be updated until next reset                  */

/* ENABLE @Bit 9 : Region n enable */
  #define MPC_REGION_CONFIG_ENABLE_Pos (9UL)         /*!< Position of ENABLE field.                                            */
  #define MPC_REGION_CONFIG_ENABLE_Msk (0x1UL << MPC_REGION_CONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.                  */
  #define MPC_REGION_CONFIG_ENABLE_Min (0x0UL)       /*!< Min enumerator value of ENABLE field.                                */
  #define MPC_REGION_CONFIG_ENABLE_Max (0x1UL)       /*!< Max enumerator value of ENABLE field.                                */
  #define MPC_REGION_CONFIG_ENABLE_Disabled (0x0UL)  /*!< Region n is not used                                                 */
  #define MPC_REGION_CONFIG_ENABLE_Enabled (0x1UL)   /*!< Region n is used                                                     */

/* READ @Bit 12 : Read access */
  #define MPC_REGION_CONFIG_READ_Pos (12UL)          /*!< Position of READ field.                                              */
  #define MPC_REGION_CONFIG_READ_Msk (0x1UL << MPC_REGION_CONFIG_READ_Pos) /*!< Bit mask of READ field.                        */
  #define MPC_REGION_CONFIG_READ_Min (0x0UL)         /*!< Min enumerator value of READ field.                                  */
  #define MPC_REGION_CONFIG_READ_Max (0x1UL)         /*!< Max enumerator value of READ field.                                  */
  #define MPC_REGION_CONFIG_READ_NotAllowed (0x0UL)  /*!< Read access to region n is not allowed                               */
  #define MPC_REGION_CONFIG_READ_Allowed (0x1UL)     /*!< Read access to region n is allowed                                   */

/* WRITE @Bit 13 : Write access */
  #define MPC_REGION_CONFIG_WRITE_Pos (13UL)         /*!< Position of WRITE field.                                             */
  #define MPC_REGION_CONFIG_WRITE_Msk (0x1UL << MPC_REGION_CONFIG_WRITE_Pos) /*!< Bit mask of WRITE field.                     */
  #define MPC_REGION_CONFIG_WRITE_Min (0x0UL)        /*!< Min enumerator value of WRITE field.                                 */
  #define MPC_REGION_CONFIG_WRITE_Max (0x1UL)        /*!< Max enumerator value of WRITE field.                                 */
  #define MPC_REGION_CONFIG_WRITE_NotAllowed (0x0UL) /*!< Write access to region n is not allowed                              */
  #define MPC_REGION_CONFIG_WRITE_Allowed (0x1UL)    /*!< Write access to region n is allowed                                  */

/* EXECUTE @Bit 14 : Software execute */
  #define MPC_REGION_CONFIG_EXECUTE_Pos (14UL)       /*!< Position of EXECUTE field.                                           */
  #define MPC_REGION_CONFIG_EXECUTE_Msk (0x1UL << MPC_REGION_CONFIG_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.               */
  #define MPC_REGION_CONFIG_EXECUTE_Min (0x0UL)      /*!< Min enumerator value of EXECUTE field.                               */
  #define MPC_REGION_CONFIG_EXECUTE_Max (0x1UL)      /*!< Max enumerator value of EXECUTE field.                               */
  #define MPC_REGION_CONFIG_EXECUTE_NotAllowed (0x0UL) /*!< Software execution from region n is not allowed                    */
  #define MPC_REGION_CONFIG_EXECUTE_Allowed (0x1UL)  /*!< Software execution from region n is allowed                          */

/* SECATTR @Bit 15 : Memory security mapping */
  #define MPC_REGION_CONFIG_SECATTR_Pos (15UL)       /*!< Position of SECATTR field.                                           */
  #define MPC_REGION_CONFIG_SECATTR_Msk (0x1UL << MPC_REGION_CONFIG_SECATTR_Pos) /*!< Bit mask of SECATTR field.               */
  #define MPC_REGION_CONFIG_SECATTR_Min (0x0UL)      /*!< Min enumerator value of SECATTR field.                               */
  #define MPC_REGION_CONFIG_SECATTR_Max (0x1UL)      /*!< Max enumerator value of SECATTR field.                               */
  #define MPC_REGION_CONFIG_SECATTR_Secure (0x1UL)   /*!< Memory is mapped in secure memory address space                      */
  #define MPC_REGION_CONFIG_SECATTR_NonSecure (0x0UL) /*!< Memory is mapped in non-secure memory address space                 */

/* OWNERID @Bits 16..19 : Region owner identifier. */
  #define MPC_REGION_CONFIG_OWNERID_Pos (16UL)       /*!< Position of OWNERID field.                                           */
  #define MPC_REGION_CONFIG_OWNERID_Msk (0xFUL << MPC_REGION_CONFIG_OWNERID_Pos) /*!< Bit mask of OWNERID field.               */


/* MPC_REGION_STARTADDR: Region n start address */
  #define MPC_REGION_STARTADDR_ResetValue (0x00000000UL) /*!< Reset value of STARTADDR register.                               */

