adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* POWERDOWNCFG @Bit 30 : Power down mode when the timeout happens. */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Pos (30UL) /*!< Position of POWERDOWNCFG field.                               */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Msk (0x1UL << MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Pos) /*!< Bit mask of
                                                                            POWERDOWNCFG field.*/
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Min (0x0UL) /*!< Min enumerator value of POWERDOWNCFG field.                  */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Max (0x1UL) /*!< Max enumerator value of POWERDOWNCFG field.                  */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_MramOffTrimRetain (0x0UL) /*!< Power mode is MRAM_OFF_TRIM_RETAIN             */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_MramOff (0x1UL) /*!< Power mode is MRAM_OFF                                   */

/* ENABLE @Bit 31 : Enable the automatic power down feature. */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Pos (31UL) /*!< Position of ENABLE field.                                           */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Msk (0x1UL << MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Pos) /*!< Bit mask of ENABLE field.  */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                              */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                              */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Disable (0x0UL) /*!< Disable the automatic power down feature                       */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Enable (0x1UL) /*!< Enable the automatic power down feature                         */


/* MRAMC_POWER_MASK: Mask for the various voltages supplies when initiating power up/down. */
  #define MRAMC_POWER_MASK_ResetValue (0x00000000UL) /*!< Reset value of MASK register.                                        */

/* VDD @Bit 0 : Mask VDD */
  #define MRAMC_POWER_MASK_VDD_Pos (0UL)             /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_MASK_VDD_Msk (0x1UL << MRAMC_POWER_MASK_VDD_Pos) /*!< Bit mask of VDD field.                             */
  #define MRAMC_POWER_MASK_VDD_Min (0x0UL)           /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_MASK_VDD_Max (0x1UL)           /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_MASK_VDD_NoOperation (0x0UL)   /*!< No operation                                                         */
  #define MRAMC_POWER_MASK_VDD_Mask (0x1UL)          /*!< Mask VDD                                                             */

/* VDDA @Bit 1 : Mask VDDA */
  #define MRAMC_POWER_MASK_VDDA_Pos (1UL)            /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_MASK_VDDA_Msk (0x1UL << MRAMC_POWER_MASK_VDDA_Pos) /*!< Bit mask of VDDA field.                          */
  #define MRAMC_POWER_MASK_VDDA_Min (0x0UL)          /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_MASK_VDDA_Max (0x1UL)          /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_MASK_VDDA_NoOperation (0x0UL)  /*!< No operation                                                         */
  #define MRAMC_POWER_MASK_VDDA_Mask (0x1UL)         /*!< Mask VDDA                                                            */

/* VDDCFG @Bit 2 : Mask VDD_CFG */
  #define MRAMC_POWER_MASK_VDDCFG_Pos (2UL)          /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_MASK_VDDCFG_Msk (0x1UL << MRAMC_POWER_MASK_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.                    */
  #define MRAMC_POWER_MASK_VDDCFG_Min (0x0UL)        /*!< Min enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_MASK_VDDCFG_Max (0x1UL)        /*!< Max enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_MASK_VDDCFG_NoOperation (0x0UL) /*!< No operation                                                        */
  #define MRAMC_POWER_MASK_VDDCFG_Mask (0x1UL)       /*!< Mask VDD_CFG                                                         */

/* VREFVPR @Bit 4 : Mask VREF and VPR */
  #define MRAMC_POWER_MASK_VREFVPR_Pos (4UL)         /*!< Position of VREFVPR field.                                           */
  #define MRAMC_POWER_MASK_VREFVPR_Msk (0x1UL << MRAMC_POWER_MASK_VREFVPR_Pos) /*!< Bit mask of VREFVPR field.                 */
  #define MRAMC_POWER_MASK_VREFVPR_Min (0x0UL)       /*!< Min enumerator value of VREFVPR field.                               */
  #define MRAMC_POWER_MASK_VREFVPR_Max (0x1UL)       /*!< Max enumerator value of VREFVPR field.                               */
  #define MRAMC_POWER_MASK_VREFVPR_NoOperation (0x0UL) /*!< No operation                                                       */
  #define MRAMC_POWER_MASK_VREFVPR_Mask (0x1UL)      /*!< Mask VREF and VPR                                                    */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_POWER_MASK_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_POWER_MASK_KEY_Msk (0xFFFFUL << MRAMC_POWER_MASK_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_POWER_MASK_KEY_Min (0x0UL)           /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_POWER_MASK_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_POWER_MASK_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_POWER_MASK_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


