adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VDDCFG @Bit 3 : Waiting for VDD_CFG down ACK or not */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Pos (3UL)  /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Msk (0x1UL << MRAMC_POWER_POWERDOWNACK_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.    */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Min (0x0UL) /*!< Min enumerator value of VDDCFG field.                               */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Max (0x1UL) /*!< Max enumerator value of VDDCFG field.                               */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Busy (0x0UL) /*!< Busy                                                               */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Ready (0x1UL) /*!< Ready                                                             */

/* VDDA @Bit 4 : Waiting for VDDA down ACK or not */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Pos (4UL)    /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Msk (0x1UL << MRAMC_POWER_POWERDOWNACK_VDDA_Pos) /*!< Bit mask of VDDA field.          */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Min (0x0UL)  /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Max (0x1UL)  /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Busy (0x0UL) /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Ready (0x1UL) /*!< Ready                                                               */


/* MRAMC_POWER_FORCEON: Force ON the power supply. */
  #define MRAMC_POWER_FORCEON_ResetValue (0x00000000UL) /*!< Reset value of FORCEON register.                                  */

/* VREFVPR @Bit 0 : Force ON the VREF and VPR supply */
  #define MRAMC_POWER_FORCEON_VREFVPR_Pos (0UL)      /*!< Position of VREFVPR field.                                           */
  #define MRAMC_POWER_FORCEON_VREFVPR_Msk (0x1UL << MRAMC_POWER_FORCEON_VREFVPR_Pos) /*!< Bit mask of VREFVPR field.           */
  #define MRAMC_POWER_FORCEON_VREFVPR_Min (0x0UL)    /*!< Min enumerator value of VREFVPR field.                               */
  #define MRAMC_POWER_FORCEON_VREFVPR_Max (0x1UL)    /*!< Max enumerator value of VREFVPR field.                               */
  #define MRAMC_POWER_FORCEON_VREFVPR_NoOperation (0x0UL) /*!< No Force ON.                                                    */
  #define MRAMC_POWER_FORCEON_VREFVPR_ForceOn (0x1UL) /*!< Force ON.                                                           */

/* VDD @Bit 2 : Force ON the VDD supply */
  #define MRAMC_POWER_FORCEON_VDD_Pos (2UL)          /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_FORCEON_VDD_Msk (0x1UL << MRAMC_POWER_FORCEON_VDD_Pos) /*!< Bit mask of VDD field.                       */
  #define MRAMC_POWER_FORCEON_VDD_Min (0x0UL)        /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_FORCEON_VDD_Max (0x1UL)        /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_FORCEON_VDD_NoOperation (0x0UL) /*!< No Force ON.                                                        */
  #define MRAMC_POWER_FORCEON_VDD_ForceOn (0x1UL)    /*!< Force ON.                                                            */

/* VDDCFG @Bit 3 : Force ON the VDD_CFG supply */
  #define MRAMC_POWER_FORCEON_VDDCFG_Pos (3UL)       /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_FORCEON_VDDCFG_Msk (0x1UL << MRAMC_POWER_FORCEON_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.              */
  #define MRAMC_POWER_FORCEON_VDDCFG_Min (0x0UL)     /*!< Min enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_FORCEON_VDDCFG_Max (0x1UL)     /*!< Max enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_FORCEON_VDDCFG_NoOperation (0x0UL) /*!< No Force ON.                                                     */
  #define MRAMC_POWER_FORCEON_VDDCFG_ForceOn (0x1UL) /*!< Force ON.                                                            */

/* VDDA @Bit 4 : Force ON the VDDA supply */
  #define MRAMC_POWER_FORCEON_VDDA_Pos (4UL)         /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_FORCEON_VDDA_Msk (0x1UL << MRAMC_POWER_FORCEON_VDDA_Pos) /*!< Bit mask of VDDA field.                    */
  #define MRAMC_POWER_FORCEON_VDDA_Min (0x0UL)       /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_FORCEON_VDDA_Max (0x1UL)       /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_FORCEON_VDDA_NoOperation (0x0UL) /*!< No Force ON.                                                       */
  #define MRAMC_POWER_FORCEON_VDDA_ForceOn (0x1UL)   /*!< Force ON.                                                            */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_POWER_FORCEON_KEY_Pos (16UL)         /*!< Position of KEY field.                                               */
  #define MRAMC_POWER_FORCEON_KEY_Msk (0xFFFFUL << MRAMC_POWER_FORCEON_KEY_Pos) /*!< Bit mask of KEY field.                    */
  #define MRAMC_POWER_FORCEON_KEY_Min (0x0UL)        /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_POWER_FORCEON_KEY_Max (0xA66DUL)     /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_POWER_FORCEON_KEY_Disable (0x0000UL) /*!< Disable the writing to this register                                 */
  #define MRAMC_POWER_FORCEON_KEY_Enable (0xA66DUL)  /*!< Enable the writing to this register                                  */


/* MRAMC_POWER_FORCEOFF: Force OFF the power supply. */
  #define MRAMC_POWER_FORCEOFF_ResetValue (0x00000000UL) /*!< Reset value of FORCEOFF register.                                */

