adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREFVPR @Bit 0 : Force OFF the VREF and VPR supply */
  #define MRAMC_POWER_FORCEOFF_VREFVPR_Pos (0UL)     /*!< Position of VREFVPR field.                                           */
  #define MRAMC_POWER_FORCEOFF_VREFVPR_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VREFVPR_Pos) /*!< Bit mask of VREFVPR field.         */
  #define MRAMC_POWER_FORCEOFF_VREFVPR_Min (0x0UL)   /*!< Min enumerator value of VREFVPR field.                               */
  #define MRAMC_POWER_FORCEOFF_VREFVPR_Max (0x1UL)   /*!< Max enumerator value of VREFVPR field.                               */
  #define MRAMC_POWER_FORCEOFF_VREFVPR_NoOperation (0x0UL) /*!< No Force OFF.                                                  */
  #define MRAMC_POWER_FORCEOFF_VREFVPR_ForceOff (0x1UL) /*!< Force OFF.                                                        */

/* VDD @Bit 2 : Force OFF the VDD supply */
  #define MRAMC_POWER_FORCEOFF_VDD_Pos (2UL)         /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_FORCEOFF_VDD_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VDD_Pos) /*!< Bit mask of VDD field.                     */
  #define MRAMC_POWER_FORCEOFF_VDD_Min (0x0UL)       /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_FORCEOFF_VDD_Max (0x1UL)       /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_FORCEOFF_VDD_NoOperation (0x0UL) /*!< No Force OFF.                                                      */
  #define MRAMC_POWER_FORCEOFF_VDD_ForceOff (0x1UL)  /*!< Force OFF.                                                           */

/* VDDCFG @Bit 3 : Force OFF the VDD_CFG supply */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_Pos (3UL)      /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.            */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_Min (0x0UL)    /*!< Min enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_Max (0x1UL)    /*!< Max enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_NoOperation (0x0UL) /*!< No Force OFF.                                                   */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_ForceOff (0x1UL) /*!< Force OFF.                                                         */

/* VDDA @Bit 4 : Force OFF the VDDA supply */
  #define MRAMC_POWER_FORCEOFF_VDDA_Pos (4UL)        /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_FORCEOFF_VDDA_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VDDA_Pos) /*!< Bit mask of VDDA field.                  */
  #define MRAMC_POWER_FORCEOFF_VDDA_Min (0x0UL)      /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_FORCEOFF_VDDA_Max (0x1UL)      /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_FORCEOFF_VDDA_NoOperation (0x0UL) /*!< No Force OFF.                                                     */
  #define MRAMC_POWER_FORCEOFF_VDDA_ForceOff (0x1UL) /*!< Force OFF.                                                           */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_POWER_FORCEOFF_KEY_Pos (16UL)        /*!< Position of KEY field.                                               */
  #define MRAMC_POWER_FORCEOFF_KEY_Msk (0xFFFFUL << MRAMC_POWER_FORCEOFF_KEY_Pos) /*!< Bit mask of KEY field.                  */
  #define MRAMC_POWER_FORCEOFF_KEY_Min (0x0UL)       /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_POWER_FORCEOFF_KEY_Max (0xA66DUL)    /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_POWER_FORCEOFF_KEY_Disable (0x0000UL) /*!< Disable the writing to this register                                */
  #define MRAMC_POWER_FORCEOFF_KEY_Enable (0xA66DUL) /*!< Enable the writing to this register                                  */



/* ==================================================== Struct MRAMC_TRIM ==================================================== */
/**
  * @brief TRIM [MRAMC_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATAIN;                            /*!< (@ 0x00000000) Data to be written to the MRAM trim configuration.    */
  __IM  uint32_t  DATAOUT;                           /*!< (@ 0x00000004) Data read from the MRAM trim configuration.           */
  __IOM uint32_t  COUNT;                             /*!< (@ 0x00000008) Number of bits in the current data to be written to and
                                                                         read from the trim configuration.*/
  __IOM uint32_t  START;                             /*!< (@ 0x0000000C) Start shifting data for trim configuration.           */
  __IM  uint32_t  READY;                             /*!< (@ 0x00000010) Status of shifting the MRAM trim configuration data.  */
  __IOM uint32_t  DONE;                              /*!< (@ 0x00000014) This register is used to indicate to the MRAMC that the
                                                                         whole MRAM trim configuration data write is completed.*/
} NRF_MRAMC_TRIM_Type;                               /*!< Size = 24 (0x018)                                                    */

/* MRAMC_TRIM_DATAIN: Data to be written to the MRAM trim configuration. */
  #define MRAMC_TRIM_DATAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DATAIN register.                                     */

/* DATAIN @Bits 0..31 : Data */
  #define MRAMC_TRIM_DATAIN_DATAIN_Pos (0UL)         /*!< Position of DATAIN field.                                            */
  #define MRAMC_TRIM_DATAIN_DATAIN_Msk (0xFFFFFFFFUL << MRAMC_TRIM_DATAIN_DATAIN_Pos) /*!< Bit mask of DATAIN field.           */


/* MRAMC_TRIM_DATAOUT: Data read from the MRAM trim configuration. */
  #define MRAMC_TRIM_DATAOUT_ResetValue (0x00000000UL) /*!< Reset value of DATAOUT register.                                   */

