adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DATAOUT @Bits 0..31 : Data */
  #define MRAMC_TRIM_DATAOUT_DATAOUT_Pos (0UL)       /*!< Position of DATAOUT field.                                           */
  #define MRAMC_TRIM_DATAOUT_DATAOUT_Msk (0xFFFFFFFFUL << MRAMC_TRIM_DATAOUT_DATAOUT_Pos) /*!< Bit mask of DATAOUT field.      */


/* MRAMC_TRIM_COUNT: Number of bits in the current data to be written to and read from the trim configuration. */
  #define MRAMC_TRIM_COUNT_ResetValue (0x00000020UL) /*!< Reset value of COUNT register.                                       */

/* COUNT @Bits 0..5 : Number of bits to be written. */
  #define MRAMC_TRIM_COUNT_COUNT_Pos (0UL)           /*!< Position of COUNT field.                                             */
  #define MRAMC_TRIM_COUNT_COUNT_Msk (0x3FUL << MRAMC_TRIM_COUNT_COUNT_Pos) /*!< Bit mask of COUNT field.                      */
  #define MRAMC_TRIM_COUNT_COUNT_Min (0x00UL)        /*!< Min value of COUNT field.                                            */
  #define MRAMC_TRIM_COUNT_COUNT_Max (0x20UL)        /*!< Max size of COUNT field.                                             */


/* MRAMC_TRIM_START: Start shifting data for trim configuration. */
  #define MRAMC_TRIM_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                       */

/* START @Bit 0 : Start trim configuration */
  #define MRAMC_TRIM_START_START_Pos (0UL)           /*!< Position of START field.                                             */
  #define MRAMC_TRIM_START_START_Msk (0x1UL << MRAMC_TRIM_START_START_Pos) /*!< Bit mask of START field.                       */
  #define MRAMC_TRIM_START_START_Min (0x0UL)         /*!< Min enumerator value of START field.                                 */
  #define MRAMC_TRIM_START_START_Max (0x1UL)         /*!< Max enumerator value of START field.                                 */
  #define MRAMC_TRIM_START_START_NoOperation (0x0UL) /*!< No operation                                                         */
  #define MRAMC_TRIM_START_START_Start (0x1UL)       /*!< Start trim config                                                    */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_TRIM_START_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_TRIM_START_KEY_Msk (0xFFFFUL << MRAMC_TRIM_START_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_TRIM_START_KEY_Min (0x0UL)           /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_TRIM_START_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_TRIM_START_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_TRIM_START_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


/* MRAMC_TRIM_READY: Status of shifting the MRAM trim configuration data. */
  #define MRAMC_TRIM_READY_ResetValue (0x00000001UL) /*!< Reset value of READY register.                                       */

/* READY @Bit 0 : Shifting the MRAM trim configuration data is in progress or not. */
  #define MRAMC_TRIM_READY_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define MRAMC_TRIM_READY_READY_Msk (0x1UL << MRAMC_TRIM_READY_READY_Pos) /*!< Bit mask of READY field.                       */
  #define MRAMC_TRIM_READY_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_TRIM_READY_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_TRIM_READY_READY_Busy (0x0UL)        /*!< Shifting the MRAM trim configuration data is in progress.            */
  #define MRAMC_TRIM_READY_READY_Ready (0x1UL)       /*!< Ready for shifting the next MRAM trim configuration data.            */


/* MRAMC_TRIM_DONE: This register is used to indicate to the MRAMC that the whole MRAM trim configuration data write is
                     completed. */

  #define MRAMC_TRIM_DONE_ResetValue (0x00000000UL)  /*!< Reset value of DONE register.                                        */

/* TRIMCOMPLETED @Bits 0..31 : Trim configuration is completed. */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Pos (0UL)    /*!< Position of TRIMCOMPLETED field.                                     */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Msk (0xFFFFFFFFUL << MRAMC_TRIM_DONE_TRIMCOMPLETED_Pos) /*!< Bit mask of TRIMCOMPLETED
                                                                            field.*/
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Min (0x0UL)  /*!< Min enumerator value of TRIMCOMPLETED field.                         */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Max (0xA66DA66DUL) /*!< Max enumerator value of TRIMCOMPLETED field.                   */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimUnknown (0x00000000UL) /*!< Read: Trim configuration is unknown                    */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimCompleted (0x00000001UL) /*!< Read: Trim configuration data write is completed.    */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimComplete (0xA66DA66DUL) /*!< Write: Trim configuration data write is complete.     */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_NoOperation (0x00000000UL) /*!< Write ignored for all other values than 0xA66DA66D.    */



/* =================================================== Struct MRAMC_ERASE ==================================================== */
/**
  * @brief ERASE [MRAMC_ERASE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ERASEWORD;                         /*!< (@ 0x00000000) Register for erasing a word in the MRAM main block.   */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Size for erasing an area in the MRAM main block       */
  __IOM uint32_t  ERASEAREA;                         /*!< (@ 0x00000008) Register for erasing an area in the MRAM main block   */
  __OM  uint32_t  ERASEALL;                          /*!< (@ 0x0000000C) Register for erasing whole MRAM main block and the
                                                                         first NVR page*/
  __IOM uint32_t  LOCK;                              /*!< (@ 0x00000010) Locking the erase registers.                          */
} NRF_MRAMC_ERASE_Type;                              /*!< Size = 20 (0x014)                                                    */

/* MRAMC_ERASE_ERASEWORD: Register for erasing a word in the MRAM main block. */
  #define MRAMC_ERASE_ERASEWORD_ResetValue (0x00000000UL) /*!< Reset value of ERASEWORD register.                              */

