adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ERASEWORD @Bits 0..31 : Address of the word that needs to be erased. */
  #define MRAMC_ERASE_ERASEWORD_ERASEWORD_Pos (0UL)  /*!< Position of ERASEWORD field.                                         */
  #define MRAMC_ERASE_ERASEWORD_ERASEWORD_Msk (0xFFFFFFFFUL << MRAMC_ERASE_ERASEWORD_ERASEWORD_Pos) /*!< Bit mask of ERASEWORD
                                                                            field.*/


/* MRAMC_ERASE_SIZE: Size for erasing an area in the MRAM main block */
  #define MRAMC_ERASE_SIZE_ResetValue (0x00000000UL) /*!< Reset value of SIZE register.                                        */

/* SIZE @Bits 0..18 : Number of MRAM words to be erased using ERASE.ERASEAREA. */
  #define MRAMC_ERASE_SIZE_SIZE_Pos (0UL)            /*!< Position of SIZE field.                                              */
  #define MRAMC_ERASE_SIZE_SIZE_Msk (0x7FFFFUL << MRAMC_ERASE_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.                      */
  #define MRAMC_ERASE_SIZE_SIZE_Min (0x00001UL)      /*!< Min value of SIZE field.                                             */
  #define MRAMC_ERASE_SIZE_SIZE_Max (0x10000UL)      /*!< Max size of SIZE field.                                              */


/* MRAMC_ERASE_ERASEAREA: Register for erasing an area in the MRAM main block */
  #define MRAMC_ERASE_ERASEAREA_ResetValue (0x00000000UL) /*!< Reset value of ERASEAREA register.                              */

/* ERASEAREA @Bits 0..31 : Start address of the area to be erased. */
  #define MRAMC_ERASE_ERASEAREA_ERASEAREA_Pos (0UL)  /*!< Position of ERASEAREA field.                                         */
  #define MRAMC_ERASE_ERASEAREA_ERASEAREA_Msk (0xFFFFFFFFUL << MRAMC_ERASE_ERASEAREA_ERASEAREA_Pos) /*!< Bit mask of ERASEAREA
                                                                            field.*/


/* MRAMC_ERASE_ERASEALL: Register for erasing whole MRAM main block and the first NVR page */
  #define MRAMC_ERASE_ERASEALL_ResetValue (0x00000000UL) /*!< Reset value of ERASEALL register.                                */

/* ERASEALL @Bit 0 : Erase whole MRAM and the first NVR page. The other NVR pages are not erased. */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Pos (0UL)    /*!< Position of ERASEALL field.                                          */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Msk (0x1UL << MRAMC_ERASE_ERASEALL_ERASEALL_Pos) /*!< Bit mask of ERASEALL field.      */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Min (0x0UL)  /*!< Min enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Max (0x1UL)  /*!< Max enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_NoOperation (0x0UL) /*!< No operation                                                  */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Erase (0x1UL) /*!< Start erase of chip                                                 */


/* MRAMC_ERASE_LOCK: Locking the erase registers. */
  #define MRAMC_ERASE_LOCK_ResetValue (0x00000000UL) /*!< Reset value of LOCK register.                                        */

/* ERASEWORD @Bit 0 : Lock for ERASE.ERASEWORD. */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Pos (0UL)       /*!< Position of ERASEWORD field.                                         */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEWORD_Pos) /*!< Bit mask of ERASEWORD field.           */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Min (0x0UL)     /*!< Min enumerator value of ERASEWORD field.                             */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Max (0x1UL)     /*!< Max enumerator value of ERASEWORD field.                             */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Disabled (0x0UL) /*!< Lock disabled.                                                      */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Enabled (0x1UL) /*!< Lock enabled.                                                        */

/* ERASEAREA @Bit 1 : Lock for ERASE.ERASEAREA. */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Pos (1UL)       /*!< Position of ERASEAREA field.                                         */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEAREA_Pos) /*!< Bit mask of ERASEAREA field.           */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Min (0x0UL)     /*!< Min enumerator value of ERASEAREA field.                             */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Max (0x1UL)     /*!< Max enumerator value of ERASEAREA field.                             */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Disabled (0x0UL) /*!< Lock disabled.                                                      */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Enabled (0x1UL) /*!< Lock enabled.                                                        */

/* ERASEALL @Bit 2 : Lock for ERASE.ERASEALL. */
  #define MRAMC_ERASE_LOCK_ERASEALL_Pos (2UL)        /*!< Position of ERASEALL field.                                          */
  #define MRAMC_ERASE_LOCK_ERASEALL_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEALL_Pos) /*!< Bit mask of ERASEALL field.              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Min (0x0UL)      /*!< Min enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Max (0x1UL)      /*!< Max enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Disabled (0x0UL) /*!< Lock disabled.                                                       */
  #define MRAMC_ERASE_LOCK_ERASEALL_Enabled (0x1UL)  /*!< Lock enabled.                                                        */



/* ================================================= Struct MRAMC_CONFIGNVR ================================================== */
/**
  * @brief CONFIGNVR [MRAMC_CONFIGNVR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PAGE[4];                           /*!< (@ 0x00000000) Configuration register for NVR page n                 */
} NRF_MRAMC_CONFIGNVR_Type;                          /*!< Size = 16 (0x010)                                                    */

/* MRAMC_CONFIGNVR_PAGE: Configuration register for NVR page n */
  #define MRAMC_CONFIGNVR_PAGE_MaxCount (4UL)        /*!< Max size of PAGE[4] array.                                           */
  #define MRAMC_CONFIGNVR_PAGE_MaxIndex (3UL)        /*!< Max index of PAGE[4] array.                                          */
  #define MRAMC_CONFIGNVR_PAGE_MinIndex (0UL)        /*!< Min index of PAGE[4] array.                                          */
  #define MRAMC_CONFIGNVR_PAGE_ResetValue (0xFFC00000UL) /*!< Reset value of PAGE[4] register.                                 */

