adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================= Struct MRAMC_TESTMODE1 ================================================== */
/**
  * @brief TESTMODE1 [MRAMC_TESTMODE1] (unspecified)
  */
typedef struct {
  __OM  uint32_t  MASSERASE;                         /*!< (@ 0x00000000) Self-timed mass-erase operation.                      */
} NRF_MRAMC_TESTMODE1_Type;                          /*!< Size = 4 (0x004)                                                     */

/* MRAMC_TESTMODE1_MASSERASE: Self-timed mass-erase operation. */
  #define MRAMC_TESTMODE1_MASSERASE_ResetValue (0x00000000UL) /*!< Reset value of MASSERASE register.                          */

/* MASSERASE @Bits 0..1 : Self-timed mass-erase operation. */
  #define MRAMC_TESTMODE1_MASSERASE_MASSERASE_Pos (0UL) /*!< Position of MASSERASE field.                                      */
  #define MRAMC_TESTMODE1_MASSERASE_MASSERASE_Msk (0x3UL << MRAMC_TESTMODE1_MASSERASE_MASSERASE_Pos) /*!< Bit mask of MASSERASE
                                                                            field.*/
  #define MRAMC_TESTMODE1_MASSERASE_MASSERASE_Min (0x0UL) /*!< Min enumerator value of MASSERASE field.                        */
  #define MRAMC_TESTMODE1_MASSERASE_MASSERASE_Max (0x3UL) /*!< Max enumerator value of MASSERASE field.                        */
  #define MRAMC_TESTMODE1_MASSERASE_MASSERASE_EVERYTHING (0x3UL) /*!< Erase everything in the MRAM including all NVR pages     */
  #define MRAMC_TESTMODE1_MASSERASE_MASSERASE_MAIN (0x2UL) /*!< Erase only the main block                                      */
  #define MRAMC_TESTMODE1_MASSERASE_MASSERASE_NOOPERATION1 (0x1UL) /*!< No operation                                           */
  #define MRAMC_TESTMODE1_MASSERASE_MASSERASE_NOOPERATION0 (0x0UL) /*!< No operation                                           */



/* =============================================== Struct MRAMC_TESTMODE2_MRAM =============================================== */
/**
  * @brief MRAM [MRAMC_TESTMODE2_MRAM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  IN;                                /*!< (@ 0x00000000) Writes to the input control signals to the MRAM. Read
                                                                         to this registers reads back the last written value.*/
  __IM  uint32_t  OUT;                               /*!< (@ 0x00000004) The output control signals from the MRAM              */
  __IM  uint32_t  DONE;                              /*!< (@ 0x00000008) The DONE signal of the MRAM                           */
  __IM  uint32_t  RDY;                               /*!< (@ 0x0000000C) The RDY signal of the MRAM                            */
} NRF_MRAMC_TESTMODE2_MRAM_Type;                     /*!< Size = 16 (0x010)                                                    */

/* MRAMC_TESTMODE2_MRAM_IN: Writes to the input control signals to the MRAM. Read to this registers reads back the last written
                             value. */

  #define MRAMC_TESTMODE2_MRAM_IN_ResetValue (0x00000000UL) /*!< Reset value of IN register.                                   */

/* CLK @Bit 0 : Clock for synchronous Read */
  #define MRAMC_TESTMODE2_MRAM_IN_CLK_Pos (0UL)      /*!< Position of CLK field.                                               */
  #define MRAMC_TESTMODE2_MRAM_IN_CLK_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_CLK_Pos) /*!< Bit mask of CLK field.               */

/* RDEN @Bit 1 : Read Enable */
  #define MRAMC_TESTMODE2_MRAM_IN_RDEN_Pos (1UL)     /*!< Position of RDEN field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_RDEN_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_RDEN_Pos) /*!< Bit mask of RDEN field.            */

/* NVR @Bit 2 : Select NVR pages/sectors */
  #define MRAMC_TESTMODE2_MRAM_IN_NVR_Pos (2UL)      /*!< Position of NVR field.                                               */
  #define MRAMC_TESTMODE2_MRAM_IN_NVR_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_NVR_Pos) /*!< Bit mask of NVR field.               */

/* CEb @Bit 3 : Chip Enable */
  #define MRAMC_TESTMODE2_MRAM_IN_CEb_Pos (3UL)      /*!< Position of CEb field.                                               */
  #define MRAMC_TESTMODE2_MRAM_IN_CEb_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_CEb_Pos) /*!< Bit mask of CEb field.               */

/* WEb @Bit 4 : Write Enable */
  #define MRAMC_TESTMODE2_MRAM_IN_WEb_Pos (4UL)      /*!< Position of WEb field.                                               */
  #define MRAMC_TESTMODE2_MRAM_IN_WEb_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_WEb_Pos) /*!< Bit mask of WEb field.               */

/* PROGEN @Bit 5 : Program Enable */
  #define MRAMC_TESTMODE2_MRAM_IN_PROGEN_Pos (5UL)   /*!< Position of PROGEN field.                                            */
  #define MRAMC_TESTMODE2_MRAM_IN_PROGEN_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_PROGEN_Pos) /*!< Bit mask of PROGEN field.      */

/* PROG @Bit 6 : Program signal */
  #define MRAMC_TESTMODE2_MRAM_IN_PROG_Pos (6UL)     /*!< Position of PROG field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_PROG_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_PROG_Pos) /*!< Bit mask of PROG field.            */

/* ERASE @Bit 7 : Erase signal */
  #define MRAMC_TESTMODE2_MRAM_IN_ERASE_Pos (7UL)    /*!< Position of ERASE field.                                             */
  #define MRAMC_TESTMODE2_MRAM_IN_ERASE_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_ERASE_Pos) /*!< Bit mask of ERASE field.         */

/* SCE @Bit 8 : Sector Erase */
  #define MRAMC_TESTMODE2_MRAM_IN_SCE_Pos (8UL)      /*!< Position of SCE field.                                               */
  #define MRAMC_TESTMODE2_MRAM_IN_SCE_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_SCE_Pos) /*!< Bit mask of SCE field.               */

/* CHIP @Bit 9 : Chip Erase */
  #define MRAMC_TESTMODE2_MRAM_IN_CHIP_Pos (9UL)     /*!< Position of CHIP field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_CHIP_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_CHIP_Pos) /*!< Bit mask of CHIP field.            */

/* PEON @Bit 10 : Read within program/erase */
  #define MRAMC_TESTMODE2_MRAM_IN_PEON_Pos (10UL)    /*!< Position of PEON field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_PEON_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_PEON_Pos) /*!< Bit mask of PEON field.            */

/* PORb @Bit 11 : Power On Reset (active low) */
  #define MRAMC_TESTMODE2_MRAM_IN_PORb_Pos (11UL)    /*!< Position of PORb field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_PORb_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_PORb_Pos) /*!< Bit mask of PORb field.            */

