adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RSTb @Bit 12 : Trim Configuration Register Reset (active low) */
  #define MRAMC_TESTMODE2_MRAM_IN_RSTb_Pos (12UL)    /*!< Position of RSTb field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_RSTb_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_RSTb_Pos) /*!< Bit mask of RSTb field.            */

/* SHIFT @Bit 13 : Trim Configuration Shift */
  #define MRAMC_TESTMODE2_MRAM_IN_SHIFT_Pos (13UL)   /*!< Position of SHIFT field.                                             */
  #define MRAMC_TESTMODE2_MRAM_IN_SHIFT_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_SHIFT_Pos) /*!< Bit mask of SHIFT field.         */

/* SUPD @Bit 14 : Trim Configuration Upload */
  #define MRAMC_TESTMODE2_MRAM_IN_SUPD_Pos (14UL)    /*!< Position of SUPD field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_SUPD_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_SUPD_Pos) /*!< Bit mask of SUPD field.            */

/* SDI @Bit 15 : Trim Configuration Input */
  #define MRAMC_TESTMODE2_MRAM_IN_SDI_Pos (15UL)     /*!< Position of SDI field.                                               */
  #define MRAMC_TESTMODE2_MRAM_IN_SDI_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_SDI_Pos) /*!< Bit mask of SDI field.               */

/* SCLK @Bit 16 : Trim Configuration Clock */
  #define MRAMC_TESTMODE2_MRAM_IN_SCLK_Pos (16UL)    /*!< Position of SCLK field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_SCLK_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_SCLK_Pos) /*!< Bit mask of SCLK field.            */

/* RETb @Bit 17 : Trim Configuration Register Retention (active low) */
  #define MRAMC_TESTMODE2_MRAM_IN_RETb_Pos (17UL)    /*!< Position of RETb field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_RETb_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_RETb_Pos) /*!< Bit mask of RETb field.            */

/* ECCBYPS @Bit 18 : Bypass ECC Encoder and Decoder */
  #define MRAMC_TESTMODE2_MRAM_IN_ECCBYPS_Pos (18UL) /*!< Position of ECCBYPS field.                                           */
  #define MRAMC_TESTMODE2_MRAM_IN_ECCBYPS_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_ECCBYPS_Pos) /*!< Bit mask of ECCBYPS field.   */

/* DPD @Bit 19 : Deep Power Down */
  #define MRAMC_TESTMODE2_MRAM_IN_DPD_Pos (19UL)     /*!< Position of DPD field.                                               */
  #define MRAMC_TESTMODE2_MRAM_IN_DPD_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_DPD_Pos) /*!< Bit mask of DPD field.               */

/* TMEN @Bit 20 : Test Mode Enable */
  #define MRAMC_TESTMODE2_MRAM_IN_TMEN_Pos (20UL)    /*!< Position of TMEN field.                                              */
  #define MRAMC_TESTMODE2_MRAM_IN_TMEN_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_IN_TMEN_Pos) /*!< Bit mask of TMEN field.            */


/* MRAMC_TESTMODE2_MRAM_OUT: The output control signals from the MRAM */
  #define MRAMC_TESTMODE2_MRAM_OUT_ResetValue (0x00000000UL) /*!< Reset value of OUT register.                                 */

/* SDO @Bit 0 : Trim Configuration Register Output */
  #define MRAMC_TESTMODE2_MRAM_OUT_SDO_Pos (0UL)     /*!< Position of SDO field.                                               */
  #define MRAMC_TESTMODE2_MRAM_OUT_SDO_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_OUT_SDO_Pos) /*!< Bit mask of SDO field.             */

/* EC @Bit 1 : ECC Error Correction */
  #define MRAMC_TESTMODE2_MRAM_OUT_EC_Pos (1UL)      /*!< Position of EC field.                                                */
  #define MRAMC_TESTMODE2_MRAM_OUT_EC_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_OUT_EC_Pos) /*!< Bit mask of EC field.                */

/* UE @Bit 2 : ECC Unrecoverable Error */
  #define MRAMC_TESTMODE2_MRAM_OUT_UE_Pos (2UL)      /*!< Position of UE field.                                                */
  #define MRAMC_TESTMODE2_MRAM_OUT_UE_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_OUT_UE_Pos) /*!< Bit mask of UE field.                */


/* MRAMC_TESTMODE2_MRAM_DONE: The DONE signal of the MRAM */
  #define MRAMC_TESTMODE2_MRAM_DONE_ResetValue (0x00000000UL) /*!< Reset value of DONE register.                               */

/* DONE @Bit 0 : Program/Erase Status */
  #define MRAMC_TESTMODE2_MRAM_DONE_DONE_Pos (0UL)   /*!< Position of DONE field.                                              */
  #define MRAMC_TESTMODE2_MRAM_DONE_DONE_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_DONE_DONE_Pos) /*!< Bit mask of DONE field.        */


/* MRAMC_TESTMODE2_MRAM_RDY: The RDY signal of the MRAM */
  #define MRAMC_TESTMODE2_MRAM_RDY_ResetValue (0x00000000UL) /*!< Reset value of RDY register.                                 */

/* RDY @Bit 0 : Read Status */
  #define MRAMC_TESTMODE2_MRAM_RDY_RDY_Pos (0UL)     /*!< Position of RDY field.                                               */
  #define MRAMC_TESTMODE2_MRAM_RDY_RDY_Msk (0x1UL << MRAMC_TESTMODE2_MRAM_RDY_RDY_Pos) /*!< Bit mask of RDY field.             */



/* ================================================= Struct MRAMC_TESTMODE2 ================================================== */
/**
  * @brief TESTMODE2 [MRAMC_TESTMODE2] (unspecified)
  */
typedef struct {
  __IOM NRF_MRAMC_TESTMODE2_MRAM_Type MRAM;          /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM uint32_t  DATA[4];                           /*!< (@ 0x00000010) Data word n to/from MRAM data in/out bus.             */
  __IOM uint32_t  DATAECC;                           /*!< (@ 0x00000020) ECC bits to/from MRAM data in/out bus.                */
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000024) Address bits of the MRAM address bus. The register is
                                                                         updated when the auto-increment is done.*/
  __IOM uint32_t  DATAINC[4];                        /*!< (@ 0x00000028) Same as DATA but post-increments address after the read
                                                                         from the bus.*/
  __IOM uint32_t  DATAECCINC;                        /*!< (@ 0x00000038) Same as DATAECC but post-increments ADDR after the read
                                                                         from the bus.*/
  __IM  uint32_t  TESTCMP;                           /*!< (@ 0x0000003C) Compares the MRAM data with DATA and DATAECC register
                                                                         content. Post-increments the address after the read
                                                                         based on TESTMODE2.CONFIG.AUTOINC.*/
  __IOM uint32_t  COUNTERRELOAD;                     /*!< (@ 0x00000040) Configures the counter reload value. The counter is
                                                                         reloaded and starts counting from the CLK/PROGEN rising
                                                                         edge.*/
  __IM  uint32_t  COUNTERRUN;                        /*!< (@ 0x00000044) Returns the state (counting or not) of the counter    */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000048) TESTMODE2 Configuration                               */
  __IOM uint32_t  TMOEN;                             /*!< (@ 0x0000004C) Enable the pin multiplexing for TMO[2:0] pins of the
                                                                         MRAM macro*/
  __IOM uint32_t  BURSTWORDSNUM;                     /*!< (@ 0x00000050) Number of words for burst read or write               */
  __IM  uint32_t  BURSTMODESTAT;                     /*!< (@ 0x00000054) The burst mode operation status.                      */
  __IOM uint32_t  ONEBITERR;                         /*!< (@ 0x00000058) Number of one bit error words detected while compare in
                                                                         the last burst mode read operation.*/
  __IOM uint32_t  TWOBITSERR;                        /*!< (@ 0x0000005C) Number of two bit errors words detected while compare
                                                                         in the last burst mode read operation.*/
  __IOM uint32_t  MANYBITSERR;                       /*!< (@ 0x00000060) Number of more than two bit errors words detected while
                                                                         compare in the last burst mode read operation.*/
  __IOM uint32_t  ONEBITERRTHR;                      /*!< (@ 0x00000064) Threshold in terms of number of one bit error words to
                                                                         end the burst mode read operation with error.*/
  __IOM uint32_t  TWOBITSERRTHR;                     /*!< (@ 0x00000068) Threshold in terms of number of two bits error words to
                                                                         end the burst mode read operation with error.*/
  __IOM uint32_t  MANYBITSERRTHR;                    /*!< (@ 0x0000006C) Threshold in terms of number of more than two bits
                                                                         error words to end the burst mode read operation with
                                                                         error.*/
} NRF_MRAMC_TESTMODE2_Type;                          /*!< Size = 112 (0x070)                                                   */

