adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* WEN @Bits 0..1 : Write enable. */
  #define MRAMC_CONFIG_WEN_Pos (0UL)                 /*!< Position of WEN field.                                               */
  #define MRAMC_CONFIG_WEN_Msk (0x3UL << MRAMC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field.                                     */
  #define MRAMC_CONFIG_WEN_Min (0x0UL)               /*!< Min enumerator value of WEN field.                                   */
  #define MRAMC_CONFIG_WEN_Max (0x2UL)               /*!< Max enumerator value of WEN field.                                   */
  #define MRAMC_CONFIG_WEN_DisableWrite (0x0UL)      /*!< Write is disabled                                                    */
  #define MRAMC_CONFIG_WEN_EnableNormalWrite (0x1UL) /*!< Normal write is enabled                                              */
  #define MRAMC_CONFIG_WEN_EnableDirectWrite (0x2UL) /*!< Direct write is enabled                                              */

/* EEN @Bits 4..5 : Erase enable. */
  #define MRAMC_CONFIG_EEN_Pos (4UL)                 /*!< Position of EEN field.                                               */
  #define MRAMC_CONFIG_EEN_Msk (0x3UL << MRAMC_CONFIG_EEN_Pos) /*!< Bit mask of EEN field.                                     */
  #define MRAMC_CONFIG_EEN_Min (0x0UL)               /*!< Min enumerator value of EEN field.                                   */
  #define MRAMC_CONFIG_EEN_Max (0x2UL)               /*!< Max enumerator value of EEN field.                                   */
  #define MRAMC_CONFIG_EEN_DisableErase (0x0UL)      /*!< Erase is disabled but read is allowed                                */
  #define MRAMC_CONFIG_EEN_EnablePageErase (0x1UL)   /*!< Erase page and read are allowed                                      */
  #define MRAMC_CONFIG_EEN_EnableWordErase (0x2UL)   /*!< Erase word and read are allowed                                      */

/* DISABLEECC @Bit 8 : Disable ECC. It is enabled by default */
  #define MRAMC_CONFIG_DISABLEECC_Pos (8UL)          /*!< Position of DISABLEECC field.                                        */
  #define MRAMC_CONFIG_DISABLEECC_Msk (0x1UL << MRAMC_CONFIG_DISABLEECC_Pos) /*!< Bit mask of DISABLEECC field.                */
  #define MRAMC_CONFIG_DISABLEECC_Min (0x0UL)        /*!< Min enumerator value of DISABLEECC field.                            */
  #define MRAMC_CONFIG_DISABLEECC_Max (0x1UL)        /*!< Max enumerator value of DISABLEECC field.                            */
  #define MRAMC_CONFIG_DISABLEECC_EnableECC (0x0UL)  /*!< Enable ECC                                                           */
  #define MRAMC_CONFIG_DISABLEECC_DisableECC (0x1UL) /*!< Disable ECC                                                          */


/* MRAMC_AUTOREADMODE: Automatically disables the write and erases on timeout and enters into read mode. */
  #define MRAMC_AUTOREADMODE_ResetValue (0x00000000UL) /*!< Reset value of AUTOREADMODE register.                              */

/* VALUE @Bits 0..11 : Timeout value to disable write and erase. */
  #define MRAMC_AUTOREADMODE_VALUE_Pos (0UL)         /*!< Position of VALUE field.                                             */
  #define MRAMC_AUTOREADMODE_VALUE_Msk (0xFFFUL << MRAMC_AUTOREADMODE_VALUE_Pos) /*!< Bit mask of VALUE field.                 */
  #define MRAMC_AUTOREADMODE_VALUE_Min (0x000UL)     /*!< Min value of VALUE field.                                            */
  #define MRAMC_AUTOREADMODE_VALUE_Max (0xFFFUL)     /*!< Max size of VALUE field.                                             */


/* MRAMC_WAITSTATES: Waitstates for MRAM read access */
  #define MRAMC_WAITSTATES_ResetValue (0x00000000UL) /*!< Reset value of WAITSTATES register.                                  */

/* WAITSTATENUM @Bits 0..4 : Register to read the current number of waitstate for the MRAM access and set a new value */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Pos (0UL)    /*!< Position of WAITSTATENUM field.                                      */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Msk (0x1FUL << MRAMC_WAITSTATES_WAITSTATENUM_Pos) /*!< Bit mask of WAITSTATENUM field. */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Min (0x03UL) /*!< Min value of WAITSTATENUM field.                                     */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Max (0x1FUL) /*!< Max size of WAITSTATENUM field.                                      */

/* RDY @Bit 8 : Use RDY (ready) signal from the MRAM macro in addition to waitstates specified above. The data is read which
                ever of waitstate or RDY signal comes first. */

  #define MRAMC_WAITSTATES_RDY_Pos (8UL)             /*!< Position of RDY field.                                               */
  #define MRAMC_WAITSTATES_RDY_Msk (0x1UL << MRAMC_WAITSTATES_RDY_Pos) /*!< Bit mask of RDY field.                             */
  #define MRAMC_WAITSTATES_RDY_Min (0x0UL)           /*!< Min enumerator value of RDY field.                                   */
  #define MRAMC_WAITSTATES_RDY_Max (0x1UL)           /*!< Max enumerator value of RDY field.                                   */
  #define MRAMC_WAITSTATES_RDY_Disable (0x0UL)       /*!< Do not use RDY signal from the MRAM macro                            */
  #define MRAMC_WAITSTATES_RDY_Enable (0x1UL)        /*!< Use RDY signal from the MRAM macro                                   */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_WAITSTATES_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_WAITSTATES_KEY_Msk (0xFFFFUL << MRAMC_WAITSTATES_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_WAITSTATES_KEY_Min (0x0UL)           /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_WAITSTATES_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_WAITSTATES_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_WAITSTATES_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


/* MRAMC_READYNEXTTIMEOUT: Preload timeout value for waiting for a next write */
  #define MRAMC_READYNEXTTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of READYNEXTTIMEOUT register.                      */

/* VALUE @Bits 0..11 : Preload value */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Pos (0UL)     /*!< Position of VALUE field.                                             */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Msk (0xFFFUL << MRAMC_READYNEXTTIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE field.         */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Min (0x000UL) /*!< Min value of VALUE field.                                            */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Max (0xFFFUL) /*!< Max size of VALUE field.                                             */

/* DW @Bit 31 : Triggers a write to MRAMC macro on the ready next timeout in direct write mode (CONFIG.WEN = 2) and some data
                written into the internal write buffer. */

  #define MRAMC_READYNEXTTIMEOUT_DW_Pos (31UL)       /*!< Position of DW field.                                                */
  #define MRAMC_READYNEXTTIMEOUT_DW_Msk (0x1UL << MRAMC_READYNEXTTIMEOUT_DW_Pos) /*!< Bit mask of DW field.                    */
  #define MRAMC_READYNEXTTIMEOUT_DW_Min (0x0UL)      /*!< Min enumerator value of DW field.                                    */
  #define MRAMC_READYNEXTTIMEOUT_DW_Max (0x1UL)      /*!< Max enumerator value of DW field.                                    */
  #define MRAMC_READYNEXTTIMEOUT_DW_Disable (0x0UL)  /*!< No write trigger                                                     */
  #define MRAMC_READYNEXTTIMEOUT_DW_Enable (0x1UL)   /*!< Write trigger                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MUTEX                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct MUTEX ======================================================= */
/**
  * @brief MUTEX
  */
  typedef struct {                                   /*!< MUTEX Structure                                                      */
    __IM uint32_t RESERVED[256];
    __IOM uint32_t MUTEX[32];                        /*!< (@ 0x00000400) Mutex register                                        */
  } NRF_MUTEX_Type;                                  /*!< Size = 1152 (0x480)                                                  */

