adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* MVDMA_STATUS_ACTIVE: Status of DMA transfer. */
  #define MVDMA_STATUS_ACTIVE_ResetValue (0x00000000UL) /*!< Reset value of ACTIVE register.                                   */

/* ACTIVE @Bit 0 : DMA activity */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Pos (0UL)       /*!< Position of ACTIVE field.                                            */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Msk (0x1UL << MVDMA_STATUS_ACTIVE_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.              */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Min (0x0UL)     /*!< Min enumerator value of ACTIVE field.                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Max (0x1UL)     /*!< Max enumerator value of ACTIVE field.                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Idle (0x0UL)    /*!< DMA is in IDLE state.                                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Active (0x1UL)  /*!< Data being transferred.                                              */



/* =================================================== Struct MVDMA_CONFIG =================================================== */
/**
  * @brief CONFIG [MVDMA_CONFIG] MVDMA configuration registers.
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Configure MVDMA mode of operation.                    */
  __IOM uint32_t  AXIMODE;                           /*!< (@ 0x00000004) Mode that defines if the AXI bus is AXI or AXI-Lite
                                                                         (one-beat bursts)*/
} NRF_MVDMA_CONFIG_Type;                             /*!< Size = 8 (0x008)                                                     */

/* MVDMA_CONFIG_MODE: Configure MVDMA mode of operation. */
  #define MVDMA_CONFIG_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                       */

/* MODE @Bit 0 : (unspecified) */
  #define MVDMA_CONFIG_MODE_MODE_Pos (0UL)           /*!< Position of MODE field.                                              */
  #define MVDMA_CONFIG_MODE_MODE_Msk (0x1UL << MVDMA_CONFIG_MODE_MODE_Pos) /*!< Bit mask of MODE field.                        */
  #define MVDMA_CONFIG_MODE_MODE_Min (0x0UL)         /*!< Min enumerator value of MODE field.                                  */
  #define MVDMA_CONFIG_MODE_MODE_Max (0x1UL)         /*!< Max enumerator value of MODE field.                                  */
  #define MVDMA_CONFIG_MODE_MODE_SingleMode (0x0UL)  /*!< Registers SOURCE.LISTPTR and SINK.LISTPTR contain start address of a
                                                          single job list.*/
  #define MVDMA_CONFIG_MODE_MODE_MultiMode (0x1UL)   /*!< Registers SOURCE.LISTPTR and SINK.LISTPTR contain start address of a
                                                          list of job list pointers in memory.*/


/* MVDMA_CONFIG_AXIMODE: Mode that defines if the AXI bus is AXI or AXI-Lite (one-beat bursts) */
  #define MVDMA_CONFIG_AXIMODE_ResetValue (0x00000000UL) /*!< Reset value of AXIMODE register.                                 */

/* AXIMODE @Bit 0 : (unspecified) */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_Pos (0UL)     /*!< Position of AXIMODE field.                                           */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_Msk (0x1UL << MVDMA_CONFIG_AXIMODE_AXIMODE_Pos) /*!< Bit mask of AXIMODE field.         */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_Min (0x0UL)   /*!< Min enumerator value of AXIMODE field.                               */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_Max (0x1UL)   /*!< Max enumerator value of AXIMODE field.                               */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_AXI (0x0UL)   /*!< AXI burst transactions may be longer than one beat.                  */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_AXILITE (0x1UL) /*!< All AXI transactions are one-beat accesses.                        */



/* =================================================== Struct MVDMA_SOURCE =================================================== */
/**
  * @brief SOURCE [MVDMA_SOURCE] Source channel configuration and status.
  */
typedef struct {
  __IOM uint32_t  LISTPTR;                           /*!< (@ 0x00000000) Start address of Source job list or list of job list
                                                                         pointers, depending on value of CONFIG.MODE.*/
  __IM  uint32_t  BUSERROR;                          /*!< (@ 0x00000004) Source bus error status.                              */
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000008) Latest address being accessed on the Source channel.If
                                                                         a bus error occurs, these registers will contain the
                                                                         address that cause the error.*/
  __IM  uint32_t  JOBCOUNT;                          /*!< (@ 0x0000000C) Number of completed jobs in the current Source
                                                                         descriptor list. This resets to 0 when a new joblist is
                                                                         started.*/
} NRF_MVDMA_SOURCE_Type;                             /*!< Size = 16 (0x010)                                                    */

/* MVDMA_SOURCE_LISTPTR: Start address of Source job list or list of job list pointers, depending on value of CONFIG.MODE. */
  #define MVDMA_SOURCE_LISTPTR_ResetValue (0x00000000UL) /*!< Reset value of LISTPTR register.                                 */

/* ADDRESS @Bits 0..31 : Source job descriptor list address. */
  #define MVDMA_SOURCE_LISTPTR_ADDRESS_Pos (0UL)     /*!< Position of ADDRESS field.                                           */
  #define MVDMA_SOURCE_LISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SOURCE_LISTPTR_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.  */


/* MVDMA_SOURCE_BUSERROR: Source bus error status. */
  #define MVDMA_SOURCE_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                               */

/* BUSERROR @Bits 0..1 : Bus error type */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Pos (0UL)   /*!< Position of BUSERROR field.                                          */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Msk (0x3UL << MVDMA_SOURCE_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR field.    */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                              */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Max (0x2UL) /*!< Max enumerator value of BUSERROR field.                              */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_NoError (0x0UL) /*!< There are no errors.                                             */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_ReadError (0x1UL) /*!< Error related to memory when reading joblist, or error related
                                                                to memory/register when reading data.*/
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_ReadDecodeError (0x2UL) /*!< Error related to the joblist address when reading joblist,
                                                                      or error related to address when reading memory/register.*/


/* MVDMA_SOURCE_ADDRESS: Latest address being accessed on the Source channel.If a bus error occurs, these registers will contain
                          the address that cause the error. */

  #define MVDMA_SOURCE_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                 */

/* ADDRESS @Bits 0..31 : Source address */
  #define MVDMA_SOURCE_ADDRESS_ADDRESS_Pos (0UL)     /*!< Position of ADDRESS field.                                           */
  #define MVDMA_SOURCE_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SOURCE_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.  */


