adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* MVDMA_EVENTS_RESET: Event indicating that the peripheral has been reset. */
  #define MVDMA_EVENTS_RESET_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RESET register.                              */

/* EVENTS_RESET @Bit 0 : Event indicating that the peripheral has been reset. */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Pos (0UL)  /*!< Position of EVENTS_RESET field.                                      */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Msk (0x1UL << MVDMA_EVENTS_RESET_EVENTS_RESET_Pos) /*!< Bit mask of EVENTS_RESET
                                                                            field.*/
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Min (0x0UL) /*!< Min enumerator value of EVENTS_RESET field.                         */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Max (0x1UL) /*!< Max enumerator value of EVENTS_RESET field.                         */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Generated (0x1UL) /*!< Event generated                                               */


/* MVDMA_EVENTS_COMPLETED: Event indicating that the operation started by the task START[n] has been completed. Base address for
                            successive EVENTS_COMPLETED. */

  #define MVDMA_EVENTS_COMPLETED_MaxCount (8UL)      /*!< Max size of EVENTS_COMPLETED[8] array.                               */
  #define MVDMA_EVENTS_COMPLETED_MaxIndex (7UL)      /*!< Max index of EVENTS_COMPLETED[8] array.                              */
  #define MVDMA_EVENTS_COMPLETED_MinIndex (0UL)      /*!< Min index of EVENTS_COMPLETED[8] array.                              */
  #define MVDMA_EVENTS_COMPLETED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_COMPLETED[8] register.                   */

/* EVENTS_COMPLETED @Bit 0 : Event indicating that the operation started by the task START[n] has been completed. Base address
                             for successive EVENTS_COMPLETED. */

  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Pos (0UL) /*!< Position of EVENTS_COMPLETED field.                           */
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Msk (0x1UL << MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Pos) /*!< Bit mask of
                                                                            EVENTS_COMPLETED field.*/
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Min (0x0UL) /*!< Min enumerator value of EVENTS_COMPLETED field.             */
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Max (0x1UL) /*!< Max enumerator value of EVENTS_COMPLETED field.             */
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Generated (0x1UL) /*!< Event generated                                       */


/* MVDMA_PUBLISH_END: Publish configuration for event END */
  #define MVDMA_PUBLISH_END_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_END register.                                */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define MVDMA_PUBLISH_END_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define MVDMA_PUBLISH_END_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define MVDMA_PUBLISH_END_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define MVDMA_PUBLISH_END_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_END_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define MVDMA_PUBLISH_END_EN_Msk (0x1UL << MVDMA_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field.                              */
  #define MVDMA_PUBLISH_END_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_END_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_END_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define MVDMA_PUBLISH_END_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* MVDMA_PUBLISH_COMPLETED: Publish configuration for event COMPLETED[n] */
  #define MVDMA_PUBLISH_COMPLETED_MaxCount (8UL)     /*!< Max size of PUBLISH_COMPLETED[8] array.                              */
  #define MVDMA_PUBLISH_COMPLETED_MaxIndex (7UL)     /*!< Max index of PUBLISH_COMPLETED[8] array.                             */
  #define MVDMA_PUBLISH_COMPLETED_MinIndex (0UL)     /*!< Min index of PUBLISH_COMPLETED[8] array.                             */
  #define MVDMA_PUBLISH_COMPLETED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_COMPLETED[8] register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that event COMPLETED[n] will publish to */
  #define MVDMA_PUBLISH_COMPLETED_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define MVDMA_PUBLISH_COMPLETED_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_COMPLETED_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define MVDMA_PUBLISH_COMPLETED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define MVDMA_PUBLISH_COMPLETED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_COMPLETED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define MVDMA_PUBLISH_COMPLETED_EN_Msk (0x1UL << MVDMA_PUBLISH_COMPLETED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define MVDMA_PUBLISH_COMPLETED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_COMPLETED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_COMPLETED_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define MVDMA_PUBLISH_COMPLETED_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* MVDMA_INTEN: Enable or disable interrupt */
  #define MVDMA_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* END @Bit 0 : Enable or disable interrupt for event END */
  #define MVDMA_INTEN_END_Pos (0UL)                  /*!< Position of END field.                                               */
  #define MVDMA_INTEN_END_Msk (0x1UL << MVDMA_INTEN_END_Pos) /*!< Bit mask of END field.                                       */
  #define MVDMA_INTEN_END_Min (0x0UL)                /*!< Min enumerator value of END field.                                   */
  #define MVDMA_INTEN_END_Max (0x1UL)                /*!< Max enumerator value of END field.                                   */
  #define MVDMA_INTEN_END_Disabled (0x0UL)           /*!< Disable                                                              */
  #define MVDMA_INTEN_END_Enabled (0x1UL)            /*!< Enable                                                               */

/* STARTED @Bit 1 : Enable or disable interrupt for event STARTED */
  #define MVDMA_INTEN_STARTED_Pos (1UL)              /*!< Position of STARTED field.                                           */
  #define MVDMA_INTEN_STARTED_Msk (0x1UL << MVDMA_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                           */
  #define MVDMA_INTEN_STARTED_Min (0x0UL)            /*!< Min enumerator value of STARTED field.                               */
  #define MVDMA_INTEN_STARTED_Max (0x1UL)            /*!< Max enumerator value of STARTED field.                               */
  #define MVDMA_INTEN_STARTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MVDMA_INTEN_STARTED_Enabled (0x1UL)        /*!< Enable                                                               */

/* PAUSED @Bit 2 : Enable or disable interrupt for event PAUSED */
  #define MVDMA_INTEN_PAUSED_Pos (2UL)               /*!< Position of PAUSED field.                                            */
  #define MVDMA_INTEN_PAUSED_Msk (0x1UL << MVDMA_INTEN_PAUSED_Pos) /*!< Bit mask of PAUSED field.                              */
  #define MVDMA_INTEN_PAUSED_Min (0x0UL)             /*!< Min enumerator value of PAUSED field.                                */
  #define MVDMA_INTEN_PAUSED_Max (0x1UL)             /*!< Max enumerator value of PAUSED field.                                */
  #define MVDMA_INTEN_PAUSED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define MVDMA_INTEN_PAUSED_Enabled (0x1UL)         /*!< Enable                                                               */

/* RESET @Bit 3 : Enable or disable interrupt for event RESET */
  #define MVDMA_INTEN_RESET_Pos (3UL)                /*!< Position of RESET field.                                             */
  #define MVDMA_INTEN_RESET_Msk (0x1UL << MVDMA_INTEN_RESET_Pos) /*!< Bit mask of RESET field.                                 */
  #define MVDMA_INTEN_RESET_Min (0x0UL)              /*!< Min enumerator value of RESET field.                                 */
  #define MVDMA_INTEN_RESET_Max (0x1UL)              /*!< Max enumerator value of RESET field.                                 */
  #define MVDMA_INTEN_RESET_Disabled (0x0UL)         /*!< Disable                                                              */
  #define MVDMA_INTEN_RESET_Enabled (0x1UL)          /*!< Enable                                                               */

/* SOURCEBUSERROR @Bit 4 : Enable or disable interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTEN_SOURCEBUSERROR_Pos (4UL)       /*!< Position of SOURCEBUSERROR field.                                    */
  #define MVDMA_INTEN_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTEN_SOURCEBUSERROR_Pos) /*!< Bit mask of SOURCEBUSERROR field.      */
  #define MVDMA_INTEN_SOURCEBUSERROR_Min (0x0UL)     /*!< Min enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTEN_SOURCEBUSERROR_Max (0x1UL)     /*!< Max enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTEN_SOURCEBUSERROR_Disabled (0x0UL) /*!< Disable                                                             */
  #define MVDMA_INTEN_SOURCEBUSERROR_Enabled (0x1UL) /*!< Enable                                                               */

/* SOURCESELECTJOBDONE @Bit 5 : Enable or disable interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Pos (5UL)  /*!< Position of SOURCESELECTJOBDONE field.                               */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTEN_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SOURCESELECTJOBDONE field.                  */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SOURCESELECTJOBDONE field.                  */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Disabled (0x0UL) /*!< Disable                                                        */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Enabled (0x1UL) /*!< Enable                                                          */

/* SINKBUSERROR @Bit 6 : Enable or disable interrupt for event SINKBUSERROR */
  #define MVDMA_INTEN_SINKBUSERROR_Pos (6UL)         /*!< Position of SINKBUSERROR field.                                      */
  #define MVDMA_INTEN_SINKBUSERROR_Msk (0x1UL << MVDMA_INTEN_SINKBUSERROR_Pos) /*!< Bit mask of SINKBUSERROR field.            */
  #define MVDMA_INTEN_SINKBUSERROR_Min (0x0UL)       /*!< Min enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTEN_SINKBUSERROR_Max (0x1UL)       /*!< Max enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTEN_SINKBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define MVDMA_INTEN_SINKBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */

/* SINKSELECTJOBDONE @Bit 7 : Enable or disable interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Pos (7UL)    /*!< Position of SINKSELECTJOBDONE field.                                 */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTEN_SINKSELECTJOBDONE_Pos) /*!< Bit mask of SINKSELECTJOBDONE
                                                                            field.*/
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Min (0x0UL)  /*!< Min enumerator value of SINKSELECTJOBDONE field.                     */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Max (0x1UL)  /*!< Max enumerator value of SINKSELECTJOBDONE field.                     */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Disabled (0x0UL) /*!< Disable                                                          */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Enabled (0x1UL) /*!< Enable                                                            */

/* COMPLETED0 @Bit 8 : Enable or disable interrupt for event COMPLETED[0] */
  #define MVDMA_INTEN_COMPLETED0_Pos (8UL)           /*!< Position of COMPLETED0 field.                                        */
  #define MVDMA_INTEN_COMPLETED0_Msk (0x1UL << MVDMA_INTEN_COMPLETED0_Pos) /*!< Bit mask of COMPLETED0 field.                  */
  #define MVDMA_INTEN_COMPLETED0_Min (0x0UL)         /*!< Min enumerator value of COMPLETED0 field.                            */
  #define MVDMA_INTEN_COMPLETED0_Max (0x1UL)         /*!< Max enumerator value of COMPLETED0 field.                            */
  #define MVDMA_INTEN_COMPLETED0_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MVDMA_INTEN_COMPLETED0_Enabled (0x1UL)     /*!< Enable                                                               */

