adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RESET @Bit 3 : Write '1' to disable interrupt for event RESET */
  #define MVDMA_INTENCLR_RESET_Pos (3UL)             /*!< Position of RESET field.                                             */
  #define MVDMA_INTENCLR_RESET_Msk (0x1UL << MVDMA_INTENCLR_RESET_Pos) /*!< Bit mask of RESET field.                           */
  #define MVDMA_INTENCLR_RESET_Min (0x0UL)           /*!< Min enumerator value of RESET field.                                 */
  #define MVDMA_INTENCLR_RESET_Max (0x1UL)           /*!< Max enumerator value of RESET field.                                 */
  #define MVDMA_INTENCLR_RESET_Clear (0x1UL)         /*!< Disable                                                              */
  #define MVDMA_INTENCLR_RESET_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_RESET_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SOURCEBUSERROR @Bit 4 : Write '1' to disable interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Pos (4UL)    /*!< Position of SOURCEBUSERROR field.                                    */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTENCLR_SOURCEBUSERROR_Pos) /*!< Bit mask of SOURCEBUSERROR field.*/
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Min (0x0UL)  /*!< Min enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Max (0x1UL)  /*!< Max enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Clear (0x1UL) /*!< Disable                                                             */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* SOURCESELECTJOBDONE @Bit 5 : Write '1' to disable interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Pos (5UL) /*!< Position of SOURCESELECTJOBDONE field.                             */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTENCLR_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SOURCESELECTJOBDONE field.               */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SOURCESELECTJOBDONE field.               */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Clear (0x1UL) /*!< Disable                                                        */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                              */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                */

/* SINKBUSERROR @Bit 6 : Write '1' to disable interrupt for event SINKBUSERROR */
  #define MVDMA_INTENCLR_SINKBUSERROR_Pos (6UL)      /*!< Position of SINKBUSERROR field.                                      */
  #define MVDMA_INTENCLR_SINKBUSERROR_Msk (0x1UL << MVDMA_INTENCLR_SINKBUSERROR_Pos) /*!< Bit mask of SINKBUSERROR field.      */
  #define MVDMA_INTENCLR_SINKBUSERROR_Min (0x0UL)    /*!< Min enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTENCLR_SINKBUSERROR_Max (0x1UL)    /*!< Max enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTENCLR_SINKBUSERROR_Clear (0x1UL)  /*!< Disable                                                              */
  #define MVDMA_INTENCLR_SINKBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define MVDMA_INTENCLR_SINKBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* SINKSELECTJOBDONE @Bit 7 : Write '1' to disable interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Pos (7UL) /*!< Position of SINKSELECTJOBDONE field.                                 */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTENCLR_SINKSELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SINKSELECTJOBDONE field.*/
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SINKSELECTJOBDONE field.                   */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SINKSELECTJOBDONE field.                   */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Clear (0x1UL) /*!< Disable                                                          */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* COMPLETED0 @Bit 8 : Write '1' to disable interrupt for event COMPLETED[0] */
  #define MVDMA_INTENCLR_COMPLETED0_Pos (8UL)        /*!< Position of COMPLETED0 field.                                        */
  #define MVDMA_INTENCLR_COMPLETED0_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED0_Pos) /*!< Bit mask of COMPLETED0 field.            */
  #define MVDMA_INTENCLR_COMPLETED0_Min (0x0UL)      /*!< Min enumerator value of COMPLETED0 field.                            */
  #define MVDMA_INTENCLR_COMPLETED0_Max (0x1UL)      /*!< Max enumerator value of COMPLETED0 field.                            */
  #define MVDMA_INTENCLR_COMPLETED0_Clear (0x1UL)    /*!< Disable                                                              */
  #define MVDMA_INTENCLR_COMPLETED0_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_COMPLETED0_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED1 @Bit 9 : Write '1' to disable interrupt for event COMPLETED[1] */
  #define MVDMA_INTENCLR_COMPLETED1_Pos (9UL)        /*!< Position of COMPLETED1 field.                                        */
  #define MVDMA_INTENCLR_COMPLETED1_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED1_Pos) /*!< Bit mask of COMPLETED1 field.            */
  #define MVDMA_INTENCLR_COMPLETED1_Min (0x0UL)      /*!< Min enumerator value of COMPLETED1 field.                            */
  #define MVDMA_INTENCLR_COMPLETED1_Max (0x1UL)      /*!< Max enumerator value of COMPLETED1 field.                            */
  #define MVDMA_INTENCLR_COMPLETED1_Clear (0x1UL)    /*!< Disable                                                              */
  #define MVDMA_INTENCLR_COMPLETED1_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_COMPLETED1_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

