adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* NFCT_RXD_AMOUNT: Size of last incoming frame */
  #define NFCT_RXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* RXDATABITS @Bits 0..2 : Number of bits in the last byte in the frame, if less than 8 (including CRC, but excluding parity and
                           SoF/EoF framing). */

  #define NFCT_RXD_AMOUNT_RXDATABITS_Pos (0UL)       /*!< Position of RXDATABITS field.                                        */
  #define NFCT_RXD_AMOUNT_RXDATABITS_Msk (0x7UL << NFCT_RXD_AMOUNT_RXDATABITS_Pos) /*!< Bit mask of RXDATABITS field.          */

/* RXDATABYTES @Bits 3..11 : Number of complete bytes received in the frame (including CRC, but excluding parity and SoF/EoF
                             framing) */

  #define NFCT_RXD_AMOUNT_RXDATABYTES_Pos (3UL)      /*!< Position of RXDATABYTES field.                                       */
  #define NFCT_RXD_AMOUNT_RXDATABYTES_Msk (0x1FFUL << NFCT_RXD_AMOUNT_RXDATABYTES_Pos) /*!< Bit mask of RXDATABYTES field.     */



/* =================================================== Struct NFCT_NFCID1 ==================================================== */
/**
  * @brief NFCID1 [NFCT_NFCID1] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LAST;                              /*!< (@ 0x00000000) Last NFCID1 part (4, 7 or 10 bytes ID)                */
  __IOM uint32_t  SECONDLAST;                        /*!< (@ 0x00000004) Second last NFCID1 part (7 or 10 bytes ID)            */
  __IOM uint32_t  THIRDLAST;                         /*!< (@ 0x00000008) Third last NFCID1 part (10 bytes ID)                  */
} NRF_NFCT_NFCID1_Type;                              /*!< Size = 12 (0x00C)                                                    */

/* NFCT_NFCID1_LAST: Last NFCID1 part (4, 7 or 10 bytes ID) */
  #define NFCT_NFCID1_LAST_ResetValue (0x00006363UL) /*!< Reset value of LAST register.                                        */

/* Z @Bits 0..7 : NFCID1 byte Z (very last byte sent) */
  #define NFCT_NFCID1_LAST_Z_Pos (0UL)               /*!< Position of Z field.                                                 */
  #define NFCT_NFCID1_LAST_Z_Msk (0xFFUL << NFCT_NFCID1_LAST_Z_Pos) /*!< Bit mask of Z field.                                  */

/* Y @Bits 8..15 : NFCID1 byte Y */
  #define NFCT_NFCID1_LAST_Y_Pos (8UL)               /*!< Position of Y field.                                                 */
  #define NFCT_NFCID1_LAST_Y_Msk (0xFFUL << NFCT_NFCID1_LAST_Y_Pos) /*!< Bit mask of Y field.                                  */

/* X @Bits 16..23 : NFCID1 byte X */
  #define NFCT_NFCID1_LAST_X_Pos (16UL)              /*!< Position of X field.                                                 */
  #define NFCT_NFCID1_LAST_X_Msk (0xFFUL << NFCT_NFCID1_LAST_X_Pos) /*!< Bit mask of X field.                                  */

/* W @Bits 24..31 : NFCID1 byte W */
  #define NFCT_NFCID1_LAST_W_Pos (24UL)              /*!< Position of W field.                                                 */
  #define NFCT_NFCID1_LAST_W_Msk (0xFFUL << NFCT_NFCID1_LAST_W_Pos) /*!< Bit mask of W field.                                  */


/* NFCT_NFCID1_SECONDLAST: Second last NFCID1 part (7 or 10 bytes ID) */
  #define NFCT_NFCID1_SECONDLAST_ResetValue (0x00000000UL) /*!< Reset value of SECONDLAST register.                            */

/* V @Bits 0..7 : NFCID1 byte V */
  #define NFCT_NFCID1_SECONDLAST_V_Pos (0UL)         /*!< Position of V field.                                                 */
  #define NFCT_NFCID1_SECONDLAST_V_Msk (0xFFUL << NFCT_NFCID1_SECONDLAST_V_Pos) /*!< Bit mask of V field.                      */

/* U @Bits 8..15 : NFCID1 byte U */
  #define NFCT_NFCID1_SECONDLAST_U_Pos (8UL)         /*!< Position of U field.                                                 */
  #define NFCT_NFCID1_SECONDLAST_U_Msk (0xFFUL << NFCT_NFCID1_SECONDLAST_U_Pos) /*!< Bit mask of U field.                      */

/* T @Bits 16..23 : NFCID1 byte T */
  #define NFCT_NFCID1_SECONDLAST_T_Pos (16UL)        /*!< Position of T field.                                                 */
  #define NFCT_NFCID1_SECONDLAST_T_Msk (0xFFUL << NFCT_NFCID1_SECONDLAST_T_Pos) /*!< Bit mask of T field.                      */


/* NFCT_NFCID1_THIRDLAST: Third last NFCID1 part (10 bytes ID) */
  #define NFCT_NFCID1_THIRDLAST_ResetValue (0x00000000UL) /*!< Reset value of THIRDLAST register.                              */

/* S @Bits 0..7 : NFCID1 byte S */
  #define NFCT_NFCID1_THIRDLAST_S_Pos (0UL)          /*!< Position of S field.                                                 */
  #define NFCT_NFCID1_THIRDLAST_S_Msk (0xFFUL << NFCT_NFCID1_THIRDLAST_S_Pos) /*!< Bit mask of S field.                        */

/* R @Bits 8..15 : NFCID1 byte R */
  #define NFCT_NFCID1_THIRDLAST_R_Pos (8UL)          /*!< Position of R field.                                                 */
  #define NFCT_NFCID1_THIRDLAST_R_Msk (0xFFUL << NFCT_NFCID1_THIRDLAST_R_Pos) /*!< Bit mask of R field.                        */

/* Q @Bits 16..23 : NFCID1 byte Q */
  #define NFCT_NFCID1_THIRDLAST_Q_Pos (16UL)         /*!< Position of Q field.                                                 */
  #define NFCT_NFCID1_THIRDLAST_Q_Msk (0xFFUL << NFCT_NFCID1_THIRDLAST_Q_Pos) /*!< Bit mask of Q field.                        */



/* ===================================================== Struct NFCT_DFT ===================================================== */
/**
  * @brief DFT [NFCT_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_NFCT_DFT_Type;                                 /*!< Size = 52 (0x034)                                                    */

/* NFCT_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define NFCT_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB0 */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_Msk (0x7UL << NFCT_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_Max (0x7UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_HighZ (0x0UL)   /*!< High impudence                                                       */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_BiasCurr8uA (0x1UL) /*!< 8 uA bias current from NFCT_BIAS_GF22N                           */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_BiasCurr50nA (0x2UL) /*!< 50 nA bias current from NFCT_BIAS_GF22N                         */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_ConnectATB0ToCalib (0x3UL) /*!< Connect ATB0 to inverting input of calibration comparator
                                                                     in NFCT_BIAS_GF22N.*/
  #define NFCT_DFT_ATB0CONFIG_SELMUX_Spare0 (0x4UL)  /*!< Spare pin (High impudence).                                          */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_Spare1 (0x5UL)  /*!< Spare pin (High impudence).                                          */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_Spare2 (0x6UL)  /*!< Spare pin (High impudence).                                          */
  #define NFCT_DFT_ATB0CONFIG_SELMUX_Spare3 (0x7UL)  /*!< Spare pin (High impudence).                                          */

