adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define NFCT_DFT_ATB0CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define NFCT_DFT_ATB0CONFIG_EN_Msk (0x1UL << NFCT_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define NFCT_DFT_ATB0CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define NFCT_DFT_ATB0CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define NFCT_DFT_ATB0CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled                                          */
  #define NFCT_DFT_ATB0CONFIG_EN_Enabled (0x1UL)     /*!< Analog test bus is enabled                                           */


/* NFCT_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define NFCT_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                               */

/* SELMUX @Bits 0..3 : Select multiplexer for ATB1 */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Msk (0xFUL << NFCT_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Max (0xFUL)     /*!< Max enumerator value of SELMUX field.                                */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_HighZ (0x0UL)   /*!< High impudence                                                       */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_NFCTLDOOut (0x1UL) /*!< Output voltage from NFCT_LDO_GF22N                                */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_VCOTuningVolt (0x2UL) /*!< VCO tuning voltage from NFCT_CLOCKREC_GF22N                    */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Spare0 (0x3UL)  /*!< Spare pin                                                            */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Spare1 (0x4UL)  /*!< Spare pin                                                            */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Spare2 (0x5UL)  /*!< Spare pin                                                            */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Spare3 (0x6UL)  /*!< Spare pin                                                            */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Spare4 (0x7UL)  /*!< Spare pin                                                            */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Spare5 (0x8UL)  /*!< Spare pin (ATB buffer enabled)                                       */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_SWATRefVolt (0x9UL) /*!< SWAT reference voltage from NFCT_BIAS_GF22N (ATB buffer enabled) */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_BackGateVolt (0xAUL) /*!< Back-gate voltage from envelope detector in NFCT_SHUNTREG_GF22N
                                                               (ATB buffer enabled)*/
  #define NFCT_DFT_ATB1CONFIG_SELMUX_HighThrPeakDet (0xBUL) /*!< High threshold voltage for peak detector in NFCT_SHUNTREG_GF22N
                                                                 (ATB buffer enabled)*/
  #define NFCT_DFT_ATB1CONFIG_SELMUX_LowThrPeakDet (0xCUL) /*!< Low threshold voltage for peak detector in NFCT_SHUNTREG_GF22N
                                                                (ATB buffer enabled)*/
  #define NFCT_DFT_ATB1CONFIG_SELMUX_CommomModeEnvDet (0xDUL) /*!< Common-mode for envelope detector in NFCT_SHUNTREG_GF22N (ATB
                                                                   buffer enabled)*/
  #define NFCT_DFT_ATB1CONFIG_SELMUX_NFCEnv (0xEUL)  /*!< Extracted NFC envelope from NFCT_SHUNTREG_GF22N)                     */
  #define NFCT_DFT_ATB1CONFIG_SELMUX_Spare6 (0xFUL)  /*!< Spare pin (ATB buffer enabled)                                       */

/* EN @Bit 31 : Enable the analog test bus */
  #define NFCT_DFT_ATB1CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define NFCT_DFT_ATB1CONFIG_EN_Msk (0x1UL << NFCT_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define NFCT_DFT_ATB1CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define NFCT_DFT_ATB1CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define NFCT_DFT_ATB1CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled                                          */
  #define NFCT_DFT_ATB1CONFIG_EN_Enabled (0x1UL)     /*!< Analog test bus is enabled                                           */


/* NFCT_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define NFCT_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << NFCT_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_Max (0x7UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_LOCKDET (0x0UL) /*!< NFCT_LOCKDET_AO_0V8 from NFCT_CLOCKREC_GF22N                         */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_FIELDLEVHIGH (0x1UL) /*!< NFCT_FIELDLEVHIGH_AO_0V8 from NFCT_SHUNTREG_GF22N               */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_FIELDLEVLOW (0x2UL) /*!< NFCT_FIELDLEVLOW_AO_0V8 from NFCT_SHUNTREG_GF22N                 */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_FIELDDET (0x3UL) /*!< NFCT_FIELDDET_AO_0V8 from NFCT_FIELDDET_GF22N                       */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_CK13M56 (0x4UL) /*!< CK_13M56_AO_0V8 from NFCT_CLOCKREC_GF22N (after frequency division of
                                                          4)*/
  #define NFCT_DFT_DTB0CONFIG_SELMUX_REF13M56 (0x5UL) /*!< NFCT_REF_13M56_AO_0V8 from NFCT_CLOCKREC_GF22N (after frequency
                                                           division of 4)*/
  #define NFCT_DFT_DTB0CONFIG_SELMUX_NEDGEDETCLK0 (0x6UL) /*!< NFCT_EDGEDETCLK_AO_0V8[0] from NFCT_CLOCKREC_GF22N              */
  #define NFCT_DFT_DTB0CONFIG_SELMUX_NEDGEDETCLK1 (0x7UL) /*!< NFCT_EDGEDETCLK_AO_0V8[1] from NFCT_CLOCKREC_GF22N              */

