adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BIT9 @Bit 9 : Spare */
  #define NFCT_DFT_TCFG_BIT9_Pos (9UL)               /*!< Position of BIT9 field.                                              */
  #define NFCT_DFT_TCFG_BIT9_Msk (0x1UL << NFCT_DFT_TCFG_BIT9_Pos) /*!< Bit mask of BIT9 field.                                */
  #define NFCT_DFT_TCFG_BIT9_Min (0x0UL)             /*!< Min enumerator value of BIT9 field.                                  */
  #define NFCT_DFT_TCFG_BIT9_Max (0x1UL)             /*!< Max enumerator value of BIT9 field.                                  */
  #define NFCT_DFT_TCFG_BIT9_Disabled (0x0UL)        /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_BIT9_Enabled (0x1UL)         /*!< (unspecified)                                                        */


/* ======================================================= Struct NFCT ======================================================= */
/**
  * @brief NFC-A compatible radio NFC-A compatible radio
  */
  typedef struct {                                   /*!< NFCT Structure                                                       */
    __OM uint32_t TASKS_ACTIVATE;                    /*!< (@ 0x00000000) Activate NFCT peripheral for incoming and outgoing
                                                                         frames, change state to activated*/
    __OM uint32_t TASKS_DISABLE;                     /*!< (@ 0x00000004) Disable NFCT peripheral                               */
    __OM uint32_t TASKS_SENSE;                       /*!< (@ 0x00000008) Enable NFC sense field mode, change state to sense
                                                                         mode*/
    __OM uint32_t TASKS_STARTTX;                     /*!< (@ 0x0000000C) Start transmission of an outgoing frame, change state
                                                                         to transmit*/
    __OM uint32_t TASKS_STOPTX;                      /*!< (@ 0x00000010) Stops an issued transmission of a frame               */
    __OM uint32_t TASKS_START_ROSCCAL;               /*!< (@ 0x00000014) Starts calibration of ring oscillator                 */
    __OM uint32_t TASKS_FREQMEASURE;                 /*!< (@ 0x00000018) Measures the 13.56 MHz clock frequency                */
    __OM uint32_t TASKS_ENABLERXDATA;                /*!< (@ 0x0000001C) Initializes the EasyDMA for receive.                  */
    __OM uint32_t TASKS_DISABLERXDATA;               /*!< (@ 0x00000020) Ends current EasyDMA transfer and stops waiting for
                                                                         start of frame (SoF)*/
    __OM uint32_t TASKS_GOIDLE;                      /*!< (@ 0x00000024) Force state machine to IDLE state                     */
    __OM uint32_t TASKS_GOSLEEP;                     /*!< (@ 0x00000028) Force state machine to SLEEP_A state                  */
    __IM uint32_t RESERVED[21];
    __IOM uint32_t SUBSCRIBE_ACTIVATE;               /*!< (@ 0x00000080) Subscribe configuration for task ACTIVATE             */
    __IOM uint32_t SUBSCRIBE_DISABLE;                /*!< (@ 0x00000084) Subscribe configuration for task DISABLE              */
    __IOM uint32_t SUBSCRIBE_SENSE;                  /*!< (@ 0x00000088) Subscribe configuration for task SENSE                */
    __IOM uint32_t SUBSCRIBE_STARTTX;                /*!< (@ 0x0000008C) Subscribe configuration for task STARTTX              */
    __IOM uint32_t SUBSCRIBE_STOPTX;                 /*!< (@ 0x00000090) Subscribe configuration for task STOPTX               */
    __IOM uint32_t SUBSCRIBE_START_ROSCCAL;          /*!< (@ 0x00000094) Subscribe configuration for task START_ROSCCAL        */
    __IOM uint32_t SUBSCRIBE_FREQMEASURE;            /*!< (@ 0x00000098) Subscribe configuration for task FREQMEASURE          */
    __IOM uint32_t SUBSCRIBE_ENABLERXDATA;           /*!< (@ 0x0000009C) Subscribe configuration for task ENABLERXDATA         */
    __IOM uint32_t SUBSCRIBE_DISABLERXDATA;          /*!< (@ 0x000000A0) Subscribe configuration for task DISABLERXDATA        */
    __IOM uint32_t SUBSCRIBE_GOIDLE;                 /*!< (@ 0x000000A4) Subscribe configuration for task GOIDLE               */
    __IOM uint32_t SUBSCRIBE_GOSLEEP;                /*!< (@ 0x000000A8) Subscribe configuration for task GOSLEEP              */
    __IM uint32_t RESERVED1[21];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) The NFCT peripheral is ready to receive and send
                                                                         frames*/
    __IOM uint32_t EVENTS_FIELDDETECTED;             /*!< (@ 0x00000104) Remote NFC field detected                             */
    __IOM uint32_t EVENTS_FIELDLOST;                 /*!< (@ 0x00000108) Remote NFC field lost                                 */
    __IOM uint32_t EVENTS_TXFRAMESTART;              /*!< (@ 0x0000010C) Marks the start of the first symbol of a transmitted
                                                                         frame*/
    __IOM uint32_t EVENTS_TXFRAMEEND;                /*!< (@ 0x00000110) Marks the end of the last transmitted on-air symbol of
                                                                         a frame data bit on the last positive edge ckTxNfc with
                                                                         nfcTransmit = 1*/
    __IOM uint32_t EVENTS_RXFRAMESTART;              /*!< (@ 0x00000114) Marks the end of the first symbol of a received frame */
    __IOM uint32_t EVENTS_RXFRAMEEND;                /*!< (@ 0x00000118) Received data has been checked (CRC, parity) and
                                                                         transferred to RAM, and EasyDMA has ended accessing the
                                                                         RX buffer*/
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x0000011C) NFC error reported. The ERRORSTATUS register contains
                                                                         details on the source of the error.*/
    __IOM uint32_t EVENTS_FREQMEASUREDONE;           /*!< (@ 0x00000120) Done with one frequency measurement, result available
                                                                         in the MEASUREDFREQ register. This event will fire
                                                                         several times during calibration.*/
    __IOM uint32_t EVENTS_CALCOMPLETE;               /*!< (@ 0x00000124) NFC ring oscillator calibration complete.             */
    __IOM uint32_t EVENTS_RXERROR;                   /*!< (@ 0x00000128) NFC RX frame error reported. The FRAMESTATUS.RX
                                                                         register contains details on the source of the error.*/
    __IOM uint32_t EVENTS_ENDRX;                     /*!< (@ 0x0000012C) RX buffer (as defined by PACKETPTR and MAXLEN) in Data
                                                                         RAM full.*/
    __IOM uint32_t EVENTS_ENDTX;                     /*!< (@ 0x00000130) Transmission of data in RAM has ended, and EasyDMA has
                                                                         ended accessing the TX buffer*/
    __IM uint32_t RESERVED2;
    __IOM uint32_t EVENTS_AUTOCOLRESSTARTED;         /*!< (@ 0x00000138) Auto collision resolution process has started Event
                                                                         generated when ALL_REQ or SENS_REQ has been received
                                                                         while in IDLE state*/
    __IOM uint32_t EVENTS_AUTOCOLRES1;               /*!< (@ 0x0000013C) Auto collision resolution cascade level 1 succeeded   */
    __IOM uint32_t EVENTS_AUTOCOLRES2;               /*!< (@ 0x00000140) Auto collision resolution cascade level 2 succeeded   */
    __IOM uint32_t EVENTS_AUTOCOLRES3;               /*!< (@ 0x00000144) Auto collision resolution cascade level 3 succeeded   */
    __IOM uint32_t EVENTS_COLLISION;                 /*!< (@ 0x00000148) NFC auto collision resolution error reported. The
                                                                         AUTOCOLRESSTATUS register contains details on the
                                                                         source of the error.*/
    __IOM uint32_t EVENTS_SELECTED;                  /*!< (@ 0x0000014C) NFC auto collision resolution successfully completed  */
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000150) EasyDMA is ready to receive or send frames.           */
    __IM uint32_t RESERVED3[11];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_FIELDDETECTED;            /*!< (@ 0x00000184) Publish configuration for event FIELDDETECTED         */
    __IOM uint32_t PUBLISH_FIELDLOST;                /*!< (@ 0x00000188) Publish configuration for event FIELDLOST             */
    __IOM uint32_t PUBLISH_TXFRAMESTART;             /*!< (@ 0x0000018C) Publish configuration for event TXFRAMESTART          */
    __IOM uint32_t PUBLISH_TXFRAMEEND;               /*!< (@ 0x00000190) Publish configuration for event TXFRAMEEND            */
    __IOM uint32_t PUBLISH_RXFRAMESTART;             /*!< (@ 0x00000194) Publish configuration for event RXFRAMESTART          */
    __IOM uint32_t PUBLISH_RXFRAMEEND;               /*!< (@ 0x00000198) Publish configuration for event RXFRAMEEND            */
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x0000019C) Publish configuration for event ERROR                 */
    __IOM uint32_t PUBLISH_FREQMEASUREDONE;          /*!< (@ 0x000001A0) Publish configuration for event FREQMEASUREDONE       */
    __IOM uint32_t PUBLISH_CALCOMPLETE;              /*!< (@ 0x000001A4) Publish configuration for event CALCOMPLETE           */
    __IOM uint32_t PUBLISH_RXERROR;                  /*!< (@ 0x000001A8) Publish configuration for event RXERROR               */
    __IOM uint32_t PUBLISH_ENDRX;                    /*!< (@ 0x000001AC) Publish configuration for event ENDRX                 */
    __IOM uint32_t PUBLISH_ENDTX;                    /*!< (@ 0x000001B0) Publish configuration for event ENDTX                 */
    __IM uint32_t RESERVED4;
    __IOM uint32_t PUBLISH_AUTOCOLRESSTARTED;        /*!< (@ 0x000001B8) Publish configuration for event AUTOCOLRESSTARTED     */
    __IOM uint32_t PUBLISH_AUTOCOLRES1;              /*!< (@ 0x000001BC) Publish configuration for event AUTOCOLRES1           */
    __IOM uint32_t PUBLISH_AUTOCOLRES2;              /*!< (@ 0x000001C0) Publish configuration for event AUTOCOLRES2           */
    __IOM uint32_t PUBLISH_AUTOCOLRES3;              /*!< (@ 0x000001C4) Publish configuration for event AUTOCOLRES3           */
    __IOM uint32_t PUBLISH_COLLISION;                /*!< (@ 0x000001C8) Publish configuration for event COLLISION             */
    __IOM uint32_t PUBLISH_SELECTED;                 /*!< (@ 0x000001CC) Publish configuration for event SELECTED              */
    __IOM uint32_t PUBLISH_STARTED;                  /*!< (@ 0x000001D0) Publish configuration for event STARTED               */
    __IM uint32_t RESERVED5[11];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED7[61];
    __IM uint32_t PWRUPSENSE;                        /*!< (@ 0x00000400) Tells if the NFCT peripheral is in SENSE mode         */
    __IOM uint32_t ERRORSTATUS;                      /*!< (@ 0x00000404) NFC Error Status register                             */
    __IOM uint32_t AUTOCOLRESSTATUS;                 /*!< (@ 0x00000408) NFC Auto collision resolution Error Status register   */
    __IOM NRF_NFCT_FRAMESTATUS_Type FRAMESTATUS;     /*!< (@ 0x0000040C) (unspecified)                                         */
    __IM uint32_t NFCTAGSTATE;                       /*!< (@ 0x00000410) Current operating state of NFC tag                    */
    __IM uint32_t RESERVED8[3];
    __IM uint32_t SLEEPSTATE;                        /*!< (@ 0x00000420) Sleep state during automatic collision resolution     */
    __IM uint32_t BYTESWRITTENTORAM;                 /*!< (@ 0x00000424) Number of bytes written to RAM                        */
    __IM uint32_t NFCFRAMINGCORESTATE;               /*!< (@ 0x00000428) NFC Framing Core State                                */
    __IOM uint32_t NFCANTICOLRESSTATE;               /*!< (@ 0x0000042C) Automatic collision resolution (anti-collision) state */
    __IM uint32_t RESERVED9;
    __IM uint32_t MEASUREDFREQ;                      /*!< (@ 0x00000434) The frequency measured on the 13.56 MHz NFC carrier
                                                                         signal*/
    __IM uint32_t ROSCCALVALUE;                      /*!< (@ 0x00000438) The current value used by the ring oscillator         */
    __IM uint32_t FIELDPRESENT;                      /*!< (@ 0x0000043C) Indicates the presence or not of a valid field        */
    __IM uint32_t CMFBPDREF;                         /*!< (@ 0x00000440) Current value of common-mode voltage level at pad     */
    __IM uint32_t RESERVED10[47];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Register to enable NFC functionality                  */
    __IOM uint32_t FRAMEDELAYMIN;                    /*!< (@ 0x00000504) Minimum frame delay                                   */
    __IOM uint32_t FRAMEDELAYMAX;                    /*!< (@ 0x00000508) Maximum frame delay                                   */
    __IOM uint32_t FRAMEDELAYMODE;                   /*!< (@ 0x0000050C) Configuration register for the Frame Delay Timer      */
    __IOM uint32_t PACKETPTR;                        /*!< (@ 0x00000510) Packet pointer for TXD and RXD data storage in Data
                                                                         RAM*/
    __IOM uint32_t MAXLEN;                           /*!< (@ 0x00000514) Size of the RAM buffer allocated to TXD and RXD data
                                                                         storage each*/
    __IOM NRF_NFCT_TXD_Type TXD;                     /*!< (@ 0x00000518) (unspecified)                                         */
    __IOM NRF_NFCT_RXD_Type RXD;                     /*!< (@ 0x00000520) (unspecified)                                         */
    __IOM uint32_t FRAMEDELAYSHIFT;                  /*!< (@ 0x00000528) Correction for the frame delay reference              */
    __IOM uint32_t MODULATIONCTRL;                   /*!< (@ 0x0000052C) Enables the modulation output to a GPIO pin which can
                                                                         be connected to a second external antenna.*/
    __IOM uint32_t CRCPOLY;                          /*!< (@ 0x00000530) CRC polynomial                                        */
    __IOM uint32_t CRCINIT;                          /*!< (@ 0x00000534) CRC initial value                                     */
    __IOM uint32_t MODULATIONPSEL;                   /*!< (@ 0x00000538) Pin select for Modulation control                     */
    __IM uint32_t RESERVED11[5];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000550) Configure EasyDMA mode                                */
    __IM uint32_t RESERVED12[15];
    __IOM NRF_NFCT_NFCID1_Type NFCID1;               /*!< (@ 0x00000590) (unspecified)                                         */
    __IOM uint32_t AUTOCOLRESCONFIG;                 /*!< (@ 0x0000059C) Controls the auto collision resolution function. This
                                                                         setting must be done before the NFCT peripheral is
                                                                         activated.*/
    __IOM uint32_t SENSRES;                          /*!< (@ 0x000005A0) NFC-A SENS_RES auto-response settings                 */
    __IOM uint32_t SELRES;                           /*!< (@ 0x000005A4) NFC-A SEL_RES auto-response settings                  */
    __IM uint32_t RESERVED13[29];
    __IOM uint32_t DEMODCONFIG;                      /*!< (@ 0x0000061C) Configuration settings for demodulation               */
    __IM uint32_t RESERVED14[2];
    __IOM uint32_t SYMBOLTOLLOWER;                   /*!< (@ 0x00000628) Configuration register for the tolerance of the
                                                                         received NFC pulse width*/
    __IOM uint32_t SYMBOLTOLUPPER;                   /*!< (@ 0x0000062C) Configuration register for the tolerance of the
                                                                         received NFC pulse width*/
    __IOM uint32_t CONTINUOUSSUBCARRIER;             /*!< (@ 0x00000630) Selects continuous sub-carrier transmission           */
    __IM uint32_t RESERVED15[2];
    __IOM uint32_t CLOCKRECCONFIG;                   /*!< (@ 0x0000063C) Configuration bits for NFCT_CLOCKREC_GF22N            */
    __IM uint32_t RESERVED16[4];
    __IOM uint32_t OVERRIDEENABLE;                   /*!< (@ 0x00000650) Enables override functionality.                       */
    __IM uint32_t RESERVED17[3];
    __IOM uint32_t OVRVALPWRUPNFC;                   /*!< (@ 0x00000660) Override value for pwrupNfc                           */
    __IOM uint32_t OVRVALMODULATION;                 /*!< (@ 0x00000664) Override value for modulation on/off                  */
    __IM uint32_t RESERVED18[3];
    __IOM uint32_t OVRVALROSCCALCODE;                /*!< (@ 0x00000674) Override value for the calibration word for the
                                                                         oscillator*/
    __IOM uint32_t OVRVALCLAMPEN1V6;                 /*!< (@ 0x00000678) Override value for the 1V6 clamp                      */
    __IOM uint32_t OVRVALCLAMPEN2V6;                 /*!< (@ 0x0000067C) Override value for the 2V6 clamp                      */
    __IOM uint32_t CALENNFC;                         /*!< (@ 0x00000680) Value for the signal CALEN going to the oscillator    */
    __IOM uint32_t AUTOCAL;                          /*!< (@ 0x00000684) Controls auto-calibration at NFCT module enabling     */
    __IM uint32_t RESERVED19;
    __IOM uint32_t SHUNTREGCONFIG;                   /*!< (@ 0x0000068C) Configuration for NFCT_SHUNTREG_GF22N                 */
    __IOM uint32_t LOADMODCONFIG;                    /*!< (@ 0x00000690) Configuration for load modulation                     */
    __IM uint32_t RESERVED20[2];
    __IOM uint32_t OVRVALCMFBPDREF;                  /*!< (@ 0x0000069C) Override value for cmfbPdRef                          */
    __IOM uint32_t LOCKDETECTWINDOW;                 /*!< (@ 0x000006A0) Adjust window size on falling edge of lock detect
                                                                         filter used for demodulation*/
    __IM uint32_t RESERVED21;
    __IOM uint32_t PNFCCFGRET;                       /*!< (@ 0x000006A8) Configuration of constant bits in P_NFCCFG_RET_0V8    */
    __IOM uint32_t SHUNTALGCONFIG;                   /*!< (@ 0x000006AC) Configuration settings for Shunt regulator algorithm  */
    __IM uint32_t RESERVED22[2];
    __IOM uint32_t OVRVALPWRUPNFCTFIELDDET;          /*!< (@ 0x000006B8) Power up field detect part of circuit and 5 nA IBPP
                                                                         current reference*/
    __IOM uint32_t OVRVALNFCTRSTEDCLK;               /*!< (@ 0x000006BC) Resets edge detect signal in NFCT_CLOCKREC_GF22N      */
    __IOM uint32_t OVRVALNFCTRSTPEAKLEV;             /*!< (@ 0x000006C0) Resets peak detectors in NFCT_SHUNTREG_GF22N          */
    __IOM uint32_t OVRVALNFCTCALEN;                  /*!< (@ 0x000006C4) Enable calibration of ring oscillator in
                                                                         NFCT_CLOCKREC_GF22N*/
    __IOM uint32_t NFCTFIELDDETCFG;                  /*!< (@ 0x000006C8) NFCT_FIELDDET_GF22N configuration bits                */
    __IOM uint32_t NFCTCTRL;                         /*!< (@ 0x000006CC) Spare digital control signals                         */
    __IOM uint32_t PWRUPNFCTLDO;                     /*!< (@ 0x000006D0) Power-up for LDO                                      */
    __IOM uint32_t PADCONFIG;                        /*!< (@ 0x000006D4) NFC pad configuration                                 */
    __IM uint32_t RESERVED23[2];
    __IM uint32_t NFCTCALCMP;                        /*!< (@ 0x000006E0) Output from the calibration comparator                */
    __IOM uint32_t BIASCFG;                          /*!< (@ 0x000006E4) Configuration of NFCT_BIAS_GF22N                      */
    __IOM uint32_t RINGOSCCONFIG;                    /*!< (@ 0x000006E8) Configuration settings for ring oscillator algorithm  */
    __IOM uint32_t OVRVALRETAIN;                     /*!< (@ 0x000006EC) Retain - Latch and isolate all RET_0V8 inputs to
                                                                         NFCT_ANA_GF22N and P_NFC_GF22N*/
    __IOM uint32_t CMFBENABLE;                       /*!< (@ 0x000006F0) Enable calibration of cmfbPdRef                       */
    __IOM uint32_t OVRVALPADNFCCFG;                  /*!< (@ 0x000006F4) Override of P_NFCCFG_RET_0V8 to P_NFC_GF22N           */
    __IM uint32_t RESERVED24[66];
    __IOM NRF_NFCT_DFT_Type DFT;                     /*!< (@ 0x00000800) (unspecified)                                         */
  } NRF_NFCT_Type;                                   /*!< Size = 2100 (0x834)                                                  */

/* NFCT_TASKS_ACTIVATE: Activate NFCT peripheral for incoming and outgoing frames, change state to activated */
  #define NFCT_TASKS_ACTIVATE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACTIVATE register.                           */

/* TASKS_ACTIVATE @Bit 0 : Activate NFCT peripheral for incoming and outgoing frames, change state to activated */
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Pos (0UL) /*!< Position of TASKS_ACTIVATE field.                                  */
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Msk (0x1UL << NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Pos) /*!< Bit mask of
                                                                            TASKS_ACTIVATE field.*/
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Min (0x1UL) /*!< Min enumerator value of TASKS_ACTIVATE field.                    */
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Max (0x1UL) /*!< Max enumerator value of TASKS_ACTIVATE field.                    */
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Trigger (0x1UL) /*!< Trigger task                                                 */


/* NFCT_TASKS_DISABLE: Disable NFCT peripheral */
  #define NFCT_TASKS_DISABLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DISABLE register.                             */

