adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_DISABLE @Bit 0 : Disable NFCT peripheral */
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Pos (0UL) /*!< Position of TASKS_DISABLE field.                                     */
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Msk (0x1UL << NFCT_TASKS_DISABLE_TASKS_DISABLE_Pos) /*!< Bit mask of TASKS_DISABLE
                                                                            field.*/
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Min (0x1UL) /*!< Min enumerator value of TASKS_DISABLE field.                       */
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Max (0x1UL) /*!< Max enumerator value of TASKS_DISABLE field.                       */
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Trigger (0x1UL) /*!< Trigger task                                                   */


/* NFCT_TASKS_SENSE: Enable NFC sense field mode, change state to sense mode */
  #define NFCT_TASKS_SENSE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SENSE register.                                 */

/* TASKS_SENSE @Bit 0 : Enable NFC sense field mode, change state to sense mode */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Pos (0UL)     /*!< Position of TASKS_SENSE field.                                       */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Msk (0x1UL << NFCT_TASKS_SENSE_TASKS_SENSE_Pos) /*!< Bit mask of TASKS_SENSE field.     */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Min (0x1UL)   /*!< Min enumerator value of TASKS_SENSE field.                           */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Max (0x1UL)   /*!< Max enumerator value of TASKS_SENSE field.                           */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Trigger (0x1UL) /*!< Trigger task                                                       */


/* NFCT_TASKS_STARTTX: Start transmission of an outgoing frame, change state to transmit */
  #define NFCT_TASKS_STARTTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTTX register.                             */

/* TASKS_STARTTX @Bit 0 : Start transmission of an outgoing frame, change state to transmit */
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Pos (0UL) /*!< Position of TASKS_STARTTX field.                                     */
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Msk (0x1UL << NFCT_TASKS_STARTTX_TASKS_STARTTX_Pos) /*!< Bit mask of TASKS_STARTTX
                                                                            field.*/
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTTX field.                       */
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTTX field.                       */
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Trigger (0x1UL) /*!< Trigger task                                                   */


/* NFCT_TASKS_STOPTX: Stops an issued transmission of a frame */
  #define NFCT_TASKS_STOPTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPTX register.                               */

/* TASKS_STOPTX @Bit 0 : Stops an issued transmission of a frame */
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Pos (0UL)   /*!< Position of TASKS_STOPTX field.                                      */
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Msk (0x1UL << NFCT_TASKS_STOPTX_TASKS_STOPTX_Pos) /*!< Bit mask of TASKS_STOPTX field.*/
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPTX field.                          */
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPTX field.                          */
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Trigger (0x1UL) /*!< Trigger task                                                     */


/* NFCT_TASKS_START_ROSCCAL: Starts calibration of ring oscillator */
  #define NFCT_TASKS_START_ROSCCAL_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START_ROSCCAL register.                 */

/* TASKS_START_ROSCCAL @Bit 0 : Starts calibration of ring oscillator */
  #define NFCT_TASKS_START_ROSCCAL_TASKS_START_ROSCCAL_Pos (0UL) /*!< Position of TASKS_START_ROSCCAL field.                   */
  #define NFCT_TASKS_START_ROSCCAL_TASKS_START_ROSCCAL_Msk (0x1UL << NFCT_TASKS_START_ROSCCAL_TASKS_START_ROSCCAL_Pos) /*!< Bit
                                                                            mask of TASKS_START_ROSCCAL field.*/
  #define NFCT_TASKS_START_ROSCCAL_TASKS_START_ROSCCAL_Min (0x1UL) /*!< Min enumerator value of TASKS_START_ROSCCAL field.     */
  #define NFCT_TASKS_START_ROSCCAL_TASKS_START_ROSCCAL_Max (0x1UL) /*!< Max enumerator value of TASKS_START_ROSCCAL field.     */
  #define NFCT_TASKS_START_ROSCCAL_TASKS_START_ROSCCAL_Trigger (0x1UL) /*!< Trigger task                                       */


/* NFCT_TASKS_FREQMEASURE: Measures the 13.56 MHz clock frequency */
  #define NFCT_TASKS_FREQMEASURE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQMEASURE register.                     */

/* TASKS_FREQMEASURE @Bit 0 : Measures the 13.56 MHz clock frequency */
  #define NFCT_TASKS_FREQMEASURE_TASKS_FREQMEASURE_Pos (0UL) /*!< Position of TASKS_FREQMEASURE field.                         */
  #define NFCT_TASKS_FREQMEASURE_TASKS_FREQMEASURE_Msk (0x1UL << NFCT_TASKS_FREQMEASURE_TASKS_FREQMEASURE_Pos) /*!< Bit mask of
                                                                            TASKS_FREQMEASURE field.*/
  #define NFCT_TASKS_FREQMEASURE_TASKS_FREQMEASURE_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQMEASURE field.           */
  #define NFCT_TASKS_FREQMEASURE_TASKS_FREQMEASURE_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQMEASURE field.           */
  #define NFCT_TASKS_FREQMEASURE_TASKS_FREQMEASURE_Trigger (0x1UL) /*!< Trigger task                                           */


/* NFCT_TASKS_ENABLERXDATA: Initializes the EasyDMA for receive. */
  #define NFCT_TASKS_ENABLERXDATA_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ENABLERXDATA register.                   */

/* TASKS_ENABLERXDATA @Bit 0 : Initializes the EasyDMA for receive. */
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Pos (0UL) /*!< Position of TASKS_ENABLERXDATA field.                      */
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Msk (0x1UL << NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Pos) /*!< Bit mask
                                                                            of TASKS_ENABLERXDATA field.*/
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Min (0x1UL) /*!< Min enumerator value of TASKS_ENABLERXDATA field.        */
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Max (0x1UL) /*!< Max enumerator value of TASKS_ENABLERXDATA field.        */
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Trigger (0x1UL) /*!< Trigger task                                         */


/* NFCT_TASKS_DISABLERXDATA: Ends current EasyDMA transfer and stops waiting for start of frame (SoF) */
  #define NFCT_TASKS_DISABLERXDATA_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DISABLERXDATA register.                 */

/* TASKS_DISABLERXDATA @Bit 0 : Ends current EasyDMA transfer and stops waiting for start of frame (SoF) */
  #define NFCT_TASKS_DISABLERXDATA_TASKS_DISABLERXDATA_Pos (0UL) /*!< Position of TASKS_DISABLERXDATA field.                   */
  #define NFCT_TASKS_DISABLERXDATA_TASKS_DISABLERXDATA_Msk (0x1UL << NFCT_TASKS_DISABLERXDATA_TASKS_DISABLERXDATA_Pos) /*!< Bit
                                                                            mask of TASKS_DISABLERXDATA field.*/
  #define NFCT_TASKS_DISABLERXDATA_TASKS_DISABLERXDATA_Min (0x1UL) /*!< Min enumerator value of TASKS_DISABLERXDATA field.     */
  #define NFCT_TASKS_DISABLERXDATA_TASKS_DISABLERXDATA_Max (0x1UL) /*!< Max enumerator value of TASKS_DISABLERXDATA field.     */
  #define NFCT_TASKS_DISABLERXDATA_TASKS_DISABLERXDATA_Trigger (0x1UL) /*!< Trigger task                                       */


