adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* NFCT_EVENTS_STARTED: EasyDMA is ready to receive or send frames. */
  #define NFCT_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                           */

/* EVENTS_STARTED @Bit 0 : EasyDMA is ready to receive or send frames. */
  #define NFCT_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                  */
  #define NFCT_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << NFCT_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define NFCT_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                    */
  #define NFCT_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                    */
  #define NFCT_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define NFCT_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                            */


/* NFCT_PUBLISH_READY: Publish configuration for event READY */
  #define NFCT_PUBLISH_READY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READY register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define NFCT_PUBLISH_READY_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_READY_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define NFCT_PUBLISH_READY_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_READY_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_READY_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_READY_EN_Msk (0x1UL << NFCT_PUBLISH_READY_EN_Pos) /*!< Bit mask of EN field.                            */
  #define NFCT_PUBLISH_READY_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_READY_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_READY_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_READY_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_FIELDDETECTED: Publish configuration for event FIELDDETECTED */
  #define NFCT_PUBLISH_FIELDDETECTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_FIELDDETECTED register.             */

/* CHIDX @Bits 0..7 : DPPI channel that event FIELDDETECTED will publish to */
  #define NFCT_PUBLISH_FIELDDETECTED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_FIELDDETECTED_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_FIELDDETECTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define NFCT_PUBLISH_FIELDDETECTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define NFCT_PUBLISH_FIELDDETECTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_FIELDDETECTED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_FIELDDETECTED_EN_Msk (0x1UL << NFCT_PUBLISH_FIELDDETECTED_EN_Pos) /*!< Bit mask of EN field.            */
  #define NFCT_PUBLISH_FIELDDETECTED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_FIELDDETECTED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_FIELDDETECTED_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define NFCT_PUBLISH_FIELDDETECTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* NFCT_PUBLISH_FIELDLOST: Publish configuration for event FIELDLOST */
  #define NFCT_PUBLISH_FIELDLOST_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_FIELDLOST register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event FIELDLOST will publish to */
  #define NFCT_PUBLISH_FIELDLOST_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_FIELDLOST_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_FIELDLOST_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define NFCT_PUBLISH_FIELDLOST_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_FIELDLOST_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_FIELDLOST_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_FIELDLOST_EN_Msk (0x1UL << NFCT_PUBLISH_FIELDLOST_EN_Pos) /*!< Bit mask of EN field.                    */
  #define NFCT_PUBLISH_FIELDLOST_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_FIELDLOST_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_FIELDLOST_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_FIELDLOST_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_TXFRAMESTART: Publish configuration for event TXFRAMESTART */
  #define NFCT_PUBLISH_TXFRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXFRAMESTART register.               */

/* CHIDX @Bits 0..7 : DPPI channel that event TXFRAMESTART will publish to */
  #define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_TXFRAMESTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Msk (0x1UL << NFCT_PUBLISH_TXFRAMESTART_EN_Pos) /*!< Bit mask of EN field.              */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


