adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event FREQMEASUREDONE will publish to */
  #define NFCT_PUBLISH_FREQMEASUREDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define NFCT_PUBLISH_FREQMEASUREDONE_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_FREQMEASUREDONE_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define NFCT_PUBLISH_FREQMEASUREDONE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                       */
  #define NFCT_PUBLISH_FREQMEASUREDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_FREQMEASUREDONE_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_FREQMEASUREDONE_EN_Msk (0x1UL << NFCT_PUBLISH_FREQMEASUREDONE_EN_Pos) /*!< Bit mask of EN field.        */
  #define NFCT_PUBLISH_FREQMEASUREDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define NFCT_PUBLISH_FREQMEASUREDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define NFCT_PUBLISH_FREQMEASUREDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                             */
  #define NFCT_PUBLISH_FREQMEASUREDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                               */


/* NFCT_PUBLISH_CALCOMPLETE: Publish configuration for event CALCOMPLETE */
  #define NFCT_PUBLISH_CALCOMPLETE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CALCOMPLETE register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that event CALCOMPLETE will publish to */
  #define NFCT_PUBLISH_CALCOMPLETE_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_CALCOMPLETE_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_CALCOMPLETE_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define NFCT_PUBLISH_CALCOMPLETE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define NFCT_PUBLISH_CALCOMPLETE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_CALCOMPLETE_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_CALCOMPLETE_EN_Msk (0x1UL << NFCT_PUBLISH_CALCOMPLETE_EN_Pos) /*!< Bit mask of EN field.                */
  #define NFCT_PUBLISH_CALCOMPLETE_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_CALCOMPLETE_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_CALCOMPLETE_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define NFCT_PUBLISH_CALCOMPLETE_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* NFCT_PUBLISH_RXERROR: Publish configuration for event RXERROR */
  #define NFCT_PUBLISH_RXERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXERROR register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event RXERROR will publish to */
  #define NFCT_PUBLISH_RXERROR_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_RXERROR_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_RXERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define NFCT_PUBLISH_RXERROR_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_RXERROR_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_RXERROR_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_RXERROR_EN_Msk (0x1UL << NFCT_PUBLISH_RXERROR_EN_Pos) /*!< Bit mask of EN field.                        */
  #define NFCT_PUBLISH_RXERROR_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_RXERROR_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_RXERROR_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_RXERROR_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_ENDRX: Publish configuration for event ENDRX */
  #define NFCT_PUBLISH_ENDRX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ENDRX register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event ENDRX will publish to */
  #define NFCT_PUBLISH_ENDRX_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_ENDRX_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_ENDRX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define NFCT_PUBLISH_ENDRX_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_ENDRX_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_ENDRX_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_ENDRX_EN_Msk (0x1UL << NFCT_PUBLISH_ENDRX_EN_Pos) /*!< Bit mask of EN field.                            */
  #define NFCT_PUBLISH_ENDRX_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_ENDRX_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_ENDRX_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_ENDRX_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


