adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define NFCT_PUBLISH_STARTED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define NFCT_PUBLISH_STARTED_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_STARTED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_STARTED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_STARTED_EN_Msk (0x1UL << NFCT_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define NFCT_PUBLISH_STARTED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_STARTED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_STARTED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_STARTED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* NFCT_SHORTS: Shortcuts between local events and tasks */
  #define NFCT_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* FIELDDETECTED_ACTIVATE @Bit 0 : Shortcut between event FIELDDETECTED and task ACTIVATE */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Pos (0UL) /*!< Position of FIELDDETECTED_ACTIVATE field.                          */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Msk (0x1UL << NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Pos) /*!< Bit mask of
                                                                            FIELDDETECTED_ACTIVATE field.*/
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Min (0x0UL) /*!< Min enumerator value of FIELDDETECTED_ACTIVATE field.            */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Max (0x1UL) /*!< Max enumerator value of FIELDDETECTED_ACTIVATE field.            */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Disabled (0x0UL) /*!< Disable shortcut                                            */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Enabled (0x1UL) /*!< Enable shortcut                                              */

/* FIELDLOST_SENSE @Bit 1 : Shortcut between event FIELDLOST and task SENSE */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Pos (1UL)      /*!< Position of FIELDLOST_SENSE field.                                   */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Msk (0x1UL << NFCT_SHORTS_FIELDLOST_SENSE_Pos) /*!< Bit mask of FIELDLOST_SENSE field.   */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Min (0x0UL)    /*!< Min enumerator value of FIELDLOST_SENSE field.                       */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Max (0x1UL)    /*!< Max enumerator value of FIELDLOST_SENSE field.                       */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* ENDRX_ENABLERXDATA @Bit 2 : Shortcut between event ENDRX and task ENABLERXDATA */
  #define NFCT_SHORTS_ENDRX_ENABLERXDATA_Pos (2UL)   /*!< Position of ENDRX_ENABLERXDATA field.                                */
  #define NFCT_SHORTS_ENDRX_ENABLERXDATA_Msk (0x1UL << NFCT_SHORTS_ENDRX_ENABLERXDATA_Pos) /*!< Bit mask of ENDRX_ENABLERXDATA
                                                                            field.*/
  #define NFCT_SHORTS_ENDRX_ENABLERXDATA_Min (0x0UL) /*!< Min enumerator value of ENDRX_ENABLERXDATA field.                    */
  #define NFCT_SHORTS_ENDRX_ENABLERXDATA_Max (0x1UL) /*!< Max enumerator value of ENDRX_ENABLERXDATA field.                    */
  #define NFCT_SHORTS_ENDRX_ENABLERXDATA_Disabled (0x0UL) /*!< Disable shortcut                                                */
  #define NFCT_SHORTS_ENDRX_ENABLERXDATA_Enabled (0x1UL) /*!< Enable shortcut                                                  */

/* ENDTX_ENABLERXDATA @Bit 3 : Shortcut between event ENDTX and task ENABLERXDATA */
  #define NFCT_SHORTS_ENDTX_ENABLERXDATA_Pos (3UL)   /*!< Position of ENDTX_ENABLERXDATA field.                                */
  #define NFCT_SHORTS_ENDTX_ENABLERXDATA_Msk (0x1UL << NFCT_SHORTS_ENDTX_ENABLERXDATA_Pos) /*!< Bit mask of ENDTX_ENABLERXDATA
                                                                            field.*/
  #define NFCT_SHORTS_ENDTX_ENABLERXDATA_Min (0x0UL) /*!< Min enumerator value of ENDTX_ENABLERXDATA field.                    */
  #define NFCT_SHORTS_ENDTX_ENABLERXDATA_Max (0x1UL) /*!< Max enumerator value of ENDTX_ENABLERXDATA field.                    */
  #define NFCT_SHORTS_ENDTX_ENABLERXDATA_Disabled (0x0UL) /*!< Disable shortcut                                                */
  #define NFCT_SHORTS_ENDTX_ENABLERXDATA_Enabled (0x1UL) /*!< Enable shortcut                                                  */

/* RXFRAMEEND_DISABLERXDATA @Bit 4 : Shortcut between event RXFRAMEEND and task DISABLERXDATA */
  #define NFCT_SHORTS_RXFRAMEEND_DISABLERXDATA_Pos (4UL) /*!< Position of RXFRAMEEND_DISABLERXDATA field.                      */
  #define NFCT_SHORTS_RXFRAMEEND_DISABLERXDATA_Msk (0x1UL << NFCT_SHORTS_RXFRAMEEND_DISABLERXDATA_Pos) /*!< Bit mask of
                                                                            RXFRAMEEND_DISABLERXDATA field.*/
  #define NFCT_SHORTS_RXFRAMEEND_DISABLERXDATA_Min (0x0UL) /*!< Min enumerator value of RXFRAMEEND_DISABLERXDATA field.        */
  #define NFCT_SHORTS_RXFRAMEEND_DISABLERXDATA_Max (0x1UL) /*!< Max enumerator value of RXFRAMEEND_DISABLERXDATA field.        */
  #define NFCT_SHORTS_RXFRAMEEND_DISABLERXDATA_Disabled (0x0UL) /*!< Disable shortcut                                          */
  #define NFCT_SHORTS_RXFRAMEEND_DISABLERXDATA_Enabled (0x1UL) /*!< Enable shortcut                                            */

/* TXFRAMEEND_ENABLERXDATA @Bit 5 : Shortcut between event TXFRAMEEND and task ENABLERXDATA */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Pos (5UL) /*!< Position of TXFRAMEEND_ENABLERXDATA field.                        */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Msk (0x1UL << NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Pos) /*!< Bit mask of
                                                                            TXFRAMEEND_ENABLERXDATA field.*/
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Min (0x0UL) /*!< Min enumerator value of TXFRAMEEND_ENABLERXDATA field.          */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Max (0x1UL) /*!< Max enumerator value of TXFRAMEEND_ENABLERXDATA field.          */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Disabled (0x0UL) /*!< Disable shortcut                                           */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Enabled (0x1UL) /*!< Enable shortcut                                             */

/* TXFRAMEEND_DISABLERXDATA @Bit 6 : Shortcut between event TXFRAMEEND and task DISABLERXDATA */
  #define NFCT_SHORTS_TXFRAMEEND_DISABLERXDATA_Pos (6UL) /*!< Position of TXFRAMEEND_DISABLERXDATA field.                      */
  #define NFCT_SHORTS_TXFRAMEEND_DISABLERXDATA_Msk (0x1UL << NFCT_SHORTS_TXFRAMEEND_DISABLERXDATA_Pos) /*!< Bit mask of
                                                                            TXFRAMEEND_DISABLERXDATA field.*/
  #define NFCT_SHORTS_TXFRAMEEND_DISABLERXDATA_Min (0x0UL) /*!< Min enumerator value of TXFRAMEEND_DISABLERXDATA field.        */
  #define NFCT_SHORTS_TXFRAMEEND_DISABLERXDATA_Max (0x1UL) /*!< Max enumerator value of TXFRAMEEND_DISABLERXDATA field.        */
  #define NFCT_SHORTS_TXFRAMEEND_DISABLERXDATA_Disabled (0x0UL) /*!< Disable shortcut                                          */
  #define NFCT_SHORTS_TXFRAMEEND_DISABLERXDATA_Enabled (0x1UL) /*!< Enable shortcut                                            */


/* NFCT_INTEN: Enable or disable interrupt */
  #define NFCT_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

