adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define NFCT_INTEN_READY_Pos (0UL)                 /*!< Position of READY field.                                             */
  #define NFCT_INTEN_READY_Msk (0x1UL << NFCT_INTEN_READY_Pos) /*!< Bit mask of READY field.                                   */
  #define NFCT_INTEN_READY_Min (0x0UL)               /*!< Min enumerator value of READY field.                                 */
  #define NFCT_INTEN_READY_Max (0x1UL)               /*!< Max enumerator value of READY field.                                 */
  #define NFCT_INTEN_READY_Disabled (0x0UL)          /*!< Disable                                                              */
  #define NFCT_INTEN_READY_Enabled (0x1UL)           /*!< Enable                                                               */

/* FIELDDETECTED @Bit 1 : Enable or disable interrupt for event FIELDDETECTED */
  #define NFCT_INTEN_FIELDDETECTED_Pos (1UL)         /*!< Position of FIELDDETECTED field.                                     */
  #define NFCT_INTEN_FIELDDETECTED_Msk (0x1UL << NFCT_INTEN_FIELDDETECTED_Pos) /*!< Bit mask of FIELDDETECTED field.           */
  #define NFCT_INTEN_FIELDDETECTED_Min (0x0UL)       /*!< Min enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTEN_FIELDDETECTED_Max (0x1UL)       /*!< Max enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTEN_FIELDDETECTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define NFCT_INTEN_FIELDDETECTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* FIELDLOST @Bit 2 : Enable or disable interrupt for event FIELDLOST */
  #define NFCT_INTEN_FIELDLOST_Pos (2UL)             /*!< Position of FIELDLOST field.                                         */
  #define NFCT_INTEN_FIELDLOST_Msk (0x1UL << NFCT_INTEN_FIELDLOST_Pos) /*!< Bit mask of FIELDLOST field.                       */
  #define NFCT_INTEN_FIELDLOST_Min (0x0UL)           /*!< Min enumerator value of FIELDLOST field.                             */
  #define NFCT_INTEN_FIELDLOST_Max (0x1UL)           /*!< Max enumerator value of FIELDLOST field.                             */
  #define NFCT_INTEN_FIELDLOST_Disabled (0x0UL)      /*!< Disable                                                              */
  #define NFCT_INTEN_FIELDLOST_Enabled (0x1UL)       /*!< Enable                                                               */

/* TXFRAMESTART @Bit 3 : Enable or disable interrupt for event TXFRAMESTART */
  #define NFCT_INTEN_TXFRAMESTART_Pos (3UL)          /*!< Position of TXFRAMESTART field.                                      */
  #define NFCT_INTEN_TXFRAMESTART_Msk (0x1UL << NFCT_INTEN_TXFRAMESTART_Pos) /*!< Bit mask of TXFRAMESTART field.              */
  #define NFCT_INTEN_TXFRAMESTART_Min (0x0UL)        /*!< Min enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTEN_TXFRAMESTART_Max (0x1UL)        /*!< Max enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTEN_TXFRAMESTART_Disabled (0x0UL)   /*!< Disable                                                              */
  #define NFCT_INTEN_TXFRAMESTART_Enabled (0x1UL)    /*!< Enable                                                               */

/* TXFRAMEEND @Bit 4 : Enable or disable interrupt for event TXFRAMEEND */
  #define NFCT_INTEN_TXFRAMEEND_Pos (4UL)            /*!< Position of TXFRAMEEND field.                                        */
  #define NFCT_INTEN_TXFRAMEEND_Msk (0x1UL << NFCT_INTEN_TXFRAMEEND_Pos) /*!< Bit mask of TXFRAMEEND field.                    */
  #define NFCT_INTEN_TXFRAMEEND_Min (0x0UL)          /*!< Min enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTEN_TXFRAMEEND_Max (0x1UL)          /*!< Max enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTEN_TXFRAMEEND_Disabled (0x0UL)     /*!< Disable                                                              */
  #define NFCT_INTEN_TXFRAMEEND_Enabled (0x1UL)      /*!< Enable                                                               */

/* RXFRAMESTART @Bit 5 : Enable or disable interrupt for event RXFRAMESTART */
  #define NFCT_INTEN_RXFRAMESTART_Pos (5UL)          /*!< Position of RXFRAMESTART field.                                      */
  #define NFCT_INTEN_RXFRAMESTART_Msk (0x1UL << NFCT_INTEN_RXFRAMESTART_Pos) /*!< Bit mask of RXFRAMESTART field.              */
  #define NFCT_INTEN_RXFRAMESTART_Min (0x0UL)        /*!< Min enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTEN_RXFRAMESTART_Max (0x1UL)        /*!< Max enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTEN_RXFRAMESTART_Disabled (0x0UL)   /*!< Disable                                                              */
  #define NFCT_INTEN_RXFRAMESTART_Enabled (0x1UL)    /*!< Enable                                                               */

/* RXFRAMEEND @Bit 6 : Enable or disable interrupt for event RXFRAMEEND */
  #define NFCT_INTEN_RXFRAMEEND_Pos (6UL)            /*!< Position of RXFRAMEEND field.                                        */
  #define NFCT_INTEN_RXFRAMEEND_Msk (0x1UL << NFCT_INTEN_RXFRAMEEND_Pos) /*!< Bit mask of RXFRAMEEND field.                    */
  #define NFCT_INTEN_RXFRAMEEND_Min (0x0UL)          /*!< Min enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTEN_RXFRAMEEND_Max (0x1UL)          /*!< Max enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTEN_RXFRAMEEND_Disabled (0x0UL)     /*!< Disable                                                              */
  #define NFCT_INTEN_RXFRAMEEND_Enabled (0x1UL)      /*!< Enable                                                               */

/* ERROR @Bit 7 : Enable or disable interrupt for event ERROR */
  #define NFCT_INTEN_ERROR_Pos (7UL)                 /*!< Position of ERROR field.                                             */
  #define NFCT_INTEN_ERROR_Msk (0x1UL << NFCT_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                   */
  #define NFCT_INTEN_ERROR_Min (0x0UL)               /*!< Min enumerator value of ERROR field.                                 */
  #define NFCT_INTEN_ERROR_Max (0x1UL)               /*!< Max enumerator value of ERROR field.                                 */
  #define NFCT_INTEN_ERROR_Disabled (0x0UL)          /*!< Disable                                                              */
  #define NFCT_INTEN_ERROR_Enabled (0x1UL)           /*!< Enable                                                               */

/* FREQMEASUREDONE @Bit 8 : Enable or disable interrupt for event FREQMEASUREDONE */
  #define NFCT_INTEN_FREQMEASUREDONE_Pos (8UL)       /*!< Position of FREQMEASUREDONE field.                                   */
  #define NFCT_INTEN_FREQMEASUREDONE_Msk (0x1UL << NFCT_INTEN_FREQMEASUREDONE_Pos) /*!< Bit mask of FREQMEASUREDONE field.     */
  #define NFCT_INTEN_FREQMEASUREDONE_Min (0x0UL)     /*!< Min enumerator value of FREQMEASUREDONE field.                       */
  #define NFCT_INTEN_FREQMEASUREDONE_Max (0x1UL)     /*!< Max enumerator value of FREQMEASUREDONE field.                       */
  #define NFCT_INTEN_FREQMEASUREDONE_Disabled (0x0UL) /*!< Disable                                                             */
  #define NFCT_INTEN_FREQMEASUREDONE_Enabled (0x1UL) /*!< Enable                                                               */

/* CALCOMPLETE @Bit 9 : Enable or disable interrupt for event CALCOMPLETE */
  #define NFCT_INTEN_CALCOMPLETE_Pos (9UL)           /*!< Position of CALCOMPLETE field.                                       */
  #define NFCT_INTEN_CALCOMPLETE_Msk (0x1UL << NFCT_INTEN_CALCOMPLETE_Pos) /*!< Bit mask of CALCOMPLETE field.                 */
  #define NFCT_INTEN_CALCOMPLETE_Min (0x0UL)         /*!< Min enumerator value of CALCOMPLETE field.                           */
  #define NFCT_INTEN_CALCOMPLETE_Max (0x1UL)         /*!< Max enumerator value of CALCOMPLETE field.                           */
  #define NFCT_INTEN_CALCOMPLETE_Disabled (0x0UL)    /*!< Disable                                                              */
  #define NFCT_INTEN_CALCOMPLETE_Enabled (0x1UL)     /*!< Enable                                                               */

/* RXERROR @Bit 10 : Enable or disable interrupt for event RXERROR */
  #define NFCT_INTEN_RXERROR_Pos (10UL)              /*!< Position of RXERROR field.                                           */
  #define NFCT_INTEN_RXERROR_Msk (0x1UL << NFCT_INTEN_RXERROR_Pos) /*!< Bit mask of RXERROR field.                             */
  #define NFCT_INTEN_RXERROR_Min (0x0UL)             /*!< Min enumerator value of RXERROR field.                               */
  #define NFCT_INTEN_RXERROR_Max (0x1UL)             /*!< Max enumerator value of RXERROR field.                               */
  #define NFCT_INTEN_RXERROR_Disabled (0x0UL)        /*!< Disable                                                              */
  #define NFCT_INTEN_RXERROR_Enabled (0x1UL)         /*!< Enable                                                               */

