adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENDRX @Bit 11 : Enable or disable interrupt for event ENDRX */
  #define NFCT_INTEN_ENDRX_Pos (11UL)                /*!< Position of ENDRX field.                                             */
  #define NFCT_INTEN_ENDRX_Msk (0x1UL << NFCT_INTEN_ENDRX_Pos) /*!< Bit mask of ENDRX field.                                   */
  #define NFCT_INTEN_ENDRX_Min (0x0UL)               /*!< Min enumerator value of ENDRX field.                                 */
  #define NFCT_INTEN_ENDRX_Max (0x1UL)               /*!< Max enumerator value of ENDRX field.                                 */
  #define NFCT_INTEN_ENDRX_Disabled (0x0UL)          /*!< Disable                                                              */
  #define NFCT_INTEN_ENDRX_Enabled (0x1UL)           /*!< Enable                                                               */

/* ENDTX @Bit 12 : Enable or disable interrupt for event ENDTX */
  #define NFCT_INTEN_ENDTX_Pos (12UL)                /*!< Position of ENDTX field.                                             */
  #define NFCT_INTEN_ENDTX_Msk (0x1UL << NFCT_INTEN_ENDTX_Pos) /*!< Bit mask of ENDTX field.                                   */
  #define NFCT_INTEN_ENDTX_Min (0x0UL)               /*!< Min enumerator value of ENDTX field.                                 */
  #define NFCT_INTEN_ENDTX_Max (0x1UL)               /*!< Max enumerator value of ENDTX field.                                 */
  #define NFCT_INTEN_ENDTX_Disabled (0x0UL)          /*!< Disable                                                              */
  #define NFCT_INTEN_ENDTX_Enabled (0x1UL)           /*!< Enable                                                               */

/* AUTOCOLRESSTARTED @Bit 14 : Enable or disable interrupt for event AUTOCOLRESSTARTED */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Pos (14UL)    /*!< Position of AUTOCOLRESSTARTED field.                                 */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Msk (0x1UL << NFCT_INTEN_AUTOCOLRESSTARTED_Pos) /*!< Bit mask of AUTOCOLRESSTARTED
                                                                            field.*/
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Min (0x0UL)   /*!< Min enumerator value of AUTOCOLRESSTARTED field.                     */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Max (0x1UL)   /*!< Max enumerator value of AUTOCOLRESSTARTED field.                     */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Disabled (0x0UL) /*!< Disable                                                           */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Enabled (0x1UL) /*!< Enable                                                             */

/* AUTOCOLRES1 @Bit 15 : Enable or disable interrupt for event AUTOCOLRES1 */
  #define NFCT_INTEN_AUTOCOLRES1_Pos (15UL)          /*!< Position of AUTOCOLRES1 field.                                       */
  #define NFCT_INTEN_AUTOCOLRES1_Msk (0x1UL << NFCT_INTEN_AUTOCOLRES1_Pos) /*!< Bit mask of AUTOCOLRES1 field.                 */
  #define NFCT_INTEN_AUTOCOLRES1_Min (0x0UL)         /*!< Min enumerator value of AUTOCOLRES1 field.                           */
  #define NFCT_INTEN_AUTOCOLRES1_Max (0x1UL)         /*!< Max enumerator value of AUTOCOLRES1 field.                           */
  #define NFCT_INTEN_AUTOCOLRES1_Disabled (0x0UL)    /*!< Disable                                                              */
  #define NFCT_INTEN_AUTOCOLRES1_Enabled (0x1UL)     /*!< Enable                                                               */

/* AUTOCOLRES2 @Bit 16 : Enable or disable interrupt for event AUTOCOLRES2 */
  #define NFCT_INTEN_AUTOCOLRES2_Pos (16UL)          /*!< Position of AUTOCOLRES2 field.                                       */
  #define NFCT_INTEN_AUTOCOLRES2_Msk (0x1UL << NFCT_INTEN_AUTOCOLRES2_Pos) /*!< Bit mask of AUTOCOLRES2 field.                 */
  #define NFCT_INTEN_AUTOCOLRES2_Min (0x0UL)         /*!< Min enumerator value of AUTOCOLRES2 field.                           */
  #define NFCT_INTEN_AUTOCOLRES2_Max (0x1UL)         /*!< Max enumerator value of AUTOCOLRES2 field.                           */
  #define NFCT_INTEN_AUTOCOLRES2_Disabled (0x0UL)    /*!< Disable                                                              */
  #define NFCT_INTEN_AUTOCOLRES2_Enabled (0x1UL)     /*!< Enable                                                               */

/* AUTOCOLRES3 @Bit 17 : Enable or disable interrupt for event AUTOCOLRES3 */
  #define NFCT_INTEN_AUTOCOLRES3_Pos (17UL)          /*!< Position of AUTOCOLRES3 field.                                       */
  #define NFCT_INTEN_AUTOCOLRES3_Msk (0x1UL << NFCT_INTEN_AUTOCOLRES3_Pos) /*!< Bit mask of AUTOCOLRES3 field.                 */
  #define NFCT_INTEN_AUTOCOLRES3_Min (0x0UL)         /*!< Min enumerator value of AUTOCOLRES3 field.                           */
  #define NFCT_INTEN_AUTOCOLRES3_Max (0x1UL)         /*!< Max enumerator value of AUTOCOLRES3 field.                           */
  #define NFCT_INTEN_AUTOCOLRES3_Disabled (0x0UL)    /*!< Disable                                                              */
  #define NFCT_INTEN_AUTOCOLRES3_Enabled (0x1UL)     /*!< Enable                                                               */

/* COLLISION @Bit 18 : Enable or disable interrupt for event COLLISION */
  #define NFCT_INTEN_COLLISION_Pos (18UL)            /*!< Position of COLLISION field.                                         */
  #define NFCT_INTEN_COLLISION_Msk (0x1UL << NFCT_INTEN_COLLISION_Pos) /*!< Bit mask of COLLISION field.                       */
  #define NFCT_INTEN_COLLISION_Min (0x0UL)           /*!< Min enumerator value of COLLISION field.                             */
  #define NFCT_INTEN_COLLISION_Max (0x1UL)           /*!< Max enumerator value of COLLISION field.                             */
  #define NFCT_INTEN_COLLISION_Disabled (0x0UL)      /*!< Disable                                                              */
  #define NFCT_INTEN_COLLISION_Enabled (0x1UL)       /*!< Enable                                                               */

/* SELECTED @Bit 19 : Enable or disable interrupt for event SELECTED */
  #define NFCT_INTEN_SELECTED_Pos (19UL)             /*!< Position of SELECTED field.                                          */
  #define NFCT_INTEN_SELECTED_Msk (0x1UL << NFCT_INTEN_SELECTED_Pos) /*!< Bit mask of SELECTED field.                          */
  #define NFCT_INTEN_SELECTED_Min (0x0UL)            /*!< Min enumerator value of SELECTED field.                              */
  #define NFCT_INTEN_SELECTED_Max (0x1UL)            /*!< Max enumerator value of SELECTED field.                              */
  #define NFCT_INTEN_SELECTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define NFCT_INTEN_SELECTED_Enabled (0x1UL)        /*!< Enable                                                               */

/* STARTED @Bit 20 : Enable or disable interrupt for event STARTED */
  #define NFCT_INTEN_STARTED_Pos (20UL)              /*!< Position of STARTED field.                                           */
  #define NFCT_INTEN_STARTED_Msk (0x1UL << NFCT_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                             */
  #define NFCT_INTEN_STARTED_Min (0x0UL)             /*!< Min enumerator value of STARTED field.                               */
  #define NFCT_INTEN_STARTED_Max (0x1UL)             /*!< Max enumerator value of STARTED field.                               */
  #define NFCT_INTEN_STARTED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define NFCT_INTEN_STARTED_Enabled (0x1UL)         /*!< Enable                                                               */


