adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ERROR @Bit 7 : Write '1' to disable interrupt for event ERROR */
  #define NFCT_INTENCLR_ERROR_Pos (7UL)              /*!< Position of ERROR field.                                             */
  #define NFCT_INTENCLR_ERROR_Msk (0x1UL << NFCT_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define NFCT_INTENCLR_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define NFCT_INTENCLR_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define NFCT_INTENCLR_ERROR_Clear (0x1UL)          /*!< Disable                                                              */
  #define NFCT_INTENCLR_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* FREQMEASUREDONE @Bit 8 : Write '1' to disable interrupt for event FREQMEASUREDONE */
  #define NFCT_INTENCLR_FREQMEASUREDONE_Pos (8UL)    /*!< Position of FREQMEASUREDONE field.                                   */
  #define NFCT_INTENCLR_FREQMEASUREDONE_Msk (0x1UL << NFCT_INTENCLR_FREQMEASUREDONE_Pos) /*!< Bit mask of FREQMEASUREDONE
                                                                            field.*/
  #define NFCT_INTENCLR_FREQMEASUREDONE_Min (0x0UL)  /*!< Min enumerator value of FREQMEASUREDONE field.                       */
  #define NFCT_INTENCLR_FREQMEASUREDONE_Max (0x1UL)  /*!< Max enumerator value of FREQMEASUREDONE field.                       */
  #define NFCT_INTENCLR_FREQMEASUREDONE_Clear (0x1UL) /*!< Disable                                                             */
  #define NFCT_INTENCLR_FREQMEASUREDONE_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define NFCT_INTENCLR_FREQMEASUREDONE_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* CALCOMPLETE @Bit 9 : Write '1' to disable interrupt for event CALCOMPLETE */
  #define NFCT_INTENCLR_CALCOMPLETE_Pos (9UL)        /*!< Position of CALCOMPLETE field.                                       */
  #define NFCT_INTENCLR_CALCOMPLETE_Msk (0x1UL << NFCT_INTENCLR_CALCOMPLETE_Pos) /*!< Bit mask of CALCOMPLETE field.           */
  #define NFCT_INTENCLR_CALCOMPLETE_Min (0x0UL)      /*!< Min enumerator value of CALCOMPLETE field.                           */
  #define NFCT_INTENCLR_CALCOMPLETE_Max (0x1UL)      /*!< Max enumerator value of CALCOMPLETE field.                           */
  #define NFCT_INTENCLR_CALCOMPLETE_Clear (0x1UL)    /*!< Disable                                                              */
  #define NFCT_INTENCLR_CALCOMPLETE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_CALCOMPLETE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RXERROR @Bit 10 : Write '1' to disable interrupt for event RXERROR */
  #define NFCT_INTENCLR_RXERROR_Pos (10UL)           /*!< Position of RXERROR field.                                           */
  #define NFCT_INTENCLR_RXERROR_Msk (0x1UL << NFCT_INTENCLR_RXERROR_Pos) /*!< Bit mask of RXERROR field.                       */
  #define NFCT_INTENCLR_RXERROR_Min (0x0UL)          /*!< Min enumerator value of RXERROR field.                               */
  #define NFCT_INTENCLR_RXERROR_Max (0x1UL)          /*!< Max enumerator value of RXERROR field.                               */
  #define NFCT_INTENCLR_RXERROR_Clear (0x1UL)        /*!< Disable                                                              */
  #define NFCT_INTENCLR_RXERROR_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_RXERROR_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDRX @Bit 11 : Write '1' to disable interrupt for event ENDRX */
  #define NFCT_INTENCLR_ENDRX_Pos (11UL)             /*!< Position of ENDRX field.                                             */
  #define NFCT_INTENCLR_ENDRX_Msk (0x1UL << NFCT_INTENCLR_ENDRX_Pos) /*!< Bit mask of ENDRX field.                             */
  #define NFCT_INTENCLR_ENDRX_Min (0x0UL)            /*!< Min enumerator value of ENDRX field.                                 */
  #define NFCT_INTENCLR_ENDRX_Max (0x1UL)            /*!< Max enumerator value of ENDRX field.                                 */
  #define NFCT_INTENCLR_ENDRX_Clear (0x1UL)          /*!< Disable                                                              */
  #define NFCT_INTENCLR_ENDRX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_ENDRX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* ENDTX @Bit 12 : Write '1' to disable interrupt for event ENDTX */
  #define NFCT_INTENCLR_ENDTX_Pos (12UL)             /*!< Position of ENDTX field.                                             */
  #define NFCT_INTENCLR_ENDTX_Msk (0x1UL << NFCT_INTENCLR_ENDTX_Pos) /*!< Bit mask of ENDTX field.                             */
  #define NFCT_INTENCLR_ENDTX_Min (0x0UL)            /*!< Min enumerator value of ENDTX field.                                 */
  #define NFCT_INTENCLR_ENDTX_Max (0x1UL)            /*!< Max enumerator value of ENDTX field.                                 */
  #define NFCT_INTENCLR_ENDTX_Clear (0x1UL)          /*!< Disable                                                              */
  #define NFCT_INTENCLR_ENDTX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_ENDTX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* AUTOCOLRESSTARTED @Bit 14 : Write '1' to disable interrupt for event AUTOCOLRESSTARTED */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Pos (14UL) /*!< Position of AUTOCOLRESSTARTED field.                                 */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Msk (0x1UL << NFCT_INTENCLR_AUTOCOLRESSTARTED_Pos) /*!< Bit mask of AUTOCOLRESSTARTED
                                                                            field.*/
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Min (0x0UL) /*!< Min enumerator value of AUTOCOLRESSTARTED field.                    */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Max (0x1UL) /*!< Max enumerator value of AUTOCOLRESSTARTED field.                    */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Clear (0x1UL) /*!< Disable                                                           */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* AUTOCOLRES1 @Bit 15 : Write '1' to disable interrupt for event AUTOCOLRES1 */
  #define NFCT_INTENCLR_AUTOCOLRES1_Pos (15UL)       /*!< Position of AUTOCOLRES1 field.                                       */
  #define NFCT_INTENCLR_AUTOCOLRES1_Msk (0x1UL << NFCT_INTENCLR_AUTOCOLRES1_Pos) /*!< Bit mask of AUTOCOLRES1 field.           */
  #define NFCT_INTENCLR_AUTOCOLRES1_Min (0x0UL)      /*!< Min enumerator value of AUTOCOLRES1 field.                           */
  #define NFCT_INTENCLR_AUTOCOLRES1_Max (0x1UL)      /*!< Max enumerator value of AUTOCOLRES1 field.                           */
  #define NFCT_INTENCLR_AUTOCOLRES1_Clear (0x1UL)    /*!< Disable                                                              */
  #define NFCT_INTENCLR_AUTOCOLRES1_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_AUTOCOLRES1_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* AUTOCOLRES2 @Bit 16 : Write '1' to disable interrupt for event AUTOCOLRES2 */
  #define NFCT_INTENCLR_AUTOCOLRES2_Pos (16UL)       /*!< Position of AUTOCOLRES2 field.                                       */
  #define NFCT_INTENCLR_AUTOCOLRES2_Msk (0x1UL << NFCT_INTENCLR_AUTOCOLRES2_Pos) /*!< Bit mask of AUTOCOLRES2 field.           */
  #define NFCT_INTENCLR_AUTOCOLRES2_Min (0x0UL)      /*!< Min enumerator value of AUTOCOLRES2 field.                           */
  #define NFCT_INTENCLR_AUTOCOLRES2_Max (0x1UL)      /*!< Max enumerator value of AUTOCOLRES2 field.                           */
  #define NFCT_INTENCLR_AUTOCOLRES2_Clear (0x1UL)    /*!< Disable                                                              */
  #define NFCT_INTENCLR_AUTOCOLRES2_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_AUTOCOLRES2_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* AUTOCOLRES3 @Bit 17 : Write '1' to disable interrupt for event AUTOCOLRES3 */
  #define NFCT_INTENCLR_AUTOCOLRES3_Pos (17UL)       /*!< Position of AUTOCOLRES3 field.                                       */
  #define NFCT_INTENCLR_AUTOCOLRES3_Msk (0x1UL << NFCT_INTENCLR_AUTOCOLRES3_Pos) /*!< Bit mask of AUTOCOLRES3 field.           */
  #define NFCT_INTENCLR_AUTOCOLRES3_Min (0x0UL)      /*!< Min enumerator value of AUTOCOLRES3 field.                           */
  #define NFCT_INTENCLR_AUTOCOLRES3_Max (0x1UL)      /*!< Max enumerator value of AUTOCOLRES3 field.                           */
  #define NFCT_INTENCLR_AUTOCOLRES3_Clear (0x1UL)    /*!< Disable                                                              */
  #define NFCT_INTENCLR_AUTOCOLRES3_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_AUTOCOLRES3_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COLLISION @Bit 18 : Write '1' to disable interrupt for event COLLISION */
  #define NFCT_INTENCLR_COLLISION_Pos (18UL)         /*!< Position of COLLISION field.                                         */
  #define NFCT_INTENCLR_COLLISION_Msk (0x1UL << NFCT_INTENCLR_COLLISION_Pos) /*!< Bit mask of COLLISION field.                 */
  #define NFCT_INTENCLR_COLLISION_Min (0x0UL)        /*!< Min enumerator value of COLLISION field.                             */
  #define NFCT_INTENCLR_COLLISION_Max (0x1UL)        /*!< Max enumerator value of COLLISION field.                             */
  #define NFCT_INTENCLR_COLLISION_Clear (0x1UL)      /*!< Disable                                                              */
  #define NFCT_INTENCLR_COLLISION_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_COLLISION_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* SELECTED @Bit 19 : Write '1' to disable interrupt for event SELECTED */
  #define NFCT_INTENCLR_SELECTED_Pos (19UL)          /*!< Position of SELECTED field.                                          */
  #define NFCT_INTENCLR_SELECTED_Msk (0x1UL << NFCT_INTENCLR_SELECTED_Pos) /*!< Bit mask of SELECTED field.                    */
  #define NFCT_INTENCLR_SELECTED_Min (0x0UL)         /*!< Min enumerator value of SELECTED field.                              */
  #define NFCT_INTENCLR_SELECTED_Max (0x1UL)         /*!< Max enumerator value of SELECTED field.                              */
  #define NFCT_INTENCLR_SELECTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define NFCT_INTENCLR_SELECTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_SELECTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* STARTED @Bit 20 : Write '1' to disable interrupt for event STARTED */
  #define NFCT_INTENCLR_STARTED_Pos (20UL)           /*!< Position of STARTED field.                                           */
  #define NFCT_INTENCLR_STARTED_Msk (0x1UL << NFCT_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define NFCT_INTENCLR_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define NFCT_INTENCLR_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define NFCT_INTENCLR_STARTED_Clear (0x1UL)        /*!< Disable                                                              */
  #define NFCT_INTENCLR_STARTED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_STARTED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


