adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCKDETECT @Bit 1 : Indicates if the low level has locked to the field */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Pos (1UL)     /*!< Position of LOCKDETECT field.                                        */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Msk (0x1UL << NFCT_FIELDPRESENT_LOCKDETECT_Pos) /*!< Bit mask of LOCKDETECT field.      */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Min (0x0UL)   /*!< Min enumerator value of LOCKDETECT field.                            */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Max (0x1UL)   /*!< Max enumerator value of LOCKDETECT field.                            */
  #define NFCT_FIELDPRESENT_LOCKDETECT_NotLocked (0x0UL) /*!< Not locked to field                                              */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Locked (0x1UL) /*!< Locked to field                                                     */


/* NFCT_CMFBPDREF: Current value of common-mode voltage level at pad */
  #define NFCT_CMFBPDREF_ResetValue (0x00000000UL)   /*!< Reset value of CMFBPDREF register.                                   */

/* CMFBPDREF @Bits 0..2 : Current value of common-mode voltage level at pad. */
  #define NFCT_CMFBPDREF_CMFBPDREF_Pos (0UL)         /*!< Position of CMFBPDREF field.                                         */
  #define NFCT_CMFBPDREF_CMFBPDREF_Msk (0x7UL << NFCT_CMFBPDREF_CMFBPDREF_Pos) /*!< Bit mask of CMFBPDREF field.               */
  #define NFCT_CMFBPDREF_CMFBPDREF_Min (0x0UL)       /*!< Min enumerator value of CMFBPDREF field.                             */
  #define NFCT_CMFBPDREF_CMFBPDREF_Max (0x4UL)       /*!< Max enumerator value of CMFBPDREF field.                             */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF0 (0x0UL) /*!< 800 mV                                                              */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF1 (0x1UL) /*!< 900 mV                                                              */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF2 (0x2UL) /*!< 1 V                                                                 */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF3 (0x3UL) /*!< 1.1 V                                                               */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF4 (0x4UL) /*!< Spare                                                               */


/* NFCT_ENABLE: Register to enable NFC functionality */
  #define NFCT_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Register to enable NFC functionality */
  #define NFCT_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define NFCT_ENABLE_ENABLE_Msk (0x1UL << NFCT_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define NFCT_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define NFCT_ENABLE_ENABLE_Max (0x1UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define NFCT_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable NFC                                                          */
  #define NFCT_ENABLE_ENABLE_Enabled (0x1UL)         /*!< Enable NFC                                                           */


/* NFCT_FRAMEDELAYMIN: Minimum frame delay */
  #define NFCT_FRAMEDELAYMIN_ResetValue (0x00000480UL) /*!< Reset value of FRAMEDELAYMIN register.                             */

/* FRAMEDELAYMIN @Bits 0..15 : Minimum frame delay in number of 13.56 MHz clock cycles */
  #define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos (0UL) /*!< Position of FRAMEDELAYMIN field.                                     */
  #define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Msk (0xFFFFUL << NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos) /*!< Bit mask of FRAMEDELAYMIN
                                                                            field.*/


/* NFCT_FRAMEDELAYMAX: Maximum frame delay */
  #define NFCT_FRAMEDELAYMAX_ResetValue (0x00001000UL) /*!< Reset value of FRAMEDELAYMAX register.                             */

/* FRAMEDELAYMAX @Bits 0..19 : Maximum frame delay in number of 13.56 MHz clock cycles */
  #define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Pos (0UL) /*!< Position of FRAMEDELAYMAX field.                                     */
  #define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Msk (0xFFFFFUL << NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYMAX field.*/


/* NFCT_FRAMEDELAYMODE: Configuration register for the Frame Delay Timer */
  #define NFCT_FRAMEDELAYMODE_ResetValue (0x00000001UL) /*!< Reset value of FRAMEDELAYMODE register.                           */

/* FRAMEDELAYMODE @Bits 0..1 : Configuration register for the Frame Delay Timer */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos (0UL) /*!< Position of FRAMEDELAYMODE field.                                  */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Msk (0x3UL << NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYMODE field.*/
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Min (0x0UL) /*!< Min enumerator value of FRAMEDELAYMODE field.                    */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Max (0x3UL) /*!< Max enumerator value of FRAMEDELAYMODE field.                    */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_FreeRun (0x0UL) /*!< Transmission is independent of frame timer and will start when
                                                                  the STARTTX task is triggered. No timeout.*/
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Window (0x1UL) /*!< Frame is transmitted between FRAMEDELAYMIN and FRAMEDELAYMAX  */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_ExactVal (0x2UL) /*!< Frame is transmitted exactly at FRAMEDELAYMAX               */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid (0x3UL) /*!< Frame is transmitted on a bit grid between FRAMEDELAYMIN
                                                                     and FRAMEDELAYMAX*/


/* NFCT_PACKETPTR: Packet pointer for TXD and RXD data storage in Data RAM */
  #define NFCT_PACKETPTR_ResetValue (0x00000000UL)   /*!< Reset value of PACKETPTR register.                                   */

