adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PTR @Bits 0..31 : Packet pointer for TXD and RXD data storage in Data RAM. This address is a byte-aligned RAM address. */
  #define NFCT_PACKETPTR_PTR_Pos (0UL)               /*!< Position of PTR field.                                               */
  #define NFCT_PACKETPTR_PTR_Msk (0xFFFFFFFFUL << NFCT_PACKETPTR_PTR_Pos) /*!< Bit mask of PTR field.                          */


/* NFCT_MAXLEN: Size of the RAM buffer allocated to TXD and RXD data storage each */
  #define NFCT_MAXLEN_ResetValue (0x00000000UL)      /*!< Reset value of MAXLEN register.                                      */

/* MAXLEN @Bits 0..8 : Size of the RAM buffer allocated to TXD and RXD data storage each */
  #define NFCT_MAXLEN_MAXLEN_Pos (0UL)               /*!< Position of MAXLEN field.                                            */
  #define NFCT_MAXLEN_MAXLEN_Msk (0x1FFUL << NFCT_MAXLEN_MAXLEN_Pos) /*!< Bit mask of MAXLEN field.                            */
  #define NFCT_MAXLEN_MAXLEN_Min (0x000UL)           /*!< Min value of MAXLEN field.                                           */
  #define NFCT_MAXLEN_MAXLEN_Max (0x101UL)           /*!< Max size of MAXLEN field.                                            */


/* NFCT_FRAMEDELAYSHIFT: Correction for the frame delay reference */
  #define NFCT_FRAMEDELAYSHIFT_ResetValue (0x0000000CUL) /*!< Reset value of FRAMEDELAYSHIFT register.                         */

/* FRAMEDELAYSHIFT @Bits 0..3 : Fine offset for the reference time for frame timing controller counter, measured in carrier
                                frequency periods. Value 8 is no offset. Values greater than 8 means the frame timing controller
                                counter reaches FRAMEDELAYMIN early and values less than 8 means the counter reaches
                                FRAMEDELAYMIN late. */

  #define NFCT_FRAMEDELAYSHIFT_FRAMEDELAYSHIFT_Pos (0UL) /*!< Position of FRAMEDELAYSHIFT field.                               */
  #define NFCT_FRAMEDELAYSHIFT_FRAMEDELAYSHIFT_Msk (0xFUL << NFCT_FRAMEDELAYSHIFT_FRAMEDELAYSHIFT_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYSHIFT field.*/


/* NFCT_MODULATIONCTRL: Enables the modulation output to a GPIO pin which can be connected to a second external antenna. */
  #define NFCT_MODULATIONCTRL_ResetValue (0x00000001UL) /*!< Reset value of MODULATIONCTRL register.                           */

/* MODULATIONCTRL @Bits 0..1 : Configuration of modulation control. */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Pos (0UL) /*!< Position of MODULATIONCTRL field.                                  */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Msk (0x3UL << NFCT_MODULATIONCTRL_MODULATIONCTRL_Pos) /*!< Bit mask of
                                                                            MODULATIONCTRL field.*/
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Min (0x0UL) /*!< Min enumerator value of MODULATIONCTRL field.                    */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Max (0x3UL) /*!< Max enumerator value of MODULATIONCTRL field.                    */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Invalid (0x0UL) /*!< Invalid, defaults to same behaviour as for Internal          */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Internal (0x1UL) /*!< Use internal modulator only                                 */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_ModToGpio (0x2UL) /*!< Output digital modulation signal to a GPIO pin.            */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_InternalAndModToGpio (0x3UL) /*!< Use internal modulator and output digital
                                                                            modulation signal to a GPIO pin.*/


/* NFCT_CRCPOLY: CRC polynomial */
  #define NFCT_CRCPOLY_ResetValue (0x00001021UL)     /*!< Reset value of CRCPOLY register.                                     */

/* CRCPOLY @Bits 0..15 : CRC polynomial. Each term in the CRC polynomial is mapped to a bit in this register which index
                         corresponds to the term's exponent. The most significant term (bit 16) is hardwired to 1, and not
                         reflected in the register. The following example is for a 16-bit CRC polynomial: (x16 +) x12 + x5 + 1 =
                         (1) 0001 0000 0010 0001 = 0x1021 (x16 is implicitly 1 and does not need to be written to the register)
                         */

  #define NFCT_CRCPOLY_CRCPOLY_Pos (0UL)             /*!< Position of CRCPOLY field.                                           */
  #define NFCT_CRCPOLY_CRCPOLY_Msk (0xFFFFUL << NFCT_CRCPOLY_CRCPOLY_Pos) /*!< Bit mask of CRCPOLY field.                      */


/* NFCT_CRCINIT: CRC initial value */
  #define NFCT_CRCINIT_ResetValue (0x00006363UL)     /*!< Reset value of CRCINIT register.                                     */

/* CRCINIT @Bits 0..15 : Initial value for CRC calculation */
  #define NFCT_CRCINIT_CRCINIT_Pos (0UL)             /*!< Position of CRCINIT field.                                           */
  #define NFCT_CRCINIT_CRCINIT_Msk (0xFFFFUL << NFCT_CRCINIT_CRCINIT_Pos) /*!< Bit mask of CRCINIT field.                      */
  #define NFCT_CRCINIT_CRCINIT_Min (0x6363UL)        /*!< Min enumerator value of CRCINIT field.                               */
  #define NFCT_CRCINIT_CRCINIT_Max (0xFFFFUL)        /*!< Max enumerator value of CRCINIT field.                               */
  #define NFCT_CRCINIT_CRCINIT_NFCA (0x6363UL)       /*!< Initial value for NFC-A                                              */
  #define NFCT_CRCINIT_CRCINIT_NFCBF (0xFFFFUL)      /*!< Initial value for NFC-B and NFC-F                                    */


/* NFCT_MODULATIONPSEL: Pin select for Modulation control */
  #define NFCT_MODULATIONPSEL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MODULATIONPSEL register.                           */

/* PIN @Bits 0..4 : Pin number */
  #define NFCT_MODULATIONPSEL_PIN_Pos (0UL)          /*!< Position of PIN field.                                               */
  #define NFCT_MODULATIONPSEL_PIN_Msk (0x1FUL << NFCT_MODULATIONPSEL_PIN_Pos) /*!< Bit mask of PIN field.                      */
  #define NFCT_MODULATIONPSEL_PIN_Min (0x00UL)       /*!< Min value of PIN field.                                              */
  #define NFCT_MODULATIONPSEL_PIN_Max (0x1FUL)       /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define NFCT_MODULATIONPSEL_PORT_Pos (5UL)         /*!< Position of PORT field.                                              */
  #define NFCT_MODULATIONPSEL_PORT_Msk (0xFUL << NFCT_MODULATIONPSEL_PORT_Pos) /*!< Bit mask of PORT field.                    */
  #define NFCT_MODULATIONPSEL_PORT_Min (0x0UL)       /*!< Min value of PORT field.                                             */
  #define NFCT_MODULATIONPSEL_PORT_Max (0xFUL)       /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define NFCT_MODULATIONPSEL_CONNECT_Pos (31UL)     /*!< Position of CONNECT field.                                           */
  #define NFCT_MODULATIONPSEL_CONNECT_Msk (0x1UL << NFCT_MODULATIONPSEL_CONNECT_Pos) /*!< Bit mask of CONNECT field.           */
  #define NFCT_MODULATIONPSEL_CONNECT_Min (0x0UL)    /*!< Min enumerator value of CONNECT field.                               */
  #define NFCT_MODULATIONPSEL_CONNECT_Max (0x1UL)    /*!< Max enumerator value of CONNECT field.                               */
  #define NFCT_MODULATIONPSEL_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                     */
  #define NFCT_MODULATIONPSEL_CONNECT_Connected (0x0UL) /*!< Connect                                                           */


