adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* NFCT_MODE: Configure EasyDMA mode */
  #define NFCT_MODE_ResetValue (0x00000001UL)        /*!< Reset value of MODE register.                                        */

/* LPOP @Bits 0..1 : Enable low-power operation, or use low-latency */
  #define NFCT_MODE_LPOP_Pos (0UL)                   /*!< Position of LPOP field.                                              */
  #define NFCT_MODE_LPOP_Msk (0x3UL << NFCT_MODE_LPOP_Pos) /*!< Bit mask of LPOP field.                                        */
  #define NFCT_MODE_LPOP_Min (0x0UL)                 /*!< Min enumerator value of LPOP field.                                  */
  #define NFCT_MODE_LPOP_Max (0x3UL)                 /*!< Max enumerator value of LPOP field.                                  */
  #define NFCT_MODE_LPOP_LowLat (0x0UL)              /*!< Low-latency operation                                                */
  #define NFCT_MODE_LPOP_LowPower (0x1UL)            /*!< Low-power operation                                                  */
  #define NFCT_MODE_LPOP_FullLowPower (0x3UL)        /*!< Full Low-power operation                                             */


/* NFCT_AUTOCOLRESCONFIG: Controls the auto collision resolution function. This setting must be done before the NFCT peripheral
                           is activated. */

  #define NFCT_AUTOCOLRESCONFIG_ResetValue (0x00000002UL) /*!< Reset value of AUTOCOLRESCONFIG register.                       */

/* MODE @Bit 0 : Enables/disables auto collision resolution */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Pos (0UL)       /*!< Position of MODE field.                                              */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Msk (0x1UL << NFCT_AUTOCOLRESCONFIG_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Max (0x1UL)     /*!< Max enumerator value of MODE field.                                  */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Enabled (0x0UL) /*!< Auto collision resolution enabled                                    */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Disabled (0x1UL) /*!< Auto collision resolution disabled                                  */

/* FILTER @Bit 1 : Enables/disables auto collision resolution short frame (any frames less than 7 bits) noise filter */
  #define NFCT_AUTOCOLRESCONFIG_FILTER_Pos (1UL)     /*!< Position of FILTER field.                                            */
  #define NFCT_AUTOCOLRESCONFIG_FILTER_Msk (0x1UL << NFCT_AUTOCOLRESCONFIG_FILTER_Pos) /*!< Bit mask of FILTER field.          */
  #define NFCT_AUTOCOLRESCONFIG_FILTER_Min (0x0UL)   /*!< Min enumerator value of FILTER field.                                */
  #define NFCT_AUTOCOLRESCONFIG_FILTER_Max (0x1UL)   /*!< Max enumerator value of FILTER field.                                */
  #define NFCT_AUTOCOLRESCONFIG_FILTER_Off (0x0UL)   /*!< Auto collision resolution short frame noise filter disabled          */
  #define NFCT_AUTOCOLRESCONFIG_FILTER_On (0x1UL)    /*!< Auto collision resolution ignores any frames less than 7 bits        */


/* NFCT_SENSRES: NFC-A SENS_RES auto-response settings */
  #define NFCT_SENSRES_ResetValue (0x00000001UL)     /*!< Reset value of SENSRES register.                                     */

/* BITFRAMESDD @Bits 0..4 : Bit frame SDD as defined by the b5:b1 of byte 1 in SENS_RES response in the NFC Forum, NFC Digital
                            Protocol Technical Specification */

  #define NFCT_SENSRES_BITFRAMESDD_Pos (0UL)         /*!< Position of BITFRAMESDD field.                                       */
  #define NFCT_SENSRES_BITFRAMESDD_Msk (0x1FUL << NFCT_SENSRES_BITFRAMESDD_Pos) /*!< Bit mask of BITFRAMESDD field.            */
  #define NFCT_SENSRES_BITFRAMESDD_Min (0x0UL)       /*!< Min enumerator value of BITFRAMESDD field.                           */
  #define NFCT_SENSRES_BITFRAMESDD_Max (0x10UL)      /*!< Max enumerator value of BITFRAMESDD field.                           */
  #define NFCT_SENSRES_BITFRAMESDD_SDD00000 (0x00UL) /*!< SDD pattern 00000                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD00001 (0x01UL) /*!< SDD pattern 00001                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD00010 (0x02UL) /*!< SDD pattern 00010                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD00100 (0x04UL) /*!< SDD pattern 00100                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD01000 (0x08UL) /*!< SDD pattern 01000                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD10000 (0x10UL) /*!< SDD pattern 10000                                                    */

/* RFU5 @Bit 5 : Reserved for future use. Shall be 0. */
  #define NFCT_SENSRES_RFU5_Pos (5UL)                /*!< Position of RFU5 field.                                              */
  #define NFCT_SENSRES_RFU5_Msk (0x1UL << NFCT_SENSRES_RFU5_Pos) /*!< Bit mask of RFU5 field.                                  */

/* NFCIDSIZE @Bits 6..7 : NFCID1 size. This value is used by the auto collision resolution engine. */
  #define NFCT_SENSRES_NFCIDSIZE_Pos (6UL)           /*!< Position of NFCIDSIZE field.                                         */
  #define NFCT_SENSRES_NFCIDSIZE_Msk (0x3UL << NFCT_SENSRES_NFCIDSIZE_Pos) /*!< Bit mask of NFCIDSIZE field.                   */
  #define NFCT_SENSRES_NFCIDSIZE_Min (0x0UL)         /*!< Min enumerator value of NFCIDSIZE field.                             */
  #define NFCT_SENSRES_NFCIDSIZE_Max (0x2UL)         /*!< Max enumerator value of NFCIDSIZE field.                             */
  #define NFCT_SENSRES_NFCIDSIZE_NFCID1Single (0x0UL) /*!< NFCID1 size: single (4 bytes)                                       */
  #define NFCT_SENSRES_NFCIDSIZE_NFCID1Double (0x1UL) /*!< NFCID1 size: double (7 bytes)                                       */
  #define NFCT_SENSRES_NFCIDSIZE_NFCID1Triple (0x2UL) /*!< NFCID1 size: triple (10 bytes)                                      */

/* PLATFCONFIG @Bits 8..11 : Tag platform configuration as defined by the b4:b1 of byte 2 in SENS_RES response in the NFC Forum,
                             NFC Digital Protocol Technical Specification */

  #define NFCT_SENSRES_PLATFCONFIG_Pos (8UL)         /*!< Position of PLATFCONFIG field.                                       */
  #define NFCT_SENSRES_PLATFCONFIG_Msk (0xFUL << NFCT_SENSRES_PLATFCONFIG_Pos) /*!< Bit mask of PLATFCONFIG field.             */

/* RFU74 @Bits 12..15 : Reserved for future use. Shall be 0. */
  #define NFCT_SENSRES_RFU74_Pos (12UL)              /*!< Position of RFU74 field.                                             */
  #define NFCT_SENSRES_RFU74_Msk (0xFUL << NFCT_SENSRES_RFU74_Pos) /*!< Bit mask of RFU74 field.                               */


/* NFCT_SELRES: NFC-A SEL_RES auto-response settings */
  #define NFCT_SELRES_ResetValue (0x00000000UL)      /*!< Reset value of SELRES register.                                      */

