adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RFU10 @Bits 0..1 : Reserved for future use. Shall be 0. */
  #define NFCT_SELRES_RFU10_Pos (0UL)                /*!< Position of RFU10 field.                                             */
  #define NFCT_SELRES_RFU10_Msk (0x3UL << NFCT_SELRES_RFU10_Pos) /*!< Bit mask of RFU10 field.                                 */

/* CASCADE @Bit 2 : Cascade as defined by the b3 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical
                    Specification (controlled by hardware, shall be 0) */

  #define NFCT_SELRES_CASCADE_Pos (2UL)              /*!< Position of CASCADE field.                                           */
  #define NFCT_SELRES_CASCADE_Msk (0x1UL << NFCT_SELRES_CASCADE_Pos) /*!< Bit mask of CASCADE field.                           */

/* RFU43 @Bits 3..4 : Reserved for future use. Shall be 0. */
  #define NFCT_SELRES_RFU43_Pos (3UL)                /*!< Position of RFU43 field.                                             */
  #define NFCT_SELRES_RFU43_Msk (0x3UL << NFCT_SELRES_RFU43_Pos) /*!< Bit mask of RFU43 field.                                 */

/* PROTOCOL @Bits 5..6 : Protocol as defined by the b7:b6 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical
                         Specification */

  #define NFCT_SELRES_PROTOCOL_Pos (5UL)             /*!< Position of PROTOCOL field.                                          */
  #define NFCT_SELRES_PROTOCOL_Msk (0x3UL << NFCT_SELRES_PROTOCOL_Pos) /*!< Bit mask of PROTOCOL field.                        */

/* RFU7 @Bit 7 : Reserved for future use. Shall be 0. */
  #define NFCT_SELRES_RFU7_Pos (7UL)                 /*!< Position of RFU7 field.                                              */
  #define NFCT_SELRES_RFU7_Msk (0x1UL << NFCT_SELRES_RFU7_Pos) /*!< Bit mask of RFU7 field.                                    */


/* NFCT_DEMODCONFIG: Configuration settings for demodulation */
  #define NFCT_DEMODCONFIG_ResetValue (0x00000001UL) /*!< Reset value of DEMODCONFIG register.                                 */

/* EDGEDETRSTDELAY @Bits 0..4 : Time between the falling edge of the NFC pulse and the time when reset is applied, in number of
                                13.56 MHz clocks */

  #define NFCT_DEMODCONFIG_EDGEDETRSTDELAY_Pos (0UL) /*!< Position of EDGEDETRSTDELAY field.                                   */
  #define NFCT_DEMODCONFIG_EDGEDETRSTDELAY_Msk (0x1FUL << NFCT_DEMODCONFIG_EDGEDETRSTDELAY_Pos) /*!< Bit mask of EDGEDETRSTDELAY
                                                                            field.*/

/* SPARE @Bits 8..11 : Spare */
  #define NFCT_DEMODCONFIG_SPARE_Pos (8UL)           /*!< Position of SPARE field.                                             */
  #define NFCT_DEMODCONFIG_SPARE_Msk (0xFUL << NFCT_DEMODCONFIG_SPARE_Pos) /*!< Bit mask of SPARE field.                       */

/* DEMODEDGEDETECT @Bit 12 : Selects if an edge detector is enabled to detect the rising edge of an NFC pulse */
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Pos (12UL) /*!< Position of DEMODEDGEDETECT field.                                  */
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Msk (0x1UL << NFCT_DEMODCONFIG_DEMODEDGEDETECT_Pos) /*!< Bit mask of DEMODEDGEDETECT
                                                                            field.*/
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Min (0x0UL) /*!< Min enumerator value of DEMODEDGEDETECT field.                     */
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Max (0x1UL) /*!< Max enumerator value of DEMODEDGEDETECT field.                     */
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Disabled (0x0UL) /*!< No edge detector - the rising edge of LOCKDETECT or DEMODLEV is
                                                                 used directly*/
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Enabled (0x1UL) /*!< Edge detector enabled on the rising edge of the NFC pulse      */


/* NFCT_SYMBOLTOLLOWER: Configuration register for the tolerance of the received NFC pulse width */
  #define NFCT_SYMBOLTOLLOWER_ResetValue (0x00000002UL) /*!< Reset value of SYMBOLTOLLOWER register.                           */

/* SYMBOLTOLLOWER @Bits 0..5 : Minimum allowable received NFC pulse width, given in pulses of 13.56 MHz clock */
  #define NFCT_SYMBOLTOLLOWER_SYMBOLTOLLOWER_Pos (0UL) /*!< Position of SYMBOLTOLLOWER field.                                  */
  #define NFCT_SYMBOLTOLLOWER_SYMBOLTOLLOWER_Msk (0x3FUL << NFCT_SYMBOLTOLLOWER_SYMBOLTOLLOWER_Pos) /*!< Bit mask of
                                                                            SYMBOLTOLLOWER field.*/


/* NFCT_SYMBOLTOLUPPER: Configuration register for the tolerance of the received NFC pulse width */
  #define NFCT_SYMBOLTOLUPPER_ResetValue (0x0000003FUL) /*!< Reset value of SYMBOLTOLUPPER register.                           */

/* SYMBOLTOLUPPER @Bits 0..5 : Maximum allowable received NFC pulse width, given in pulses of 13.56 MHz clock */
  #define NFCT_SYMBOLTOLUPPER_SYMBOLTOLUPPER_Pos (0UL) /*!< Position of SYMBOLTOLUPPER field.                                  */
  #define NFCT_SYMBOLTOLUPPER_SYMBOLTOLUPPER_Msk (0x3FUL << NFCT_SYMBOLTOLUPPER_SYMBOLTOLUPPER_Pos) /*!< Bit mask of
                                                                            SYMBOLTOLUPPER field.*/


/* NFCT_CONTINUOUSSUBCARRIER: Selects continuous sub-carrier transmission */
  #define NFCT_CONTINUOUSSUBCARRIER_ResetValue (0x00000000UL) /*!< Reset value of CONTINUOUSSUBCARRIER register.               */

/* CONTINUOUSSUBCARRIER @Bit 0 : Selects continuous sub-carrier transmission */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Pos (0UL) /*!< Position of CONTINUOUSSUBCARRIER field.                */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Msk (0x1UL << NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Pos) /*!<
                                                                            Bit mask of CONTINUOUSSUBCARRIER field.*/
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Min (0x0UL) /*!< Min enumerator value of CONTINUOUSSUBCARRIER field.  */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Max (0x1UL) /*!< Max enumerator value of CONTINUOUSSUBCARRIER field.  */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Normal (0x0UL) /*!< Normal modulation                                 */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Carrier (0x1UL) /*!< Continuous sub-carrier transmission              */


/* NFCT_CLOCKRECCONFIG: Configuration bits for NFCT_CLOCKREC_GF22N */
  #define NFCT_CLOCKRECCONFIG_ResetValue (0x00000121UL) /*!< Reset value of CLOCKRECCONFIG register.                           */

/* ENABLERXTHRESHOLD @Bit 0 : Enables RX threshold of the sine-to-square converter. 1b_0 enables TX threshold. */
  #define NFCT_CLOCKRECCONFIG_ENABLERXTHRESHOLD_Pos (0UL) /*!< Position of ENABLERXTHRESHOLD field.                            */
  #define NFCT_CLOCKRECCONFIG_ENABLERXTHRESHOLD_Msk (0x1UL << NFCT_CLOCKRECCONFIG_ENABLERXTHRESHOLD_Pos) /*!< Bit mask of
                                                                            ENABLERXTHRESHOLD field.*/

/* RXTHRESHOLD @Bits 4..5 : Select RX threshold voltage */
  #define NFCT_CLOCKRECCONFIG_RXTHRESHOLD_Pos (4UL)  /*!< Position of RXTHRESHOLD field.                                       */
  #define NFCT_CLOCKRECCONFIG_RXTHRESHOLD_Msk (0x3UL << NFCT_CLOCKRECCONFIG_RXTHRESHOLD_Pos) /*!< Bit mask of RXTHRESHOLD
                                                                            field.*/

/* ENABLEOUTPUT @Bit 8 : Enables the NFCT_REF_13M56_AO_0V8 output */
  #define NFCT_CLOCKRECCONFIG_ENABLEOUTPUT_Pos (8UL) /*!< Position of ENABLEOUTPUT field.                                      */
  #define NFCT_CLOCKRECCONFIG_ENABLEOUTPUT_Msk (0x1UL << NFCT_CLOCKRECCONFIG_ENABLEOUTPUT_Pos) /*!< Bit mask of ENABLEOUTPUT
                                                                            field.*/

