adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SPARE @Bit 9 : Spare */
  #define NFCT_CLOCKRECCONFIG_SPARE_Pos (9UL)        /*!< Position of SPARE field.                                             */
  #define NFCT_CLOCKRECCONFIG_SPARE_Msk (0x1UL << NFCT_CLOCKRECCONFIG_SPARE_Pos) /*!< Bit mask of SPARE field.                 */


/* NFCT_OVERRIDEENABLE: Enables override functionality. */
  #define NFCT_OVERRIDEENABLE_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDEENABLE register.                           */

/* OVRENPWRUP @Bit 0 : Override enable for OVERRIDE_PWRUP */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUP_Pos (0UL)   /*!< Position of OVRENPWRUP field.                                        */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUP_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPWRUP_Pos) /*!< Bit mask of OVRENPWRUP field.  */

/* OVRENMODULATION @Bit 1 : Override enable for modulation on/off */
  #define NFCT_OVERRIDEENABLE_OVRENMODULATION_Pos (1UL) /*!< Position of OVRENMODULATION field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENMODULATION_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENMODULATION_Pos) /*!< Bit mask of
                                                                            OVRENMODULATION field.*/

/* OVRENCMFBPDREF @Bit 2 : Spare */
  #define NFCT_OVERRIDEENABLE_OVRENCMFBPDREF_Pos (2UL) /*!< Position of OVRENCMFBPDREF field.                                  */
  #define NFCT_OVERRIDEENABLE_OVRENCMFBPDREF_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENCMFBPDREF_Pos) /*!< Bit mask of
                                                                            OVRENCMFBPDREF field.*/

/* OVRENROSCCALCODE @Bit 3 : Override enable for ROSCCALCODE */
  #define NFCT_OVERRIDEENABLE_OVRENROSCCALCODE_Pos (3UL) /*!< Position of OVRENROSCCALCODE field.                              */
  #define NFCT_OVERRIDEENABLE_OVRENROSCCALCODE_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENROSCCALCODE_Pos) /*!< Bit mask of
                                                                            OVRENROSCCALCODE field.*/

/* OVRENROSCCALEN @Bit 4 : Override enable for ROSCCALEN */
  #define NFCT_OVERRIDEENABLE_OVRENROSCCALEN_Pos (4UL) /*!< Position of OVRENROSCCALEN field.                                  */
  #define NFCT_OVERRIDEENABLE_OVRENROSCCALEN_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENROSCCALEN_Pos) /*!< Bit mask of
                                                                            OVRENROSCCALEN field.*/

/* OVRENCLAMPEN1V6 @Bit 5 : Override enable for the 1V6 clamp */
  #define NFCT_OVERRIDEENABLE_OVRENCLAMPEN1V6_Pos (5UL) /*!< Position of OVRENCLAMPEN1V6 field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENCLAMPEN1V6_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENCLAMPEN1V6_Pos) /*!< Bit mask of
                                                                            OVRENCLAMPEN1V6 field.*/

/* OVRENCLAMPEN2V6 @Bit 6 : Override enable for the 2V6 clamp */
  #define NFCT_OVERRIDEENABLE_OVRENCLAMPEN2V6_Pos (6UL) /*!< Position of OVRENCLAMPEN2V6 field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENCLAMPEN2V6_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENCLAMPEN2V6_Pos) /*!< Bit mask of
                                                                            OVRENCLAMPEN2V6 field.*/

/* OVRENPWRUPRES @Bit 7 : Override enable for pwrUpRes */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUPRES_Pos (7UL) /*!< Position of OVRENPWRUPRES field.                                    */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUPRES_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPWRUPRES_Pos) /*!< Bit mask of OVRENPWRUPRES
                                                                            field.*/

/* OVRENRSTPEAKLEV @Bit 8 : Override enable for nfcRstPeakLev */
  #define NFCT_OVERRIDEENABLE_OVRENRSTPEAKLEV_Pos (8UL) /*!< Position of OVRENRSTPEAKLEV field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENRSTPEAKLEV_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENRSTPEAKLEV_Pos) /*!< Bit mask of
                                                                            OVRENRSTPEAKLEV field.*/

/* OVRENRSTEDCLOCK @Bit 9 : Override enable for nfcRstEdgeDetectClockRec */
  #define NFCT_OVERRIDEENABLE_OVRENRSTEDCLOCK_Pos (9UL) /*!< Position of OVRENRSTEDCLOCK field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENRSTEDCLOCK_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENRSTEDCLOCK_Pos) /*!< Bit mask of
                                                                            OVRENRSTEDCLOCK field.*/

/* OVRENFIELDDET @Bit 10 : Override enable for pwrupNfcFieldDetect */
  #define NFCT_OVERRIDEENABLE_OVRENFIELDDET_Pos (10UL) /*!< Position of OVRENFIELDDET field.                                   */
  #define NFCT_OVERRIDEENABLE_OVRENFIELDDET_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENFIELDDET_Pos) /*!< Bit mask of OVRENFIELDDET
                                                                            field.*/

/* SPARE @Bit 11 : Spare */
  #define NFCT_OVERRIDEENABLE_SPARE_Pos (11UL)       /*!< Position of SPARE field.                                             */
  #define NFCT_OVERRIDEENABLE_SPARE_Msk (0x1UL << NFCT_OVERRIDEENABLE_SPARE_Pos) /*!< Bit mask of SPARE field.                 */

/* OVRENPWRUPNFCLDO @Bit 12 : Override enable for pwrupNfcLdo */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUPNFCLDO_Pos (12UL) /*!< Position of OVRENPWRUPNFCLDO field.                             */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUPNFCLDO_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPWRUPNFCLDO_Pos) /*!< Bit mask of
                                                                            OVRENPWRUPNFCLDO field.*/

/* OVRENRETAIN @Bit 13 : Override enable for retainAna */
  #define NFCT_OVERRIDEENABLE_OVRENRETAIN_Pos (13UL) /*!< Position of OVRENRETAIN field.                                       */
  #define NFCT_OVERRIDEENABLE_OVRENRETAIN_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENRETAIN_Pos) /*!< Bit mask of OVRENRETAIN
                                                                            field.*/

