adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OVRENPADNFCCFG @Bit 14 : Override enable for padNfcCfg */
  #define NFCT_OVERRIDEENABLE_OVRENPADNFCCFG_Pos (14UL) /*!< Position of OVRENPADNFCCFG field.                                 */
  #define NFCT_OVERRIDEENABLE_OVRENPADNFCCFG_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPADNFCCFG_Pos) /*!< Bit mask of
                                                                            OVRENPADNFCCFG field.*/


/* NFCT_OVRVALPWRUPNFC: Override value for pwrupNfc */
  #define NFCT_OVRVALPWRUPNFC_ResetValue (0x00000000UL) /*!< Reset value of OVRVALPWRUPNFC register.                           */

/* OVRVALPWRUPNFC @Bit 0 : Override value for pwrupNfc */
  #define NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Pos (0UL) /*!< Position of OVRVALPWRUPNFC field.                                  */
  #define NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Msk (0x1UL << NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Pos) /*!< Bit mask of
                                                                            OVRVALPWRUPNFC field.*/


/* NFCT_OVRVALMODULATION: Override value for modulation on/off */
  #define NFCT_OVRVALMODULATION_ResetValue (0x00000000UL) /*!< Reset value of OVRVALMODULATION register.                       */

/* OVRVALMODULATION @Bit 0 : Override value for modulation on/off */
  #define NFCT_OVRVALMODULATION_OVRVALMODULATION_Pos (0UL) /*!< Position of OVRVALMODULATION field.                            */
  #define NFCT_OVRVALMODULATION_OVRVALMODULATION_Msk (0x1UL << NFCT_OVRVALMODULATION_OVRVALMODULATION_Pos) /*!< Bit mask of
                                                                            OVRVALMODULATION field.*/


/* NFCT_OVRVALROSCCALCODE: Override value for the calibration word for the oscillator */
  #define NFCT_OVRVALROSCCALCODE_ResetValue (0x00000000UL) /*!< Reset value of OVRVALROSCCALCODE register.                     */

/* OVRVALROSCCALCODE @Bits 0..5 : Override value for the calibration word for the oscillator */
  #define NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Pos (0UL) /*!< Position of OVRVALROSCCALCODE field.                         */
  #define NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Msk (0x3FUL << NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Pos) /*!< Bit mask of
                                                                            OVRVALROSCCALCODE field.*/


/* NFCT_OVRVALCLAMPEN1V6: Override value for the 1V6 clamp */
  #define NFCT_OVRVALCLAMPEN1V6_ResetValue (0x00000000UL) /*!< Reset value of OVRVALCLAMPEN1V6 register.                       */

/* OVRVALCLAMPEN1V6 @Bit 0 : Override value for the 1V6 clamp */
  #define NFCT_OVRVALCLAMPEN1V6_OVRVALCLAMPEN1V6_Pos (0UL) /*!< Position of OVRVALCLAMPEN1V6 field.                            */
  #define NFCT_OVRVALCLAMPEN1V6_OVRVALCLAMPEN1V6_Msk (0x1UL << NFCT_OVRVALCLAMPEN1V6_OVRVALCLAMPEN1V6_Pos) /*!< Bit mask of
                                                                            OVRVALCLAMPEN1V6 field.*/


/* NFCT_OVRVALCLAMPEN2V6: Override value for the 2V6 clamp */
  #define NFCT_OVRVALCLAMPEN2V6_ResetValue (0x00000000UL) /*!< Reset value of OVRVALCLAMPEN2V6 register.                       */

/* OVRVALCLAMPEN2V6 @Bit 0 : Override value for the 2V6 clamp */
  #define NFCT_OVRVALCLAMPEN2V6_OVRVALCLAMPEN2V6_Pos (0UL) /*!< Position of OVRVALCLAMPEN2V6 field.                            */
  #define NFCT_OVRVALCLAMPEN2V6_OVRVALCLAMPEN2V6_Msk (0x1UL << NFCT_OVRVALCLAMPEN2V6_OVRVALCLAMPEN2V6_Pos) /*!< Bit mask of
                                                                            OVRVALCLAMPEN2V6 field.*/


/* NFCT_CALENNFC: Value for the signal CALEN going to the oscillator */
  #define NFCT_CALENNFC_ResetValue (0x00000000UL)    /*!< Reset value of CALENNFC register.                                    */

/* CALENNFC @Bit 0 : Value for the calibration word for the oscillator */
  #define NFCT_CALENNFC_CALENNFC_Pos (0UL)           /*!< Position of CALENNFC field.                                          */
  #define NFCT_CALENNFC_CALENNFC_Msk (0x1UL << NFCT_CALENNFC_CALENNFC_Pos) /*!< Bit mask of CALENNFC field.                    */


/* NFCT_AUTOCAL: Controls auto-calibration at NFCT module enabling */
  #define NFCT_AUTOCAL_ResetValue (0x00000001UL)     /*!< Reset value of AUTOCAL register.                                     */

/* ROSCEN @Bit 0 : Controls auto-calibration at NFCT module enabling */
  #define NFCT_AUTOCAL_ROSCEN_Pos (0UL)              /*!< Position of ROSCEN field.                                            */
  #define NFCT_AUTOCAL_ROSCEN_Msk (0x1UL << NFCT_AUTOCAL_ROSCEN_Pos) /*!< Bit mask of ROSCEN field.                            */
  #define NFCT_AUTOCAL_ROSCEN_Min (0x0UL)            /*!< Min enumerator value of ROSCEN field.                                */
  #define NFCT_AUTOCAL_ROSCEN_Max (0x1UL)            /*!< Max enumerator value of ROSCEN field.                                */
  #define NFCT_AUTOCAL_ROSCEN_Disabled (0x0UL)       /*!< No auto-calibration at module enablin                                */
  #define NFCT_AUTOCAL_ROSCEN_Enabled (0x1UL)        /*!< Enable auto-calibration at module enabling                           */


/* NFCT_SHUNTREGCONFIG: Configuration for NFCT_SHUNTREG_GF22N */
  #define NFCT_SHUNTREGCONFIG_ResetValue (0x00031145UL) /*!< Reset value of SHUNTREGCONFIG register.                           */

/* LOWTHRESHOLD @Bits 0..2 : Tune low threshold voltage of peak detector */
  #define NFCT_SHUNTREGCONFIG_LOWTHRESHOLD_Pos (0UL) /*!< Position of LOWTHRESHOLD field.                                      */
  #define NFCT_SHUNTREGCONFIG_LOWTHRESHOLD_Msk (0x7UL << NFCT_SHUNTREGCONFIG_LOWTHRESHOLD_Pos) /*!< Bit mask of LOWTHRESHOLD
                                                                            field.*/

/* HIGHTHRESHOLD @Bits 4..6 : Tune high threshold voltage of peak detector */
  #define NFCT_SHUNTREGCONFIG_HIGHTHRESHOLD_Pos (4UL) /*!< Position of HIGHTHRESHOLD field.                                    */
  #define NFCT_SHUNTREGCONFIG_HIGHTHRESHOLD_Msk (0x7UL << NFCT_SHUNTREGCONFIG_HIGHTHRESHOLD_Pos) /*!< Bit mask of HIGHTHRESHOLD
                                                                            field.*/

