adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TUNECOMMONMODE @Bits 8..9 : Tune common-mode voltage of peak detectors */
  #define NFCT_SHUNTREGCONFIG_TUNECOMMONMODE_Pos (8UL) /*!< Position of TUNECOMMONMODE field.                                  */
  #define NFCT_SHUNTREGCONFIG_TUNECOMMONMODE_Msk (0x3UL << NFCT_SHUNTREGCONFIG_TUNECOMMONMODE_Pos) /*!< Bit mask of
                                                                            TUNECOMMONMODE field.*/

/* ENABLECOMMONMODE @Bit 12 : Enable/disable common-mode voltage circuit */
  #define NFCT_SHUNTREGCONFIG_ENABLECOMMONMODE_Pos (12UL) /*!< Position of ENABLECOMMONMODE field.                             */
  #define NFCT_SHUNTREGCONFIG_ENABLECOMMONMODE_Msk (0x1UL << NFCT_SHUNTREGCONFIG_ENABLECOMMONMODE_Pos) /*!< Bit mask of
                                                                            ENABLECOMMONMODE field.*/

/* DIVIDER @Bits 16..18 : Adjust capacitive divider ratio */
  #define NFCT_SHUNTREGCONFIG_DIVIDER_Pos (16UL)     /*!< Position of DIVIDER field.                                           */
  #define NFCT_SHUNTREGCONFIG_DIVIDER_Msk (0x7UL << NFCT_SHUNTREGCONFIG_DIVIDER_Pos) /*!< Bit mask of DIVIDER field.           */

/* BYPASS @Bit 20 : Bypass parts of RC filter for NFC envelope */
  #define NFCT_SHUNTREGCONFIG_BYPASS_Pos (20UL)      /*!< Position of BYPASS field.                                            */
  #define NFCT_SHUNTREGCONFIG_BYPASS_Msk (0x1UL << NFCT_SHUNTREGCONFIG_BYPASS_Pos) /*!< Bit mask of BYPASS field.              */
  #define NFCT_SHUNTREGCONFIG_BYPASS_Min (0x0UL)     /*!< Min enumerator value of BYPASS field.                                */
  #define NFCT_SHUNTREGCONFIG_BYPASS_Max (0x1UL)     /*!< Max enumerator value of BYPASS field.                                */
  #define NFCT_SHUNTREGCONFIG_BYPASS_Nobypass (0x0UL) /*!< No bypass                                                           */
  #define NFCT_SHUNTREGCONFIG_BYPASS_Bypass (0x1UL)  /*!< Bypass                                                               */


/* NFCT_LOADMODCONFIG: Configuration for load modulation */
  #define NFCT_LOADMODCONFIG_ResetValue (0x00001F00UL) /*!< Reset value of LOADMODCONFIG register.                             */

/* LOADMODCONFIGOFF @Bits 0..6 : Load modulation value when modulation is off. The value has to be 0. Changing it would give
                                 undesired results. */

  #define NFCT_LOADMODCONFIG_LOADMODCONFIGOFF_Pos (0UL) /*!< Position of LOADMODCONFIGOFF field.                               */
  #define NFCT_LOADMODCONFIG_LOADMODCONFIGOFF_Msk (0x7FUL << NFCT_LOADMODCONFIG_LOADMODCONFIGOFF_Pos) /*!< Bit mask of
                                                                            LOADMODCONFIGOFF field.*/

/* LOADMODCONFIGON @Bits 8..14 : Load modulation value when modulation is on */
  #define NFCT_LOADMODCONFIG_LOADMODCONFIGON_Pos (8UL) /*!< Position of LOADMODCONFIGON field.                                 */
  #define NFCT_LOADMODCONFIG_LOADMODCONFIGON_Msk (0x7FUL << NFCT_LOADMODCONFIG_LOADMODCONFIGON_Pos) /*!< Bit mask of
                                                                            LOADMODCONFIGON field.*/


/* NFCT_OVRVALCMFBPDREF: Override value for cmfbPdRef */
  #define NFCT_OVRVALCMFBPDREF_ResetValue (0x00000000UL) /*!< Reset value of OVRVALCMFBPDREF register.                         */

/* OVRVALCMFBPDREF @Bits 0..1 : Override value for cmfbPdRef */
  #define NFCT_OVRVALCMFBPDREF_OVRVALCMFBPDREF_Pos (0UL) /*!< Position of OVRVALCMFBPDREF field.                               */
  #define NFCT_OVRVALCMFBPDREF_OVRVALCMFBPDREF_Msk (0x3UL << NFCT_OVRVALCMFBPDREF_OVRVALCMFBPDREF_Pos) /*!< Bit mask of
                                                                            OVRVALCMFBPDREF field.*/


/* NFCT_LOCKDETECTWINDOW: Adjust window size on falling edge of lock detect filter used for demodulation */
  #define NFCT_LOCKDETECTWINDOW_ResetValue (0x00000004UL) /*!< Reset value of LOCKDETECTWINDOW register.                       */

/* LOCKDETECTWINDOW @Bits 0..2 : Adjust window size on falling edge of lock detect filter used for demodulation */
  #define NFCT_LOCKDETECTWINDOW_LOCKDETECTWINDOW_Pos (0UL) /*!< Position of LOCKDETECTWINDOW field.                            */
  #define NFCT_LOCKDETECTWINDOW_LOCKDETECTWINDOW_Msk (0x7UL << NFCT_LOCKDETECTWINDOW_LOCKDETECTWINDOW_Pos) /*!< Bit mask of
                                                                            LOCKDETECTWINDOW field.*/


/* NFCT_PNFCCFGRET: Configuration of constant bits in P_NFCCFG_RET_0V8 */
  #define NFCT_PNFCCFGRET_ResetValue (0x00000031UL)  /*!< Reset value of PNFCCFGRET register.                                  */

/* INTVALCOMMON @Bits 0..1 : Initial value of common-mode voltage level at pad */
  #define NFCT_PNFCCFGRET_INTVALCOMMON_Pos (0UL)     /*!< Position of INTVALCOMMON field.                                      */
  #define NFCT_PNFCCFGRET_INTVALCOMMON_Msk (0x3UL << NFCT_PNFCCFGRET_INTVALCOMMON_Pos) /*!< Bit mask of INTVALCOMMON field.    */

/* ENABLECOMMONREGULATION @Bit 4 : Enable/disable common-regulation at pad */
  #define NFCT_PNFCCFGRET_ENABLECOMMONREGULATION_Pos (4UL) /*!< Position of ENABLECOMMONREGULATION field.                      */
  #define NFCT_PNFCCFGRET_ENABLECOMMONREGULATION_Msk (0x1UL << NFCT_PNFCCFGRET_ENABLECOMMONREGULATION_Pos) /*!< Bit mask of
                                                                            ENABLECOMMONREGULATION field.*/

/* ENABLEBULKBIASSHUNT @Bit 5 : Enable/disable bulk bias of shunt transistors (flipped-well devices) during load modulation */
  #define NFCT_PNFCCFGRET_ENABLEBULKBIASSHUNT_Pos (5UL) /*!< Position of ENABLEBULKBIASSHUNT field.                            */
  #define NFCT_PNFCCFGRET_ENABLEBULKBIASSHUNT_Msk (0x1UL << NFCT_PNFCCFGRET_ENABLEBULKBIASSHUNT_Pos) /*!< Bit mask of
                                                                            ENABLEBULKBIASSHUNT field.*/


/* NFCT_SHUNTALGCONFIG: Configuration settings for Shunt regulator algorithm */
  #define NFCT_SHUNTALGCONFIG_ResetValue (0x00004482UL) /*!< Reset value of SHUNTALGCONFIG register.                           */

/* RSTPULSEWIDTH @Bits 0..3 : Pulse width of peak reset signal */
  #define NFCT_SHUNTALGCONFIG_RSTPULSEWIDTH_Pos (0UL) /*!< Position of RSTPULSEWIDTH field.                                    */
  #define NFCT_SHUNTALGCONFIG_RSTPULSEWIDTH_Msk (0xFUL << NFCT_SHUNTALGCONFIG_RSTPULSEWIDTH_Pos) /*!< Bit mask of RSTPULSEWIDTH
                                                                            field.*/

/* RSTPPEAKPERIOD @Bits 4..7 : Period of peak reset signal */
  #define NFCT_SHUNTALGCONFIG_RSTPPEAKPERIOD_Pos (4UL) /*!< Position of RSTPPEAKPERIOD field.                                  */
  #define NFCT_SHUNTALGCONFIG_RSTPPEAKPERIOD_Msk (0xFUL << NFCT_SHUNTALGCONFIG_RSTPPEAKPERIOD_Pos) /*!< Bit mask of
                                                                            RSTPPEAKPERIOD field.*/

/* MULTTRIMSTARTVALUE @Bits 8..11 : Start value for MULT_TRIM */
  #define NFCT_SHUNTALGCONFIG_MULTTRIMSTARTVALUE_Pos (8UL) /*!< Position of MULTTRIMSTARTVALUE field.                          */
  #define NFCT_SHUNTALGCONFIG_MULTTRIMSTARTVALUE_Msk (0xFUL << NFCT_SHUNTALGCONFIG_MULTTRIMSTARTVALUE_Pos) /*!< Bit mask of
                                                                            MULTTRIMSTARTVALUE field.*/

