adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* MULTTRIMLOVWERBOUND @Bits 12..15 : Lower bound on MULT_TRIM */
  #define NFCT_SHUNTALGCONFIG_MULTTRIMLOVWERBOUND_Pos (12UL) /*!< Position of MULTTRIMLOVWERBOUND field.                       */
  #define NFCT_SHUNTALGCONFIG_MULTTRIMLOVWERBOUND_Msk (0xFUL << NFCT_SHUNTALGCONFIG_MULTTRIMLOVWERBOUND_Pos) /*!< Bit mask of
                                                                            MULTTRIMLOVWERBOUND field.*/

/* DISABLESHUNT @Bit 16 : Control shunt regulation during load modulation */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Pos (16UL) /*!< Position of DISABLESHUNT field.                                     */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Msk (0x1UL << NFCT_SHUNTALGCONFIG_DISABLESHUNT_Pos) /*!< Bit mask of DISABLESHUNT
                                                                            field.*/
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Min (0x0UL) /*!< Min enumerator value of DISABLESHUNT field.                        */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Max (0x1UL) /*!< Max enumerator value of DISABLESHUNT field.                        */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Disabled (0x0UL) /*!< Shunt regulation is disabled during load modulation           */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Enabled (0x1UL) /*!< Shunt regulation is enabled during load modulation             */


/* NFCT_OVRVALPWRUPNFCTFIELDDET: Power up field detect part of circuit and 5 nA IBPP current reference */
  #define NFCT_OVRVALPWRUPNFCTFIELDDET_ResetValue (0x00000000UL) /*!< Reset value of OVRVALPWRUPNFCTFIELDDET register.         */

/* OVRVALPWRUPNFCTFIELDDET @Bit 0 : Power up field detect part of circuit and 5 nA IBPP current reference */
  #define NFCT_OVRVALPWRUPNFCTFIELDDET_OVRVALPWRUPNFCTFIELDDET_Pos (0UL) /*!< Position of OVRVALPWRUPNFCTFIELDDET field.       */
  #define NFCT_OVRVALPWRUPNFCTFIELDDET_OVRVALPWRUPNFCTFIELDDET_Msk (0x1UL << NFCT_OVRVALPWRUPNFCTFIELDDET_OVRVALPWRUPNFCTFIELDDET_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPNFCTFIELDDET field.*/


/* NFCT_OVRVALNFCTRSTEDCLK: Resets edge detect signal in NFCT_CLOCKREC_GF22N */
  #define NFCT_OVRVALNFCTRSTEDCLK_ResetValue (0x00000000UL) /*!< Reset value of OVRVALNFCTRSTEDCLK register.                   */

/* OVRVALNFCTRSTEDCLK @Bit 0 : Resets edge detect signal in NFCT_CLOCKREC_GF22N */
  #define NFCT_OVRVALNFCTRSTEDCLK_OVRVALNFCTRSTEDCLK_Pos (0UL) /*!< Position of OVRVALNFCTRSTEDCLK field.                      */
  #define NFCT_OVRVALNFCTRSTEDCLK_OVRVALNFCTRSTEDCLK_Msk (0x1UL << NFCT_OVRVALNFCTRSTEDCLK_OVRVALNFCTRSTEDCLK_Pos) /*!< Bit mask
                                                                            of OVRVALNFCTRSTEDCLK field.*/


/* NFCT_OVRVALNFCTRSTPEAKLEV: Resets peak detectors in NFCT_SHUNTREG_GF22N */
  #define NFCT_OVRVALNFCTRSTPEAKLEV_ResetValue (0x00000000UL) /*!< Reset value of OVRVALNFCTRSTPEAKLEV register.               */

/* OVRVALNFCTRSTPEAKLEV @Bit 0 : Resets peak detectors in NFCT_SHUNTREG_GF22N */
  #define NFCT_OVRVALNFCTRSTPEAKLEV_OVRVALNFCTRSTPEAKLEV_Pos (0UL) /*!< Position of OVRVALNFCTRSTPEAKLEV field.                */
  #define NFCT_OVRVALNFCTRSTPEAKLEV_OVRVALNFCTRSTPEAKLEV_Msk (0x1UL << NFCT_OVRVALNFCTRSTPEAKLEV_OVRVALNFCTRSTPEAKLEV_Pos) /*!<
                                                                            Bit mask of OVRVALNFCTRSTPEAKLEV field.*/


/* NFCT_OVRVALNFCTCALEN: Enable calibration of ring oscillator in NFCT_CLOCKREC_GF22N */
  #define NFCT_OVRVALNFCTCALEN_ResetValue (0x00000000UL) /*!< Reset value of OVRVALNFCTCALEN register.                         */

/* OVRVALNFCTCALEN @Bit 0 : Enable calibration of ring oscillator in NFCT_CLOCKREC_GF22N */
  #define NFCT_OVRVALNFCTCALEN_OVRVALNFCTCALEN_Pos (0UL) /*!< Position of OVRVALNFCTCALEN field.                               */
  #define NFCT_OVRVALNFCTCALEN_OVRVALNFCTCALEN_Msk (0x1UL << NFCT_OVRVALNFCTCALEN_OVRVALNFCTCALEN_Pos) /*!< Bit mask of
                                                                            OVRVALNFCTCALEN field.*/


/* NFCT_NFCTFIELDDETCFG: NFCT_FIELDDET_GF22N configuration bits */
  #define NFCT_NFCTFIELDDETCFG_ResetValue (0x00000001UL) /*!< Reset value of NFCTFIELDDETCFG register.                         */

/* THRESHOLDVOLTAGE @Bits 0..1 : Trimming of field detector threshold voltage */
  #define NFCT_NFCTFIELDDETCFG_THRESHOLDVOLTAGE_Pos (0UL) /*!< Position of THRESHOLDVOLTAGE field.                             */
  #define NFCT_NFCTFIELDDETCFG_THRESHOLDVOLTAGE_Msk (0x3UL << NFCT_NFCTFIELDDETCFG_THRESHOLDVOLTAGE_Pos) /*!< Bit mask of
                                                                            THRESHOLDVOLTAGE field.*/

/* HYSTERESISLEVEL @Bit 4 : Change hysteresis level of internal comparator */
  #define NFCT_NFCTFIELDDETCFG_HYSTERESISLEVEL_Pos (4UL) /*!< Position of HYSTERESISLEVEL field.                               */
  #define NFCT_NFCTFIELDDETCFG_HYSTERESISLEVEL_Msk (0x1UL << NFCT_NFCTFIELDDETCFG_HYSTERESISLEVEL_Pos) /*!< Bit mask of
                                                                            HYSTERESISLEVEL field.*/

/* TRIMIBPP @Bits 8..9 : Trim 5 nA IBPP current (from NFCT_BIAS_GF22N) */
  #define NFCT_NFCTFIELDDETCFG_TRIMIBPP_Pos (8UL)    /*!< Position of TRIMIBPP field.                                          */
  #define NFCT_NFCTFIELDDETCFG_TRIMIBPP_Msk (0x3UL << NFCT_NFCTFIELDDETCFG_TRIMIBPP_Pos) /*!< Bit mask of TRIMIBPP field.      */


/* NFCT_NFCTCTRL: Spare digital control signals */
  #define NFCT_NFCTCTRL_ResetValue (0x00000000UL)    /*!< Reset value of NFCTCTRL register.                                    */

/* DIGITALCONTROL @Bits 0..1 : Spare digital control signals */
  #define NFCT_NFCTCTRL_DIGITALCONTROL_Pos (0UL)     /*!< Position of DIGITALCONTROL field.                                    */
  #define NFCT_NFCTCTRL_DIGITALCONTROL_Msk (0x3UL << NFCT_NFCTCTRL_DIGITALCONTROL_Pos) /*!< Bit mask of DIGITALCONTROL field.  */


/* NFCT_PWRUPNFCTLDO: Power-up for LDO */
  #define NFCT_PWRUPNFCTLDO_ResetValue (0x00000000UL) /*!< Reset value of PWRUPNFCTLDO register.                               */

/* POWERBLEEDCURRENT @Bit 0 : Power-up with bleed current */
  #define NFCT_PWRUPNFCTLDO_POWERBLEEDCURRENT_Pos (0UL) /*!< Position of POWERBLEEDCURRENT field.                              */
  #define NFCT_PWRUPNFCTLDO_POWERBLEEDCURRENT_Msk (0x1UL << NFCT_PWRUPNFCTLDO_POWERBLEEDCURRENT_Pos) /*!< Bit mask of
                                                                            POWERBLEEDCURRENT field.*/

/* POWERNOBLEEDCURRENT @Bit 1 : Power-up without bleed current */
  #define NFCT_PWRUPNFCTLDO_POWERNOBLEEDCURRENT_Pos (1UL) /*!< Position of POWERNOBLEEDCURRENT field.                          */
  #define NFCT_PWRUPNFCTLDO_POWERNOBLEEDCURRENT_Msk (0x1UL << NFCT_PWRUPNFCTLDO_POWERNOBLEEDCURRENT_Pos) /*!< Bit mask of
                                                                            POWERNOBLEEDCURRENT field.*/


/* NFCT_PADCONFIG: NFC pad configuration */
  #define NFCT_PADCONFIG_ResetValue (0x00000001UL)   /*!< Reset value of PADCONFIG register.                                   */

/* ENABLE @Bit 0 : Enable NFC pads */
  #define NFCT_PADCONFIG_ENABLE_Pos (0UL)            /*!< Position of ENABLE field.                                            */
  #define NFCT_PADCONFIG_ENABLE_Msk (0x1UL << NFCT_PADCONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.                        */
  #define NFCT_PADCONFIG_ENABLE_Min (0x0UL)          /*!< Min enumerator value of ENABLE field.                                */
  #define NFCT_PADCONFIG_ENABLE_Max (0x1UL)          /*!< Max enumerator value of ENABLE field.                                */
  #define NFCT_PADCONFIG_ENABLE_Disabled (0x0UL)     /*!< NFC pads are used as GPIO pins                                       */
  #define NFCT_PADCONFIG_ENABLE_Enabled (0x1UL)      /*!< The NFC pads are configured as NFC antenna pins                      */


