adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* NFCT_NFCTCALCMP: Output from the calibration comparator */
  #define NFCT_NFCTCALCMP_ResetValue (0x00000000UL)  /*!< Reset value of NFCTCALCMP register.                                  */

/* NFCTCALCMP @Bit 0 : (unspecified) */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_Pos (0UL)       /*!< Position of NFCTCALCMP field.                                        */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_Msk (0x1UL << NFCT_NFCTCALCMP_NFCTCALCMP_Pos) /*!< Bit mask of NFCTCALCMP field.          */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_Min (0x0UL)     /*!< Min enumerator value of NFCTCALCMP field.                            */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_Max (0x1UL)     /*!< Max enumerator value of NFCTCALCMP field.                            */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_NFCCaLCmpLow (0x0UL) /*!< Trim code low                                                   */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_NFCCaLCmpHigh (0x1UL) /*!< Trim code high                                                 */


/* NFCT_BIASCFG: Configuration of NFCT_BIAS_GF22N */
  #define NFCT_BIASCFG_ResetValue (0x00007000UL)     /*!< Reset value of BIASCFG register.                                     */

/* TRIMIBPSR @Bits 0..4 : Fine trim IBPSR 4 uA bias current This will also trim VREF_SWAT_0V8 in steps of 10 mV */
  #define NFCT_BIASCFG_TRIMIBPSR_Pos (0UL)           /*!< Position of TRIMIBPSR field.                                         */
  #define NFCT_BIASCFG_TRIMIBPSR_Msk (0x1FUL << NFCT_BIASCFG_TRIMIBPSR_Pos) /*!< Bit mask of TRIMIBPSR field.                  */

/* COARSEIBPSR @Bits 8..9 : Coarse IBPSR 4 uA. Might be needed to cover trimming range if modelling is an issue */
  #define NFCT_BIASCFG_COARSEIBPSR_Pos (8UL)         /*!< Position of COARSEIBPSR field.                                       */
  #define NFCT_BIASCFG_COARSEIBPSR_Msk (0x3UL << NFCT_BIASCFG_COARSEIBPSR_Pos) /*!< Bit mask of COARSEIBPSR field.             */

/* REFERENCEVOLTAGE @Bits 12..14 : Reference voltage level */
  #define NFCT_BIASCFG_REFERENCEVOLTAGE_Pos (12UL)   /*!< Position of REFERENCEVOLTAGE field.                                  */
  #define NFCT_BIASCFG_REFERENCEVOLTAGE_Msk (0x7UL << NFCT_BIASCFG_REFERENCEVOLTAGE_Pos) /*!< Bit mask of REFERENCEVOLTAGE
                                                                            field.*/

/* SPARE @Bits 16..19 : Spare */
  #define NFCT_BIASCFG_SPARE_Pos (16UL)              /*!< Position of SPARE field.                                             */
  #define NFCT_BIASCFG_SPARE_Msk (0xFUL << NFCT_BIASCFG_SPARE_Pos) /*!< Bit mask of SPARE field.                               */


/* NFCT_RINGOSCCONFIG: Configuration settings for ring oscillator algorithm */
  #define NFCT_RINGOSCCONFIG_ResetValue (0x00000000UL) /*!< Reset value of RINGOSCCONFIG register.                             */

/* CALIBRATIONSOURCE @Bit 0 : Calibration source */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Pos (0UL) /*!< Position of CALIBRATIONSOURCE field.                             */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Msk (0x1UL << NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Pos) /*!< Bit mask of
                                                                            CALIBRATIONSOURCE field.*/
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Min (0x0UL) /*!< Min enumerator value of CALIBRATIONSOURCE field.               */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Max (0x1UL) /*!< Max enumerator value of CALIBRATIONSOURCE field.               */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Disabled (0x0UL) /*!< NFC carrier signal used as calibration source             */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Enabled (0x1UL) /*!< 16 MHz crystal oscillator used as calibration source       */


/* NFCT_OVRVALRETAIN: Retain - Latch and isolate all RET_0V8 inputs to NFCT_ANA_GF22N and P_NFC_GF22N */
  #define NFCT_OVRVALRETAIN_ResetValue (0x00000000UL) /*!< Reset value of OVRVALRETAIN register.                               */

/* OVRVALRETAIN @Bit 0 : Retain - Latch and isolate all RET_0V8 inputs to NFCT_ANA_GF22N and P_NFC_GF22N */
  #define NFCT_OVRVALRETAIN_OVRVALRETAIN_Pos (0UL)   /*!< Position of OVRVALRETAIN field.                                      */
  #define NFCT_OVRVALRETAIN_OVRVALRETAIN_Msk (0x1UL << NFCT_OVRVALRETAIN_OVRVALRETAIN_Pos) /*!< Bit mask of OVRVALRETAIN field.*/


/* NFCT_CMFBENABLE: Enable calibration of cmfbPdRef */
  #define NFCT_CMFBENABLE_ResetValue (0x00000000UL)  /*!< Reset value of CMFBENABLE register.                                  */

/* CMFBENABLE @Bit 0 : Enable calibration of cmfbPdRef */
  #define NFCT_CMFBENABLE_CMFBENABLE_Pos (0UL)       /*!< Position of CMFBENABLE field.                                        */
  #define NFCT_CMFBENABLE_CMFBENABLE_Msk (0x1UL << NFCT_CMFBENABLE_CMFBENABLE_Pos) /*!< Bit mask of CMFBENABLE field.          */


/* NFCT_OVRVALPADNFCCFG: Override of P_NFCCFG_RET_0V8 to P_NFC_GF22N */
  #define NFCT_OVRVALPADNFCCFG_ResetValue (0x00000000UL) /*!< Reset value of OVRVALPADNFCCFG register.                         */

/* COMMONREGEN @Bit 0 : Enable/disable common-regulation at pad */
  #define NFCT_OVRVALPADNFCCFG_COMMONREGEN_Pos (0UL) /*!< Position of COMMONREGEN field.                                       */
  #define NFCT_OVRVALPADNFCCFG_COMMONREGEN_Msk (0x1UL << NFCT_OVRVALPADNFCCFG_COMMONREGEN_Pos) /*!< Bit mask of COMMONREGEN
                                                                            field.*/

/* COMMONMODEVOLT @Bits 1..3 : Set common-mode voltage level at pad */
  #define NFCT_OVRVALPADNFCCFG_COMMONMODEVOLT_Pos (1UL) /*!< Position of COMMONMODEVOLT field.                                 */
  #define NFCT_OVRVALPADNFCCFG_COMMONMODEVOLT_Msk (0x7UL << NFCT_OVRVALPADNFCCFG_COMMONMODEVOLT_Pos) /*!< Bit mask of
                                                                            COMMONMODEVOLT field.*/

/* SHUNTREGSHUNT @Bits 4..10 : Multiplier of shunt transistor between NFC1 and NFC2 during shunt regulation */
  #define NFCT_OVRVALPADNFCCFG_SHUNTREGSHUNT_Pos (4UL) /*!< Position of SHUNTREGSHUNT field.                                   */
  #define NFCT_OVRVALPADNFCCFG_SHUNTREGSHUNT_Msk (0x7FUL << NFCT_OVRVALPADNFCCFG_SHUNTREGSHUNT_Pos) /*!< Bit mask of
                                                                            SHUNTREGSHUNT field.*/

