adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SHUNTTRANSISTORS @Bits 11..15 : Gate voltage of shunt transistors */
  #define NFCT_OVRVALPADNFCCFG_SHUNTTRANSISTORS_Pos (11UL) /*!< Position of SHUNTTRANSISTORS field.                            */
  #define NFCT_OVRVALPADNFCCFG_SHUNTTRANSISTORS_Msk (0x1FUL << NFCT_OVRVALPADNFCCFG_SHUNTTRANSISTORS_Pos) /*!< Bit mask of
                                                                            SHUNTTRANSISTORS field.*/

/* SHUNTREGLOAD @Bits 16..22 : Multiplier of shunt transistor between NFC1 and NFC2 during load modulation */
  #define NFCT_OVRVALPADNFCCFG_SHUNTREGLOAD_Pos (16UL) /*!< Position of SHUNTREGLOAD field.                                    */
  #define NFCT_OVRVALPADNFCCFG_SHUNTREGLOAD_Msk (0x7FUL << NFCT_OVRVALPADNFCCFG_SHUNTREGLOAD_Pos) /*!< Bit mask of SHUNTREGLOAD
                                                                            field.*/

/* BULKBIAS @Bit 23 : Enable/disable bulk bias of shunt transistors (flipped-well devices) during load modulation */
  #define NFCT_OVRVALPADNFCCFG_BULKBIAS_Pos (23UL)   /*!< Position of BULKBIAS field.                                          */
  #define NFCT_OVRVALPADNFCCFG_BULKBIAS_Msk (0x1UL << NFCT_OVRVALPADNFCCFG_BULKBIAS_Pos) /*!< Bit mask of BULKBIAS field.      */

/* GATEVOLTAGECLAMP @Bits 24..27 : Back gate voltage of clamp during 2.6 V clamping mode */
  #define NFCT_OVRVALPADNFCCFG_GATEVOLTAGECLAMP_Pos (24UL) /*!< Position of GATEVOLTAGECLAMP field.                            */
  #define NFCT_OVRVALPADNFCCFG_GATEVOLTAGECLAMP_Msk (0xFUL << NFCT_OVRVALPADNFCCFG_GATEVOLTAGECLAMP_Pos) /*!< Bit mask of
                                                                            GATEVOLTAGECLAMP field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           OICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct OICR_DEVICE ==================================================== */
/**
  * @brief DEVICE [OICR_DEVICE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  UUID[4];                           /*!< (@ 0x00000000) 128-bit Universally Unique IDentifier (UUID).         */
  __IOM uint32_t  TYPE;                              /*!< (@ 0x00000010) Device type.                                          */
  __IOM uint32_t  TESTIMPRINT[8];                    /*!< (@ 0x00000014) Production test imprint.                              */
  __IM  uint32_t  PARTNO;                            /*!< (@ 0x00000034) Part number.                                          */
  __IM  uint32_t  HWREVISION;                        /*!< (@ 0x00000038) Hardware revision.                                    */
  __IM  uint32_t  PRODUCTIONREVISION;                /*!< (@ 0x0000003C) Production reversion.                                 */
} NRF_OICR_DEVICE_Type;                              /*!< Size = 64 (0x040)                                                    */

/* OICR_DEVICE_UUID: 128-bit Universally Unique IDentifier (UUID). */
  #define OICR_DEVICE_UUID_MaxCount (4UL)            /*!< Max size of UUID[4] array.                                           */
  #define OICR_DEVICE_UUID_MaxIndex (3UL)            /*!< Max index of UUID[4] array.                                          */
  #define OICR_DEVICE_UUID_MinIndex (0UL)            /*!< Min index of UUID[4] array.                                          */
  #define OICR_DEVICE_UUID_ResetValue (0xFFFFFFFFUL) /*!< Reset value of UUID[4] register.                                     */

/* UUID @Bits 0..31 : Device UUID [n]. */
  #define OICR_DEVICE_UUID_UUID_Pos (0UL)            /*!< Position of UUID field.                                              */
  #define OICR_DEVICE_UUID_UUID_Msk (0xFFFFFFFFUL << OICR_DEVICE_UUID_UUID_Pos) /*!< Bit mask of UUID field.                   */


/* OICR_DEVICE_TYPE: Device type. */
  #define OICR_DEVICE_TYPE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TYPE register.                                        */

/* TYPE @Bits 0..31 : Device type. */
  #define OICR_DEVICE_TYPE_TYPE_Pos (0UL)            /*!< Position of TYPE field.                                              */
  #define OICR_DEVICE_TYPE_TYPE_Msk (0xFFFFFFFFUL << OICR_DEVICE_TYPE_TYPE_Pos) /*!< Bit mask of TYPE field.                   */
  #define OICR_DEVICE_TYPE_TYPE_Min (0x0UL)          /*!< Min enumerator value of TYPE field.                                  */
  #define OICR_DEVICE_TYPE_TYPE_Max (0xFFFFFFFFUL)   /*!< Max enumerator value of TYPE field.                                  */
  #define OICR_DEVICE_TYPE_TYPE_Die (0x00000000UL)   /*!< Device is a physical DIE.                                            */
  #define OICR_DEVICE_TYPE_TYPE_FPGA (0xFFFFFFFFUL)  /*!< Device is a FPGA.                                                    */


/* OICR_DEVICE_TESTIMPRINT: Production test imprint. */
  #define OICR_DEVICE_TESTIMPRINT_MaxCount (8UL)     /*!< Max size of TESTIMPRINT[8] array.                                    */
  #define OICR_DEVICE_TESTIMPRINT_MaxIndex (7UL)     /*!< Max index of TESTIMPRINT[8] array.                                   */
  #define OICR_DEVICE_TESTIMPRINT_MinIndex (0UL)     /*!< Min index of TESTIMPRINT[8] array.                                   */
  #define OICR_DEVICE_TESTIMPRINT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TESTIMPRINT[8] register.                       */

/* TESTIMPRINT @Bits 0..31 : Production test imprint. */
  #define OICR_DEVICE_TESTIMPRINT_TESTIMPRINT_Pos (0UL) /*!< Position of TESTIMPRINT field.                                    */
  #define OICR_DEVICE_TESTIMPRINT_TESTIMPRINT_Msk (0xFFFFFFFFUL << OICR_DEVICE_TESTIMPRINT_TESTIMPRINT_Pos) /*!< Bit mask of
                                                                            TESTIMPRINT field.*/


