adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OICR_DEVICE_PARTNO: Part number. */
  #define OICR_DEVICE_PARTNO_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PARTNO register.                                    */

/* PART @Bits 0..31 : Part number. */
  #define OICR_DEVICE_PARTNO_PART_Pos (0UL)          /*!< Position of PART field.                                              */
  #define OICR_DEVICE_PARTNO_PART_Msk (0xFFFFFFFFUL << OICR_DEVICE_PARTNO_PART_Pos) /*!< Bit mask of PART field.               */


/* OICR_DEVICE_HWREVISION: Hardware revision. */
  #define OICR_DEVICE_HWREVISION_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HWREVISION register.                            */

/* HWREVISION @Bits 0..31 : Hardvare revision. */
  #define OICR_DEVICE_HWREVISION_HWREVISION_Pos (0UL) /*!< Position of HWREVISION field.                                       */
  #define OICR_DEVICE_HWREVISION_HWREVISION_Msk (0xFFFFFFFFUL << OICR_DEVICE_HWREVISION_HWREVISION_Pos) /*!< Bit mask of
                                                                            HWREVISION field.*/


/* OICR_DEVICE_PRODUCTIONREVISION: Production reversion. */
  #define OICR_DEVICE_PRODUCTIONREVISION_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PRODUCTIONREVISION register.            */

/* PRODUCTIONREVISION @Bits 0..31 : Production reversion. */
  #define OICR_DEVICE_PRODUCTIONREVISION_PRODUCTIONREVISION_Pos (0UL) /*!< Position of PRODUCTIONREVISION field.               */
  #define OICR_DEVICE_PRODUCTIONREVISION_PRODUCTIONREVISION_Msk (0xFFFFFFFFUL << OICR_DEVICE_PRODUCTIONREVISION_PRODUCTIONREVISION_Pos)
                                                                            /*!< Bit mask of PRODUCTIONREVISION field.*/



/* ===================================================== Struct OICR_PUF ===================================================== */
/**
  * @brief PUF [OICR_PUF] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000000) PUF enrollment status                                 */
} NRF_OICR_PUF_Type;                                 /*!< Size = 4 (0x004)                                                     */

/* OICR_PUF_STATUS: PUF enrollment status */
  #define OICR_PUF_STATUS_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of STATUS register.                                      */

/* STATUS @Bits 0..31 : PUF enrollment status. */
  #define OICR_PUF_STATUS_STATUS_Pos (0UL)           /*!< Position of STATUS field.                                            */
  #define OICR_PUF_STATUS_STATUS_Msk (0xFFFFFFFFUL << OICR_PUF_STATUS_STATUS_Pos) /*!< Bit mask of STATUS field.               */
  #define OICR_PUF_STATUS_STATUS_Min (0x50FA50FAUL)  /*!< Min enumerator value of STATUS field.                                */
  #define OICR_PUF_STATUS_STATUS_Max (0xFFFFFFFFUL)  /*!< Max enumerator value of STATUS field.                                */
  #define OICR_PUF_STATUS_STATUS_Enrolled (0x50FA50FAUL) /*!< PUF enrollment has been completed.                               */
  #define OICR_PUF_STATUS_STATUS_NotEnrolled (0xFFFFFFFFUL) /*!< PUF enrollment has not been done.                             */



/* ================================================== Struct OICR_PRECALIB =================================================== */
/**
  * @brief PRECALIB [OICR_PRECALIB] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PRECALIBRDY;                       /*!< (@ 0x00000000) PRECALIB information is populated and ready.          */
  __IOM uint32_t  ADDRESS[64];                       /*!< (@ 0x00000004) Address to trim register                              */
  __IOM uint32_t  DATA[64];                          /*!< (@ 0x00000104) Data for trim register                                */
} NRF_OICR_PRECALIB_Type;                            /*!< Size = 516 (0x204)                                                   */

/* OICR_PRECALIB_PRECALIBRDY: PRECALIB information is populated and ready. */
  #define OICR_PRECALIB_PRECALIBRDY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PRECALIBRDY register.                        */

/* PRECALIBRDY @Bits 0..3 : PRECALIB information is populated and ready. */
  #define OICR_PRECALIB_PRECALIBRDY_PRECALIBRDY_Pos (0UL) /*!< Position of PRECALIBRDY field.                                  */
  #define OICR_PRECALIB_PRECALIBRDY_PRECALIBRDY_Msk (0xFUL << OICR_PRECALIB_PRECALIBRDY_PRECALIBRDY_Pos) /*!< Bit mask of
                                                                            PRECALIBRDY field.*/
  #define OICR_PRECALIB_PRECALIBRDY_PRECALIBRDY_Min (0x0UL) /*!< Min enumerator value of PRECALIBRDY field.                    */
  #define OICR_PRECALIB_PRECALIBRDY_PRECALIBRDY_Max (0xFUL) /*!< Max enumerator value of PRECALIBRDY field.                    */
  #define OICR_PRECALIB_PRECALIBRDY_PRECALIBRDY_Ready (0x0UL) /*!< Precalibration information is populated and ready.          */
  #define OICR_PRECALIB_PRECALIBRDY_PRECALIBRDY_NotReady (0xFUL) /*!< Precalibration information is not populated or ready.    */



/* =============================================== Struct OICR_MRAM_LOWAVGCURR =============================================== */
/**
  * @brief LOWAVGCURR [OICR_MRAM_LOWAVGCURR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  READ;                              /*!< (@ 0x00000000) Timeout value for low average current in case of read.*/
  __IOM uint32_t  WRITE;                             /*!< (@ 0x00000004) Timeout value for low average current in case of
                                                                         write.*/
  __IOM uint32_t  ERASE;                             /*!< (@ 0x00000008) Timeout value for low average current in case of
                                                                         erase.*/
} NRF_OICR_MRAM_LOWAVGCURR_Type;                     /*!< Size = 12 (0x00C)                                                    */

/* OICR_MRAM_LOWAVGCURR_READ: Timeout value for low average current in case of read. */
  #define OICR_MRAM_LOWAVGCURR_READ_ResetValue (0xFFFFFFFFUL) /*!< Reset value of READ register.                               */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_LOWAVGCURR_READ_VALUE_Pos (0UL)  /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_LOWAVGCURR_READ_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_LOWAVGCURR_READ_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


