adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OICR_MRAM_LOWAVGCURR_WRITE: Timeout value for low average current in case of write. */
  #define OICR_MRAM_LOWAVGCURR_WRITE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of WRITE register.                             */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_LOWAVGCURR_WRITE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_LOWAVGCURR_WRITE_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_LOWAVGCURR_WRITE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* OICR_MRAM_LOWAVGCURR_ERASE: Timeout value for low average current in case of erase. */
  #define OICR_MRAM_LOWAVGCURR_ERASE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ERASE register.                             */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_LOWAVGCURR_ERASE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_LOWAVGCURR_ERASE_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_LOWAVGCURR_ERASE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/



/* ==================================================== Struct OICR_MRAM ===================================================== */
/**
  * @brief MRAM [OICR_MRAM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TRIMRDY;                           /*!< (@ 0x00000000) MRAM TRIM information is populated and ready.         */
  __IOM NRF_OICR_MRAM_LOWAVGCURR_Type LOWAVGCURR;    /*!< (@ 0x00000004) (unspecified)                                         */
  __IOM uint32_t  WAITSTATES;                        /*!< (@ 0x00000010) Default MRAM[n] waitstates.                           */
  __IOM uint32_t  READYNEXTTIMEOUT;                  /*!< (@ 0x00000014) Default MRAM[n] READYNEXTTIMEOUT.                     */
  __IOM uint32_t  NCONFIG;                           /*!< (@ 0x00000018) Number of bits to load from trim configuration for
                                                                         MRAM[n].*/
  __IOM uint32_t  CONFIG[12];                        /*!< (@ 0x0000001C) MRAM[n] trim configuration.                           */
} NRF_OICR_MRAM_Type;                                /*!< Size = 76 (0x04C)                                                    */
  #define OICR_MRAM_MaxCount (2UL)                   /*!< Size of MRAM[2] array.                                               */
  #define OICR_MRAM_MaxIndex (1UL)                   /*!< Max index of MRAM[2] array.                                          */
  #define OICR_MRAM_MinIndex (0UL)                   /*!< Min index of MRAM[2] array.                                          */

/* OICR_MRAM_TRIMRDY: MRAM TRIM information is populated and ready. */
  #define OICR_MRAM_TRIMRDY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIMRDY register.                                    */

/* TRIMRDY @Bit 0 : MRAM TRIM information is populated and ready. */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Pos (0UL)        /*!< Position of TRIMRDY field.                                           */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Msk (0x1UL << OICR_MRAM_TRIMRDY_TRIMRDY_Pos) /*!< Bit mask of TRIMRDY field.               */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Min (0x0UL)      /*!< Min enumerator value of TRIMRDY field.                               */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Max (0x1UL)      /*!< Max enumerator value of TRIMRDY field.                               */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Ready (0x0UL)    /*!< Trim information is populated and ready.                             */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_NotReady (0x1UL) /*!< Trim information is not populated or ready.                          */


/* OICR_MRAM_WAITSTATES: Default MRAM[n] waitstates. */
  #define OICR_MRAM_WAITSTATES_ResetValue (0xFFFFFFFFUL) /*!< Reset value of WAITSTATES register.                              */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_WAITSTATES_VALUE_Pos (0UL)       /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_WAITSTATES_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_WAITSTATES_VALUE_Pos) /*!< Bit mask of VALUE field.        */


/* OICR_MRAM_READYNEXTTIMEOUT: Default MRAM[n] READYNEXTTIMEOUT. */
  #define OICR_MRAM_READYNEXTTIMEOUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of READYNEXTTIMEOUT register.                  */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_READYNEXTTIMEOUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_READYNEXTTIMEOUT_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_READYNEXTTIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* OICR_MRAM_NCONFIG: Number of bits to load from trim configuration for MRAM[n]. */
  #define OICR_MRAM_NCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of NCONFIG register.                                    */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_NCONFIG_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_NCONFIG_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_NCONFIG_VALUE_Pos) /*!< Bit mask of VALUE field.              */


/* OICR_MRAM_CONFIG: MRAM[n] trim configuration. */
  #define OICR_MRAM_CONFIG_MaxCount (12UL)           /*!< Max size of CONFIG[12] array.                                        */
  #define OICR_MRAM_CONFIG_MaxIndex (11UL)           /*!< Max index of CONFIG[12] array.                                       */
  #define OICR_MRAM_CONFIG_MinIndex (0UL)            /*!< Min index of CONFIG[12] array.                                       */
  #define OICR_MRAM_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG[12] register.                                  */

/* CONFIG @Bits 0..31 : Trim Configuration [o]. */
  #define OICR_MRAM_CONFIG_CONFIG_Pos (0UL)          /*!< Position of CONFIG field.                                            */
  #define OICR_MRAM_CONFIG_CONFIG_Msk (0xFFFFFFFFUL << OICR_MRAM_CONFIG_CONFIG_Pos) /*!< Bit mask of CONFIG field.             */



/* ==================================================== Struct OICR_UROT ===================================================== */
/**
  * @brief UROT [OICR_UROT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[64];                          /*!< (@ 0x00000000) Reserved for updatable RoT data.                      */
} NRF_OICR_UROT_Type;                                /*!< Size = 256 (0x100)                                                   */

/* OICR_UROT_DATA: Reserved for updatable RoT data. */
  #define OICR_UROT_DATA_MaxCount (64UL)             /*!< Max size of DATA[64] array.                                          */
  #define OICR_UROT_DATA_MaxIndex (63UL)             /*!< Max index of DATA[64] array.                                         */
  #define OICR_UROT_DATA_MinIndex (0UL)              /*!< Min index of DATA[64] array.                                         */
  #define OICR_UROT_DATA_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of DATA[64] register.                                    */

/* DATA @Bits 0..31 : Data */
  #define OICR_UROT_DATA_DATA_Pos (0UL)              /*!< Position of DATA field.                                              */
  #define OICR_UROT_DATA_DATA_Msk (0xFFFFFFFFUL << OICR_UROT_DATA_DATA_Pos) /*!< Bit mask of DATA field.                       */



/* ============================================= Struct OICR_USER_ROT_UROTPUBKEY ============================================= */
/**
  * @brief UROTPUBKEY [OICR_USER_ROT_UROTPUBKEY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIGEST[8];                         /*!< (@ 0x00000000) First 256 bits of SHA2-512 digest over RoT public key
                                                                         generation [n].*/
  __IOM uint32_t  REVOKE[2];                         /*!< (@ 0x00000020) Revocation status for public key generation [n].      */
} NRF_OICR_USER_ROT_UROTPUBKEY_Type;                 /*!< Size = 40 (0x028)                                                    */
  #define OICR_USER_ROT_UROTPUBKEY_MaxCount (3UL)    /*!< Size of UROTPUBKEY[3] array.                                         */
  #define OICR_USER_ROT_UROTPUBKEY_MaxIndex (2UL)    /*!< Max index of UROTPUBKEY[3] array.                                    */
  #define OICR_USER_ROT_UROTPUBKEY_MinIndex (0UL)    /*!< Min index of UROTPUBKEY[3] array.                                    */

