adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OICR_NORDIC_ROT_UROTPUBKEY_REVOKE: Revocation status for public key generation [n]. */
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_MaxCount (2UL) /*!< Max size of REVOKE[2] array.                                   */
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_MaxIndex (1UL) /*!< Max index of REVOKE[2] array.                                  */
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_MinIndex (0UL) /*!< Min index of REVOKE[2] array.                                  */
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[2] register.                  */

/* STATUS @Bits 0..31 : Revocation status. */
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                    */
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_STATUS_Pos) /*!< Bit
                                                                            mask of STATUS field.*/
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.               */
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.               */
  #define OICR_NORDIC_ROT_UROTPUBKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                             */



/* ========================================== Struct OICR_NORDIC_ROT_RECOVERYPUBKEY ========================================== */
/**
  * @brief RECOVERYPUBKEY [OICR_NORDIC_ROT_RECOVERYPUBKEY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIGEST[8];                         /*!< (@ 0x00000000) First 256 bits of SHA2-512 digest over RoT public key
                                                                         generation [n].*/
  __IOM uint32_t  REVOKE[2];                         /*!< (@ 0x00000020) Revocation status for public key generation [n].      */
} NRF_OICR_NORDIC_ROT_RECOVERYPUBKEY_Type;           /*!< Size = 40 (0x028)                                                    */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_MaxCount (3UL) /*!< Size of RECOVERYPUBKEY[3] array.                                  */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_MaxIndex (2UL) /*!< Max index of RECOVERYPUBKEY[3] array.                             */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_MinIndex (0UL) /*!< Min index of RECOVERYPUBKEY[3] array.                             */

/* OICR_NORDIC_ROT_RECOVERYPUBKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT public key generation [n]. */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                               */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_DIGEST_MaxIndex (7UL) /*!< Max index of DIGEST[8] array.                              */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_DIGEST_MinIndex (0UL) /*!< Min index of DIGEST[8] array.                              */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.              */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_RECOVERYPUBKEY_DIGEST_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE: Revocation status for public key generation [n]. */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_MaxCount (2UL) /*!< Max size of REVOKE[2] array.                               */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_MaxIndex (1UL) /*!< Max index of REVOKE[2] array.                              */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_MinIndex (0UL) /*!< Min index of REVOKE[2] array.                              */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[2] register.              */

/* STATUS @Bits 0..31 : Revocation status. */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_STATUS_Pos)
                                                                            /*!< Bit mask of STATUS field.*/
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.           */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.           */
  #define OICR_NORDIC_ROT_RECOVERYPUBKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                         */



/* ============================================ Struct OICR_NORDIC_ROT_AUTHOPKEY ============================================= */
/**
  * @brief AUTHOPKEY [OICR_NORDIC_ROT_AUTHOPKEY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIGEST[8];                         /*!< (@ 0x00000000) First 256 bits of SHA2-512 digest over RoT
                                                                         authenticated operation public key generation [n].*/
  __IOM uint32_t  REVOKE[2];                         /*!< (@ 0x00000020) Revocation status for RoT authenticated operation
                                                                         public key generation [n].*/
} NRF_OICR_NORDIC_ROT_AUTHOPKEY_Type;                /*!< Size = 40 (0x028)                                                    */
  #define OICR_NORDIC_ROT_AUTHOPKEY_MaxCount (3UL)   /*!< Size of AUTHOPKEY[3] array.                                          */
  #define OICR_NORDIC_ROT_AUTHOPKEY_MaxIndex (2UL)   /*!< Max index of AUTHOPKEY[3] array.                                     */
  #define OICR_NORDIC_ROT_AUTHOPKEY_MinIndex (0UL)   /*!< Min index of AUTHOPKEY[3] array.                                     */

/* OICR_NORDIC_ROT_AUTHOPKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation
                                      [n]. */

  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                                    */
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_MaxIndex (7UL) /*!< Max index of DIGEST[8] array.                                   */
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_MinIndex (0UL) /*!< Min index of DIGEST[8] array.                                   */
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.                   */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* OICR_NORDIC_ROT_AUTHOPKEY_REVOKE: Revocation status for RoT authenticated operation public key generation [n]. */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_MaxCount (2UL) /*!< Max size of REVOKE[2] array.                                    */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_MaxIndex (1UL) /*!< Max index of REVOKE[2] array.                                   */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_MinIndex (0UL) /*!< Min index of REVOKE[2] array.                                   */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[2] register.                   */

