adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STATUS @Bits 0..31 : Revocation status. */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                     */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Pos) /*!< Bit
                                                                            mask of STATUS field.*/
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.                */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                              */



/* =========================================== Struct OICR_NORDIC_ROT_AUTHDEBUGKEY =========================================== */
/**
  * @brief AUTHDEBUGKEY [OICR_NORDIC_ROT_AUTHDEBUGKEY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIGEST[8];                         /*!< (@ 0x00000000) First 256 bits of SHA2-512 digest over RoT
                                                                         authenticated debug public key generation [n].*/
  __IOM uint32_t  REVOKE[2];                         /*!< (@ 0x00000020) Revocation status for RoT authenticated debug public
                                                                         key generation [n].*/
} NRF_OICR_NORDIC_ROT_AUTHDEBUGKEY_Type;             /*!< Size = 40 (0x028)                                                    */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_MaxCount (3UL) /*!< Size of AUTHDEBUGKEY[3] array.                                      */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_MaxIndex (2UL) /*!< Max index of AUTHDEBUGKEY[3] array.                                 */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_MinIndex (0UL) /*!< Min index of AUTHDEBUGKEY[3] array.                                 */

/* OICR_NORDIC_ROT_AUTHDEBUGKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT authenticated debug public key generation
                                         [n]. */

  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                                 */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_DIGEST_MaxIndex (7UL) /*!< Max index of DIGEST[8] array.                                */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_DIGEST_MinIndex (0UL) /*!< Min index of DIGEST[8] array.                                */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.                */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_AUTHDEBUGKEY_DIGEST_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE: Revocation status for RoT authenticated debug public key generation [n]. */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_MaxCount (2UL) /*!< Max size of REVOKE[2] array.                                 */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_MaxIndex (1UL) /*!< Max index of REVOKE[2] array.                                */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_MinIndex (0UL) /*!< Min index of REVOKE[2] array.                                */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[2] register.                */

/* STATUS @Bits 0..31 : Revocation status. */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                  */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_STATUS_Pos) /*!<
                                                                            Bit mask of STATUS field.*/
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.             */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.             */
  #define OICR_NORDIC_ROT_AUTHDEBUGKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                           */



/* =========================================== Struct OICR_NORDIC_ROT_FWENC_AES256 =========================================== */
/**
  * @brief AES256 [OICR_NORDIC_ROT_FWENC_AES256] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VALUE[8];                          /*!< (@ 0x00000000) RoT AES256 firmware encryption key generation [n].    */
} NRF_OICR_NORDIC_ROT_FWENC_AES256_Type;             /*!< Size = 32 (0x020)                                                    */
  #define OICR_NORDIC_ROT_FWENC_AES256_MaxCount (2UL) /*!< Size of AES256[2] array.                                            */
  #define OICR_NORDIC_ROT_FWENC_AES256_MaxIndex (1UL) /*!< Max index of AES256[2] array.                                       */
  #define OICR_NORDIC_ROT_FWENC_AES256_MinIndex (0UL) /*!< Min index of AES256[2] array.                                       */

/* OICR_NORDIC_ROT_FWENC_AES256_VALUE: RoT AES256 firmware encryption key generation [n]. */
  #define OICR_NORDIC_ROT_FWENC_AES256_VALUE_MaxCount (8UL) /*!< Max size of VALUE[8] array.                                   */
  #define OICR_NORDIC_ROT_FWENC_AES256_VALUE_MaxIndex (7UL) /*!< Max index of VALUE[8] array.                                  */
  #define OICR_NORDIC_ROT_FWENC_AES256_VALUE_MinIndex (0UL) /*!< Min index of VALUE[8] array.                                  */
  #define OICR_NORDIC_ROT_FWENC_AES256_VALUE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VALUE[8] register.                  */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define OICR_NORDIC_ROT_FWENC_AES256_VALUE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define OICR_NORDIC_ROT_FWENC_AES256_VALUE_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_FWENC_AES256_VALUE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



