adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ============================================ Struct OICR_NORDIC_ROT_FWENC_SM4 ============================================= */
/**
  * @brief SM4 [OICR_NORDIC_ROT_FWENC_SM4] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VALUE[4];                          /*!< (@ 0x00000000) RoT SM4 firmware encryption key generation [n].       */
} NRF_OICR_NORDIC_ROT_FWENC_SM4_Type;                /*!< Size = 16 (0x010)                                                    */
  #define OICR_NORDIC_ROT_FWENC_SM4_MaxCount (4UL)   /*!< Size of SM4[4] array.                                                */
  #define OICR_NORDIC_ROT_FWENC_SM4_MaxIndex (3UL)   /*!< Max index of SM4[4] array.                                           */
  #define OICR_NORDIC_ROT_FWENC_SM4_MinIndex (0UL)   /*!< Min index of SM4[4] array.                                           */

/* OICR_NORDIC_ROT_FWENC_SM4_VALUE: RoT SM4 firmware encryption key generation [n]. */
  #define OICR_NORDIC_ROT_FWENC_SM4_VALUE_MaxCount (4UL) /*!< Max size of VALUE[4] array.                                      */
  #define OICR_NORDIC_ROT_FWENC_SM4_VALUE_MaxIndex (3UL) /*!< Max index of VALUE[4] array.                                     */
  #define OICR_NORDIC_ROT_FWENC_SM4_VALUE_MinIndex (0UL) /*!< Min index of VALUE[4] array.                                     */
  #define OICR_NORDIC_ROT_FWENC_SM4_VALUE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VALUE[4] register.                     */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define OICR_NORDIC_ROT_FWENC_SM4_VALUE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                        */
  #define OICR_NORDIC_ROT_FWENC_SM4_VALUE_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_FWENC_SM4_VALUE_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* ========================================== Struct OICR_NORDIC_ROT_FWENC_UROTENC =========================================== */
/**
  * @brief UROTENC [OICR_NORDIC_ROT_FWENC_UROTENC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VALUE[8];                          /*!< (@ 0x00000000) AES256 key for decryption of UROT firmware.           */
} NRF_OICR_NORDIC_ROT_FWENC_UROTENC_Type;            /*!< Size = 32 (0x020)                                                    */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_MaxCount (2UL) /*!< Size of UROTENC[2] array.                                          */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_MaxIndex (1UL) /*!< Max index of UROTENC[2] array.                                     */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_MinIndex (0UL) /*!< Min index of UROTENC[2] array.                                     */

/* OICR_NORDIC_ROT_FWENC_UROTENC_VALUE: AES256 key for decryption of UROT firmware. */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_VALUE_MaxCount (8UL) /*!< Max size of VALUE[8] array.                                  */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_VALUE_MaxIndex (7UL) /*!< Max index of VALUE[8] array.                                 */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_VALUE_MinIndex (0UL) /*!< Min index of VALUE[8] array.                                 */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_VALUE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VALUE[8] register.                 */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_VALUE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define OICR_NORDIC_ROT_FWENC_UROTENC_VALUE_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_FWENC_UROTENC_VALUE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================== Struct OICR_NORDIC_ROT_FWENC =============================================== */
/**
  * @brief FWENC [OICR_NORDIC_ROT_FWENC] (unspecified)
  */
typedef struct {
  __IOM NRF_OICR_NORDIC_ROT_FWENC_AES256_Type AES256[2]; /*!< (@ 0x00000000) (unspecified)                                     */
  __IOM NRF_OICR_NORDIC_ROT_FWENC_SM4_Type SM4[4];   /*!< (@ 0x00000040) (unspecified)                                         */
  __IOM NRF_OICR_NORDIC_ROT_FWENC_UROTENC_Type UROTENC[2]; /*!< (@ 0x00000080) (unspecified)                                   */
} NRF_OICR_NORDIC_ROT_FWENC_Type;                    /*!< Size = 192 (0x0C0)                                                   */


/* ================================================= Struct OICR_NORDIC_ROT ================================================== */
/**
  * @brief ROT [OICR_NORDIC_ROT] Assets installed to establish initial Root of Trust in the device.
  */
typedef struct {
  __IOM NRF_OICR_NORDIC_ROT_UROTPUBKEY_Type UROTPUBKEY[3]; /*!< (@ 0x00000000) (unspecified)                                   */
  __IOM NRF_OICR_NORDIC_ROT_RECOVERYPUBKEY_Type RECOVERYPUBKEY[3]; /*!< (@ 0x00000078) (unspecified)                           */
  __IOM NRF_OICR_NORDIC_ROT_AUTHOPKEY_Type AUTHOPKEY[3]; /*!< (@ 0x000000F0) (unspecified)                                     */
  __IOM NRF_OICR_NORDIC_ROT_AUTHDEBUGKEY_Type AUTHDEBUGKEY[3]; /*!< (@ 0x00000168) (unspecified)                               */
  __IOM NRF_OICR_NORDIC_ROT_FWENC_Type FWENC;        /*!< (@ 0x000001E0) (unspecified)                                         */
  __IOM uint32_t  KEYID;                             /*!< (@ 0x000002A0) Root of trust key identifier.                         */
} NRF_OICR_NORDIC_ROT_Type;                          /*!< Size = 676 (0x2A4)                                                   */

/* OICR_NORDIC_ROT_KEYID: Root of trust key identifier. */
  #define OICR_NORDIC_ROT_KEYID_ResetValue (0xFFFFFFFFUL) /*!< Reset value of KEYID register.                                  */

/* VALUE @Bits 0..31 : Root of trust key identifier. */
  #define OICR_NORDIC_ROT_KEYID_VALUE_Pos (0UL)      /*!< Position of VALUE field.                                             */
  #define OICR_NORDIC_ROT_KEYID_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_KEYID_VALUE_Pos) /*!< Bit mask of VALUE field.      */
  #define OICR_NORDIC_ROT_KEYID_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.                             */
  #define OICR_NORDIC_ROT_KEYID_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.                             */
  #define OICR_NORDIC_ROT_KEYID_VALUE_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                              */



