adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================= Struct OICR_NORDIC_LCS ================================================== */
/**
  * @brief LCS [OICR_NORDIC_LCS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FFF[3];                            /*!< (@ 0x00000000) Life cycle state FFF encoding.                        */
  __IOM uint32_t  DISCARDED[3];                      /*!< (@ 0x0000000C) Life cycle state DISCARDED encoding.                  */
  __IOM uint32_t  ANALYSIS[3];                       /*!< (@ 0x00000018) Life cycle state ANALYSIS encoding.                   */
} NRF_OICR_NORDIC_LCS_Type;                          /*!< Size = 36 (0x024)                                                    */


/* ================================================ Struct OICR_NORDIC_POLICY ================================================ */
/**
  * @brief POLICY [OICR_NORDIC_POLICY] ROM enforced device policy
  */
typedef struct {
  __IOM uint32_t  ERASEONEMPTY;                      /*!< (@ 0x00000000) Policy to disable erasing of MRAMC111 memory on
                                                                         backward transition to LCS EMPTY.*/
  __IOM uint32_t  RFU[9];                            /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_OICR_NORDIC_POLICY_Type;                       /*!< Size = 40 (0x028)                                                    */

/* OICR_NORDIC_POLICY_ERASEONEMPTY: Policy to disable erasing of MRAMC111 memory on backward transition to LCS EMPTY. */
  #define OICR_NORDIC_POLICY_ERASEONEMPTY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ERASEONEMPTY register.                 */

/* CONFIG @Bits 0..31 : Policy configuration */
  #define OICR_NORDIC_POLICY_ERASEONEMPTY_CONFIG_Pos (0UL) /*!< Position of CONFIG field.                                      */
  #define OICR_NORDIC_POLICY_ERASEONEMPTY_CONFIG_Msk (0xFFFFFFFFUL << OICR_NORDIC_POLICY_ERASEONEMPTY_CONFIG_Pos) /*!< Bit mask
                                                                            of CONFIG field.*/
  #define OICR_NORDIC_POLICY_ERASEONEMPTY_CONFIG_Min (0x72B4E5ACUL) /*!< Min enumerator value of CONFIG field.                 */
  #define OICR_NORDIC_POLICY_ERASEONEMPTY_CONFIG_Max (0x72B4E5ACUL) /*!< Max enumerator value of CONFIG field.                 */
  #define OICR_NORDIC_POLICY_ERASEONEMPTY_CONFIG_DISABLE (0x72B4E5ACUL) /*!< Disable erasing MRAMC111 on backward transition to
                                                                            EMPTY.*/


/* OICR_NORDIC_POLICY_RFU: (unspecified) */
  #define OICR_NORDIC_POLICY_RFU_MaxCount (9UL)      /*!< Max size of RFU[9] array.                                            */
  #define OICR_NORDIC_POLICY_RFU_MaxIndex (8UL)      /*!< Max index of RFU[9] array.                                           */
  #define OICR_NORDIC_POLICY_RFU_MinIndex (0UL)      /*!< Min index of RFU[9] array.                                           */
  #define OICR_NORDIC_POLICY_RFU_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RFU[9] register.                                */

/* RFU @Bits 0..31 : Reserved for future use. */
  #define OICR_NORDIC_POLICY_RFU_RFU_Pos (0UL)       /*!< Position of RFU field.                                               */
  #define OICR_NORDIC_POLICY_RFU_RFU_Msk (0xFFFFFFFFUL << OICR_NORDIC_POLICY_RFU_RFU_Pos) /*!< Bit mask of RFU field.          */



/* =================================================== Struct OICR_NORDIC ==================================================== */
/**
  * @brief NORDIC [OICR_NORDIC] (unspecified)
  */
typedef struct {
  __IOM NRF_OICR_NORDIC_ROT_Type ROT;                /*!< (@ 0x00000000) Assets installed to establish initial Root of Trust in
                                                                         the device.*/
  __IOM NRF_OICR_NORDIC_LCS_Type LCS;                /*!< (@ 0x000002A4) (unspecified)                                         */
  __IOM NRF_OICR_NORDIC_POLICY_Type POLICY;          /*!< (@ 0x000002C8) ROM enforced device policy                            */
} NRF_OICR_NORDIC_Type;                              /*!< Size = 752 (0x2F0)                                                   */


/* ================================================== Struct OICR_PICR_MEM =================================================== */
/**
  * @brief MEM [OICR_PICR_MEM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000000) Start address of the memory to be blocked             */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Size of the memory to be blocked                      */
} NRF_OICR_PICR_MEM_Type;                            /*!< Size = 8 (0x008)                                                     */
  #define OICR_PICR_MEM_MaxCount (8UL)               /*!< Size of MEM[8] array.                                                */
  #define OICR_PICR_MEM_MaxIndex (7UL)               /*!< Max index of MEM[8] array.                                           */
  #define OICR_PICR_MEM_MinIndex (0UL)               /*!< Min index of MEM[8] array.                                           */

/* OICR_PICR_MEM_ADDR: Start address of the memory to be blocked */
  #define OICR_PICR_MEM_ADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDR register.                                      */

/* ADDR @Bits 0..31 : Memory start address */
  #define OICR_PICR_MEM_ADDR_ADDR_Pos (0UL)          /*!< Position of ADDR field.                                              */
  #define OICR_PICR_MEM_ADDR_ADDR_Msk (0xFFFFFFFFUL << OICR_PICR_MEM_ADDR_ADDR_Pos) /*!< Bit mask of ADDR field.               */
  #define OICR_PICR_MEM_ADDR_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                                  */
  #define OICR_PICR_MEM_ADDR_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                                  */
  #define OICR_PICR_MEM_ADDR_ADDR_NotBlocked (0xFFFFFFFFUL) /*!< Memory not blocked                                            */


/* OICR_PICR_MEM_SIZE: Size of the memory to be blocked */
  #define OICR_PICR_MEM_SIZE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SIZE register.                                      */

/* SIZE @Bits 0..31 : Memory size in bytes */
  #define OICR_PICR_MEM_SIZE_SIZE_Pos (0UL)          /*!< Position of SIZE field.                                              */
  #define OICR_PICR_MEM_SIZE_SIZE_Msk (0xFFFFFFFFUL << OICR_PICR_MEM_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.               */



