adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================= Struct OICR_PICR_PERIPH ================================================= */
/**
  * @brief PERIPH [OICR_PICR_PERIPH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000000) Start address of the peripheral to be blocked         */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Number of peripherals to be blocked                   */
} NRF_OICR_PICR_PERIPH_Type;                         /*!< Size = 8 (0x008)                                                     */
  #define OICR_PICR_PERIPH_MaxCount (8UL)            /*!< Size of PERIPH[8] array.                                             */
  #define OICR_PICR_PERIPH_MaxIndex (7UL)            /*!< Max index of PERIPH[8] array.                                        */
  #define OICR_PICR_PERIPH_MinIndex (0UL)            /*!< Min index of PERIPH[8] array.                                        */

/* OICR_PICR_PERIPH_ADDR: Start address of the peripheral to be blocked */
  #define OICR_PICR_PERIPH_ADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDR register.                                   */

/* ADDR @Bits 0..31 : Peripheral start address */
  #define OICR_PICR_PERIPH_ADDR_ADDR_Pos (0UL)       /*!< Position of ADDR field.                                              */
  #define OICR_PICR_PERIPH_ADDR_ADDR_Msk (0xFFFFFFFFUL << OICR_PICR_PERIPH_ADDR_ADDR_Pos) /*!< Bit mask of ADDR field.         */
  #define OICR_PICR_PERIPH_ADDR_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                               */
  #define OICR_PICR_PERIPH_ADDR_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                               */
  #define OICR_PICR_PERIPH_ADDR_ADDR_NotBlocked (0xFFFFFFFFUL) /*!< Peripheral not blocked                                     */


/* OICR_PICR_PERIPH_SIZE: Number of peripherals to be blocked */
  #define OICR_PICR_PERIPH_SIZE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SIZE register.                                   */

/* SIZE @Bits 0..31 : Peripheral size in 4Kbytes. */
  #define OICR_PICR_PERIPH_SIZE_SIZE_Pos (0UL)       /*!< Position of SIZE field.                                              */
  #define OICR_PICR_PERIPH_SIZE_SIZE_Msk (0xFFFFFFFFUL << OICR_PICR_PERIPH_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.         */



/* ==================================================== Struct OICR_PICR ===================================================== */
/**
  * @brief PICR [OICR_PICR] Product (paper-spin) Information Configuration Registers
  */
typedef struct {
  __IOM uint32_t  DOMAIN;                            /*!< (@ 0x00000000) Block use of a domain                                 */
  __IM  uint32_t  RESERVED[3];
  __IOM NRF_OICR_PICR_MEM_Type MEM[8];               /*!< (@ 0x00000010) (unspecified)                                         */
  __IOM NRF_OICR_PICR_PERIPH_Type PERIPH[8];         /*!< (@ 0x00000050) (unspecified)                                         */
  __IOM uint32_t  GPIO[32];                          /*!< (@ 0x00000090) GPIO configuration to block a pin or port             */
} NRF_OICR_PICR_Type;                                /*!< Size = 272 (0x110)                                                   */

/* OICR_PICR_DOMAIN: Block use of a domain */
  #define OICR_PICR_DOMAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DOMAIN register.                                      */

/* ID0 @Bits 0..3 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID0_Pos (0UL)             /*!< Position of ID0 field.                                               */
  #define OICR_PICR_DOMAIN_ID0_Msk (0xFUL << OICR_PICR_DOMAIN_ID0_Pos) /*!< Bit mask of ID0 field.                             */
  #define OICR_PICR_DOMAIN_ID0_Min (0xFUL)           /*!< Min enumerator value of ID0 field.                                   */
  #define OICR_PICR_DOMAIN_ID0_Max (0xFUL)           /*!< Max enumerator value of ID0 field.                                   */
  #define OICR_PICR_DOMAIN_ID0_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID1 @Bits 4..7 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID1_Pos (4UL)             /*!< Position of ID1 field.                                               */
  #define OICR_PICR_DOMAIN_ID1_Msk (0xFUL << OICR_PICR_DOMAIN_ID1_Pos) /*!< Bit mask of ID1 field.                             */
  #define OICR_PICR_DOMAIN_ID1_Min (0xFUL)           /*!< Min enumerator value of ID1 field.                                   */
  #define OICR_PICR_DOMAIN_ID1_Max (0xFUL)           /*!< Max enumerator value of ID1 field.                                   */
  #define OICR_PICR_DOMAIN_ID1_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID2 @Bits 8..11 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID2_Pos (8UL)             /*!< Position of ID2 field.                                               */
  #define OICR_PICR_DOMAIN_ID2_Msk (0xFUL << OICR_PICR_DOMAIN_ID2_Pos) /*!< Bit mask of ID2 field.                             */
  #define OICR_PICR_DOMAIN_ID2_Min (0xFUL)           /*!< Min enumerator value of ID2 field.                                   */
  #define OICR_PICR_DOMAIN_ID2_Max (0xFUL)           /*!< Max enumerator value of ID2 field.                                   */
  #define OICR_PICR_DOMAIN_ID2_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID3 @Bits 12..15 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID3_Pos (12UL)            /*!< Position of ID3 field.                                               */
  #define OICR_PICR_DOMAIN_ID3_Msk (0xFUL << OICR_PICR_DOMAIN_ID3_Pos) /*!< Bit mask of ID3 field.                             */
  #define OICR_PICR_DOMAIN_ID3_Min (0xFUL)           /*!< Min enumerator value of ID3 field.                                   */
  #define OICR_PICR_DOMAIN_ID3_Max (0xFUL)           /*!< Max enumerator value of ID3 field.                                   */
  #define OICR_PICR_DOMAIN_ID3_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID4 @Bits 16..19 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID4_Pos (16UL)            /*!< Position of ID4 field.                                               */
  #define OICR_PICR_DOMAIN_ID4_Msk (0xFUL << OICR_PICR_DOMAIN_ID4_Pos) /*!< Bit mask of ID4 field.                             */
  #define OICR_PICR_DOMAIN_ID4_Min (0xFUL)           /*!< Min enumerator value of ID4 field.                                   */
  #define OICR_PICR_DOMAIN_ID4_Max (0xFUL)           /*!< Max enumerator value of ID4 field.                                   */
  #define OICR_PICR_DOMAIN_ID4_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

