adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ID5 @Bits 20..23 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID5_Pos (20UL)            /*!< Position of ID5 field.                                               */
  #define OICR_PICR_DOMAIN_ID5_Msk (0xFUL << OICR_PICR_DOMAIN_ID5_Pos) /*!< Bit mask of ID5 field.                             */
  #define OICR_PICR_DOMAIN_ID5_Min (0xFUL)           /*!< Min enumerator value of ID5 field.                                   */
  #define OICR_PICR_DOMAIN_ID5_Max (0xFUL)           /*!< Max enumerator value of ID5 field.                                   */
  #define OICR_PICR_DOMAIN_ID5_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID6 @Bits 24..27 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID6_Pos (24UL)            /*!< Position of ID6 field.                                               */
  #define OICR_PICR_DOMAIN_ID6_Msk (0xFUL << OICR_PICR_DOMAIN_ID6_Pos) /*!< Bit mask of ID6 field.                             */
  #define OICR_PICR_DOMAIN_ID6_Min (0xFUL)           /*!< Min enumerator value of ID6 field.                                   */
  #define OICR_PICR_DOMAIN_ID6_Max (0xFUL)           /*!< Max enumerator value of ID6 field.                                   */
  #define OICR_PICR_DOMAIN_ID6_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID7 @Bits 28..31 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID7_Pos (28UL)            /*!< Position of ID7 field.                                               */
  #define OICR_PICR_DOMAIN_ID7_Msk (0xFUL << OICR_PICR_DOMAIN_ID7_Pos) /*!< Bit mask of ID7 field.                             */
  #define OICR_PICR_DOMAIN_ID7_Min (0xFUL)           /*!< Min enumerator value of ID7 field.                                   */
  #define OICR_PICR_DOMAIN_ID7_Max (0xFUL)           /*!< Max enumerator value of ID7 field.                                   */
  #define OICR_PICR_DOMAIN_ID7_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */


/* OICR_PICR_GPIO: GPIO configuration to block a pin or port */
  #define OICR_PICR_GPIO_MaxCount (32UL)             /*!< Max size of GPIO[32] array.                                          */
  #define OICR_PICR_GPIO_MaxIndex (31UL)             /*!< Max index of GPIO[32] array.                                         */
  #define OICR_PICR_GPIO_MinIndex (0UL)              /*!< Min index of GPIO[32] array.                                         */
  #define OICR_PICR_GPIO_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of GPIO[32] register.                                    */

/* PIN @Bits 0..4 : Pin number */
  #define OICR_PICR_GPIO_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define OICR_PICR_GPIO_PIN_Msk (0x1FUL << OICR_PICR_GPIO_PIN_Pos) /*!< Bit mask of PIN field.                                */

/* PORT @Bits 8..11 : Port number */
  #define OICR_PICR_GPIO_PORT_Pos (8UL)              /*!< Position of PORT field.                                              */
  #define OICR_PICR_GPIO_PORT_Msk (0xFUL << OICR_PICR_GPIO_PORT_Pos) /*!< Bit mask of PORT field.                              */

/* ENABLE @Bits 12..13 : Enable blocking */
  #define OICR_PICR_GPIO_ENABLE_Pos (12UL)           /*!< Position of ENABLE field.                                            */
  #define OICR_PICR_GPIO_ENABLE_Msk (0x3UL << OICR_PICR_GPIO_ENABLE_Pos) /*!< Bit mask of ENABLE field.                        */
  #define OICR_PICR_GPIO_ENABLE_Min (0x0UL)          /*!< Min enumerator value of ENABLE field.                                */
  #define OICR_PICR_GPIO_ENABLE_Max (0x3UL)          /*!< Max enumerator value of ENABLE field.                                */
  #define OICR_PICR_GPIO_ENABLE_PinBlock (0x0UL)     /*!< GPIO pin block is enabled                                            */
  #define OICR_PICR_GPIO_ENABLE_PortBlock (0x2UL)    /*!< Enable blocking a whole port                                         */
  #define OICR_PICR_GPIO_ENABLE_Disabled (0x3UL)     /*!< GPIO pin block is disabled                                           */



/* =============================================== Struct OICR_FWPATCH_SYSCTRL =============================================== */
/**
  * @brief SYSCTRL [OICR_FWPATCH_SYSCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PATCHADDR[8];                      /*!< (@ 0x00000000) Patch address for SysCtrl ROM patch entry point n.    */
  __IOM uint32_t  TRAPADDR[8];                       /*!< (@ 0x00000020) Addresses in SysCtrl ROM which will be trapped to the
                                                                         PATCHADDR target.*/
} NRF_OICR_FWPATCH_SYSCTRL_Type;                     /*!< Size = 64 (0x040)                                                    */

/* OICR_FWPATCH_SYSCTRL_PATCHADDR: Patch address for SysCtrl ROM patch entry point n. */
  #define OICR_FWPATCH_SYSCTRL_PATCHADDR_MaxCount (8UL) /*!< Max size of PATCHADDR[8] array.                                   */
  #define OICR_FWPATCH_SYSCTRL_PATCHADDR_MaxIndex (7UL) /*!< Max index of PATCHADDR[8] array.                                  */
  #define OICR_FWPATCH_SYSCTRL_PATCHADDR_MinIndex (0UL) /*!< Min index of PATCHADDR[8] array.                                  */
  #define OICR_FWPATCH_SYSCTRL_PATCHADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PATCHADDR[8] register.                  */

/* ADDR @Bits 0..31 : Address */
  #define OICR_FWPATCH_SYSCTRL_PATCHADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                           */
  #define OICR_FWPATCH_SYSCTRL_PATCHADDR_ADDR_Msk (0xFFFFFFFFUL << OICR_FWPATCH_SYSCTRL_PATCHADDR_ADDR_Pos) /*!< Bit mask of
                                                                            ADDR field.*/


/* OICR_FWPATCH_SYSCTRL_TRAPADDR: Addresses in SysCtrl ROM which will be trapped to the PATCHADDR target. */
  #define OICR_FWPATCH_SYSCTRL_TRAPADDR_MaxCount (8UL) /*!< Max size of TRAPADDR[8] array.                                     */
  #define OICR_FWPATCH_SYSCTRL_TRAPADDR_MaxIndex (7UL) /*!< Max index of TRAPADDR[8] array.                                    */
  #define OICR_FWPATCH_SYSCTRL_TRAPADDR_MinIndex (0UL) /*!< Min index of TRAPADDR[8] array.                                    */
  #define OICR_FWPATCH_SYSCTRL_TRAPADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRAPADDR[8] register.                    */

/* ADDR @Bits 0..31 : Address */
  #define OICR_FWPATCH_SYSCTRL_TRAPADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                            */
  #define OICR_FWPATCH_SYSCTRL_TRAPADDR_ADDR_Msk (0xFFFFFFFFUL << OICR_FWPATCH_SYSCTRL_TRAPADDR_ADDR_Pos) /*!< Bit mask of ADDR
                                                                            field.*/



/* =============================================== Struct OICR_FWPATCH_SECROM ================================================ */
/**
  * @brief SECROM [OICR_FWPATCH_SECROM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PATCHADDR[224];                    /*!< (@ 0x00000000) Patch address for secure domain ROM patch entry point
                                                                         n.*/
} NRF_OICR_FWPATCH_SECROM_Type;                      /*!< Size = 896 (0x380)                                                   */

/* OICR_FWPATCH_SECROM_PATCHADDR: Patch address for secure domain ROM patch entry point n. */
  #define OICR_FWPATCH_SECROM_PATCHADDR_MaxCount (224UL) /*!< Max size of PATCHADDR[224] array.                                */
  #define OICR_FWPATCH_SECROM_PATCHADDR_MaxIndex (223UL) /*!< Max index of PATCHADDR[224] array.                               */
  #define OICR_FWPATCH_SECROM_PATCHADDR_MinIndex (0UL) /*!< Min index of PATCHADDR[224] array.                                 */
  #define OICR_FWPATCH_SECROM_PATCHADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PATCHADDR[224] register.                 */

/* ADDR @Bits 0..31 : Address */
  #define OICR_FWPATCH_SECROM_PATCHADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                            */
  #define OICR_FWPATCH_SECROM_PATCHADDR_ADDR_Msk (0xFFFFFFFFUL << OICR_FWPATCH_SECROM_PATCHADDR_ADDR_Pos) /*!< Bit mask of ADDR
                                                                            field.*/



/* =================================================== Struct OICR_FWPATCH =================================================== */
/**
  * @brief FWPATCH [OICR_FWPATCH] (unspecified)
  */
typedef struct {
  __IOM NRF_OICR_FWPATCH_SYSCTRL_Type SYSCTRL;       /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_OICR_FWPATCH_SECROM_Type SECROM;         /*!< (@ 0x00000040) (unspecified)                                         */
  __IOM uint32_t  PATCHCODE[3088];                   /*!< (@ 0x000003C0) Patch code area. The code area is shared through mutual
                                                                         agreement between SysCtrl ROM and Secure Domain ROM.*/
} NRF_OICR_FWPATCH_Type;                             /*!< Size = 13312 (0x3400)                                                */

/* OICR_FWPATCH_PATCHCODE: Patch code area. The code area is shared through mutual agreement between SysCtrl ROM and Secure
                            Domain ROM. */

