adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define OICR_FWPATCH_PATCHCODE_MaxCount (3088UL)   /*!< Max size of PATCHCODE[3088] array.                                   */
  #define OICR_FWPATCH_PATCHCODE_MaxIndex (3087UL)   /*!< Max index of PATCHCODE[3088] array.                                  */
  #define OICR_FWPATCH_PATCHCODE_MinIndex (0UL)      /*!< Min index of PATCHCODE[3088] array.                                  */
  #define OICR_FWPATCH_PATCHCODE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PATCHCODE[3088] register.                       */

/* DATA @Bits 0..31 : Data */
  #define OICR_FWPATCH_PATCHCODE_DATA_Pos (0UL)      /*!< Position of DATA field.                                              */
  #define OICR_FWPATCH_PATCHCODE_DATA_Msk (0xFFFFFFFFUL << OICR_FWPATCH_PATCHCODE_DATA_Pos) /*!< Bit mask of DATA field.       */


/* ======================================================= Struct OICR ======================================================= */
/**
  * @brief One time programmable Information Configuration Registers
  */
  typedef struct {                                   /*!< OICR Structure                                                       */
    __IOM NRF_OICR_DEVICE_Type DEVICE;               /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_OICR_PUF_Type PUF;                     /*!< (@ 0x00000040) (unspecified)                                         */
    __IM uint32_t RESERVED[3];
    __IOM NRF_OICR_PRECALIB_Type PRECALIB;           /*!< (@ 0x00000050) (unspecified)                                         */
    __IM uint32_t RESERVED1[3];
    __IOM NRF_OICR_MRAM_Type MRAM[2];                /*!< (@ 0x00000260) (unspecified)                                         */
    __IM uint32_t RESERVED2[2];
    __IOM NRF_OICR_UROT_Type UROT;                   /*!< (@ 0x00000300) (unspecified)                                         */
    __IOM NRF_OICR_USER_Type USER;                   /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[15];
    __IOM NRF_OICR_NORDIC_Type NORDIC;               /*!< (@ 0x00000700) (unspecified)                                         */
    __IM uint32_t RESERVED4[4];
    __IOM NRF_OICR_PICR_Type PICR;                   /*!< (@ 0x00000A00) Product (paper-spin) Information Configuration
                                                                         Registers*/
    __IM uint32_t RESERVED5[60];
    __IOM NRF_OICR_FWPATCH_Type FWPATCH;             /*!< (@ 0x00000C00) (unspecified)                                         */
  } NRF_OICR_Type;                                   /*!< Size = 16384 (0x4000)                                                */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          OSCRFR                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct OSCRFR_CONFIG =================================================== */
/**
  * @brief CONFIG [OSCRFR_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) OSCRFR static CFG configuration                       */
} NRF_OSCRFR_CONFIG_Type;                            /*!< Size = 4 (0x004)                                                     */

/* OSCRFR_CONFIG_CFGSTATIC: OSCRFR static CFG configuration */
  #define OSCRFR_CONFIG_CFGSTATIC_ResetValue (0x00000000UL) /*!< Reset value of CFGSTATIC register.                            */

/* DOUBLEBIAS @Bit 0 : Enable double bias */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Pos (0UL) /*!< Position of DOUBLEBIAS field.                                      */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Msk (0x1UL << OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Pos) /*!< Bit mask of DOUBLEBIAS
                                                                            field.*/
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Min (0x0UL) /*!< Min enumerator value of DOUBLEBIAS field.                        */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Max (0x1UL) /*!< Max enumerator value of DOUBLEBIAS field.                        */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Disabled (0x0UL) /*!< Disabled                                                    */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Enabled (0x1UL) /*!< Enabled                                                      */

/* TRIGDELAY @Bit 1 : Increase TRIG signal delay */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Pos (1UL) /*!< Position of TRIGDELAY field.                                        */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Msk (0x1UL << OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Pos) /*!< Bit mask of TRIGDELAY
                                                                            field.*/
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Min (0x0UL) /*!< Min enumerator value of TRIGDELAY field.                          */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Max (0x1UL) /*!< Max enumerator value of TRIGDELAY field.                          */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Disabled (0x0UL) /*!< Disabled                                                     */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Enabled (0x1UL) /*!< Enabled                                                       */

/* SPARE @Bit 2 : Spare */
  #define OSCRFR_CONFIG_CFGSTATIC_SPARE_Pos (2UL)    /*!< Position of SPARE field.                                             */
  #define OSCRFR_CONFIG_CFGSTATIC_SPARE_Msk (0x1UL << OSCRFR_CONFIG_CFGSTATIC_SPARE_Pos) /*!< Bit mask of SPARE field.         */



/* =================================================== Struct OSCRFR_TRIM ==================================================== */
/**
  * @brief TRIM [OSCRFR_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OSC;                               /*!< (@ 0x00000000) Oscillation period trimming                           */
  __IOM uint32_t  IBPSR;                             /*!< (@ 0x00000004) IBPSR current trimming                                */
} NRF_OSCRFR_TRIM_Type;                              /*!< Size = 8 (0x008)                                                     */

/* OSCRFR_TRIM_OSC: Oscillation period trimming */
  #define OSCRFR_TRIM_OSC_ResetValue (0x00000000UL)  /*!< Reset value of OSC register.                                         */

/* VAL @Bits 0..2 : Oscillation period trimming value */
  #define OSCRFR_TRIM_OSC_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define OSCRFR_TRIM_OSC_VAL_Msk (0x7UL << OSCRFR_TRIM_OSC_VAL_Pos) /*!< Bit mask of VAL field.                               */
  #define OSCRFR_TRIM_OSC_VAL_Min (0x0UL)            /*!< Min enumerator value of VAL field.                                   */
  #define OSCRFR_TRIM_OSC_VAL_Max (0x7UL)            /*!< Max enumerator value of VAL field.                                   */
  #define OSCRFR_TRIM_OSC_VAL_Normal (0x0UL)         /*!< Normal trim value                                                    */
  #define OSCRFR_TRIM_OSC_VAL_Val35 (0x1UL)          /*!< Oscillation period increases by 35 percent                           */
  #define OSCRFR_TRIM_OSC_VAL_Val154 (0x2UL)         /*!< Oscillation period increases by 154 percent                          */
  #define OSCRFR_TRIM_OSC_VAL_Val670 (0x3UL)         /*!< Oscillation period increases by 670 percent                          */
  #define OSCRFR_TRIM_OSC_VAL_ValNeg54 (0x4UL)       /*!< Oscillation period decreases by 54 percent                           */
  #define OSCRFR_TRIM_OSC_VAL_ValNeg49 (0x5UL)       /*!< Oscillation period decreases by 49 percent                           */
  #define OSCRFR_TRIM_OSC_VAL_ValNeg37 (0x6UL)       /*!< Oscillation period decreases by 37 percent                           */
  #define OSCRFR_TRIM_OSC_VAL_ValNeg26 (0x7UL)       /*!< Oscillation period decreases by 26 percent                           */


/* OSCRFR_TRIM_IBPSR: IBPSR current trimming */
  #define OSCRFR_TRIM_IBPSR_ResetValue (0x00000000UL) /*!< Reset value of IBPSR register.                                      */

/* VAL @Bits 0..3 : IBPSR current and VREF voltage trimming value */
  #define OSCRFR_TRIM_IBPSR_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define OSCRFR_TRIM_IBPSR_VAL_Msk (0xFUL << OSCRFR_TRIM_IBPSR_VAL_Pos) /*!< Bit mask of VAL field.                           */



