adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================= Struct OSCRFR_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [OSCRFR_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x0000000C) Override the SETTLED signal from the analog module    */
} NRF_OSCRFR_OVERRIDE_Type;                          /*!< Size = 16 (0x010)                                                    */

/* OSCRFR_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define OSCRFR_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define OSCRFR_OVERRIDE_PWRUP_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define OSCRFR_OVERRIDE_PWRUP_VAL_Msk (0x1UL << OSCRFR_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Msk (0x1UL << OSCRFR_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                      */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* OSCRFR_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define OSCRFR_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define OSCRFR_OVERRIDE_RETAIN_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define OSCRFR_OVERRIDE_RETAIN_VAL_Msk (0x1UL << OSCRFR_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Msk (0x1UL << OSCRFR_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                    */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* OSCRFR_OVERRIDE_READY: Override the READY signal from the analog module */
  #define OSCRFR_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                  */

/* VAL @Bit 0 : Current value of the signal */
  #define OSCRFR_OVERRIDE_READY_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define OSCRFR_OVERRIDE_READY_VAL_Msk (0x1UL << OSCRFR_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define OSCRFR_OVERRIDE_READY_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define OSCRFR_OVERRIDE_READY_EN_Msk (0x1UL << OSCRFR_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                      */
  #define OSCRFR_OVERRIDE_READY_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_READY_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_READY_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define OSCRFR_OVERRIDE_READY_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* OSCRFR_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define OSCRFR_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                              */

/* VAL @Bit 0 : Current value of the signal */
  #define OSCRFR_OVERRIDE_SETTLED_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define OSCRFR_OVERRIDE_SETTLED_VAL_Msk (0x1UL << OSCRFR_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Msk (0x1UL << OSCRFR_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */



