adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ==================================================== Struct OSCRFR_DFT ==================================================== */
/**
  * @brief DFT [OSCRFR_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_OSCRFR_DFT_Type;                               /*!< Size = 52 (0x034)                                                    */

/* OSCRFR_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define OSCRFR_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                             */

/* SELMUX @Bit 0 : Select multiplexer for ATB0 */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Msk (0x1UL << OSCRFR_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Max (0x1UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_IBPSR4U (0x0UL) /*!< IBPSR_4U signal selected                                           */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Spare (0x1UL) /*!< None selected                                                        */

/* EN @Bit 31 : Enable the analog test bus */
  #define OSCRFR_DFT_ATB0CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define OSCRFR_DFT_ATB0CONFIG_EN_Msk (0x1UL << OSCRFR_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define OSCRFR_DFT_ATB0CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_DFT_ATB0CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_DFT_ATB0CONFIG_EN_Disabled (0x0UL)  /*!< Analog test bus is disabled                                          */
  #define OSCRFR_DFT_ATB0CONFIG_EN_Enabled (0x1UL)   /*!< Analog test bus is enabled                                           */


/* OSCRFR_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define OSCRFR_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                             */

/* SELMUX @Bit 0 : Select multiplexer for DTB0 */
  #define OSCRFR_DFT_DTB0CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define OSCRFR_DFT_DTB0CONFIG_SELMUX_Msk (0x1UL << OSCRFR_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define OSCRFR_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define OSCRFR_DFT_DTB0CONFIG_SELMUX_Max (0x1UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define OSCRFR_DFT_DTB0CONFIG_SELMUX_READY (0x0UL) /*!< READY signal selected                                                */
  #define OSCRFR_DFT_DTB0CONFIG_SELMUX_OSC (0x1UL)   /*!< OSC_RFR_ANA_AO_0V8 signal selected                                   */

/* EN @Bit 31 : Enable the digital test bus */
  #define OSCRFR_DFT_DTB0CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define OSCRFR_DFT_DTB0CONFIG_EN_Msk (0x1UL << OSCRFR_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define OSCRFR_DFT_DTB0CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_DFT_DTB0CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_DFT_DTB0CONFIG_EN_Disabled (0x0UL)  /*!< Digital test bus is disabled                                         */
  #define OSCRFR_DFT_DTB0CONFIG_EN_Enabled (0x1UL)   /*!< Digital test bus is enabled                                          */


/* OSCRFR_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define OSCRFR_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                             */

/* SELMUX @Bit 0 : Select multiplexer for DTB1 */
  #define OSCRFR_DFT_DTB1CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define OSCRFR_DFT_DTB1CONFIG_SELMUX_Msk (0x1UL << OSCRFR_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define OSCRFR_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define OSCRFR_DFT_DTB1CONFIG_SELMUX_Max (0x1UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define OSCRFR_DFT_DTB1CONFIG_SELMUX_SETTLED (0x0UL) /*!< SETTLED signal selected                                            */
  #define OSCRFR_DFT_DTB1CONFIG_SELMUX_OSC (0x1UL)   /*!< OSC_RFR_ANA_AO_0V8 signal selected                                   */

/* EN @Bit 31 : Enable the digital test bus */
  #define OSCRFR_DFT_DTB1CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define OSCRFR_DFT_DTB1CONFIG_EN_Msk (0x1UL << OSCRFR_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define OSCRFR_DFT_DTB1CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_DFT_DTB1CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_DFT_DTB1CONFIG_EN_Disabled (0x0UL)  /*!< Digital test bus is disabled                                         */
  #define OSCRFR_DFT_DTB1CONFIG_EN_Enabled (0x1UL)   /*!< Digital test bus is enabled                                          */


