adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OSCRFR_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define OSCRFR_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                             */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define OSCRFR_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                   */
  #define OSCRFR_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << OSCRFR_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define OSCRFR_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                      */
  #define OSCRFR_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                      */
  #define OSCRFR_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                        */
  #define OSCRFR_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                          */


/* OSCRFR_DFT_TCFG: Test mode configuration */
  #define OSCRFR_DFT_TCFG_ResetValue (0x00000000UL)  /*!< Reset value of TCFG register.                                        */

/* BIASCURRENT @Bit 0 : Enable continuous mode for measuring bias current over ATB */
  #define OSCRFR_DFT_TCFG_BIASCURRENT_Pos (0UL)      /*!< Position of BIASCURRENT field.                                       */
  #define OSCRFR_DFT_TCFG_BIASCURRENT_Msk (0x1UL << OSCRFR_DFT_TCFG_BIASCURRENT_Pos) /*!< Bit mask of BIASCURRENT field.       */
  #define OSCRFR_DFT_TCFG_BIASCURRENT_Min (0x0UL)    /*!< Min enumerator value of BIASCURRENT field.                           */
  #define OSCRFR_DFT_TCFG_BIASCURRENT_Max (0x1UL)    /*!< Max enumerator value of BIASCURRENT field.                           */
  #define OSCRFR_DFT_TCFG_BIASCURRENT_Disabled (0x0UL) /*!< Disabled                                                           */
  #define OSCRFR_DFT_TCFG_BIASCURRENT_Enabled (0x1UL) /*!< Enabled                                                             */

/* OSCRFRDTBI @Bit 1 : Use DTBI input as refresh clock when in bypass mode */
  #define OSCRFR_DFT_TCFG_OSCRFRDTBI_Pos (1UL)       /*!< Position of OSCRFRDTBI field.                                        */
  #define OSCRFR_DFT_TCFG_OSCRFRDTBI_Msk (0x1UL << OSCRFR_DFT_TCFG_OSCRFRDTBI_Pos) /*!< Bit mask of OSCRFRDTBI field.          */
  #define OSCRFR_DFT_TCFG_OSCRFRDTBI_Min (0x0UL)     /*!< Min enumerator value of OSCRFRDTBI field.                            */
  #define OSCRFR_DFT_TCFG_OSCRFRDTBI_Max (0x1UL)     /*!< Max enumerator value of OSCRFRDTBI field.                            */
  #define OSCRFR_DFT_TCFG_OSCRFRDTBI_Disabled (0x0UL) /*!< Disabled                                                            */
  #define OSCRFR_DFT_TCFG_OSCRFRDTBI_Enabled (0x1UL) /*!< Enabled                                                              */


/* ====================================================== Struct OSCRFR ====================================================== */
/**
  * @brief OSCRFR peripheral
  */
  typedef struct {                                   /*!< OSCRFR Structure                                                     */
    __IM uint32_t RESERVED[256];
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000400) Status of analog module output signals                */
    __IM uint32_t RESERVED1[3];
    __IOM NRF_OSCRFR_CONFIG_Type CONFIG;             /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED2[11];
    __IOM NRF_OSCRFR_TRIM_Type TRIM;                 /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED3[14];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000484) Oscillator mode                                       */
    __IM uint32_t RESERVED4[30];
    __IOM NRF_OSCRFR_OVERRIDE_Type OVERRIDE;         /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED5[60];
    __IOM NRF_OSCRFR_DFT_Type DFT;                   /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_OSCRFR_Type;                                 /*!< Size = 1588 (0x634)                                                  */

/* OSCRFR_STATUSANA: Status of analog module output signals */
  #define OSCRFR_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                   */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define OSCRFR_STATUSANA_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define OSCRFR_STATUSANA_READY_Msk (0x1UL << OSCRFR_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                       */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define OSCRFR_STATUSANA_SETTLED_Pos (1UL)         /*!< Position of SETTLED field.                                           */
  #define OSCRFR_STATUSANA_SETTLED_Msk (0x1UL << OSCRFR_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.                 */


/* OSCRFR_MIRROR: Enable LOCK for mirrored registers */
  #define OSCRFR_MIRROR_ResetValue (0x00000001UL)    /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define OSCRFR_MIRROR_LOCK_Pos (0UL)               /*!< Position of LOCK field.                                              */
  #define OSCRFR_MIRROR_LOCK_Msk (0x1UL << OSCRFR_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                */
  #define OSCRFR_MIRROR_LOCK_Min (0x0UL)             /*!< Min enumerator value of LOCK field.                                  */
  #define OSCRFR_MIRROR_LOCK_Max (0x1UL)             /*!< Max enumerator value of LOCK field.                                  */
  #define OSCRFR_MIRROR_LOCK_Disabled (0x0UL)        /*!< Lock disabled                                                        */
  #define OSCRFR_MIRROR_LOCK_Enabled (0x1UL)         /*!< Lock enabled                                                         */


