adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VDD2 @Bit 1 : Waiting for VDD2 up ACK or not. */
  #define OTPC_POWER_POWERUPACK_VDD2_Pos (1UL)       /*!< Position of VDD2 field.                                              */
  #define OTPC_POWER_POWERUPACK_VDD2_Msk (0x1UL << OTPC_POWER_POWERUPACK_VDD2_Pos) /*!< Bit mask of VDD2 field.                */
  #define OTPC_POWER_POWERUPACK_VDD2_Min (0x0UL)     /*!< Min enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_POWERUPACK_VDD2_Max (0x1UL)     /*!< Max enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_POWERUPACK_VDD2_NoOperation (0x0UL) /*!< Not waiting for VDD2 up ACK.                                     */
  #define OTPC_POWER_POWERUPACK_VDD2_Ack (0x1UL)     /*!< Waiting for VDD2 up ACK                                              */


/* OTPC_POWER_POWERDOWNACK: Status of the power control signals acknowledgment during power down sequence. */
  #define OTPC_POWER_POWERDOWNACK_ResetValue (0x00000000UL) /*!< Reset value of POWERDOWNACK register.                         */

/* VDD @Bit 0 : Waiting for VDD down ACK or not. */
  #define OTPC_POWER_POWERDOWNACK_VDD_Pos (0UL)      /*!< Position of VDD field.                                               */
  #define OTPC_POWER_POWERDOWNACK_VDD_Msk (0x1UL << OTPC_POWER_POWERDOWNACK_VDD_Pos) /*!< Bit mask of VDD field.               */
  #define OTPC_POWER_POWERDOWNACK_VDD_Min (0x0UL)    /*!< Min enumerator value of VDD field.                                   */
  #define OTPC_POWER_POWERDOWNACK_VDD_Max (0x1UL)    /*!< Max enumerator value of VDD field.                                   */
  #define OTPC_POWER_POWERDOWNACK_VDD_NoOperation (0x0UL) /*!< Not waiting for VDD down ACK.                                   */
  #define OTPC_POWER_POWERDOWNACK_VDD_Ack (0x1UL)    /*!< Waiting for VDD down ACK.                                            */

/* VDD2 @Bit 1 : Waiting for VDD2 down ACK or not. */
  #define OTPC_POWER_POWERDOWNACK_VDD2_Pos (1UL)     /*!< Position of VDD2 field.                                              */
  #define OTPC_POWER_POWERDOWNACK_VDD2_Msk (0x1UL << OTPC_POWER_POWERDOWNACK_VDD2_Pos) /*!< Bit mask of VDD2 field.            */
  #define OTPC_POWER_POWERDOWNACK_VDD2_Min (0x0UL)   /*!< Min enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_POWERDOWNACK_VDD2_Max (0x1UL)   /*!< Max enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_POWERDOWNACK_VDD2_NoOperation (0x0UL) /*!< Not waiting for VDD2 down ACK.                                 */
  #define OTPC_POWER_POWERDOWNACK_VDD2_Ack (0x1UL)   /*!< Waiting for VDD2 down ACK.                                           */


/* OTPC_POWER_FORCEON: Force ON the power supply. */
  #define OTPC_POWER_FORCEON_ResetValue (0x00000000UL) /*!< Reset value of FORCEON register.                                   */

/* VDD @Bit 0 : Force ON the VDD supply */
  #define OTPC_POWER_FORCEON_VDD_Pos (0UL)           /*!< Position of VDD field.                                               */
  #define OTPC_POWER_FORCEON_VDD_Msk (0x1UL << OTPC_POWER_FORCEON_VDD_Pos) /*!< Bit mask of VDD field.                         */
  #define OTPC_POWER_FORCEON_VDD_Min (0x0UL)         /*!< Min enumerator value of VDD field.                                   */
  #define OTPC_POWER_FORCEON_VDD_Max (0x1UL)         /*!< Max enumerator value of VDD field.                                   */
  #define OTPC_POWER_FORCEON_VDD_NoOperation (0x0UL) /*!< No Force ON.                                                         */
  #define OTPC_POWER_FORCEON_VDD_ForceOn (0x1UL)     /*!< Force ON.                                                            */

/* VDD2 @Bit 1 : Force ON the VDD2 supply. */
  #define OTPC_POWER_FORCEON_VDD2_Pos (1UL)          /*!< Position of VDD2 field.                                              */
  #define OTPC_POWER_FORCEON_VDD2_Msk (0x1UL << OTPC_POWER_FORCEON_VDD2_Pos) /*!< Bit mask of VDD2 field.                      */
  #define OTPC_POWER_FORCEON_VDD2_Min (0x0UL)        /*!< Min enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_FORCEON_VDD2_Max (0x1UL)        /*!< Max enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_FORCEON_VDD2_NoOperation (0x0UL) /*!< No Force ON.                                                        */
  #define OTPC_POWER_FORCEON_VDD2_ForceOn (0x1UL)    /*!< Force ON.                                                            */

/* KEY @Bits 16..31 : Key to enable the writing to this register. Writes to this register are ignored if KEY is not set to
                      0xA66D. */

  #define OTPC_POWER_FORCEON_KEY_Pos (16UL)          /*!< Position of KEY field.                                               */
  #define OTPC_POWER_FORCEON_KEY_Msk (0xFFFFUL << OTPC_POWER_FORCEON_KEY_Pos) /*!< Bit mask of KEY field.                      */
  #define OTPC_POWER_FORCEON_KEY_Min (0xA66DUL)      /*!< Min enumerator value of KEY field.                                   */
  #define OTPC_POWER_FORCEON_KEY_Max (0xA66DUL)      /*!< Max enumerator value of KEY field.                                   */
  #define OTPC_POWER_FORCEON_KEY_Allowed (0xA66DUL)  /*!< Write is allowed.                                                    */


/* OTPC_POWER_FORCEOFF: Force OFF the power supply. */
  #define OTPC_POWER_FORCEOFF_ResetValue (0x00000000UL) /*!< Reset value of FORCEOFF register.                                 */

/* VDD @Bit 0 : Force OFF the VDD supply */
  #define OTPC_POWER_FORCEOFF_VDD_Pos (0UL)          /*!< Position of VDD field.                                               */
  #define OTPC_POWER_FORCEOFF_VDD_Msk (0x1UL << OTPC_POWER_FORCEOFF_VDD_Pos) /*!< Bit mask of VDD field.                       */
  #define OTPC_POWER_FORCEOFF_VDD_Min (0x0UL)        /*!< Min enumerator value of VDD field.                                   */
  #define OTPC_POWER_FORCEOFF_VDD_Max (0x1UL)        /*!< Max enumerator value of VDD field.                                   */
  #define OTPC_POWER_FORCEOFF_VDD_NoOperation (0x0UL) /*!< No Force OFF.                                                       */
  #define OTPC_POWER_FORCEOFF_VDD_ForceOff (0x1UL)   /*!< Force OFF.                                                           */

