adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READ @Bits 0..1 : OTP mempory read mode. */
  #define OTPC_TESTMODE1_EMEMORY_READ_READ_Pos (0UL) /*!< Position of READ field.                                              */
  #define OTPC_TESTMODE1_EMEMORY_READ_READ_Msk (0x3UL << OTPC_TESTMODE1_EMEMORY_READ_READ_Pos) /*!< Bit mask of READ field.    */
  #define OTPC_TESTMODE1_EMEMORY_READ_READ_Min (0x0UL) /*!< Min enumerator value of READ field.                                */
  #define OTPC_TESTMODE1_EMEMORY_READ_READ_Max (0x2UL) /*!< Max enumerator value of READ field.                                */
  #define OTPC_TESTMODE1_EMEMORY_READ_READ_Normal (0x0UL) /*!< Normal read mode.                                               */
  #define OTPC_TESTMODE1_EMEMORY_READ_READ_PGMMargin (0x1UL) /*!< PGM margin read mode.                                        */
  #define OTPC_TESTMODE1_EMEMORY_READ_READ_InitialMargin (0x2UL) /*!< Initial margin read mode.                                */


/* OTPC_TESTMODE1_EMEMORY_PTR: Enables the PTR (PTR is the direct signal to the OTP macro, it enables the test row) for read or
                                write. When enabled, the read and writes goes to test row instead of main OTP memory. */

  #define OTPC_TESTMODE1_EMEMORY_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                               */

/* PTR @Bit 0 : Enable PTR. */
  #define OTPC_TESTMODE1_EMEMORY_PTR_PTR_Pos (0UL)   /*!< Position of PTR field.                                               */
  #define OTPC_TESTMODE1_EMEMORY_PTR_PTR_Msk (0x1UL << OTPC_TESTMODE1_EMEMORY_PTR_PTR_Pos) /*!< Bit mask of PTR field.         */
  #define OTPC_TESTMODE1_EMEMORY_PTR_PTR_Min (0x0UL) /*!< Min enumerator value of PTR field.                                   */
  #define OTPC_TESTMODE1_EMEMORY_PTR_PTR_Max (0x1UL) /*!< Max enumerator value of PTR field.                                   */
  #define OTPC_TESTMODE1_EMEMORY_PTR_PTR_Disable (0x0UL) /*!< Disable PTR.                                                     */
  #define OTPC_TESTMODE1_EMEMORY_PTR_PTR_Enable (0x1UL) /*!< Enable PTR.                                                       */



/* ================================================== Struct OTPC_TESTMODE1 ================================================== */
/**
  * @brief TESTMODE1 [OTPC_TESTMODE1] (unspecified)
  */
typedef struct {
  __IOM NRF_OTPC_TESTMODE1_EMEMORY_Type EMEMORY;     /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_OTPC_TESTMODE1_Type;                           /*!< Size = 8 (0x008)                                                     */


/* ============================================== Struct OTPC_TESTMODE2_EMEMORY ============================================== */
/**
  * @brief EMEMORY [OTPC_TESTMODE2_EMEMORY] (unspecified)
  */
typedef struct {
  __OM  uint32_t  IN;                                /*!< (@ 0x00000000) Writes directly to the input signals of the OTP macro.*/
  __IM  uint32_t  OUT;                               /*!< (@ 0x00000004) Reads directly from the output signals of the OTP
                                                                         macro.*/
  __OM  uint32_t  PA;                                /*!< (@ 0x00000008) Writes directly to the address input PA of the OTP
                                                                         macro.*/
  __OM  uint32_t  PAIO;                              /*!< (@ 0x0000000C) Writes directly to the address input PAIO of the OTP
                                                                         macro*/
  __IOM uint32_t  DATA;                              /*!< (@ 0x00000010) OTP read/write data                                   */
} NRF_OTPC_TESTMODE2_EMEMORY_Type;                   /*!< Size = 20 (0x014)                                                    */

/* OTPC_TESTMODE2_EMEMORY_IN: Writes directly to the input signals of the OTP macro. */
  #define OTPC_TESTMODE2_EMEMORY_IN_ResetValue (0x00000000UL) /*!< Reset value of IN register.                                 */

/* PTM @Bits 0..3 : Test mode enabling. */
  #define OTPC_TESTMODE2_EMEMORY_IN_PTM_Pos (0UL)    /*!< Position of PTM field.                                               */
  #define OTPC_TESTMODE2_EMEMORY_IN_PTM_Msk (0xFUL << OTPC_TESTMODE2_EMEMORY_IN_PTM_Pos) /*!< Bit mask of PTM field.           */

/* PWE @Bit 4 : Define program cycle. */
  #define OTPC_TESTMODE2_EMEMORY_IN_PWE_Pos (4UL)    /*!< Position of PWE field.                                               */
  #define OTPC_TESTMODE2_EMEMORY_IN_PWE_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_IN_PWE_Pos) /*!< Bit mask of PWE field.           */

/* PPROG @Bit 5 : Program Mode enabling. */
  #define OTPC_TESTMODE2_EMEMORY_IN_PPROG_Pos (5UL)  /*!< Position of PPROG field.                                             */
  #define OTPC_TESTMODE2_EMEMORY_IN_PPROG_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_IN_PPROG_Pos) /*!< Bit mask of PPROG field.     */

/* PCLK @Bit 6 : Clock input. */
  #define OTPC_TESTMODE2_EMEMORY_IN_PCLK_Pos (6UL)   /*!< Position of PCLK field.                                              */
  #define OTPC_TESTMODE2_EMEMORY_IN_PCLK_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_IN_PCLK_Pos) /*!< Bit mask of PCLK field.        */

/* PCE @Bit 7 : IP enabling. */
  #define OTPC_TESTMODE2_EMEMORY_IN_PCE_Pos (7UL)    /*!< Position of PCE field.                                               */
  #define OTPC_TESTMODE2_EMEMORY_IN_PCE_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_IN_PCE_Pos) /*!< Bit mask of PCE field.           */

/* PTR @Bit 8 : Test row enable. */
  #define OTPC_TESTMODE2_EMEMORY_IN_PTR_Pos (8UL)    /*!< Position of PTR field.                                               */
  #define OTPC_TESTMODE2_EMEMORY_IN_PTR_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_IN_PTR_Pos) /*!< Bit mask of PTR field.           */

/* PDSTB @Bit 9 : Deep standby mode enabling. */
  #define OTPC_TESTMODE2_EMEMORY_IN_PDSTB_Pos (9UL)  /*!< Position of PDSTB field.                                             */
  #define OTPC_TESTMODE2_EMEMORY_IN_PDSTB_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_IN_PDSTB_Pos) /*!< Bit mask of PDSTB field.     */

