adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PENVDD2 @Bit 10 : VDD2 enable pin (VDD2 domain). */
  #define OTPC_TESTMODE2_EMEMORY_IN_PENVDD2_Pos (10UL) /*!< Position of PENVDD2 field.                                         */
  #define OTPC_TESTMODE2_EMEMORY_IN_PENVDD2_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_IN_PENVDD2_Pos) /*!< Bit mask of PENVDD2
                                                                            field.*/


/* OTPC_TESTMODE2_EMEMORY_OUT: Reads directly from the output signals of the OTP macro. */
  #define OTPC_TESTMODE2_EMEMORY_OUT_ResetValue (0x00000000UL) /*!< Reset value of OUT register.                               */

/* PBUSY @Bit 0 : Auto enrollment busy pin. */
  #define OTPC_TESTMODE2_EMEMORY_OUT_PBUSY_Pos (0UL) /*!< Position of PBUSY field.                                             */
  #define OTPC_TESTMODE2_EMEMORY_OUT_PBUSY_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_OUT_PBUSY_Pos) /*!< Bit mask of PBUSY field.   */

/* PS @Bit 1 : Auto PUF margin read success. */
  #define OTPC_TESTMODE2_EMEMORY_OUT_PS_Pos (1UL)    /*!< Position of PS field.                                                */
  #define OTPC_TESTMODE2_EMEMORY_OUT_PS_Msk (0x1UL << OTPC_TESTMODE2_EMEMORY_OUT_PS_Pos) /*!< Bit mask of PS field.            */


/* OTPC_TESTMODE2_EMEMORY_PA: Writes directly to the address input PA of the OTP macro. */
  #define OTPC_TESTMODE2_EMEMORY_PA_ResetValue (0x00000000UL) /*!< Reset value of PA register.                                 */

/* PA @Bits 0..11 : Address input for read/write operation. */
  #define OTPC_TESTMODE2_EMEMORY_PA_PA_Pos (0UL)     /*!< Position of PA field.                                                */
  #define OTPC_TESTMODE2_EMEMORY_PA_PA_Msk (0xFFFUL << OTPC_TESTMODE2_EMEMORY_PA_PA_Pos) /*!< Bit mask of PA field.            */


/* OTPC_TESTMODE2_EMEMORY_PAIO: Writes directly to the address input PAIO of the OTP macro */
  #define OTPC_TESTMODE2_EMEMORY_PAIO_ResetValue (0x00000000UL) /*!< Reset value of PAIO register.                             */

/* PAIO @Bits 0..5 : Address input for write operation. */
  #define OTPC_TESTMODE2_EMEMORY_PAIO_PAIO_Pos (0UL) /*!< Position of PAIO field.                                              */
  #define OTPC_TESTMODE2_EMEMORY_PAIO_PAIO_Msk (0x3FUL << OTPC_TESTMODE2_EMEMORY_PAIO_PAIO_Pos) /*!< Bit mask of PAIO field.   */


/* OTPC_TESTMODE2_EMEMORY_DATA: OTP read/write data */
  #define OTPC_TESTMODE2_EMEMORY_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA register.                             */

/* DATA @Bits 0..31 : OTP data register */
  #define OTPC_TESTMODE2_EMEMORY_DATA_DATA_Pos (0UL) /*!< Position of DATA field.                                              */
  #define OTPC_TESTMODE2_EMEMORY_DATA_DATA_Msk (0xFFFFFFFFUL << OTPC_TESTMODE2_EMEMORY_DATA_DATA_Pos) /*!< Bit mask of DATA
                                                                            field.*/



/* ================================================== Struct OTPC_TESTMODE2 ================================================== */
/**
  * @brief TESTMODE2 [OTPC_TESTMODE2] (unspecified)
  */
typedef struct {
  __IOM NRF_OTPC_TESTMODE2_EMEMORY_Type EMEMORY;     /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  COUNTERCONFIG;                     /*!< (@ 0x00000024) Configuration register for the counter.               */
  __OM  uint32_t  COUNTERSTART;                      /*!< (@ 0x00000028) Starts the counter. Only applicable when
                                                                         TESTMODE2.COUNTERCONFIG.OPERATIONMODE = Direct.*/
  __IOM uint32_t  COUNTERRELOAD;                     /*!< (@ 0x0000002C) Reload value for counter.                             */
  __IM  uint32_t  COUNTERRUN;                        /*!< (@ 0x00000030) Status of the counter.                                */
} NRF_OTPC_TESTMODE2_Type;                           /*!< Size = 52 (0x034)                                                    */

/* OTPC_TESTMODE2_COUNTERCONFIG: Configuration register for the counter. */
  #define OTPC_TESTMODE2_COUNTERCONFIG_ResetValue (0x00000000UL) /*!< Reset value of COUNTERCONFIG register.                   */

/* OPERATIONMODE @Bit 0 : Enable counter-triggered latching of read data from OTP. */
  #define OTPC_TESTMODE2_COUNTERCONFIG_OPERATIONMODE_Pos (0UL) /*!< Position of OPERATIONMODE field.                           */
  #define OTPC_TESTMODE2_COUNTERCONFIG_OPERATIONMODE_Msk (0x1UL << OTPC_TESTMODE2_COUNTERCONFIG_OPERATIONMODE_Pos) /*!< Bit mask
                                                                            of OPERATIONMODE field.*/
  #define OTPC_TESTMODE2_COUNTERCONFIG_OPERATIONMODE_Min (0x0UL) /*!< Min enumerator value of OPERATIONMODE field.             */
  #define OTPC_TESTMODE2_COUNTERCONFIG_OPERATIONMODE_Max (0x1UL) /*!< Max enumerator value of OPERATIONMODE field.             */
  #define OTPC_TESTMODE2_COUNTERCONFIG_OPERATIONMODE_Direct (0x0UL) /*!< The TESTMODE2.EMEMORY.DATA[31:0] register reads the
                                                                         direct value of PDOUT[31:0] of eMemory OTP.*/
  #define OTPC_TESTMODE2_COUNTERCONFIG_OPERATIONMODE_Latched (0x1UL) /*!< The TESTMODE2.EMEMORY.DATA register reads the latched
                                                                          value of PDOUT[31:0] of eMemory OTP.*/


/* OTPC_TESTMODE2_COUNTERSTART: Starts the counter. Only applicable when TESTMODE2.COUNTERCONFIG.OPERATIONMODE = Direct. */
  #define OTPC_TESTMODE2_COUNTERSTART_ResetValue (0x00000000UL) /*!< Reset value of COUNTERSTART register.                     */

/* TRIGGER @Bit 0 : Start the counter. */
  #define OTPC_TESTMODE2_COUNTERSTART_TRIGGER_Pos (0UL) /*!< Position of TRIGGER field.                                        */
  #define OTPC_TESTMODE2_COUNTERSTART_TRIGGER_Msk (0x1UL << OTPC_TESTMODE2_COUNTERSTART_TRIGGER_Pos) /*!< Bit mask of TRIGGER
                                                                            field.*/
  #define OTPC_TESTMODE2_COUNTERSTART_TRIGGER_Min (0x0UL) /*!< Min enumerator value of TRIGGER field.                          */
  #define OTPC_TESTMODE2_COUNTERSTART_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TRIGGER field.                          */
  #define OTPC_TESTMODE2_COUNTERSTART_TRIGGER_NoOperation (0x0UL) /*!< No operation.                                           */
  #define OTPC_TESTMODE2_COUNTERSTART_TRIGGER_Start (0x1UL) /*!< Start the counter. Only applicable when
                                                                 TESTMODE2.COUNTERCONFIG.OPERATIONMODE=Direct.*/


/* OTPC_TESTMODE2_COUNTERRELOAD: Reload value for counter. */
  #define OTPC_TESTMODE2_COUNTERRELOAD_ResetValue (0x00000000UL) /*!< Reset value of COUNTERRELOAD register.                   */

