adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READYNEXT @Bit 1 : Read pending status of interrupt for event READYNEXT */
  #define OTPC_INTPEND_READYNEXT_Pos (1UL)           /*!< Position of READYNEXT field.                                         */
  #define OTPC_INTPEND_READYNEXT_Msk (0x1UL << OTPC_INTPEND_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                   */
  #define OTPC_INTPEND_READYNEXT_Min (0x0UL)         /*!< Min enumerator value of READYNEXT field.                             */
  #define OTPC_INTPEND_READYNEXT_Max (0x1UL)         /*!< Max enumerator value of READYNEXT field.                             */
  #define OTPC_INTPEND_READYNEXT_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define OTPC_INTPEND_READYNEXT_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* OTPC_READY: OTPC status. */
  #define OTPC_READY_ResetValue (0x00000001UL)       /*!< Reset value of READY register.                                       */

/* READY @Bit 0 : The OTPC is ready or busy */
  #define OTPC_READY_READY_Pos (0UL)                 /*!< Position of READY field.                                             */
  #define OTPC_READY_READY_Msk (0x1UL << OTPC_READY_READY_Pos) /*!< Bit mask of READY field.                                   */
  #define OTPC_READY_READY_Min (0x0UL)               /*!< Min enumerator value of READY field.                                 */
  #define OTPC_READY_READY_Max (0x1UL)               /*!< Max enumerator value of READY field.                                 */
  #define OTPC_READY_READY_Busy (0x0UL)              /*!< OTPC is busy.                                                        */
  #define OTPC_READY_READY_Ready (0x1UL)             /*!< Current operation is completed and OTPC is ready.                    */


/* OTPC_READYNEXT: Ready next flag. */
  #define OTPC_READYNEXT_ResetValue (0x00000001UL)   /*!< Reset value of READYNEXT register.                                   */

/* READYNEXT @Bit 0 : OTPC can accept a new write operation. */
  #define OTPC_READYNEXT_READYNEXT_Pos (0UL)         /*!< Position of READYNEXT field.                                         */
  #define OTPC_READYNEXT_READYNEXT_Msk (0x1UL << OTPC_READYNEXT_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define OTPC_READYNEXT_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define OTPC_READYNEXT_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define OTPC_READYNEXT_READYNEXT_Busy (0x0UL)      /*!< OTPC cannot accept any write operation.                              */
  #define OTPC_READYNEXT_READYNEXT_Ready (0x1UL)     /*!< OTPC is ready to accept a new write operation.                       */


/* OTPC_CONFIG: Configuration register. */
  #define OTPC_CONFIG_ResetValue (0x00000000UL)      /*!< Reset value of CONFIG register.                                      */

/* WEN @Bit 0 : When the write is enabled, the writes to OTP are allowed, otherwise the write is ignored. The OTP read is
                allowed regardless of WEN setting. */

  #define OTPC_CONFIG_WEN_Pos (0UL)                  /*!< Position of WEN field.                                               */
  #define OTPC_CONFIG_WEN_Msk (0x1UL << OTPC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field.                                       */
  #define OTPC_CONFIG_WEN_Min (0x0UL)                /*!< Min enumerator value of WEN field.                                   */
  #define OTPC_CONFIG_WEN_Max (0x1UL)                /*!< Max enumerator value of WEN field.                                   */
  #define OTPC_CONFIG_WEN_DisableWrite (0x0UL)       /*!< Write is disabled.                                                   */
  #define OTPC_CONFIG_WEN_EnableWrite (0x1UL)        /*!< Write is enabled.                                                    */


/* OTPC_WAITSTATES: Wait states for OTP read. */
  #define OTPC_WAITSTATES_ResetValue (0x0000000BUL)  /*!< Reset value of WAITSTATES register.                                  */

/* WAITSTATENUM @Bits 0..6 : Register to read the current number of wait states for the OTP read and to set a new value. */
  #define OTPC_WAITSTATES_WAITSTATENUM_Pos (0UL)     /*!< Position of WAITSTATENUM field.                                      */
  #define OTPC_WAITSTATES_WAITSTATENUM_Msk (0x7FUL << OTPC_WAITSTATES_WAITSTATENUM_Pos) /*!< Bit mask of WAITSTATENUM field.   */

/* KEY @Bits 16..31 : Key to enable the writing to this register. Writes to this register are ignored if KEY is not set to
                      0xA66D. */

  #define OTPC_WAITSTATES_KEY_Pos (16UL)             /*!< Position of KEY field.                                               */
  #define OTPC_WAITSTATES_KEY_Msk (0xFFFFUL << OTPC_WAITSTATES_KEY_Pos) /*!< Bit mask of KEY field.                            */
  #define OTPC_WAITSTATES_KEY_Min (0xA66DUL)         /*!< Min enumerator value of KEY field.                                   */
  #define OTPC_WAITSTATES_KEY_Max (0xA66DUL)         /*!< Max enumerator value of KEY field.                                   */
  #define OTPC_WAITSTATES_KEY_Allowed (0xA66DUL)     /*!< Write is allowed.                                                    */


/* OTPC_STANDBYTIMEOUT: Timeout to go into standby mode. */
  #define OTPC_STANDBYTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of STANDBYTIMEOUT register.                           */

/* TIMEOUT @Bits 0..8 : Timeout in terms of OTPC clock cycles, based on FREQUENCY. */
  #define OTPC_STANDBYTIMEOUT_TIMEOUT_Pos (0UL)      /*!< Position of TIMEOUT field.                                           */
  #define OTPC_STANDBYTIMEOUT_TIMEOUT_Msk (0x1FFUL << OTPC_STANDBYTIMEOUT_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.         */
  #define OTPC_STANDBYTIMEOUT_TIMEOUT_Min (0x000UL)  /*!< Min value of TIMEOUT field.                                          */
  #define OTPC_STANDBYTIMEOUT_TIMEOUT_Max (0x1FFUL)  /*!< Max size of TIMEOUT field.                                           */


