adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OTPC_FREQUENCY: Clock frequency of OTPC. */
  #define OTPC_FREQUENCY_ResetValue (0x00000064UL)   /*!< Reset value of FREQUENCY register.                                   */

/* FREQUENCY @Bits 0..9 : Frequency in MHz. */
  #define OTPC_FREQUENCY_FREQUENCY_Pos (0UL)         /*!< Position of FREQUENCY field.                                         */
  #define OTPC_FREQUENCY_FREQUENCY_Msk (0x3FFUL << OTPC_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field.             */


/* OTPC_REGION: Configuration for region [n] */
  #define OTPC_REGION_MaxCount (6UL)                 /*!< Max size of REGION[6] array.                                         */
  #define OTPC_REGION_MaxIndex (5UL)                 /*!< Max index of REGION[6] array.                                        */
  #define OTPC_REGION_MinIndex (0UL)                 /*!< Min index of REGION[6] array.                                        */
  #define OTPC_REGION_ResetValue (0x00000000UL)      /*!< Reset value of REGION[6] register.                                   */

/* READ @Bit 0 : Read configuration to the region [n]. */
  #define OTPC_REGION_READ_Pos (0UL)                 /*!< Position of READ field.                                              */
  #define OTPC_REGION_READ_Msk (0x1UL << OTPC_REGION_READ_Pos) /*!< Bit mask of READ field.                                    */
  #define OTPC_REGION_READ_Min (0x0UL)               /*!< Min enumerator value of READ field.                                  */
  #define OTPC_REGION_READ_Max (0x1UL)               /*!< Max enumerator value of READ field.                                  */
  #define OTPC_REGION_READ_Allowed (0x0UL)           /*!< Reads to the region [n] allowed.                                     */
  #define OTPC_REGION_READ_NotAllowed (0x1UL)        /*!< Reads to the region [n] not allowed.                                 */

/* WRITE @Bit 1 : Write configuration to the region [n]. */
  #define OTPC_REGION_WRITE_Pos (1UL)                /*!< Position of WRITE field.                                             */
  #define OTPC_REGION_WRITE_Msk (0x1UL << OTPC_REGION_WRITE_Pos) /*!< Bit mask of WRITE field.                                 */
  #define OTPC_REGION_WRITE_Min (0x0UL)              /*!< Min enumerator value of WRITE field.                                 */
  #define OTPC_REGION_WRITE_Max (0x1UL)              /*!< Max enumerator value of WRITE field.                                 */
  #define OTPC_REGION_WRITE_Allowed (0x0UL)          /*!< Writes to the region [n] allowed.                                    */
  #define OTPC_REGION_WRITE_NotAllowed (0x1UL)       /*!< Writes to the region [n] not allowed.                                */

/* EXECUTE @Bit 2 : Code execute configuration to the region [n]. */
  #define OTPC_REGION_EXECUTE_Pos (2UL)              /*!< Position of EXECUTE field.                                           */
  #define OTPC_REGION_EXECUTE_Msk (0x1UL << OTPC_REGION_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.                           */
  #define OTPC_REGION_EXECUTE_Min (0x0UL)            /*!< Min enumerator value of EXECUTE field.                               */
  #define OTPC_REGION_EXECUTE_Max (0x1UL)            /*!< Max enumerator value of EXECUTE field.                               */
  #define OTPC_REGION_EXECUTE_Allowed (0x0UL)        /*!< Code execute from the region [n] allowed.                            */
  #define OTPC_REGION_EXECUTE_NotAllowed (0x1UL)     /*!< Code execute from region [n] not allowed.                            */

/* LOCK @Bit 3 : Lock writes to this register. */
  #define OTPC_REGION_LOCK_Pos (3UL)                 /*!< Position of LOCK field.                                              */
  #define OTPC_REGION_LOCK_Msk (0x1UL << OTPC_REGION_LOCK_Pos) /*!< Bit mask of LOCK field.                                    */
  #define OTPC_REGION_LOCK_Min (0x0UL)               /*!< Min enumerator value of LOCK field.                                  */
  #define OTPC_REGION_LOCK_Max (0x1UL)               /*!< Max enumerator value of LOCK field.                                  */
  #define OTPC_REGION_LOCK_NotLocked (0x0UL)         /*!< Register is not locked.                                              */
  #define OTPC_REGION_LOCK_Locked (0x1UL)            /*!< Register is locked.                                                  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        PCGCMASTER                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct PCGCMASTER ==================================================== */
/**
  * @brief PCGC Master
  */
  typedef struct {                                   /*!< PCGCMASTER Structure                                                 */
    __IM uint32_t RESERVED[56];
    __IOM uint32_t SETPWRCONTHRESHOLDBASE[3];        /*!< (@ 0x000000E0) Set power consumption threshold base for power source /
                                                                         regulator n*/
    __IM uint32_t RESERVED1[709];
    __IOM uint32_t UNLOCKBACKDOORS;                  /*!< (@ 0x00000C00) Unlock backdoors                                      */
    __IOM uint32_t ENABLEPOWERREGFORCE;              /*!< (@ 0x00000C04) Enable power reg force                                */
    __IOM uint32_t POWERREGFORCE;                    /*!< (@ 0x00000C08) Force reg                                             */
    __IM uint32_t RESERVED2;
    __IOM uint32_t MASTERFORCEREG[1];                /*!< (@ 0x00000C10) Force reg                                             */
    __IM uint32_t RESERVED3[59];
    __IOM uint32_t CLOCKFORCEREG[5];                 /*!< (@ 0x00000D00) Force clock n                                         */
  } NRF_PCGCMASTER_Type;                             /*!< Size = 3348 (0xD14)                                                  */

/* PCGCMASTER_SETPWRCONTHRESHOLDBASE: Set power consumption threshold base for power source / regulator n */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_MaxCount (3UL) /*!< Max size of SETPWRCONTHRESHOLDBASE[3] array.                   */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_MaxIndex (2UL) /*!< Max index of SETPWRCONTHRESHOLDBASE[3] array.                  */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_MinIndex (0UL) /*!< Min index of SETPWRCONTHRESHOLDBASE[3] array.                  */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_ResetValue (0x00000000UL) /*!< Reset value of SETPWRCONTHRESHOLDBASE[3] register.  */

/* SETPWRCONTHRESHOLDBASE @Bits 0..3 : SETPWRCONTHRESHOLDBASE */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_SETPWRCONTHRESHOLDBASE_Pos (0UL) /*!< Position of SETPWRCONTHRESHOLDBASE field.    */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_SETPWRCONTHRESHOLDBASE_Msk (0xFUL << PCGCMASTER_SETPWRCONTHRESHOLDBASE_SETPWRCONTHRESHOLDBASE_Pos)
                                                                            /*!< Bit mask of SETPWRCONTHRESHOLDBASE field.*/


/* PCGCMASTER_UNLOCKBACKDOORS: Unlock backdoors */
  #define PCGCMASTER_UNLOCKBACKDOORS_ResetValue (0x00000000UL) /*!< Reset value of UNLOCKBACKDOORS register.                   */

