adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PCGCMASTER_CLOCKFORCEREG: Force clock n */
  #define PCGCMASTER_CLOCKFORCEREG_MaxCount (5UL)    /*!< Max size of CLOCKFORCEREG[5] array.                                  */
  #define PCGCMASTER_CLOCKFORCEREG_MaxIndex (4UL)    /*!< Max index of CLOCKFORCEREG[5] array.                                 */
  #define PCGCMASTER_CLOCKFORCEREG_MinIndex (0UL)    /*!< Min index of CLOCKFORCEREG[5] array.                                 */
  #define PCGCMASTER_CLOCKFORCEREG_ResetValue (0x00000000UL) /*!< Reset value of CLOCKFORCEREG[5] register.                    */

/* ENABLE @Bit 0 : Enable clock forcing */
  #define PCGCMASTER_CLOCKFORCEREG_ENABLE_Pos (0UL)  /*!< Position of ENABLE field.                                            */
  #define PCGCMASTER_CLOCKFORCEREG_ENABLE_Msk (0x1UL << PCGCMASTER_CLOCKFORCEREG_ENABLE_Pos) /*!< Bit mask of ENABLE field.    */

/* CLOCKFORCING @Bit 1 : CLOCKFORCING */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Pos (1UL) /*!< Position of CLOCKFORCING field.                                 */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Msk (0x1UL << PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Pos) /*!< Bit mask of
                                                                            CLOCKFORCING field.*/

/* CLOCKSOURCEFORCING @Bits 2..4 : CLOCKSOURCEFORCING */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Pos (2UL) /*!< Position of CLOCKSOURCEFORCING field.                     */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Msk (0x7UL << PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Pos) /*!< Bit
                                                                            mask of CLOCKSOURCEFORCING field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         PCGCSLAVE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct PCGCSLAVE ===================================================== */
/**
  * @brief PCGCSlave
  */
  typedef struct {                                   /*!< PCGCSLAVE Structure                                                  */
    __IM uint32_t RESERVED[768];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM uint32_t PENALTY[5];                     /*!< (@ 0x00000C00) Penalty level for power/clock pair n. When
                                                                         FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                                                         address overlaps the PENALTY0 address and register
                                                                         description for PENALTY[0] is not valid.*/
      __IOM uint32_t PENALTY0;                       /*!< (@ 0x00000C00) Penalty level for power/clock pair 0. The register
                                                                         description is valid only when FULL_PCP_ZERO feature is
                                                                         not supported*/
      __IM uint32_t RESERVED1[5];
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IM uint32_t RESERVED2[27];
    __IOM uint32_t FORCEOVERRIDE[5];                 /*!< (@ 0x00000C80) Force override of power/clock pair n.                 */
  } NRF_PCGCSLAVE_Type;                              /*!< Size = 3220 (0xC94)                                                  */

/* PCGCSLAVE_PENALTY: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address
                       overlaps the PENALTY0 address and register description for PENALTY[0] is not valid. */

  #define PCGCSLAVE_PENALTY_MaxCount (5UL)           /*!< Max size of PENALTY[5] array.                                        */
  #define PCGCSLAVE_PENALTY_MaxIndex (4UL)           /*!< Max index of PENALTY[5] array.                                       */
  #define PCGCSLAVE_PENALTY_MinIndex (0UL)           /*!< Min index of PENALTY[5] array.                                       */
  #define PCGCSLAVE_PENALTY_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PENALTY[5] register.                                 */

/* PENALTY @Bits 0..1 : Penalty level */
  #define PCGCSLAVE_PENALTY_PENALTY_Pos (0UL)        /*!< Position of PENALTY field.                                           */
  #define PCGCSLAVE_PENALTY_PENALTY_Msk (0x3UL << PCGCSLAVE_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.               */


/* PCGCSLAVE_PENALTY0: Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature
                        is not supported */

  #define PCGCSLAVE_PENALTY0_ResetValue (0x00000000UL) /*!< Reset value of PENALTY0 register.                                  */

/* PENALTY @Bits 0..1 : Penalty level */
  #define PCGCSLAVE_PENALTY0_PENALTY_Pos (0UL)       /*!< Position of PENALTY field.                                           */
  #define PCGCSLAVE_PENALTY0_PENALTY_Msk (0x3UL << PCGCSLAVE_PENALTY0_PENALTY_Pos) /*!< Bit mask of PENALTY field.             */


/* PCGCSLAVE_FORCEOVERRIDE: Force override of power/clock pair n. */
  #define PCGCSLAVE_FORCEOVERRIDE_MaxCount (5UL)     /*!< Max size of FORCEOVERRIDE[5] array.                                  */
  #define PCGCSLAVE_FORCEOVERRIDE_MaxIndex (4UL)     /*!< Max index of FORCEOVERRIDE[5] array.                                 */
  #define PCGCSLAVE_FORCEOVERRIDE_MinIndex (0UL)     /*!< Min index of FORCEOVERRIDE[5] array.                                 */
  #define PCGCSLAVE_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[5] register.                     */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                            */
  #define PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!< Bit mask of
                                                                            CLOCKFORCINGPRE field.*/

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                            */
  #define PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!< Bit mask of
                                                                            DOFORCECLOCKPRE field.*/

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                            */
  #define PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!< Bit mask of
                                                                            POWERFORCINGPRE field.*/

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                           */
  #define PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!< Bit mask of
                                                                            DOFORCEPOWERPRE field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           PCRM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

