adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* =================================================== Struct PCRM_REQUEST =================================================== */
/**
  * @brief REQUEST [PCRM_REQUEST] (unspecified)
  */
typedef struct {
  __IM  uint32_t  STATUS;                            /*!< (@ 0x00000000) Request status for consumers                          */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  ACKSTATUS;                         /*!< (@ 0x00000008) Ack status for the request for consumers              */
  __IM  uint32_t  RESERVED1;
} NRF_PCRM_REQUEST_Type;                             /*!< Size = 16 (0x010)                                                    */

/* PCRM_REQUEST_STATUS: Request status for consumers */
  #define PCRM_REQUEST_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                   */

/* CONSUMER0 @Bit 0 : Status of the request for consumer 0 */
  #define PCRM_REQUEST_STATUS_CONSUMER0_Pos (0UL)    /*!< Position of CONSUMER0 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER0_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER0_Pos) /*!< Bit mask of CONSUMER0 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER0_Min (0x0UL)  /*!< Min enumerator value of CONSUMER0 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER0_Max (0x1UL)  /*!< Max enumerator value of CONSUMER0 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER0_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER0_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER1 @Bit 1 : Status of the request for consumer 1 */
  #define PCRM_REQUEST_STATUS_CONSUMER1_Pos (1UL)    /*!< Position of CONSUMER1 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER1_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER1_Pos) /*!< Bit mask of CONSUMER1 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER1_Min (0x0UL)  /*!< Min enumerator value of CONSUMER1 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER1_Max (0x1UL)  /*!< Max enumerator value of CONSUMER1 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER1_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER1_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER2 @Bit 2 : Status of the request for consumer 2 */
  #define PCRM_REQUEST_STATUS_CONSUMER2_Pos (2UL)    /*!< Position of CONSUMER2 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER2_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER2_Pos) /*!< Bit mask of CONSUMER2 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER2_Min (0x0UL)  /*!< Min enumerator value of CONSUMER2 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER2_Max (0x1UL)  /*!< Max enumerator value of CONSUMER2 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER2_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER2_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER3 @Bit 3 : Status of the request for consumer 3 */
  #define PCRM_REQUEST_STATUS_CONSUMER3_Pos (3UL)    /*!< Position of CONSUMER3 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER3_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER3_Pos) /*!< Bit mask of CONSUMER3 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER3_Min (0x0UL)  /*!< Min enumerator value of CONSUMER3 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER3_Max (0x1UL)  /*!< Max enumerator value of CONSUMER3 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER3_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER3_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER4 @Bit 4 : Status of the request for consumer 4 */
  #define PCRM_REQUEST_STATUS_CONSUMER4_Pos (4UL)    /*!< Position of CONSUMER4 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER4_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER4_Pos) /*!< Bit mask of CONSUMER4 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER4_Min (0x0UL)  /*!< Min enumerator value of CONSUMER4 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER4_Max (0x1UL)  /*!< Max enumerator value of CONSUMER4 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER4_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER4_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER5 @Bit 5 : Status of the request for consumer 5 */
  #define PCRM_REQUEST_STATUS_CONSUMER5_Pos (5UL)    /*!< Position of CONSUMER5 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER5_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER5_Pos) /*!< Bit mask of CONSUMER5 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER5_Min (0x0UL)  /*!< Min enumerator value of CONSUMER5 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER5_Max (0x1UL)  /*!< Max enumerator value of CONSUMER5 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER5_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER5_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER6 @Bit 6 : Status of the request for consumer 6 */
  #define PCRM_REQUEST_STATUS_CONSUMER6_Pos (6UL)    /*!< Position of CONSUMER6 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER6_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER6_Pos) /*!< Bit mask of CONSUMER6 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER6_Min (0x0UL)  /*!< Min enumerator value of CONSUMER6 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER6_Max (0x1UL)  /*!< Max enumerator value of CONSUMER6 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER6_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER6_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER7 @Bit 7 : Status of the request for consumer 7 */
  #define PCRM_REQUEST_STATUS_CONSUMER7_Pos (7UL)    /*!< Position of CONSUMER7 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER7_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER7_Pos) /*!< Bit mask of CONSUMER7 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER7_Min (0x0UL)  /*!< Min enumerator value of CONSUMER7 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER7_Max (0x1UL)  /*!< Max enumerator value of CONSUMER7 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER7_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER7_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER8 @Bit 8 : Status of the request for consumer 8 */
  #define PCRM_REQUEST_STATUS_CONSUMER8_Pos (8UL)    /*!< Position of CONSUMER8 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER8_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER8_Pos) /*!< Bit mask of CONSUMER8 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER8_Min (0x0UL)  /*!< Min enumerator value of CONSUMER8 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER8_Max (0x1UL)  /*!< Max enumerator value of CONSUMER8 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER8_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER8_Rising (0x1UL) /*!< Request rising                                                     */

