adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CONSUMER9 @Bit 9 : Status of the request for consumer 9 */
  #define PCRM_REQUEST_STATUS_CONSUMER9_Pos (9UL)    /*!< Position of CONSUMER9 field.                                         */
  #define PCRM_REQUEST_STATUS_CONSUMER9_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER9_Pos) /*!< Bit mask of CONSUMER9 field.     */
  #define PCRM_REQUEST_STATUS_CONSUMER9_Min (0x0UL)  /*!< Min enumerator value of CONSUMER9 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER9_Max (0x1UL)  /*!< Max enumerator value of CONSUMER9 field.                             */
  #define PCRM_REQUEST_STATUS_CONSUMER9_Falling (0x0UL) /*!< Request falling                                                   */
  #define PCRM_REQUEST_STATUS_CONSUMER9_Rising (0x1UL) /*!< Request rising                                                     */

/* CONSUMER10 @Bit 10 : Status of the request for consumer 10 */
  #define PCRM_REQUEST_STATUS_CONSUMER10_Pos (10UL)  /*!< Position of CONSUMER10 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER10_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER10_Pos) /*!< Bit mask of CONSUMER10 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER10_Min (0x0UL) /*!< Min enumerator value of CONSUMER10 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER10_Max (0x1UL) /*!< Max enumerator value of CONSUMER10 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER10_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER10_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER11 @Bit 11 : Status of the request for consumer 11 */
  #define PCRM_REQUEST_STATUS_CONSUMER11_Pos (11UL)  /*!< Position of CONSUMER11 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER11_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER11_Pos) /*!< Bit mask of CONSUMER11 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER11_Min (0x0UL) /*!< Min enumerator value of CONSUMER11 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER11_Max (0x1UL) /*!< Max enumerator value of CONSUMER11 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER11_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER11_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER12 @Bit 12 : Status of the request for consumer 12 */
  #define PCRM_REQUEST_STATUS_CONSUMER12_Pos (12UL)  /*!< Position of CONSUMER12 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER12_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER12_Pos) /*!< Bit mask of CONSUMER12 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER12_Min (0x0UL) /*!< Min enumerator value of CONSUMER12 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER12_Max (0x1UL) /*!< Max enumerator value of CONSUMER12 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER12_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER12_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER13 @Bit 13 : Status of the request for consumer 13 */
  #define PCRM_REQUEST_STATUS_CONSUMER13_Pos (13UL)  /*!< Position of CONSUMER13 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER13_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER13_Pos) /*!< Bit mask of CONSUMER13 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER13_Min (0x0UL) /*!< Min enumerator value of CONSUMER13 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER13_Max (0x1UL) /*!< Max enumerator value of CONSUMER13 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER13_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER13_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER14 @Bit 14 : Status of the request for consumer 14 */
  #define PCRM_REQUEST_STATUS_CONSUMER14_Pos (14UL)  /*!< Position of CONSUMER14 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER14_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER14_Pos) /*!< Bit mask of CONSUMER14 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER14_Min (0x0UL) /*!< Min enumerator value of CONSUMER14 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER14_Max (0x1UL) /*!< Max enumerator value of CONSUMER14 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER14_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER14_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER15 @Bit 15 : Status of the request for consumer 15 */
  #define PCRM_REQUEST_STATUS_CONSUMER15_Pos (15UL)  /*!< Position of CONSUMER15 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER15_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER15_Pos) /*!< Bit mask of CONSUMER15 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER15_Min (0x0UL) /*!< Min enumerator value of CONSUMER15 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER15_Max (0x1UL) /*!< Max enumerator value of CONSUMER15 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER15_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER15_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER16 @Bit 16 : Status of the request for consumer 16 */
  #define PCRM_REQUEST_STATUS_CONSUMER16_Pos (16UL)  /*!< Position of CONSUMER16 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER16_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER16_Pos) /*!< Bit mask of CONSUMER16 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER16_Min (0x0UL) /*!< Min enumerator value of CONSUMER16 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER16_Max (0x1UL) /*!< Max enumerator value of CONSUMER16 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER16_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER16_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER17 @Bit 17 : Status of the request for consumer 17 */
  #define PCRM_REQUEST_STATUS_CONSUMER17_Pos (17UL)  /*!< Position of CONSUMER17 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER17_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER17_Pos) /*!< Bit mask of CONSUMER17 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER17_Min (0x0UL) /*!< Min enumerator value of CONSUMER17 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER17_Max (0x1UL) /*!< Max enumerator value of CONSUMER17 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER17_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER17_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER18 @Bit 18 : Status of the request for consumer 18 */
  #define PCRM_REQUEST_STATUS_CONSUMER18_Pos (18UL)  /*!< Position of CONSUMER18 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER18_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER18_Pos) /*!< Bit mask of CONSUMER18 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER18_Min (0x0UL) /*!< Min enumerator value of CONSUMER18 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER18_Max (0x1UL) /*!< Max enumerator value of CONSUMER18 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER18_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER18_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER19 @Bit 19 : Status of the request for consumer 19 */
  #define PCRM_REQUEST_STATUS_CONSUMER19_Pos (19UL)  /*!< Position of CONSUMER19 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER19_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER19_Pos) /*!< Bit mask of CONSUMER19 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER19_Min (0x0UL) /*!< Min enumerator value of CONSUMER19 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER19_Max (0x1UL) /*!< Max enumerator value of CONSUMER19 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER19_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER19_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER20 @Bit 20 : Status of the request for consumer 20 */
  #define PCRM_REQUEST_STATUS_CONSUMER20_Pos (20UL)  /*!< Position of CONSUMER20 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER20_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER20_Pos) /*!< Bit mask of CONSUMER20 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER20_Min (0x0UL) /*!< Min enumerator value of CONSUMER20 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER20_Max (0x1UL) /*!< Max enumerator value of CONSUMER20 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER20_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER20_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER21 @Bit 21 : Status of the request for consumer 21 */
  #define PCRM_REQUEST_STATUS_CONSUMER21_Pos (21UL)  /*!< Position of CONSUMER21 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER21_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER21_Pos) /*!< Bit mask of CONSUMER21 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER21_Min (0x0UL) /*!< Min enumerator value of CONSUMER21 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER21_Max (0x1UL) /*!< Max enumerator value of CONSUMER21 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER21_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER21_Rising (0x1UL) /*!< Request rising                                                    */

