adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CONSUMER22 @Bit 22 : Status of the request for consumer 22 */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Pos (22UL)  /*!< Position of CONSUMER22 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER22_Pos) /*!< Bit mask of CONSUMER22 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Min (0x0UL) /*!< Min enumerator value of CONSUMER22 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Max (0x1UL) /*!< Max enumerator value of CONSUMER22 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER23 @Bit 23 : Status of the request for consumer 23 */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Pos (23UL)  /*!< Position of CONSUMER23 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER23_Pos) /*!< Bit mask of CONSUMER23 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Min (0x0UL) /*!< Min enumerator value of CONSUMER23 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Max (0x1UL) /*!< Max enumerator value of CONSUMER23 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER24 @Bit 24 : Status of the request for consumer 24 */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Pos (24UL)  /*!< Position of CONSUMER24 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER24_Pos) /*!< Bit mask of CONSUMER24 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Min (0x0UL) /*!< Min enumerator value of CONSUMER24 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Max (0x1UL) /*!< Max enumerator value of CONSUMER24 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER25 @Bit 25 : Status of the request for consumer 25 */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Pos (25UL)  /*!< Position of CONSUMER25 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER25_Pos) /*!< Bit mask of CONSUMER25 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Min (0x0UL) /*!< Min enumerator value of CONSUMER25 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Max (0x1UL) /*!< Max enumerator value of CONSUMER25 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER26 @Bit 26 : Status of the request for consumer 26 */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Pos (26UL)  /*!< Position of CONSUMER26 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER26_Pos) /*!< Bit mask of CONSUMER26 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Min (0x0UL) /*!< Min enumerator value of CONSUMER26 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Max (0x1UL) /*!< Max enumerator value of CONSUMER26 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER27 @Bit 27 : Status of the request for consumer 27 */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Pos (27UL)  /*!< Position of CONSUMER27 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER27_Pos) /*!< Bit mask of CONSUMER27 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Min (0x0UL) /*!< Min enumerator value of CONSUMER27 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Max (0x1UL) /*!< Max enumerator value of CONSUMER27 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Rising (0x1UL) /*!< Request rising                                                    */


/* PCRM_REQUEST_ACKSTATUS: Ack status for the request for consumers */
  #define PCRM_REQUEST_ACKSTATUS_ResetValue (0x00000000UL) /*!< Reset value of ACKSTATUS register.                             */

/* CONSUMER0 @Bit 0 : Ack status of the request for consumer [0] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER0_Pos (0UL) /*!< Position of CONSUMER0 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER0_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER0_Pos) /*!< Bit mask of CONSUMER0
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER0_Min (0x0UL) /*!< Min enumerator value of CONSUMER0 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER0_Max (0x1UL) /*!< Max enumerator value of CONSUMER0 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER0_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER0_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER1 @Bit 1 : Ack status of the request for consumer [1] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER1_Pos (1UL) /*!< Position of CONSUMER1 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER1_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER1_Pos) /*!< Bit mask of CONSUMER1
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER1_Min (0x0UL) /*!< Min enumerator value of CONSUMER1 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER1_Max (0x1UL) /*!< Max enumerator value of CONSUMER1 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER1_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER1_AckReceived (0x1UL) /*!< Ack received                                               */

