adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CONSUMER2 @Bit 2 : Ack status of the request for consumer [2] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER2_Pos (2UL) /*!< Position of CONSUMER2 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER2_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER2_Pos) /*!< Bit mask of CONSUMER2
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER2_Min (0x0UL) /*!< Min enumerator value of CONSUMER2 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER2_Max (0x1UL) /*!< Max enumerator value of CONSUMER2 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER2_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER2_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER3 @Bit 3 : Ack status of the request for consumer [3] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER3_Pos (3UL) /*!< Position of CONSUMER3 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER3_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER3_Pos) /*!< Bit mask of CONSUMER3
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER3_Min (0x0UL) /*!< Min enumerator value of CONSUMER3 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER3_Max (0x1UL) /*!< Max enumerator value of CONSUMER3 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER3_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER3_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER4 @Bit 4 : Ack status of the request for consumer [4] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER4_Pos (4UL) /*!< Position of CONSUMER4 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER4_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER4_Pos) /*!< Bit mask of CONSUMER4
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER4_Min (0x0UL) /*!< Min enumerator value of CONSUMER4 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER4_Max (0x1UL) /*!< Max enumerator value of CONSUMER4 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER4_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER4_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER5 @Bit 5 : Ack status of the request for consumer [5] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER5_Pos (5UL) /*!< Position of CONSUMER5 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER5_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER5_Pos) /*!< Bit mask of CONSUMER5
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER5_Min (0x0UL) /*!< Min enumerator value of CONSUMER5 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER5_Max (0x1UL) /*!< Max enumerator value of CONSUMER5 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER5_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER5_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER6 @Bit 6 : Ack status of the request for consumer [6] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER6_Pos (6UL) /*!< Position of CONSUMER6 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER6_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER6_Pos) /*!< Bit mask of CONSUMER6
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER6_Min (0x0UL) /*!< Min enumerator value of CONSUMER6 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER6_Max (0x1UL) /*!< Max enumerator value of CONSUMER6 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER6_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER6_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER7 @Bit 7 : Ack status of the request for consumer [7] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER7_Pos (7UL) /*!< Position of CONSUMER7 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER7_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER7_Pos) /*!< Bit mask of CONSUMER7
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER7_Min (0x0UL) /*!< Min enumerator value of CONSUMER7 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER7_Max (0x1UL) /*!< Max enumerator value of CONSUMER7 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER7_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER7_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER8 @Bit 8 : Ack status of the request for consumer [8] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER8_Pos (8UL) /*!< Position of CONSUMER8 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER8_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER8_Pos) /*!< Bit mask of CONSUMER8
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER8_Min (0x0UL) /*!< Min enumerator value of CONSUMER8 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER8_Max (0x1UL) /*!< Max enumerator value of CONSUMER8 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER8_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER8_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER9 @Bit 9 : Ack status of the request for consumer [9] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER9_Pos (9UL) /*!< Position of CONSUMER9 field.                                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER9_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER9_Pos) /*!< Bit mask of CONSUMER9
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER9_Min (0x0UL) /*!< Min enumerator value of CONSUMER9 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER9_Max (0x1UL) /*!< Max enumerator value of CONSUMER9 field.                           */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER9_AckNotReceived (0x0UL) /*!< Ack not received                                        */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER9_AckReceived (0x1UL) /*!< Ack received                                               */

/* CONSUMER10 @Bit 10 : Ack status of the request for consumer [10] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER10_Pos (10UL) /*!< Position of CONSUMER10 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER10_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER10_Pos) /*!< Bit mask of CONSUMER10
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER10_Min (0x0UL) /*!< Min enumerator value of CONSUMER10 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER10_Max (0x1UL) /*!< Max enumerator value of CONSUMER10 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER10_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER10_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER11 @Bit 11 : Ack status of the request for consumer [11] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER11_Pos (11UL) /*!< Position of CONSUMER11 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER11_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER11_Pos) /*!< Bit mask of CONSUMER11
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER11_Min (0x0UL) /*!< Min enumerator value of CONSUMER11 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER11_Max (0x1UL) /*!< Max enumerator value of CONSUMER11 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER11_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER11_AckReceived (0x1UL) /*!< Ack received                                              */

