adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CONSUMER12 @Bit 12 : Ack status of the request for consumer [12] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER12_Pos (12UL) /*!< Position of CONSUMER12 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER12_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER12_Pos) /*!< Bit mask of CONSUMER12
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER12_Min (0x0UL) /*!< Min enumerator value of CONSUMER12 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER12_Max (0x1UL) /*!< Max enumerator value of CONSUMER12 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER12_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER12_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER13 @Bit 13 : Ack status of the request for consumer [13] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER13_Pos (13UL) /*!< Position of CONSUMER13 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER13_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER13_Pos) /*!< Bit mask of CONSUMER13
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER13_Min (0x0UL) /*!< Min enumerator value of CONSUMER13 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER13_Max (0x1UL) /*!< Max enumerator value of CONSUMER13 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER13_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER13_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER14 @Bit 14 : Ack status of the request for consumer [14] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER14_Pos (14UL) /*!< Position of CONSUMER14 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER14_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER14_Pos) /*!< Bit mask of CONSUMER14
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER14_Min (0x0UL) /*!< Min enumerator value of CONSUMER14 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER14_Max (0x1UL) /*!< Max enumerator value of CONSUMER14 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER14_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER14_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER15 @Bit 15 : Ack status of the request for consumer [15] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER15_Pos (15UL) /*!< Position of CONSUMER15 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER15_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER15_Pos) /*!< Bit mask of CONSUMER15
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER15_Min (0x0UL) /*!< Min enumerator value of CONSUMER15 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER15_Max (0x1UL) /*!< Max enumerator value of CONSUMER15 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER15_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER15_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER16 @Bit 16 : Ack status of the request for consumer [16] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER16_Pos (16UL) /*!< Position of CONSUMER16 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER16_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER16_Pos) /*!< Bit mask of CONSUMER16
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER16_Min (0x0UL) /*!< Min enumerator value of CONSUMER16 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER16_Max (0x1UL) /*!< Max enumerator value of CONSUMER16 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER16_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER16_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER17 @Bit 17 : Ack status of the request for consumer [17] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER17_Pos (17UL) /*!< Position of CONSUMER17 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER17_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER17_Pos) /*!< Bit mask of CONSUMER17
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER17_Min (0x0UL) /*!< Min enumerator value of CONSUMER17 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER17_Max (0x1UL) /*!< Max enumerator value of CONSUMER17 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER17_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER17_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER18 @Bit 18 : Ack status of the request for consumer [18] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER18_Pos (18UL) /*!< Position of CONSUMER18 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER18_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER18_Pos) /*!< Bit mask of CONSUMER18
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER18_Min (0x0UL) /*!< Min enumerator value of CONSUMER18 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER18_Max (0x1UL) /*!< Max enumerator value of CONSUMER18 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER18_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER18_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER19 @Bit 19 : Ack status of the request for consumer [19] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER19_Pos (19UL) /*!< Position of CONSUMER19 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER19_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER19_Pos) /*!< Bit mask of CONSUMER19
                                                                            field.*/
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER19_Min (0x0UL) /*!< Min enumerator value of CONSUMER19 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER19_Max (0x1UL) /*!< Max enumerator value of CONSUMER19 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER19_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER19_AckReceived (0x1UL) /*!< Ack received                                              */

