adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VALUE @Bits 0..3 : Threshold value for the load for consumer n. NOTE: actual reset values vary across the register array. */
  #define PCRM_CONFIG_LOAD_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define PCRM_CONFIG_LOAD_VALUE_Msk (0xFUL << PCRM_CONFIG_LOAD_VALUE_Pos) /*!< Bit mask of VALUE field.                       */



/* ================================================== Struct PCRM_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [PCRM_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  REQUEST[28];                       /*!< (@ 0x00000000) Override the request for consumer n                   */
  __IM  uint32_t  RESERVED[36];
  __IOM uint32_t  ACK[28];                           /*!< (@ 0x00000100) Override the Ack for the request for consumer n       */
  __IM  uint32_t  RESERVED1[36];
  __IOM uint32_t  CROSSCURRENT[4];                   /*!< (@ 0x00000200) Override the cross current for rail n                 */
} NRF_PCRM_OVERRIDE_Type;                            /*!< Size = 528 (0x210)                                                   */

/* PCRM_OVERRIDE_REQUEST: Override the request for consumer n */
  #define PCRM_OVERRIDE_REQUEST_MaxCount (28UL)      /*!< Max size of REQUEST[28] array.                                       */
  #define PCRM_OVERRIDE_REQUEST_MaxIndex (27UL)      /*!< Max index of REQUEST[28] array.                                      */
  #define PCRM_OVERRIDE_REQUEST_MinIndex (0UL)       /*!< Min index of REQUEST[28] array.                                      */
  #define PCRM_OVERRIDE_REQUEST_ResetValue (0x00000000UL) /*!< Reset value of REQUEST[28] register.                            */

/* VAL @Bit 0 : Override value for the request for consumer n */
  #define PCRM_OVERRIDE_REQUEST_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define PCRM_OVERRIDE_REQUEST_VAL_Msk (0x1UL << PCRM_OVERRIDE_REQUEST_VAL_Pos) /*!< Bit mask of VAL field.                   */
  #define PCRM_OVERRIDE_REQUEST_VAL_Min (0x0UL)      /*!< Min enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_REQUEST_VAL_Max (0x1UL)      /*!< Max enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_REQUEST_VAL_Clear (0x0UL)    /*!< Request cleared                                                      */
  #define PCRM_OVERRIDE_REQUEST_VAL_Set (0x1UL)      /*!< Request set                                                          */

/* MASK @Bit 31 : Mask to override the request for consumer n */
  #define PCRM_OVERRIDE_REQUEST_MASK_Pos (31UL)      /*!< Position of MASK field.                                              */
  #define PCRM_OVERRIDE_REQUEST_MASK_Msk (0x1UL << PCRM_OVERRIDE_REQUEST_MASK_Pos) /*!< Bit mask of MASK field.                */
  #define PCRM_OVERRIDE_REQUEST_MASK_Min (0x0UL)     /*!< Min enumerator value of MASK field.                                  */
  #define PCRM_OVERRIDE_REQUEST_MASK_Max (0x1UL)     /*!< Max enumerator value of MASK field.                                  */
  #define PCRM_OVERRIDE_REQUEST_MASK_Mask (0x0UL)    /*!< Override value masked                                                */
  #define PCRM_OVERRIDE_REQUEST_MASK_UnMask (0x1UL)  /*!< Override value unmasked                                              */


/* PCRM_OVERRIDE_ACK: Override the Ack for the request for consumer n */
  #define PCRM_OVERRIDE_ACK_MaxCount (28UL)          /*!< Max size of ACK[28] array.                                           */
  #define PCRM_OVERRIDE_ACK_MaxIndex (27UL)          /*!< Max index of ACK[28] array.                                          */
  #define PCRM_OVERRIDE_ACK_MinIndex (0UL)           /*!< Min index of ACK[28] array.                                          */
  #define PCRM_OVERRIDE_ACK_ResetValue (0x00000000UL) /*!< Reset value of ACK[28] register.                                    */

/* VAL @Bit 0 : Override the Ack value for the request for consumer n */
  #define PCRM_OVERRIDE_ACK_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define PCRM_OVERRIDE_ACK_VAL_Msk (0x1UL << PCRM_OVERRIDE_ACK_VAL_Pos) /*!< Bit mask of VAL field.                           */
  #define PCRM_OVERRIDE_ACK_VAL_Min (0x0UL)          /*!< Min enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_ACK_VAL_Max (0x1UL)          /*!< Max enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_ACK_VAL_Clear (0x0UL)        /*!< Ack clear                                                            */
  #define PCRM_OVERRIDE_ACK_VAL_Set (0x1UL)          /*!< Ack set                                                              */

/* MASK @Bit 31 : Mask to override the Ack for the request for consumer n */
  #define PCRM_OVERRIDE_ACK_MASK_Pos (31UL)          /*!< Position of MASK field.                                              */
  #define PCRM_OVERRIDE_ACK_MASK_Msk (0x1UL << PCRM_OVERRIDE_ACK_MASK_Pos) /*!< Bit mask of MASK field.                        */
  #define PCRM_OVERRIDE_ACK_MASK_Min (0x0UL)         /*!< Min enumerator value of MASK field.                                  */
  #define PCRM_OVERRIDE_ACK_MASK_Max (0x1UL)         /*!< Max enumerator value of MASK field.                                  */
  #define PCRM_OVERRIDE_ACK_MASK_Mask (0x0UL)        /*!< Override value masked                                                */
  #define PCRM_OVERRIDE_ACK_MASK_UnMask (0x1UL)      /*!< Override value unmasked                                              */


/* PCRM_OVERRIDE_CROSSCURRENT: Override the cross current for rail n */
  #define PCRM_OVERRIDE_CROSSCURRENT_MaxCount (4UL)  /*!< Max size of CROSSCURRENT[4] array.                                   */
  #define PCRM_OVERRIDE_CROSSCURRENT_MaxIndex (3UL)  /*!< Max index of CROSSCURRENT[4] array.                                  */
  #define PCRM_OVERRIDE_CROSSCURRENT_MinIndex (0UL)  /*!< Min index of CROSSCURRENT[4] array.                                  */
  #define PCRM_OVERRIDE_CROSSCURRENT_ResetValue (0x00000000UL) /*!< Reset value of CROSSCURRENT[4] register.                   */

/* VAL @Bit 0 : Override value for the cross current for rail n */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Msk (0x1UL << PCRM_OVERRIDE_CROSSCURRENT_VAL_Pos) /*!< Bit mask of VAL field.         */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Min (0x0UL) /*!< Min enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Max (0x1UL) /*!< Max enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Disabled (0x0UL) /*!< Cross current disabled                                          */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Enabled (0x1UL) /*!< Cross current enabled                                            */

/* MASK @Bit 31 : Mask to override the cross current value for rail n */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Pos (31UL) /*!< Position of MASK field.                                              */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Msk (0x1UL << PCRM_OVERRIDE_CROSSCURRENT_MASK_Pos) /*!< Bit mask of MASK field.      */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Min (0x0UL) /*!< Min enumerator value of MASK field.                                 */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Max (0x1UL) /*!< Max enumerator value of MASK field.                                 */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Mask (0x0UL) /*!< Override value masked                                              */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_UnMask (0x1UL) /*!< Override value unmasked                                          */


/* ======================================================= Struct PCRM ======================================================= */
/**
  * @brief PCRM
  */
  typedef struct {                                   /*!< PCRM Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_REQUESTRISING[28];         /*!< (@ 0x00000100) Request rising for the consumer n                     */
    __IM uint32_t RESERVED1[36];
    __IOM uint32_t EVENTS_REQUESTFALLING[28];        /*!< (@ 0x00000200) Request falling for the consumer n                    */
    __IM uint32_t RESERVED2[36];
    __IOM uint32_t EVENTS_LOADCHANGERAIL[4];         /*!< (@ 0x00000300) Load change on rail n                                 */
    __IM uint32_t RESERVED3[60];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000400) Enable or disable interrupt                           */
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000404) Enable or disable interrupt                           */
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000408) Enable or disable interrupt                           */
    __IOM uint32_t INTEN3;                           /*!< (@ 0x0000040C) Enable or disable interrupt                           */
    __IOM uint32_t INTEN4;                           /*!< (@ 0x00000410) Enable or disable interrupt                           */
    __IM uint32_t RESERVED4[3];
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000420) Enable interrupt                                      */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000424) Enable interrupt                                      */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000428) Enable interrupt                                      */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x0000042C) Enable interrupt                                      */
    __IOM uint32_t INTENSET4;                        /*!< (@ 0x00000430) Enable interrupt                                      */
    __IM uint32_t RESERVED5[3];
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000440) Disable interrupt                                     */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000444) Disable interrupt                                     */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000448) Disable interrupt                                     */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x0000044C) Disable interrupt                                     */
    __IOM uint32_t INTENCLR4;                        /*!< (@ 0x00000450) Disable interrupt                                     */
    __IM uint32_t RESERVED6[3];
    __IM uint32_t INTPEND0;                          /*!< (@ 0x00000460) Pending interrupts                                    */
    __IM uint32_t INTPEND1;                          /*!< (@ 0x00000464) Pending interrupts                                    */
    __IM uint32_t INTPEND2;                          /*!< (@ 0x00000468) Pending interrupts                                    */
    __IM uint32_t INTPEND3;                          /*!< (@ 0x0000046C) Pending interrupts                                    */
    __IM uint32_t INTPEND4;                          /*!< (@ 0x00000470) Pending interrupts                                    */
    __IM uint32_t RESERVED7[99];
    __IOM NRF_PCRM_REQUEST_Type REQUEST;             /*!< (@ 0x00000600) (unspecified)                                         */
    __IOM NRF_PCRM_RAIL_Type RAIL;                   /*!< (@ 0x00000610) (unspecified)                                         */
    __IM uint32_t RESERVED8[12];
    __IOM NRF_PCRM_CONFIG_Type CONFIG;               /*!< (@ 0x00000650) (unspecified)                                         */
    __IM uint32_t RESERVED9[36];
    __IOM NRF_PCRM_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000750) (unspecified)                                         */
  } NRF_PCRM_Type;                                   /*!< Size = 2400 (0x960)                                                  */

/* PCRM_EVENTS_REQUESTRISING: Request rising for the consumer n */
  #define PCRM_EVENTS_REQUESTRISING_MaxCount (28UL)  /*!< Max size of EVENTS_REQUESTRISING[28] array.                          */
  #define PCRM_EVENTS_REQUESTRISING_MaxIndex (27UL)  /*!< Max index of EVENTS_REQUESTRISING[28] array.                         */
  #define PCRM_EVENTS_REQUESTRISING_MinIndex (0UL)   /*!< Min index of EVENTS_REQUESTRISING[28] array.                         */
  #define PCRM_EVENTS_REQUESTRISING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_REQUESTRISING[28] register.           */

/* EVENTS_REQUESTRISING @Bit 0 : Request rising for the consumer n */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Pos (0UL) /*!< Position of EVENTS_REQUESTRISING field.                */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Msk (0x1UL << PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Pos) /*!<
                                                                            Bit mask of EVENTS_REQUESTRISING field.*/
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Min (0x0UL) /*!< Min enumerator value of EVENTS_REQUESTRISING field.  */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Max (0x1UL) /*!< Max enumerator value of EVENTS_REQUESTRISING field.  */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Generated (0x1UL) /*!< Event generated                                */


