adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING6 @Bit 6 : Enable or disable interrupt for event REQUESTRISING[6] */
  #define PCRM_INTEN0_REQUESTRISING6_Pos (6UL)       /*!< Position of REQUESTRISING6 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING6_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING6_Pos) /*!< Bit mask of REQUESTRISING6 field.      */
  #define PCRM_INTEN0_REQUESTRISING6_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTEN0_REQUESTRISING6_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTEN0_REQUESTRISING6_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING6_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING7 @Bit 7 : Enable or disable interrupt for event REQUESTRISING[7] */
  #define PCRM_INTEN0_REQUESTRISING7_Pos (7UL)       /*!< Position of REQUESTRISING7 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING7_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING7_Pos) /*!< Bit mask of REQUESTRISING7 field.      */
  #define PCRM_INTEN0_REQUESTRISING7_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTEN0_REQUESTRISING7_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTEN0_REQUESTRISING7_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING7_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING8 @Bit 8 : Enable or disable interrupt for event REQUESTRISING[8] */
  #define PCRM_INTEN0_REQUESTRISING8_Pos (8UL)       /*!< Position of REQUESTRISING8 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING8_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING8_Pos) /*!< Bit mask of REQUESTRISING8 field.      */
  #define PCRM_INTEN0_REQUESTRISING8_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTEN0_REQUESTRISING8_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTEN0_REQUESTRISING8_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING8_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING9 @Bit 9 : Enable or disable interrupt for event REQUESTRISING[9] */
  #define PCRM_INTEN0_REQUESTRISING9_Pos (9UL)       /*!< Position of REQUESTRISING9 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING9_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING9_Pos) /*!< Bit mask of REQUESTRISING9 field.      */
  #define PCRM_INTEN0_REQUESTRISING9_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTEN0_REQUESTRISING9_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTEN0_REQUESTRISING9_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING9_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING10 @Bit 10 : Enable or disable interrupt for event REQUESTRISING[10] */
  #define PCRM_INTEN0_REQUESTRISING10_Pos (10UL)     /*!< Position of REQUESTRISING10 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING10_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING10_Pos) /*!< Bit mask of REQUESTRISING10 field.   */
  #define PCRM_INTEN0_REQUESTRISING10_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTEN0_REQUESTRISING10_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTEN0_REQUESTRISING10_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING10_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING11 @Bit 11 : Enable or disable interrupt for event REQUESTRISING[11] */
  #define PCRM_INTEN0_REQUESTRISING11_Pos (11UL)     /*!< Position of REQUESTRISING11 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING11_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING11_Pos) /*!< Bit mask of REQUESTRISING11 field.   */
  #define PCRM_INTEN0_REQUESTRISING11_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTEN0_REQUESTRISING11_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTEN0_REQUESTRISING11_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING11_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING12 @Bit 12 : Enable or disable interrupt for event REQUESTRISING[12] */
  #define PCRM_INTEN0_REQUESTRISING12_Pos (12UL)     /*!< Position of REQUESTRISING12 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING12_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING12_Pos) /*!< Bit mask of REQUESTRISING12 field.   */
  #define PCRM_INTEN0_REQUESTRISING12_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTEN0_REQUESTRISING12_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTEN0_REQUESTRISING12_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING12_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING13 @Bit 13 : Enable or disable interrupt for event REQUESTRISING[13] */
  #define PCRM_INTEN0_REQUESTRISING13_Pos (13UL)     /*!< Position of REQUESTRISING13 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING13_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING13_Pos) /*!< Bit mask of REQUESTRISING13 field.   */
  #define PCRM_INTEN0_REQUESTRISING13_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTEN0_REQUESTRISING13_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTEN0_REQUESTRISING13_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING13_Enabled (0x1UL) /*!< Enable                                                              */

