adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING14 @Bit 14 : Enable or disable interrupt for event REQUESTRISING[14] */
  #define PCRM_INTEN0_REQUESTRISING14_Pos (14UL)     /*!< Position of REQUESTRISING14 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING14_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING14_Pos) /*!< Bit mask of REQUESTRISING14 field.   */
  #define PCRM_INTEN0_REQUESTRISING14_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTEN0_REQUESTRISING14_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTEN0_REQUESTRISING14_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING14_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING15 @Bit 15 : Enable or disable interrupt for event REQUESTRISING[15] */
  #define PCRM_INTEN0_REQUESTRISING15_Pos (15UL)     /*!< Position of REQUESTRISING15 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING15_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING15_Pos) /*!< Bit mask of REQUESTRISING15 field.   */
  #define PCRM_INTEN0_REQUESTRISING15_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTEN0_REQUESTRISING15_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTEN0_REQUESTRISING15_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING15_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING16 @Bit 16 : Enable or disable interrupt for event REQUESTRISING[16] */
  #define PCRM_INTEN0_REQUESTRISING16_Pos (16UL)     /*!< Position of REQUESTRISING16 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING16_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING16_Pos) /*!< Bit mask of REQUESTRISING16 field.   */
  #define PCRM_INTEN0_REQUESTRISING16_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTEN0_REQUESTRISING16_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTEN0_REQUESTRISING16_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING16_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING17 @Bit 17 : Enable or disable interrupt for event REQUESTRISING[17] */
  #define PCRM_INTEN0_REQUESTRISING17_Pos (17UL)     /*!< Position of REQUESTRISING17 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING17_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING17_Pos) /*!< Bit mask of REQUESTRISING17 field.   */
  #define PCRM_INTEN0_REQUESTRISING17_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTEN0_REQUESTRISING17_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTEN0_REQUESTRISING17_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING17_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING18 @Bit 18 : Enable or disable interrupt for event REQUESTRISING[18] */
  #define PCRM_INTEN0_REQUESTRISING18_Pos (18UL)     /*!< Position of REQUESTRISING18 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING18_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING18_Pos) /*!< Bit mask of REQUESTRISING18 field.   */
  #define PCRM_INTEN0_REQUESTRISING18_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTEN0_REQUESTRISING18_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTEN0_REQUESTRISING18_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING18_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING19 @Bit 19 : Enable or disable interrupt for event REQUESTRISING[19] */
  #define PCRM_INTEN0_REQUESTRISING19_Pos (19UL)     /*!< Position of REQUESTRISING19 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING19_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING19_Pos) /*!< Bit mask of REQUESTRISING19 field.   */
  #define PCRM_INTEN0_REQUESTRISING19_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING19 field.                       */
  #define PCRM_INTEN0_REQUESTRISING19_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING19 field.                       */
  #define PCRM_INTEN0_REQUESTRISING19_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING19_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING20 @Bit 20 : Enable or disable interrupt for event REQUESTRISING[20] */
  #define PCRM_INTEN0_REQUESTRISING20_Pos (20UL)     /*!< Position of REQUESTRISING20 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING20_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING20_Pos) /*!< Bit mask of REQUESTRISING20 field.   */
  #define PCRM_INTEN0_REQUESTRISING20_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING20 field.                       */
  #define PCRM_INTEN0_REQUESTRISING20_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING20 field.                       */
  #define PCRM_INTEN0_REQUESTRISING20_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING20_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING21 @Bit 21 : Enable or disable interrupt for event REQUESTRISING[21] */
  #define PCRM_INTEN0_REQUESTRISING21_Pos (21UL)     /*!< Position of REQUESTRISING21 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING21_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING21_Pos) /*!< Bit mask of REQUESTRISING21 field.   */
  #define PCRM_INTEN0_REQUESTRISING21_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING21 field.                       */
  #define PCRM_INTEN0_REQUESTRISING21_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING21 field.                       */
  #define PCRM_INTEN0_REQUESTRISING21_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING21_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING22 @Bit 22 : Enable or disable interrupt for event REQUESTRISING[22] */
  #define PCRM_INTEN0_REQUESTRISING22_Pos (22UL)     /*!< Position of REQUESTRISING22 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING22_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING22_Pos) /*!< Bit mask of REQUESTRISING22 field.   */
  #define PCRM_INTEN0_REQUESTRISING22_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING22 field.                       */
  #define PCRM_INTEN0_REQUESTRISING22_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING22 field.                       */
  #define PCRM_INTEN0_REQUESTRISING22_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING22_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING23 @Bit 23 : Enable or disable interrupt for event REQUESTRISING[23] */
  #define PCRM_INTEN0_REQUESTRISING23_Pos (23UL)     /*!< Position of REQUESTRISING23 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING23_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING23_Pos) /*!< Bit mask of REQUESTRISING23 field.   */
  #define PCRM_INTEN0_REQUESTRISING23_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING23 field.                       */
  #define PCRM_INTEN0_REQUESTRISING23_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING23 field.                       */
  #define PCRM_INTEN0_REQUESTRISING23_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING23_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING24 @Bit 24 : Enable or disable interrupt for event REQUESTRISING[24] */
  #define PCRM_INTEN0_REQUESTRISING24_Pos (24UL)     /*!< Position of REQUESTRISING24 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING24_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING24_Pos) /*!< Bit mask of REQUESTRISING24 field.   */
  #define PCRM_INTEN0_REQUESTRISING24_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING24 field.                       */
  #define PCRM_INTEN0_REQUESTRISING24_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING24 field.                       */
  #define PCRM_INTEN0_REQUESTRISING24_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING24_Enabled (0x1UL) /*!< Enable                                                              */

