adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTFALLING8 @Bit 8 : Enable or disable interrupt for event REQUESTFALLING[8] */
  #define PCRM_INTEN2_REQUESTFALLING8_Pos (8UL)      /*!< Position of REQUESTFALLING8 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING8_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING8_Pos) /*!< Bit mask of REQUESTFALLING8 field.   */
  #define PCRM_INTEN2_REQUESTFALLING8_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING8_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING8_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING8_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING9 @Bit 9 : Enable or disable interrupt for event REQUESTFALLING[9] */
  #define PCRM_INTEN2_REQUESTFALLING9_Pos (9UL)      /*!< Position of REQUESTFALLING9 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING9_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING9_Pos) /*!< Bit mask of REQUESTFALLING9 field.   */
  #define PCRM_INTEN2_REQUESTFALLING9_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING9_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING9_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING9_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING10 @Bit 10 : Enable or disable interrupt for event REQUESTFALLING[10] */
  #define PCRM_INTEN2_REQUESTFALLING10_Pos (10UL)    /*!< Position of REQUESTFALLING10 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING10_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING10_Pos) /*!< Bit mask of REQUESTFALLING10 field.*/
  #define PCRM_INTEN2_REQUESTFALLING10_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING10 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING10_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING10 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING10_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING10_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING11 @Bit 11 : Enable or disable interrupt for event REQUESTFALLING[11] */
  #define PCRM_INTEN2_REQUESTFALLING11_Pos (11UL)    /*!< Position of REQUESTFALLING11 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING11_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING11_Pos) /*!< Bit mask of REQUESTFALLING11 field.*/
  #define PCRM_INTEN2_REQUESTFALLING11_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING11 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING11_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING11 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING11_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING11_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING12 @Bit 12 : Enable or disable interrupt for event REQUESTFALLING[12] */
  #define PCRM_INTEN2_REQUESTFALLING12_Pos (12UL)    /*!< Position of REQUESTFALLING12 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING12_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING12_Pos) /*!< Bit mask of REQUESTFALLING12 field.*/
  #define PCRM_INTEN2_REQUESTFALLING12_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING12 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING12_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING12 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING12_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING12_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING13 @Bit 13 : Enable or disable interrupt for event REQUESTFALLING[13] */
  #define PCRM_INTEN2_REQUESTFALLING13_Pos (13UL)    /*!< Position of REQUESTFALLING13 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING13_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING13_Pos) /*!< Bit mask of REQUESTFALLING13 field.*/
  #define PCRM_INTEN2_REQUESTFALLING13_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING13 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING13_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING13 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING13_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING13_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING14 @Bit 14 : Enable or disable interrupt for event REQUESTFALLING[14] */
  #define PCRM_INTEN2_REQUESTFALLING14_Pos (14UL)    /*!< Position of REQUESTFALLING14 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING14_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING14_Pos) /*!< Bit mask of REQUESTFALLING14 field.*/
  #define PCRM_INTEN2_REQUESTFALLING14_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING14 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING14_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING14 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING14_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING14_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING15 @Bit 15 : Enable or disable interrupt for event REQUESTFALLING[15] */
  #define PCRM_INTEN2_REQUESTFALLING15_Pos (15UL)    /*!< Position of REQUESTFALLING15 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING15_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING15_Pos) /*!< Bit mask of REQUESTFALLING15 field.*/
  #define PCRM_INTEN2_REQUESTFALLING15_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING15 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING15_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING15 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING15_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING15_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING16 @Bit 16 : Enable or disable interrupt for event REQUESTFALLING[16] */
  #define PCRM_INTEN2_REQUESTFALLING16_Pos (16UL)    /*!< Position of REQUESTFALLING16 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING16_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING16_Pos) /*!< Bit mask of REQUESTFALLING16 field.*/
  #define PCRM_INTEN2_REQUESTFALLING16_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING16 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING16_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING16 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING16_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING16_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING17 @Bit 17 : Enable or disable interrupt for event REQUESTFALLING[17] */
  #define PCRM_INTEN2_REQUESTFALLING17_Pos (17UL)    /*!< Position of REQUESTFALLING17 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING17_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING17_Pos) /*!< Bit mask of REQUESTFALLING17 field.*/
  #define PCRM_INTEN2_REQUESTFALLING17_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING17 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING17_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING17 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING17_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING17_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING18 @Bit 18 : Enable or disable interrupt for event REQUESTFALLING[18] */
  #define PCRM_INTEN2_REQUESTFALLING18_Pos (18UL)    /*!< Position of REQUESTFALLING18 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING18_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING18_Pos) /*!< Bit mask of REQUESTFALLING18 field.*/
  #define PCRM_INTEN2_REQUESTFALLING18_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING18 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING18_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING18 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING18_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING18_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING19 @Bit 19 : Enable or disable interrupt for event REQUESTFALLING[19] */
  #define PCRM_INTEN2_REQUESTFALLING19_Pos (19UL)    /*!< Position of REQUESTFALLING19 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING19_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING19_Pos) /*!< Bit mask of REQUESTFALLING19 field.*/
  #define PCRM_INTEN2_REQUESTFALLING19_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING19 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING19_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING19 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING19_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING19_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING20 @Bit 20 : Enable or disable interrupt for event REQUESTFALLING[20] */
  #define PCRM_INTEN2_REQUESTFALLING20_Pos (20UL)    /*!< Position of REQUESTFALLING20 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING20_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING20_Pos) /*!< Bit mask of REQUESTFALLING20 field.*/
  #define PCRM_INTEN2_REQUESTFALLING20_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING20 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING20_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING20 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING20_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING20_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING21 @Bit 21 : Enable or disable interrupt for event REQUESTFALLING[21] */
  #define PCRM_INTEN2_REQUESTFALLING21_Pos (21UL)    /*!< Position of REQUESTFALLING21 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING21_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING21_Pos) /*!< Bit mask of REQUESTFALLING21 field.*/
  #define PCRM_INTEN2_REQUESTFALLING21_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING21 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING21_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING21 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING21_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING21_Enabled (0x1UL) /*!< Enable                                                             */

