adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTFALLING22 @Bit 22 : Enable or disable interrupt for event REQUESTFALLING[22] */
  #define PCRM_INTEN2_REQUESTFALLING22_Pos (22UL)    /*!< Position of REQUESTFALLING22 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING22_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING22_Pos) /*!< Bit mask of REQUESTFALLING22 field.*/
  #define PCRM_INTEN2_REQUESTFALLING22_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING22 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING22_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING22 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING22_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING22_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING23 @Bit 23 : Enable or disable interrupt for event REQUESTFALLING[23] */
  #define PCRM_INTEN2_REQUESTFALLING23_Pos (23UL)    /*!< Position of REQUESTFALLING23 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING23_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING23_Pos) /*!< Bit mask of REQUESTFALLING23 field.*/
  #define PCRM_INTEN2_REQUESTFALLING23_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING23 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING23_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING23 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING23_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING23_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING24 @Bit 24 : Enable or disable interrupt for event REQUESTFALLING[24] */
  #define PCRM_INTEN2_REQUESTFALLING24_Pos (24UL)    /*!< Position of REQUESTFALLING24 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING24_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING24_Pos) /*!< Bit mask of REQUESTFALLING24 field.*/
  #define PCRM_INTEN2_REQUESTFALLING24_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING24 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING24_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING24 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING24_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING24_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING25 @Bit 25 : Enable or disable interrupt for event REQUESTFALLING[25] */
  #define PCRM_INTEN2_REQUESTFALLING25_Pos (25UL)    /*!< Position of REQUESTFALLING25 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING25_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING25_Pos) /*!< Bit mask of REQUESTFALLING25 field.*/
  #define PCRM_INTEN2_REQUESTFALLING25_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING25 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING25_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING25 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING25_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING25_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING26 @Bit 26 : Enable or disable interrupt for event REQUESTFALLING[26] */
  #define PCRM_INTEN2_REQUESTFALLING26_Pos (26UL)    /*!< Position of REQUESTFALLING26 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING26_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING26_Pos) /*!< Bit mask of REQUESTFALLING26 field.*/
  #define PCRM_INTEN2_REQUESTFALLING26_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING26 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING26_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING26 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING26_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING26_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING27 @Bit 27 : Enable or disable interrupt for event REQUESTFALLING[27] */
  #define PCRM_INTEN2_REQUESTFALLING27_Pos (27UL)    /*!< Position of REQUESTFALLING27 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING27_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING27_Pos) /*!< Bit mask of REQUESTFALLING27 field.*/
  #define PCRM_INTEN2_REQUESTFALLING27_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING27 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING27_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING27 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING27_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING27_Enabled (0x1UL) /*!< Enable                                                             */


/* PCRM_INTEN4: Enable or disable interrupt */
  #define PCRM_INTEN4_ResetValue (0x00000000UL)      /*!< Reset value of INTEN4 register.                                      */

/* LOADCHANGERAIL0 @Bit 0 : Enable or disable interrupt for event LOADCHANGERAIL[0] */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Pos (0UL)      /*!< Position of LOADCHANGERAIL0 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL0_Pos) /*!< Bit mask of LOADCHANGERAIL0 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL1 @Bit 1 : Enable or disable interrupt for event LOADCHANGERAIL[1] */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Pos (1UL)      /*!< Position of LOADCHANGERAIL1 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL1_Pos) /*!< Bit mask of LOADCHANGERAIL1 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL2 @Bit 2 : Enable or disable interrupt for event LOADCHANGERAIL[2] */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Pos (2UL)      /*!< Position of LOADCHANGERAIL2 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL2_Pos) /*!< Bit mask of LOADCHANGERAIL2 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL3 @Bit 3 : Enable or disable interrupt for event LOADCHANGERAIL[3] */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Pos (3UL)      /*!< Position of LOADCHANGERAIL3 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL3_Pos) /*!< Bit mask of LOADCHANGERAIL3 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Enabled (0x1UL) /*!< Enable                                                              */


/* PCRM_INTENSET0: Enable interrupt */
  #define PCRM_INTENSET0_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET0 register.                                   */

/* REQUESTRISING0 @Bit 0 : Write '1' to enable interrupt for event REQUESTRISING[0] */
  #define PCRM_INTENSET0_REQUESTRISING0_Pos (0UL)    /*!< Position of REQUESTRISING0 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING0_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING0_Pos) /*!< Bit mask of REQUESTRISING0 field.*/
  #define PCRM_INTENSET0_REQUESTRISING0_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING0_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING0_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING0_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING0_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING1 @Bit 1 : Write '1' to enable interrupt for event REQUESTRISING[1] */
  #define PCRM_INTENSET0_REQUESTRISING1_Pos (1UL)    /*!< Position of REQUESTRISING1 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING1_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING1_Pos) /*!< Bit mask of REQUESTRISING1 field.*/
  #define PCRM_INTENSET0_REQUESTRISING1_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING1_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING1_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING1_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING1_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING2 @Bit 2 : Write '1' to enable interrupt for event REQUESTRISING[2] */
  #define PCRM_INTENSET0_REQUESTRISING2_Pos (2UL)    /*!< Position of REQUESTRISING2 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING2_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING2_Pos) /*!< Bit mask of REQUESTRISING2 field.*/
  #define PCRM_INTENSET0_REQUESTRISING2_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING2_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING2_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING2_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING2_Enabled (0x1UL) /*!< Read: Enabled                                                     */

