adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING3 @Bit 3 : Write '1' to enable interrupt for event REQUESTRISING[3] */
  #define PCRM_INTENSET0_REQUESTRISING3_Pos (3UL)    /*!< Position of REQUESTRISING3 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING3_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING3_Pos) /*!< Bit mask of REQUESTRISING3 field.*/
  #define PCRM_INTENSET0_REQUESTRISING3_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING3_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING3_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING3_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING3_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING4 @Bit 4 : Write '1' to enable interrupt for event REQUESTRISING[4] */
  #define PCRM_INTENSET0_REQUESTRISING4_Pos (4UL)    /*!< Position of REQUESTRISING4 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING4_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING4_Pos) /*!< Bit mask of REQUESTRISING4 field.*/
  #define PCRM_INTENSET0_REQUESTRISING4_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING4_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING4_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING4_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING4_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING5 @Bit 5 : Write '1' to enable interrupt for event REQUESTRISING[5] */
  #define PCRM_INTENSET0_REQUESTRISING5_Pos (5UL)    /*!< Position of REQUESTRISING5 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING5_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING5_Pos) /*!< Bit mask of REQUESTRISING5 field.*/
  #define PCRM_INTENSET0_REQUESTRISING5_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING5_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING5_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING5_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING5_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING6 @Bit 6 : Write '1' to enable interrupt for event REQUESTRISING[6] */
  #define PCRM_INTENSET0_REQUESTRISING6_Pos (6UL)    /*!< Position of REQUESTRISING6 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING6_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING6_Pos) /*!< Bit mask of REQUESTRISING6 field.*/
  #define PCRM_INTENSET0_REQUESTRISING6_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING6_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING6_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING6_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING6_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING7 @Bit 7 : Write '1' to enable interrupt for event REQUESTRISING[7] */
  #define PCRM_INTENSET0_REQUESTRISING7_Pos (7UL)    /*!< Position of REQUESTRISING7 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING7_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING7_Pos) /*!< Bit mask of REQUESTRISING7 field.*/
  #define PCRM_INTENSET0_REQUESTRISING7_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING7_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING7_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING7_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING7_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING8 @Bit 8 : Write '1' to enable interrupt for event REQUESTRISING[8] */
  #define PCRM_INTENSET0_REQUESTRISING8_Pos (8UL)    /*!< Position of REQUESTRISING8 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING8_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING8_Pos) /*!< Bit mask of REQUESTRISING8 field.*/
  #define PCRM_INTENSET0_REQUESTRISING8_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING8_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING8_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING8_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING8_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING9 @Bit 9 : Write '1' to enable interrupt for event REQUESTRISING[9] */
  #define PCRM_INTENSET0_REQUESTRISING9_Pos (9UL)    /*!< Position of REQUESTRISING9 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING9_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING9_Pos) /*!< Bit mask of REQUESTRISING9 field.*/
  #define PCRM_INTENSET0_REQUESTRISING9_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING9_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING9_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING9_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING9_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING10 @Bit 10 : Write '1' to enable interrupt for event REQUESTRISING[10] */
  #define PCRM_INTENSET0_REQUESTRISING10_Pos (10UL)  /*!< Position of REQUESTRISING10 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING10_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING10_Pos) /*!< Bit mask of REQUESTRISING10
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING10_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING10_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING10_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING10_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING10_Enabled (0x1UL) /*!< Read: Enabled                                                    */

