adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING11 @Bit 11 : Write '1' to enable interrupt for event REQUESTRISING[11] */
  #define PCRM_INTENSET0_REQUESTRISING11_Pos (11UL)  /*!< Position of REQUESTRISING11 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING11_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING11_Pos) /*!< Bit mask of REQUESTRISING11
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING11_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING11_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING11_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING11_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING11_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING12 @Bit 12 : Write '1' to enable interrupt for event REQUESTRISING[12] */
  #define PCRM_INTENSET0_REQUESTRISING12_Pos (12UL)  /*!< Position of REQUESTRISING12 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING12_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING12_Pos) /*!< Bit mask of REQUESTRISING12
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING12_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING12_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING12_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING12_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING12_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING13 @Bit 13 : Write '1' to enable interrupt for event REQUESTRISING[13] */
  #define PCRM_INTENSET0_REQUESTRISING13_Pos (13UL)  /*!< Position of REQUESTRISING13 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING13_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING13_Pos) /*!< Bit mask of REQUESTRISING13
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING13_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING13_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING13_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING13_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING13_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING14 @Bit 14 : Write '1' to enable interrupt for event REQUESTRISING[14] */
  #define PCRM_INTENSET0_REQUESTRISING14_Pos (14UL)  /*!< Position of REQUESTRISING14 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING14_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING14_Pos) /*!< Bit mask of REQUESTRISING14
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING14_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING14_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING14_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING14_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING14_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING15 @Bit 15 : Write '1' to enable interrupt for event REQUESTRISING[15] */
  #define PCRM_INTENSET0_REQUESTRISING15_Pos (15UL)  /*!< Position of REQUESTRISING15 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING15_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING15_Pos) /*!< Bit mask of REQUESTRISING15
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING15_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING15_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING15_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING15_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING15_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING16 @Bit 16 : Write '1' to enable interrupt for event REQUESTRISING[16] */
  #define PCRM_INTENSET0_REQUESTRISING16_Pos (16UL)  /*!< Position of REQUESTRISING16 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING16_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING16_Pos) /*!< Bit mask of REQUESTRISING16
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING16_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING16_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING16_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING16_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING16_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING17 @Bit 17 : Write '1' to enable interrupt for event REQUESTRISING[17] */
  #define PCRM_INTENSET0_REQUESTRISING17_Pos (17UL)  /*!< Position of REQUESTRISING17 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING17_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING17_Pos) /*!< Bit mask of REQUESTRISING17
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING17_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING17_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING17_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING17_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING17_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING18 @Bit 18 : Write '1' to enable interrupt for event REQUESTRISING[18] */
  #define PCRM_INTENSET0_REQUESTRISING18_Pos (18UL)  /*!< Position of REQUESTRISING18 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING18_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING18_Pos) /*!< Bit mask of REQUESTRISING18
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING18_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING18_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING18_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING18_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING18_Enabled (0x1UL) /*!< Read: Enabled                                                    */

