adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING27 @Bit 27 : Write '1' to enable interrupt for event REQUESTRISING[27] */
  #define PCRM_INTENSET0_REQUESTRISING27_Pos (27UL)  /*!< Position of REQUESTRISING27 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING27_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING27_Pos) /*!< Bit mask of REQUESTRISING27
                                                                            field.*/
  #define PCRM_INTENSET0_REQUESTRISING27_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING27_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING27_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING27_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING27_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* PCRM_INTENSET2: Enable interrupt */
  #define PCRM_INTENSET2_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET2 register.                                   */

/* REQUESTFALLING0 @Bit 0 : Write '1' to enable interrupt for event REQUESTFALLING[0] */
  #define PCRM_INTENSET2_REQUESTFALLING0_Pos (0UL)   /*!< Position of REQUESTFALLING0 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING0_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING0_Pos) /*!< Bit mask of REQUESTFALLING0
                                                                            field.*/
  #define PCRM_INTENSET2_REQUESTFALLING0_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING0_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING0_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING1 @Bit 1 : Write '1' to enable interrupt for event REQUESTFALLING[1] */
  #define PCRM_INTENSET2_REQUESTFALLING1_Pos (1UL)   /*!< Position of REQUESTFALLING1 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING1_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING1_Pos) /*!< Bit mask of REQUESTFALLING1
                                                                            field.*/
  #define PCRM_INTENSET2_REQUESTFALLING1_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING1_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING1_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING2 @Bit 2 : Write '1' to enable interrupt for event REQUESTFALLING[2] */
  #define PCRM_INTENSET2_REQUESTFALLING2_Pos (2UL)   /*!< Position of REQUESTFALLING2 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING2_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING2_Pos) /*!< Bit mask of REQUESTFALLING2
                                                                            field.*/
  #define PCRM_INTENSET2_REQUESTFALLING2_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING2_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING2_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING3 @Bit 3 : Write '1' to enable interrupt for event REQUESTFALLING[3] */
  #define PCRM_INTENSET2_REQUESTFALLING3_Pos (3UL)   /*!< Position of REQUESTFALLING3 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING3_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING3_Pos) /*!< Bit mask of REQUESTFALLING3
                                                                            field.*/
  #define PCRM_INTENSET2_REQUESTFALLING3_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING3_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING3_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING3_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING4 @Bit 4 : Write '1' to enable interrupt for event REQUESTFALLING[4] */
  #define PCRM_INTENSET2_REQUESTFALLING4_Pos (4UL)   /*!< Position of REQUESTFALLING4 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING4_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING4_Pos) /*!< Bit mask of REQUESTFALLING4
                                                                            field.*/
  #define PCRM_INTENSET2_REQUESTFALLING4_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING4_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING4_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING4_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING4_Enabled (0x1UL) /*!< Read: Enabled                                                    */

