adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOADCHANGERAIL2 @Bit 2 : Write '1' to enable interrupt for event LOADCHANGERAIL[2] */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Pos (2UL)   /*!< Position of LOADCHANGERAIL2 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL2_Pos) /*!< Bit mask of LOADCHANGERAIL2
                                                                            field.*/
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL3 @Bit 3 : Write '1' to enable interrupt for event LOADCHANGERAIL[3] */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Pos (3UL)   /*!< Position of LOADCHANGERAIL3 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL3_Pos) /*!< Bit mask of LOADCHANGERAIL3
                                                                            field.*/
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* PCRM_INTENCLR0: Disable interrupt */
  #define PCRM_INTENCLR0_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR0 register.                                   */

/* REQUESTRISING0 @Bit 0 : Write '1' to disable interrupt for event REQUESTRISING[0] */
  #define PCRM_INTENCLR0_REQUESTRISING0_Pos (0UL)    /*!< Position of REQUESTRISING0 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING0_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING0_Pos) /*!< Bit mask of REQUESTRISING0 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING0_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING0_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING0_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING0_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING0_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING1 @Bit 1 : Write '1' to disable interrupt for event REQUESTRISING[1] */
  #define PCRM_INTENCLR0_REQUESTRISING1_Pos (1UL)    /*!< Position of REQUESTRISING1 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING1_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING1_Pos) /*!< Bit mask of REQUESTRISING1 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING1_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING1_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING1_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING1_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING1_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING2 @Bit 2 : Write '1' to disable interrupt for event REQUESTRISING[2] */
  #define PCRM_INTENCLR0_REQUESTRISING2_Pos (2UL)    /*!< Position of REQUESTRISING2 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING2_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING2_Pos) /*!< Bit mask of REQUESTRISING2 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING2_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING2_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING2_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING2_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING2_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING3 @Bit 3 : Write '1' to disable interrupt for event REQUESTRISING[3] */
  #define PCRM_INTENCLR0_REQUESTRISING3_Pos (3UL)    /*!< Position of REQUESTRISING3 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING3_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING3_Pos) /*!< Bit mask of REQUESTRISING3 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING3_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING3_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING3_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING3_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING3_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING4 @Bit 4 : Write '1' to disable interrupt for event REQUESTRISING[4] */
  #define PCRM_INTENCLR0_REQUESTRISING4_Pos (4UL)    /*!< Position of REQUESTRISING4 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING4_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING4_Pos) /*!< Bit mask of REQUESTRISING4 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING4_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING4_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING4_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING4_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING4_Enabled (0x1UL) /*!< Read: Enabled                                                     */

