adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING5 @Bit 5 : Write '1' to disable interrupt for event REQUESTRISING[5] */
  #define PCRM_INTENCLR0_REQUESTRISING5_Pos (5UL)    /*!< Position of REQUESTRISING5 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING5_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING5_Pos) /*!< Bit mask of REQUESTRISING5 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING5_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING5_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING5_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING5_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING5_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING6 @Bit 6 : Write '1' to disable interrupt for event REQUESTRISING[6] */
  #define PCRM_INTENCLR0_REQUESTRISING6_Pos (6UL)    /*!< Position of REQUESTRISING6 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING6_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING6_Pos) /*!< Bit mask of REQUESTRISING6 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING6_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING6_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING6_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING6_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING6_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING7 @Bit 7 : Write '1' to disable interrupt for event REQUESTRISING[7] */
  #define PCRM_INTENCLR0_REQUESTRISING7_Pos (7UL)    /*!< Position of REQUESTRISING7 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING7_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING7_Pos) /*!< Bit mask of REQUESTRISING7 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING7_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING7_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING7_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING7_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING7_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING8 @Bit 8 : Write '1' to disable interrupt for event REQUESTRISING[8] */
  #define PCRM_INTENCLR0_REQUESTRISING8_Pos (8UL)    /*!< Position of REQUESTRISING8 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING8_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING8_Pos) /*!< Bit mask of REQUESTRISING8 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING8_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING8_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING8_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING8_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING8_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING9 @Bit 9 : Write '1' to disable interrupt for event REQUESTRISING[9] */
  #define PCRM_INTENCLR0_REQUESTRISING9_Pos (9UL)    /*!< Position of REQUESTRISING9 field.                                    */
  #define PCRM_INTENCLR0_REQUESTRISING9_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING9_Pos) /*!< Bit mask of REQUESTRISING9 field.*/
  #define PCRM_INTENCLR0_REQUESTRISING9_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING9_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTENCLR0_REQUESTRISING9_Clear (0x1UL) /*!< Disable                                                             */
  #define PCRM_INTENCLR0_REQUESTRISING9_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENCLR0_REQUESTRISING9_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING10 @Bit 10 : Write '1' to disable interrupt for event REQUESTRISING[10] */
  #define PCRM_INTENCLR0_REQUESTRISING10_Pos (10UL)  /*!< Position of REQUESTRISING10 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING10_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING10_Pos) /*!< Bit mask of REQUESTRISING10
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING10_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING10_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING10_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING10_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING10_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING11 @Bit 11 : Write '1' to disable interrupt for event REQUESTRISING[11] */
  #define PCRM_INTENCLR0_REQUESTRISING11_Pos (11UL)  /*!< Position of REQUESTRISING11 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING11_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING11_Pos) /*!< Bit mask of REQUESTRISING11
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING11_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING11_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING11_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING11_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING11_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING12 @Bit 12 : Write '1' to disable interrupt for event REQUESTRISING[12] */
  #define PCRM_INTENCLR0_REQUESTRISING12_Pos (12UL)  /*!< Position of REQUESTRISING12 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING12_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING12_Pos) /*!< Bit mask of REQUESTRISING12
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING12_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING12_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING12_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING12_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING12_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING13 @Bit 13 : Write '1' to disable interrupt for event REQUESTRISING[13] */
  #define PCRM_INTENCLR0_REQUESTRISING13_Pos (13UL)  /*!< Position of REQUESTRISING13 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING13_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING13_Pos) /*!< Bit mask of REQUESTRISING13
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING13_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING13_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING13_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING13_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING13_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING14 @Bit 14 : Write '1' to disable interrupt for event REQUESTRISING[14] */
  #define PCRM_INTENCLR0_REQUESTRISING14_Pos (14UL)  /*!< Position of REQUESTRISING14 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING14_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING14_Pos) /*!< Bit mask of REQUESTRISING14
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING14_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING14_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING14_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING14_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING14_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING15 @Bit 15 : Write '1' to disable interrupt for event REQUESTRISING[15] */
  #define PCRM_INTENCLR0_REQUESTRISING15_Pos (15UL)  /*!< Position of REQUESTRISING15 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING15_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING15_Pos) /*!< Bit mask of REQUESTRISING15
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING15_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING15_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING15_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING15_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING15_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING16 @Bit 16 : Write '1' to disable interrupt for event REQUESTRISING[16] */
  #define PCRM_INTENCLR0_REQUESTRISING16_Pos (16UL)  /*!< Position of REQUESTRISING16 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING16_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING16_Pos) /*!< Bit mask of REQUESTRISING16
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING16_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING16_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING16_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING16_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING16_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING17 @Bit 17 : Write '1' to disable interrupt for event REQUESTRISING[17] */
  #define PCRM_INTENCLR0_REQUESTRISING17_Pos (17UL)  /*!< Position of REQUESTRISING17 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING17_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING17_Pos) /*!< Bit mask of REQUESTRISING17
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING17_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING17_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING17_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING17_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING17_Enabled (0x1UL) /*!< Read: Enabled                                                    */

