adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING18 @Bit 18 : Write '1' to disable interrupt for event REQUESTRISING[18] */
  #define PCRM_INTENCLR0_REQUESTRISING18_Pos (18UL)  /*!< Position of REQUESTRISING18 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING18_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING18_Pos) /*!< Bit mask of REQUESTRISING18
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING18_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING18_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING18_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING18_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING18_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING19 @Bit 19 : Write '1' to disable interrupt for event REQUESTRISING[19] */
  #define PCRM_INTENCLR0_REQUESTRISING19_Pos (19UL)  /*!< Position of REQUESTRISING19 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING19_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING19_Pos) /*!< Bit mask of REQUESTRISING19
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING19_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING19 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING19_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING19 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING19_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING19_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING19_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING20 @Bit 20 : Write '1' to disable interrupt for event REQUESTRISING[20] */
  #define PCRM_INTENCLR0_REQUESTRISING20_Pos (20UL)  /*!< Position of REQUESTRISING20 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING20_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING20_Pos) /*!< Bit mask of REQUESTRISING20
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING20_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING20 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING20_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING20 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING20_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING20_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING20_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING21 @Bit 21 : Write '1' to disable interrupt for event REQUESTRISING[21] */
  #define PCRM_INTENCLR0_REQUESTRISING21_Pos (21UL)  /*!< Position of REQUESTRISING21 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING21_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING21_Pos) /*!< Bit mask of REQUESTRISING21
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING21_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING21 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING21_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING21 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING21_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING21_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING21_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING22 @Bit 22 : Write '1' to disable interrupt for event REQUESTRISING[22] */
  #define PCRM_INTENCLR0_REQUESTRISING22_Pos (22UL)  /*!< Position of REQUESTRISING22 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING22_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING22_Pos) /*!< Bit mask of REQUESTRISING22
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING22_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING22 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING22_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING22 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING22_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING22_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING22_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING23 @Bit 23 : Write '1' to disable interrupt for event REQUESTRISING[23] */
  #define PCRM_INTENCLR0_REQUESTRISING23_Pos (23UL)  /*!< Position of REQUESTRISING23 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING23_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING23_Pos) /*!< Bit mask of REQUESTRISING23
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING23_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING23 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING23_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING23 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING23_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING23_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING23_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING24 @Bit 24 : Write '1' to disable interrupt for event REQUESTRISING[24] */
  #define PCRM_INTENCLR0_REQUESTRISING24_Pos (24UL)  /*!< Position of REQUESTRISING24 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING24_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING24_Pos) /*!< Bit mask of REQUESTRISING24
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING24_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING24 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING24_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING24 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING24_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING24_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING24_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING25 @Bit 25 : Write '1' to disable interrupt for event REQUESTRISING[25] */
  #define PCRM_INTENCLR0_REQUESTRISING25_Pos (25UL)  /*!< Position of REQUESTRISING25 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING25_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING25_Pos) /*!< Bit mask of REQUESTRISING25
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING25_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING25 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING25_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING25 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING25_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING25_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING25_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING26 @Bit 26 : Write '1' to disable interrupt for event REQUESTRISING[26] */
  #define PCRM_INTENCLR0_REQUESTRISING26_Pos (26UL)  /*!< Position of REQUESTRISING26 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING26_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING26_Pos) /*!< Bit mask of REQUESTRISING26
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING26_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING26 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING26_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING26 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING26_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING26_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING26_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING27 @Bit 27 : Write '1' to disable interrupt for event REQUESTRISING[27] */
  #define PCRM_INTENCLR0_REQUESTRISING27_Pos (27UL)  /*!< Position of REQUESTRISING27 field.                                   */
  #define PCRM_INTENCLR0_REQUESTRISING27_Msk (0x1UL << PCRM_INTENCLR0_REQUESTRISING27_Pos) /*!< Bit mask of REQUESTRISING27
                                                                            field.*/
  #define PCRM_INTENCLR0_REQUESTRISING27_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING27_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTENCLR0_REQUESTRISING27_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR0_REQUESTRISING27_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR0_REQUESTRISING27_Enabled (0x1UL) /*!< Read: Enabled                                                    */


