adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTFALLING20 @Bit 20 : Write '1' to disable interrupt for event REQUESTFALLING[20] */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Pos (20UL) /*!< Position of REQUESTFALLING20 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING20_Pos) /*!< Bit mask of REQUESTFALLING20
                                                                            field.*/
  #define PCRM_INTENCLR2_REQUESTFALLING20_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING20 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING20 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING21 @Bit 21 : Write '1' to disable interrupt for event REQUESTFALLING[21] */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Pos (21UL) /*!< Position of REQUESTFALLING21 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING21_Pos) /*!< Bit mask of REQUESTFALLING21
                                                                            field.*/
  #define PCRM_INTENCLR2_REQUESTFALLING21_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING21 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING21 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING22 @Bit 22 : Write '1' to disable interrupt for event REQUESTFALLING[22] */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Pos (22UL) /*!< Position of REQUESTFALLING22 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING22_Pos) /*!< Bit mask of REQUESTFALLING22
                                                                            field.*/
  #define PCRM_INTENCLR2_REQUESTFALLING22_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING22 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING22 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING23 @Bit 23 : Write '1' to disable interrupt for event REQUESTFALLING[23] */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Pos (23UL) /*!< Position of REQUESTFALLING23 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING23_Pos) /*!< Bit mask of REQUESTFALLING23
                                                                            field.*/
  #define PCRM_INTENCLR2_REQUESTFALLING23_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING23 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING23 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING24 @Bit 24 : Write '1' to disable interrupt for event REQUESTFALLING[24] */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Pos (24UL) /*!< Position of REQUESTFALLING24 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING24_Pos) /*!< Bit mask of REQUESTFALLING24
                                                                            field.*/
  #define PCRM_INTENCLR2_REQUESTFALLING24_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING24 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING24 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING25 @Bit 25 : Write '1' to disable interrupt for event REQUESTFALLING[25] */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Pos (25UL) /*!< Position of REQUESTFALLING25 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING25_Pos) /*!< Bit mask of REQUESTFALLING25
                                                                            field.*/
  #define PCRM_INTENCLR2_REQUESTFALLING25_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING25 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING25 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING26 @Bit 26 : Write '1' to disable interrupt for event REQUESTFALLING[26] */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Pos (26UL) /*!< Position of REQUESTFALLING26 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING26_Pos) /*!< Bit mask of REQUESTFALLING26
                                                                            field.*/
  #define PCRM_INTENCLR2_REQUESTFALLING26_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING26 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING26 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING27 @Bit 27 : Write '1' to disable interrupt for event REQUESTFALLING[27] */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Pos (27UL) /*!< Position of REQUESTFALLING27 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING27_Pos) /*!< Bit mask of REQUESTFALLING27
                                                                            field.*/
  #define PCRM_INTENCLR2_REQUESTFALLING27_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING27 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING27 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* PCRM_INTENCLR4: Disable interrupt */
  #define PCRM_INTENCLR4_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR4 register.                                   */

/* LOADCHANGERAIL0 @Bit 0 : Write '1' to disable interrupt for event LOADCHANGERAIL[0] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Pos (0UL)   /*!< Position of LOADCHANGERAIL0 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL0_Pos) /*!< Bit mask of LOADCHANGERAIL0
                                                                            field.*/
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL1 @Bit 1 : Write '1' to disable interrupt for event LOADCHANGERAIL[1] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Pos (1UL)   /*!< Position of LOADCHANGERAIL1 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL1_Pos) /*!< Bit mask of LOADCHANGERAIL1
                                                                            field.*/
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL2 @Bit 2 : Write '1' to disable interrupt for event LOADCHANGERAIL[2] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Pos (2UL)   /*!< Position of LOADCHANGERAIL2 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL2_Pos) /*!< Bit mask of LOADCHANGERAIL2
                                                                            field.*/
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL3 @Bit 3 : Write '1' to disable interrupt for event LOADCHANGERAIL[3] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Pos (3UL)   /*!< Position of LOADCHANGERAIL3 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL3_Pos) /*!< Bit mask of LOADCHANGERAIL3
                                                                            field.*/
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* PCRM_INTPEND0: Pending interrupts */
  #define PCRM_INTPEND0_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND0 register.                                    */

/* REQUESTRISING0 @Bit 0 : Read pending status of interrupt for event REQUESTRISING[0] */
  #define PCRM_INTPEND0_REQUESTRISING0_Pos (0UL)     /*!< Position of REQUESTRISING0 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING0_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING0_Pos) /*!< Bit mask of REQUESTRISING0 field.  */
  #define PCRM_INTPEND0_REQUESTRISING0_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING0_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING0_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING0_Pending (0x1UL) /*!< Read: Pending                                                      */

