adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING1 @Bit 1 : Read pending status of interrupt for event REQUESTRISING[1] */
  #define PCRM_INTPEND0_REQUESTRISING1_Pos (1UL)     /*!< Position of REQUESTRISING1 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING1_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING1_Pos) /*!< Bit mask of REQUESTRISING1 field.  */
  #define PCRM_INTPEND0_REQUESTRISING1_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING1_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING1_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING1_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING2 @Bit 2 : Read pending status of interrupt for event REQUESTRISING[2] */
  #define PCRM_INTPEND0_REQUESTRISING2_Pos (2UL)     /*!< Position of REQUESTRISING2 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING2_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING2_Pos) /*!< Bit mask of REQUESTRISING2 field.  */
  #define PCRM_INTPEND0_REQUESTRISING2_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING2_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING2_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING2_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING3 @Bit 3 : Read pending status of interrupt for event REQUESTRISING[3] */
  #define PCRM_INTPEND0_REQUESTRISING3_Pos (3UL)     /*!< Position of REQUESTRISING3 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING3_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING3_Pos) /*!< Bit mask of REQUESTRISING3 field.  */
  #define PCRM_INTPEND0_REQUESTRISING3_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING3_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING3_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING3_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING4 @Bit 4 : Read pending status of interrupt for event REQUESTRISING[4] */
  #define PCRM_INTPEND0_REQUESTRISING4_Pos (4UL)     /*!< Position of REQUESTRISING4 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING4_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING4_Pos) /*!< Bit mask of REQUESTRISING4 field.  */
  #define PCRM_INTPEND0_REQUESTRISING4_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING4_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING4_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING4_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING5 @Bit 5 : Read pending status of interrupt for event REQUESTRISING[5] */
  #define PCRM_INTPEND0_REQUESTRISING5_Pos (5UL)     /*!< Position of REQUESTRISING5 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING5_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING5_Pos) /*!< Bit mask of REQUESTRISING5 field.  */
  #define PCRM_INTPEND0_REQUESTRISING5_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING5_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING5_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING5_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING6 @Bit 6 : Read pending status of interrupt for event REQUESTRISING[6] */
  #define PCRM_INTPEND0_REQUESTRISING6_Pos (6UL)     /*!< Position of REQUESTRISING6 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING6_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING6_Pos) /*!< Bit mask of REQUESTRISING6 field.  */
  #define PCRM_INTPEND0_REQUESTRISING6_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING6_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING6_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING6_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING7 @Bit 7 : Read pending status of interrupt for event REQUESTRISING[7] */
  #define PCRM_INTPEND0_REQUESTRISING7_Pos (7UL)     /*!< Position of REQUESTRISING7 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING7_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING7_Pos) /*!< Bit mask of REQUESTRISING7 field.  */
  #define PCRM_INTPEND0_REQUESTRISING7_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING7_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING7_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING7_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING8 @Bit 8 : Read pending status of interrupt for event REQUESTRISING[8] */
  #define PCRM_INTPEND0_REQUESTRISING8_Pos (8UL)     /*!< Position of REQUESTRISING8 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING8_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING8_Pos) /*!< Bit mask of REQUESTRISING8 field.  */
  #define PCRM_INTPEND0_REQUESTRISING8_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING8_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING8_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING8_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING9 @Bit 9 : Read pending status of interrupt for event REQUESTRISING[9] */
  #define PCRM_INTPEND0_REQUESTRISING9_Pos (9UL)     /*!< Position of REQUESTRISING9 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING9_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING9_Pos) /*!< Bit mask of REQUESTRISING9 field.  */
  #define PCRM_INTPEND0_REQUESTRISING9_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING9_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING9_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING9_Pending (0x1UL) /*!< Read: Pending                                                      */

/* REQUESTRISING10 @Bit 10 : Read pending status of interrupt for event REQUESTRISING[10] */
  #define PCRM_INTPEND0_REQUESTRISING10_Pos (10UL)   /*!< Position of REQUESTRISING10 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING10_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING10_Pos) /*!< Bit mask of REQUESTRISING10
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING10_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING10_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING10_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING10_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING11 @Bit 11 : Read pending status of interrupt for event REQUESTRISING[11] */
  #define PCRM_INTPEND0_REQUESTRISING11_Pos (11UL)   /*!< Position of REQUESTRISING11 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING11_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING11_Pos) /*!< Bit mask of REQUESTRISING11
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING11_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING11_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING11_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING11_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING12 @Bit 12 : Read pending status of interrupt for event REQUESTRISING[12] */
  #define PCRM_INTPEND0_REQUESTRISING12_Pos (12UL)   /*!< Position of REQUESTRISING12 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING12_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING12_Pos) /*!< Bit mask of REQUESTRISING12
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING12_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING12_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING12_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING12_Pending (0x1UL) /*!< Read: Pending                                                     */

