adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTRISING13 @Bit 13 : Read pending status of interrupt for event REQUESTRISING[13] */
  #define PCRM_INTPEND0_REQUESTRISING13_Pos (13UL)   /*!< Position of REQUESTRISING13 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING13_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING13_Pos) /*!< Bit mask of REQUESTRISING13
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING13_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING13_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING13_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING13_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING14 @Bit 14 : Read pending status of interrupt for event REQUESTRISING[14] */
  #define PCRM_INTPEND0_REQUESTRISING14_Pos (14UL)   /*!< Position of REQUESTRISING14 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING14_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING14_Pos) /*!< Bit mask of REQUESTRISING14
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING14_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING14_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING14_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING14_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING15 @Bit 15 : Read pending status of interrupt for event REQUESTRISING[15] */
  #define PCRM_INTPEND0_REQUESTRISING15_Pos (15UL)   /*!< Position of REQUESTRISING15 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING15_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING15_Pos) /*!< Bit mask of REQUESTRISING15
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING15_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING15_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING15_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING15_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING16 @Bit 16 : Read pending status of interrupt for event REQUESTRISING[16] */
  #define PCRM_INTPEND0_REQUESTRISING16_Pos (16UL)   /*!< Position of REQUESTRISING16 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING16_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING16_Pos) /*!< Bit mask of REQUESTRISING16
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING16_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING16_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING16_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING16_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING17 @Bit 17 : Read pending status of interrupt for event REQUESTRISING[17] */
  #define PCRM_INTPEND0_REQUESTRISING17_Pos (17UL)   /*!< Position of REQUESTRISING17 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING17_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING17_Pos) /*!< Bit mask of REQUESTRISING17
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING17_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING17_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING17_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING17_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING18 @Bit 18 : Read pending status of interrupt for event REQUESTRISING[18] */
  #define PCRM_INTPEND0_REQUESTRISING18_Pos (18UL)   /*!< Position of REQUESTRISING18 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING18_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING18_Pos) /*!< Bit mask of REQUESTRISING18
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING18_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING18_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING18_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING18_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING19 @Bit 19 : Read pending status of interrupt for event REQUESTRISING[19] */
  #define PCRM_INTPEND0_REQUESTRISING19_Pos (19UL)   /*!< Position of REQUESTRISING19 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING19_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING19_Pos) /*!< Bit mask of REQUESTRISING19
                                                                            field.*/
  #define PCRM_INTPEND0_REQUESTRISING19_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING19 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING19_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING19 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING19_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING19_Pending (0x1UL) /*!< Read: Pending                                                     */

