adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PCRM_INTPEND2: Pending interrupts */
  #define PCRM_INTPEND2_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND2 register.                                    */

/* REQUESTFALLING0 @Bit 0 : Read pending status of interrupt for event REQUESTFALLING[0] */
  #define PCRM_INTPEND2_REQUESTFALLING0_Pos (0UL)    /*!< Position of REQUESTFALLING0 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING0_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING0_Pos) /*!< Bit mask of REQUESTFALLING0
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING0_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING0_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING0_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING0_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING1 @Bit 1 : Read pending status of interrupt for event REQUESTFALLING[1] */
  #define PCRM_INTPEND2_REQUESTFALLING1_Pos (1UL)    /*!< Position of REQUESTFALLING1 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING1_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING1_Pos) /*!< Bit mask of REQUESTFALLING1
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING1_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING1_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING1_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING1_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING2 @Bit 2 : Read pending status of interrupt for event REQUESTFALLING[2] */
  #define PCRM_INTPEND2_REQUESTFALLING2_Pos (2UL)    /*!< Position of REQUESTFALLING2 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING2_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING2_Pos) /*!< Bit mask of REQUESTFALLING2
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING2_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING2_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING2_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING2_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING3 @Bit 3 : Read pending status of interrupt for event REQUESTFALLING[3] */
  #define PCRM_INTPEND2_REQUESTFALLING3_Pos (3UL)    /*!< Position of REQUESTFALLING3 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING3_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING3_Pos) /*!< Bit mask of REQUESTFALLING3
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING3_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING3_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING3_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING3_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING4 @Bit 4 : Read pending status of interrupt for event REQUESTFALLING[4] */
  #define PCRM_INTPEND2_REQUESTFALLING4_Pos (4UL)    /*!< Position of REQUESTFALLING4 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING4_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING4_Pos) /*!< Bit mask of REQUESTFALLING4
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING4_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING4_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING4_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING4_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING5 @Bit 5 : Read pending status of interrupt for event REQUESTFALLING[5] */
  #define PCRM_INTPEND2_REQUESTFALLING5_Pos (5UL)    /*!< Position of REQUESTFALLING5 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING5_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING5_Pos) /*!< Bit mask of REQUESTFALLING5
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING5_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING5 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING5_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING5 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING5_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING5_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING6 @Bit 6 : Read pending status of interrupt for event REQUESTFALLING[6] */
  #define PCRM_INTPEND2_REQUESTFALLING6_Pos (6UL)    /*!< Position of REQUESTFALLING6 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING6_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING6_Pos) /*!< Bit mask of REQUESTFALLING6
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING6_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING6 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING6_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING6 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING6_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING6_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING7 @Bit 7 : Read pending status of interrupt for event REQUESTFALLING[7] */
  #define PCRM_INTPEND2_REQUESTFALLING7_Pos (7UL)    /*!< Position of REQUESTFALLING7 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING7_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING7_Pos) /*!< Bit mask of REQUESTFALLING7
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING7_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING7_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING7_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING7_Pending (0x1UL) /*!< Read: Pending                                                     */

