adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* REQUESTFALLING8 @Bit 8 : Read pending status of interrupt for event REQUESTFALLING[8] */
  #define PCRM_INTPEND2_REQUESTFALLING8_Pos (8UL)    /*!< Position of REQUESTFALLING8 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING8_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING8_Pos) /*!< Bit mask of REQUESTFALLING8
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING8_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING8_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING8_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING8_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING9 @Bit 9 : Read pending status of interrupt for event REQUESTFALLING[9] */
  #define PCRM_INTPEND2_REQUESTFALLING9_Pos (9UL)    /*!< Position of REQUESTFALLING9 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING9_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING9_Pos) /*!< Bit mask of REQUESTFALLING9
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING9_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING9_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING9_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING9_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING10 @Bit 10 : Read pending status of interrupt for event REQUESTFALLING[10] */
  #define PCRM_INTPEND2_REQUESTFALLING10_Pos (10UL)  /*!< Position of REQUESTFALLING10 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING10_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING10_Pos) /*!< Bit mask of REQUESTFALLING10
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING10_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING10 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING10_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING10 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING10_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING10_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING11 @Bit 11 : Read pending status of interrupt for event REQUESTFALLING[11] */
  #define PCRM_INTPEND2_REQUESTFALLING11_Pos (11UL)  /*!< Position of REQUESTFALLING11 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING11_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING11_Pos) /*!< Bit mask of REQUESTFALLING11
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING11_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING11 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING11_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING11 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING11_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING11_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING12 @Bit 12 : Read pending status of interrupt for event REQUESTFALLING[12] */
  #define PCRM_INTPEND2_REQUESTFALLING12_Pos (12UL)  /*!< Position of REQUESTFALLING12 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING12_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING12_Pos) /*!< Bit mask of REQUESTFALLING12
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING12_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING12 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING12_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING12 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING12_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING12_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING13 @Bit 13 : Read pending status of interrupt for event REQUESTFALLING[13] */
  #define PCRM_INTPEND2_REQUESTFALLING13_Pos (13UL)  /*!< Position of REQUESTFALLING13 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING13_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING13_Pos) /*!< Bit mask of REQUESTFALLING13
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING13_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING13 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING13_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING13 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING13_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING13_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING14 @Bit 14 : Read pending status of interrupt for event REQUESTFALLING[14] */
  #define PCRM_INTPEND2_REQUESTFALLING14_Pos (14UL)  /*!< Position of REQUESTFALLING14 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING14_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING14_Pos) /*!< Bit mask of REQUESTFALLING14
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING14_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING14 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING14_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING14 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING14_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING14_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING15 @Bit 15 : Read pending status of interrupt for event REQUESTFALLING[15] */
  #define PCRM_INTPEND2_REQUESTFALLING15_Pos (15UL)  /*!< Position of REQUESTFALLING15 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING15_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING15_Pos) /*!< Bit mask of REQUESTFALLING15
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING15_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING15 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING15_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING15 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING15_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING15_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING16 @Bit 16 : Read pending status of interrupt for event REQUESTFALLING[16] */
  #define PCRM_INTPEND2_REQUESTFALLING16_Pos (16UL)  /*!< Position of REQUESTFALLING16 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING16_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING16_Pos) /*!< Bit mask of REQUESTFALLING16
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING16_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING16 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING16_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING16 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING16_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING16_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING17 @Bit 17 : Read pending status of interrupt for event REQUESTFALLING[17] */
  #define PCRM_INTPEND2_REQUESTFALLING17_Pos (17UL)  /*!< Position of REQUESTFALLING17 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING17_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING17_Pos) /*!< Bit mask of REQUESTFALLING17
                                                                            field.*/
  #define PCRM_INTPEND2_REQUESTFALLING17_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING17 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING17_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING17 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING17_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING17_Pending (0x1UL) /*!< Read: Pending                                                    */

