adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PCRM_INTPEND4: Pending interrupts */
  #define PCRM_INTPEND4_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND4 register.                                    */

/* LOADCHANGERAIL0 @Bit 0 : Read pending status of interrupt for event LOADCHANGERAIL[0] */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Pos (0UL)    /*!< Position of LOADCHANGERAIL0 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL0_Pos) /*!< Bit mask of LOADCHANGERAIL0
                                                                            field.*/
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL1 @Bit 1 : Read pending status of interrupt for event LOADCHANGERAIL[1] */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Pos (1UL)    /*!< Position of LOADCHANGERAIL1 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL1_Pos) /*!< Bit mask of LOADCHANGERAIL1
                                                                            field.*/
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL2 @Bit 2 : Read pending status of interrupt for event LOADCHANGERAIL[2] */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Pos (2UL)    /*!< Position of LOADCHANGERAIL2 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL2_Pos) /*!< Bit mask of LOADCHANGERAIL2
                                                                            field.*/
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL3 @Bit 3 : Read pending status of interrupt for event LOADCHANGERAIL[3] */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Pos (3UL)    /*!< Position of LOADCHANGERAIL3 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL3_Pos) /*!< Bit mask of LOADCHANGERAIL3
                                                                            field.*/
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Pending (0x1UL) /*!< Read: Pending                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct PDM_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [PDM_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) This event is generated if an error occurs during the
                                                                         bus transfer. This event is generated on an AHB / AXI
                                                                         error response.*/
} NRF_PDM_EVENTS_DMA_Type;                           /*!< Size = 4 (0x004)                                                     */

/* PDM_EVENTS_DMA_BUSERROR: This event is generated if an error occurs during the bus transfer. This event is generated on an
                             AHB / AXI error response. */

  #define PDM_EVENTS_DMA_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                             */

/* BUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. This event is generated on an AHB / AXI
                     error response. */

  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                          */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Msk (0x1UL << PDM_EVENTS_DMA_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR field.*/
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                            */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                            */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                              */



/* ================================================= Struct PDM_PUBLISH_DMA ================================================== */
/**
  * @brief PUBLISH_DMA [PDM_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) Publish configuration for event DMA.BUSERROR          */
} NRF_PDM_PUBLISH_DMA_Type;                          /*!< Size = 4 (0x004)                                                     */

/* PDM_PUBLISH_DMA_BUSERROR: Publish configuration for event DMA.BUSERROR */
  #define PDM_PUBLISH_DMA_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMA.BUSERROR will publish to */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Msk (0xFFUL << PDM_PUBLISH_DMA_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Msk (0x1UL << PDM_PUBLISH_DMA_BUSERROR_EN_Pos) /*!< Bit mask of EN field.                */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */



