adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ==================================================== Struct PDM_FILTER ==================================================== */
/**
  * @brief FILTER [PDM_FILTER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRL;                              /*!< (@ 0x00000000) Reserved for internal filter use                      */
  __IOM uint32_t  HPPOLE;                            /*!< (@ 0x00000004) Settings for the high-pass filter                     */
  __IOM uint32_t  HPDISABLE;                         /*!< (@ 0x00000008) High pass filter disable                              */
  __IOM uint32_t  SOFTMUTE;                          /*!< (@ 0x0000000C) Soft mute function                                    */
  __IOM uint32_t  SOFTCYCLES;                        /*!< (@ 0x00000010) Soft mute settings                                    */
  __IOM uint32_t  SAMPLEDELAY;                       /*!< (@ 0x00000014) Input Data Sampling with Number of PDM_CLK Clock Cycle
                                                                         Delay*/
} NRF_PDM_FILTER_Type;                               /*!< Size = 24 (0x018)                                                    */

/* PDM_FILTER_CTRL: Reserved for internal filter use */
  #define PDM_FILTER_CTRL_ResetValue (0x80000434UL)  /*!< Reset value of CTRL register.                                        */

/* CNTL @Bits 0..31 : Reserved for internal filter use */
  #define PDM_FILTER_CTRL_CNTL_Pos (0UL)             /*!< Position of CNTL field.                                              */
  #define PDM_FILTER_CTRL_CNTL_Msk (0xFFFFFFFFUL << PDM_FILTER_CTRL_CNTL_Pos) /*!< Bit mask of CNTL field.                     */


/* PDM_FILTER_HPPOLE: Settings for the high-pass filter */
  #define PDM_FILTER_HPPOLE_ResetValue (0x0000000BUL) /*!< Reset value of HPPOLE register.                                     */

/* HPPOLE @Bits 0..3 : Settings for the high-pass filter -3dB gain pole, assuming filter source clock of 2.048 MHz */
  #define PDM_FILTER_HPPOLE_HPPOLE_Pos (0UL)         /*!< Position of HPPOLE field.                                            */
  #define PDM_FILTER_HPPOLE_HPPOLE_Msk (0xFUL << PDM_FILTER_HPPOLE_HPPOLE_Pos) /*!< Bit mask of HPPOLE field.                  */
  #define PDM_FILTER_HPPOLE_HPPOLE_Min (0x1UL)       /*!< Min enumerator value of HPPOLE field.                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_Max (0xFUL)       /*!< Max enumerator value of HPPOLE field.                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p10 (0xFUL)       /*!< 10 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p20 (0xEUL)       /*!< 20 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p40 (0xDUL)       /*!< 40 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p80 (0xCUL)       /*!< 80 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p160 (0xBUL)      /*!< 159 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p320 (0xAUL)      /*!< 318 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p640 (0x9UL)      /*!< 636 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p1k2 (0x8UL)      /*!< 1271 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p2k5 (0x7UL)      /*!< 2537 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p5k (0x6UL)       /*!< 5054 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p10k (0x5UL)      /*!< 10031 Hz                                                             */
  #define PDM_FILTER_HPPOLE_HPPOLE_p19k (0x4UL)      /*!< 19767 Hz                                                             */
  #define PDM_FILTER_HPPOLE_HPPOLE_p38k (0x3UL)      /*!< 38436 Hz                                                             */
  #define PDM_FILTER_HPPOLE_HPPOLE_p73k (0x2UL)      /*!< 73037 Hz                                                             */
  #define PDM_FILTER_HPPOLE_HPPOLE_p134k (0x1UL)     /*!< 134010 Hz                                                            */


/* PDM_FILTER_HPDISABLE: High pass filter disable */
  #define PDM_FILTER_HPDISABLE_ResetValue (0x00000001UL) /*!< Reset value of HPDISABLE register.                               */

/* DISABLE @Bit 0 : High pass filter disable */
  #define PDM_FILTER_HPDISABLE_DISABLE_Pos (0UL)     /*!< Position of DISABLE field.                                           */
  #define PDM_FILTER_HPDISABLE_DISABLE_Msk (0x1UL << PDM_FILTER_HPDISABLE_DISABLE_Pos) /*!< Bit mask of DISABLE field.         */
  #define PDM_FILTER_HPDISABLE_DISABLE_Min (0x0UL)   /*!< Min enumerator value of DISABLE field.                               */
  #define PDM_FILTER_HPDISABLE_DISABLE_Max (0x1UL)   /*!< Max enumerator value of DISABLE field.                               */
  #define PDM_FILTER_HPDISABLE_DISABLE_Enable (0x0UL) /*!< High pass filter enabled                                            */
  #define PDM_FILTER_HPDISABLE_DISABLE_Disable (0x1UL) /*!< High pass filter disabled                                          */


/* PDM_FILTER_SOFTMUTE: Soft mute function */
  #define PDM_FILTER_SOFTMUTE_ResetValue (0x00000000UL) /*!< Reset value of SOFTMUTE register.                                 */

/* ENABLE @Bit 0 : Soft mute function */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Pos (0UL)       /*!< Position of ENABLE field.                                            */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Msk (0x1UL << PDM_FILTER_SOFTMUTE_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Max (0x1UL)     /*!< Max enumerator value of ENABLE field.                                */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Disabled (0x0UL) /*!< Disable soft mute function                                          */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Enabled (0x1UL) /*!< Enable soft mute function                                            */


/* PDM_FILTER_SOFTCYCLES: Soft mute settings */
  #define PDM_FILTER_SOFTCYCLES_ResetValue (0x00000001UL) /*!< Reset value of SOFTCYCLES register.                             */

