adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PDM_EVENTS_OVERRUN: PDM samples lost due to DMA destination not available */
  #define PDM_EVENTS_OVERRUN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_OVERRUN register.                            */

/* EVENTS_OVERRUN @Bit 0 : PDM samples lost due to DMA destination not available */
  #define PDM_EVENTS_OVERRUN_EVENTS_OVERRUN_Pos (0UL) /*!< Position of EVENTS_OVERRUN field.                                   */
  #define PDM_EVENTS_OVERRUN_EVENTS_OVERRUN_Msk (0x1UL << PDM_EVENTS_OVERRUN_EVENTS_OVERRUN_Pos) /*!< Bit mask of EVENTS_OVERRUN
                                                                            field.*/
  #define PDM_EVENTS_OVERRUN_EVENTS_OVERRUN_Min (0x0UL) /*!< Min enumerator value of EVENTS_OVERRUN field.                     */
  #define PDM_EVENTS_OVERRUN_EVENTS_OVERRUN_Max (0x1UL) /*!< Max enumerator value of EVENTS_OVERRUN field.                     */
  #define PDM_EVENTS_OVERRUN_EVENTS_OVERRUN_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define PDM_EVENTS_OVERRUN_EVENTS_OVERRUN_Generated (0x1UL) /*!< Event generated                                             */


/* PDM_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define PDM_PUBLISH_STARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STARTED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define PDM_PUBLISH_STARTED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << PDM_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define PDM_PUBLISH_STARTED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define PDM_PUBLISH_STARTED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_STARTED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_STARTED_EN_Msk (0x1UL << PDM_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define PDM_PUBLISH_STARTED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_STARTED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_STARTED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define PDM_PUBLISH_STARTED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* PDM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define PDM_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define PDM_PUBLISH_STOPPED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << PDM_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define PDM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define PDM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_STOPPED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_STOPPED_EN_Msk (0x1UL << PDM_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define PDM_PUBLISH_STOPPED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_STOPPED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_STOPPED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define PDM_PUBLISH_STOPPED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* PDM_PUBLISH_END: Publish configuration for event END */
  #define PDM_PUBLISH_END_ResetValue (0x00000000UL)  /*!< Reset value of PUBLISH_END register.                                 */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define PDM_PUBLISH_END_CHIDX_Pos (0UL)            /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_END_CHIDX_Msk (0xFFUL << PDM_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.                        */
  #define PDM_PUBLISH_END_CHIDX_Min (0x00UL)         /*!< Min value of CHIDX field.                                            */
  #define PDM_PUBLISH_END_CHIDX_Max (0xFFUL)         /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_END_EN_Pos (31UL)              /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_END_EN_Msk (0x1UL << PDM_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field.                                  */
  #define PDM_PUBLISH_END_EN_Min (0x0UL)             /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_END_EN_Max (0x1UL)             /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_END_EN_Disabled (0x0UL)        /*!< Disable publishing                                                   */
  #define PDM_PUBLISH_END_EN_Enabled (0x1UL)         /*!< Enable publishing                                                    */


/* PDM_PUBLISH_OVERRUN: Publish configuration for event OVERRUN */
  #define PDM_PUBLISH_OVERRUN_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_OVERRUN register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event OVERRUN will publish to */
  #define PDM_PUBLISH_OVERRUN_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_OVERRUN_CHIDX_Msk (0xFFUL << PDM_PUBLISH_OVERRUN_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define PDM_PUBLISH_OVERRUN_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define PDM_PUBLISH_OVERRUN_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_OVERRUN_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_OVERRUN_EN_Msk (0x1UL << PDM_PUBLISH_OVERRUN_EN_Pos) /*!< Bit mask of EN field.                          */
  #define PDM_PUBLISH_OVERRUN_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_OVERRUN_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_OVERRUN_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define PDM_PUBLISH_OVERRUN_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* PDM_SHORTS: Shortcuts between local events and tasks */
  #define PDM_SHORTS_ResetValue (0x00000000UL)       /*!< Reset value of SHORTS register.                                      */

/* DMA_BUSERROR_STOP @Bit 0 : Shortcut between event DMA.BUSERROR and task STOP */
  #define PDM_SHORTS_DMA_BUSERROR_STOP_Pos (0UL)     /*!< Position of DMA_BUSERROR_STOP field.                                 */
  #define PDM_SHORTS_DMA_BUSERROR_STOP_Msk (0x1UL << PDM_SHORTS_DMA_BUSERROR_STOP_Pos) /*!< Bit mask of DMA_BUSERROR_STOP
                                                                            field.*/
  #define PDM_SHORTS_DMA_BUSERROR_STOP_Min (0x0UL)   /*!< Min enumerator value of DMA_BUSERROR_STOP field.                     */
  #define PDM_SHORTS_DMA_BUSERROR_STOP_Max (0x1UL)   /*!< Max enumerator value of DMA_BUSERROR_STOP field.                     */
  #define PDM_SHORTS_DMA_BUSERROR_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                  */
  #define PDM_SHORTS_DMA_BUSERROR_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                    */


