adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PDM_INTEN: Enable or disable interrupt */
  #define PDM_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define PDM_INTEN_STARTED_Pos (0UL)                /*!< Position of STARTED field.                                           */
  #define PDM_INTEN_STARTED_Msk (0x1UL << PDM_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                               */
  #define PDM_INTEN_STARTED_Min (0x0UL)              /*!< Min enumerator value of STARTED field.                               */
  #define PDM_INTEN_STARTED_Max (0x1UL)              /*!< Max enumerator value of STARTED field.                               */
  #define PDM_INTEN_STARTED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PDM_INTEN_STARTED_Enabled (0x1UL)          /*!< Enable                                                               */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define PDM_INTEN_STOPPED_Pos (1UL)                /*!< Position of STOPPED field.                                           */
  #define PDM_INTEN_STOPPED_Msk (0x1UL << PDM_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                               */
  #define PDM_INTEN_STOPPED_Min (0x0UL)              /*!< Min enumerator value of STOPPED field.                               */
  #define PDM_INTEN_STOPPED_Max (0x1UL)              /*!< Max enumerator value of STOPPED field.                               */
  #define PDM_INTEN_STOPPED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PDM_INTEN_STOPPED_Enabled (0x1UL)          /*!< Enable                                                               */

/* END @Bit 2 : Enable or disable interrupt for event END */
  #define PDM_INTEN_END_Pos (2UL)                    /*!< Position of END field.                                               */
  #define PDM_INTEN_END_Msk (0x1UL << PDM_INTEN_END_Pos) /*!< Bit mask of END field.                                           */
  #define PDM_INTEN_END_Min (0x0UL)                  /*!< Min enumerator value of END field.                                   */
  #define PDM_INTEN_END_Max (0x1UL)                  /*!< Max enumerator value of END field.                                   */
  #define PDM_INTEN_END_Disabled (0x0UL)             /*!< Disable                                                              */
  #define PDM_INTEN_END_Enabled (0x1UL)              /*!< Enable                                                               */

/* OVERRUN @Bit 3 : Enable or disable interrupt for event OVERRUN */
  #define PDM_INTEN_OVERRUN_Pos (3UL)                /*!< Position of OVERRUN field.                                           */
  #define PDM_INTEN_OVERRUN_Msk (0x1UL << PDM_INTEN_OVERRUN_Pos) /*!< Bit mask of OVERRUN field.                               */
  #define PDM_INTEN_OVERRUN_Min (0x0UL)              /*!< Min enumerator value of OVERRUN field.                               */
  #define PDM_INTEN_OVERRUN_Max (0x1UL)              /*!< Max enumerator value of OVERRUN field.                               */
  #define PDM_INTEN_OVERRUN_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PDM_INTEN_OVERRUN_Enabled (0x1UL)          /*!< Enable                                                               */

/* DMABUSERROR @Bit 4 : Enable or disable interrupt for event DMABUSERROR */
  #define PDM_INTEN_DMABUSERROR_Pos (4UL)            /*!< Position of DMABUSERROR field.                                       */
  #define PDM_INTEN_DMABUSERROR_Msk (0x1UL << PDM_INTEN_DMABUSERROR_Pos) /*!< Bit mask of DMABUSERROR field.                   */
  #define PDM_INTEN_DMABUSERROR_Min (0x0UL)          /*!< Min enumerator value of DMABUSERROR field.                           */
  #define PDM_INTEN_DMABUSERROR_Max (0x1UL)          /*!< Max enumerator value of DMABUSERROR field.                           */
  #define PDM_INTEN_DMABUSERROR_Disabled (0x0UL)     /*!< Disable                                                              */
  #define PDM_INTEN_DMABUSERROR_Enabled (0x1UL)      /*!< Enable                                                               */


/* PDM_INTENSET: Enable interrupt */
  #define PDM_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define PDM_INTENSET_STARTED_Pos (0UL)             /*!< Position of STARTED field.                                           */
  #define PDM_INTENSET_STARTED_Msk (0x1UL << PDM_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                         */
  #define PDM_INTENSET_STARTED_Min (0x0UL)           /*!< Min enumerator value of STARTED field.                               */
  #define PDM_INTENSET_STARTED_Max (0x1UL)           /*!< Max enumerator value of STARTED field.                               */
  #define PDM_INTENSET_STARTED_Set (0x1UL)           /*!< Enable                                                               */
  #define PDM_INTENSET_STARTED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PDM_INTENSET_STARTED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define PDM_INTENSET_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define PDM_INTENSET_STOPPED_Msk (0x1UL << PDM_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define PDM_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define PDM_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define PDM_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define PDM_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PDM_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

