adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PDM_PDMCLKCTRL: PDM clock generator control */
  #define PDM_PDMCLKCTRL_ResetValue (0x08400000UL)   /*!< Reset value of PDMCLKCTRL register.                                  */

/* FREQ @Bits 0..31 : PDM_CLK frequency configuration. Enumerations are deprecated, use PDMCLKCTRL equation to find the register
                      value. The 12 least significant bits of the register are ignored and shall be set to zero. */

  #define PDM_PDMCLKCTRL_FREQ_Pos (0UL)              /*!< Position of FREQ field.                                              */
  #define PDM_PDMCLKCTRL_FREQ_Msk (0xFFFFFFFFUL << PDM_PDMCLKCTRL_FREQ_Pos) /*!< Bit mask of FREQ field.                       */
  #define PDM_PDMCLKCTRL_FREQ_Min (0x8000000UL)      /*!< Min enumerator value of FREQ field.                                  */
  #define PDM_PDMCLKCTRL_FREQ_Max (0xA800000UL)      /*!< Max enumerator value of FREQ field.                                  */
  #define PDM_PDMCLKCTRL_FREQ_1000K (0x08000000UL)   /*!< PDM_CLK = 32 MHz / 32 = 1.000 MHz                                    */
  #define PDM_PDMCLKCTRL_FREQ_Default (0x08400000UL) /*!< PDM_CLK = 32 MHz / 31 = 1.032 MHz. Nominal clock for RATIO=Ratio64.
                                                          Assumes a 20 bit Baud Rate Generator (BRG) dividing the 32 MHz clock.
                                                          Output of BRG is connected to PDM_CLK, the filter source clock
                                                          requires twice that rate, a frequency doubler is built in the module
                                                          to provide 2.048 MHz, which implies a filter clockdiv ratio hardcoded
                                                          at x2 to the IP.*/
  #define PDM_PDMCLKCTRL_FREQ_1067K (0x08800000UL)   /*!< PDM_CLK = 32 MHz / 30 = 1.067 MHz                                    */
  #define PDM_PDMCLKCTRL_FREQ_1231K (0x09800000UL)   /*!< PDM_CLK = 32 MHz / 26 = 1.231 MHz                                    */
  #define PDM_PDMCLKCTRL_FREQ_1280K (0x0A000000UL)   /*!< PDM_CLK = 32 MHz / 25 = 1.280 MHz. Nominal clock for RATIO=Ratio80.  */
  #define PDM_PDMCLKCTRL_FREQ_1333K (0x0A800000UL)   /*!< PDM_CLK = 32 MHz / 24 = 1.333 MHz                                    */


/* PDM_MODE: Defines the routing of the connected PDM microphones' signals */
  #define PDM_MODE_ResetValue (0x00000000UL)         /*!< Reset value of MODE register.                                        */

/* OPERATION @Bit 0 : Mono or stereo operation Mono also disables the gated clock to the right filter bank */
  #define PDM_MODE_OPERATION_Pos (0UL)               /*!< Position of OPERATION field.                                         */
  #define PDM_MODE_OPERATION_Msk (0x1UL << PDM_MODE_OPERATION_Pos) /*!< Bit mask of OPERATION field.                           */
  #define PDM_MODE_OPERATION_Min (0x0UL)             /*!< Min enumerator value of OPERATION field.                             */
  #define PDM_MODE_OPERATION_Max (0x1UL)             /*!< Max enumerator value of OPERATION field.                             */
  #define PDM_MODE_OPERATION_Stereo (0x0UL)          /*!< Sample and store one pair (left + right) of 16-bit samples per RAM
                                                          word R=[31:16]; L=[15:0]*/
  #define PDM_MODE_OPERATION_Mono (0x1UL)            /*!< Sample and store two successive left samples (16 bits each) per RAM
                                                          word L1=[31:16]; L0=[15:0]*/

/* EDGE @Bit 1 : Defines on which PDM_CLK edge left (or mono) is sampled. */
  #define PDM_MODE_EDGE_Pos (1UL)                    /*!< Position of EDGE field.                                              */
  #define PDM_MODE_EDGE_Msk (0x1UL << PDM_MODE_EDGE_Pos) /*!< Bit mask of EDGE field.                                          */
  #define PDM_MODE_EDGE_Min (0x0UL)                  /*!< Min enumerator value of EDGE field.                                  */
  #define PDM_MODE_EDGE_Max (0x1UL)                  /*!< Max enumerator value of EDGE field.                                  */
  #define PDM_MODE_EDGE_LeftFalling (0x0UL)          /*!< Left (or mono) is sampled on falling edge of PDM_CLK                 */
  #define PDM_MODE_EDGE_LeftRising (0x1UL)           /*!< Left (or mono) is sampled on rising edge of PDM_CLK                  */


/* PDM_FDBYPASS: Bypass the frequency doubler in the PDM clock generation */
  #define PDM_FDBYPASS_ResetValue (0x00000000UL)     /*!< Reset value of FDBYPASS register.                                    */

/* BYPASS @Bit 0 : Bypass the frequency doubler in the PDM clock generation, and revert to a simple divider structure. */
  #define PDM_FDBYPASS_BYPASS_Pos (0UL)              /*!< Position of BYPASS field.                                            */
  #define PDM_FDBYPASS_BYPASS_Msk (0x1UL << PDM_FDBYPASS_BYPASS_Pos) /*!< Bit mask of BYPASS field.                            */
  #define PDM_FDBYPASS_BYPASS_Min (0x0UL)            /*!< Min enumerator value of BYPASS field.                                */
  #define PDM_FDBYPASS_BYPASS_Max (0x1UL)            /*!< Max enumerator value of BYPASS field.                                */
  #define PDM_FDBYPASS_BYPASS_DoublerActive (0x0UL)  /*!< PDMCLKCTRL determines directly the PDM_CLK frequency. A doubler is
                                                          used to provide twice that clock to the filters. This allows better
                                                          accuracy on PDM_CLK.*/
  #define PDM_FDBYPASS_BYPASS_DividerActive (0x1UL)  /*!< PDMCLKCTRL determines the clock provided to the filters, PDM_CLK is
                                                          generated by dividing that clock by two. This results in less accuracy
                                                          on PDM_CLK.*/


/* PDM_RXDLDATA: Left sample from filter output */
  #define PDM_RXDLDATA_ResetValue (0x00000000UL)     /*!< Reset value of RXDLDATA register.                                    */

/* RXDLDATA @Bits 0..15 : Left sample from filter output */
  #define PDM_RXDLDATA_RXDLDATA_Pos (0UL)            /*!< Position of RXDLDATA field.                                          */
  #define PDM_RXDLDATA_RXDLDATA_Msk (0xFFFFUL << PDM_RXDLDATA_RXDLDATA_Pos) /*!< Bit mask of RXDLDATA field.                   */


/* PDM_RXDRDATA: Right sample from filter output */
  #define PDM_RXDRDATA_ResetValue (0x00000000UL)     /*!< Reset value of RXDRDATA register.                                    */

/* RXDRDATA @Bits 0..15 : Right sample from filter output */
  #define PDM_RXDRDATA_RXDRDATA_Pos (0UL)            /*!< Position of RXDRDATA field.                                          */
  #define PDM_RXDRDATA_RXDRDATA_Msk (0xFFFFUL << PDM_RXDRDATA_RXDRDATA_Pos) /*!< Bit mask of RXDRDATA field.                   */


/* PDM_GAINL: Left output gain adjustment */
  #define PDM_GAINL_ResetValue (0x00000028UL)        /*!< Reset value of GAINL register.                                       */

/* GAINL @Bits 0..6 : Left output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)
                      0x00 -20 dB gain adjust 0x01 -19.5 dB gain adjust (...) 0x27 -0.5 dB gain adjust 0x28 0 dB gain adjust
                      0x29 +0.5 dB gain adjust (...) 0x4F +19.5 dB gain adjust 0x50 +20 dB gain adjust 0x51 +20 dB gain adjust
                      0x52 +20 dB gain adjust (...) */

  #define PDM_GAINL_GAINL_Pos (0UL)                  /*!< Position of GAINL field.                                             */
  #define PDM_GAINL_GAINL_Msk (0x7FUL << PDM_GAINL_GAINL_Pos) /*!< Bit mask of GAINL field.                                    */
  #define PDM_GAINL_GAINL_Min (0x0UL)                /*!< Min enumerator value of GAINL field.                                 */
  #define PDM_GAINL_GAINL_Max (0x50UL)               /*!< Max enumerator value of GAINL field.                                 */
  #define PDM_GAINL_GAINL_MinGain (0x00UL)           /*!< -20 dB gain adjustment (minimum)                                     */
  #define PDM_GAINL_GAINL_DefaultGain (0x28UL)       /*!< 0 dB gain adjustment                                                 */
  #define PDM_GAINL_GAINL_MaxGain (0x50UL)           /*!< +20 dB gain adjustment (maximum)                                     */


/* PDM_GAINR: Right output gain adjustment */
  #define PDM_GAINR_ResetValue (0x00000028UL)        /*!< Reset value of GAINR register.                                       */

/* GAINR @Bits 0..6 : Right output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)
                      */

  #define PDM_GAINR_GAINR_Pos (0UL)                  /*!< Position of GAINR field.                                             */
  #define PDM_GAINR_GAINR_Msk (0x7FUL << PDM_GAINR_GAINR_Pos) /*!< Bit mask of GAINR field.                                    */
  #define PDM_GAINR_GAINR_Min (0x0UL)                /*!< Min enumerator value of GAINR field.                                 */
  #define PDM_GAINR_GAINR_Max (0x50UL)               /*!< Max enumerator value of GAINR field.                                 */
  #define PDM_GAINR_GAINR_MinGain (0x00UL)           /*!< -20 dB gain adjustment (minimum)                                     */
  #define PDM_GAINR_GAINR_DefaultGain (0x28UL)       /*!< 0 dB gain adjustment                                                 */
  #define PDM_GAINR_GAINR_MaxGain (0x50UL)           /*!< +20 dB gain adjustment (maximum)                                     */


/* PDM_RATIO: Selects the decimation ratio between PDM_CLK and output sample rate. Change PDMCLKCTRL accordingly. */
  #define PDM_RATIO_ResetValue (0x00000002UL)        /*!< Reset value of RATIO register.                                       */

/* RATIO @Bits 0..2 : Selects the decimation ratio between PDM_CLK and output sample rate */
  #define PDM_RATIO_RATIO_Pos (0UL)                  /*!< Position of RATIO field.                                             */
  #define PDM_RATIO_RATIO_Msk (0x7UL << PDM_RATIO_RATIO_Pos) /*!< Bit mask of RATIO field.                                     */
  #define PDM_RATIO_RATIO_Min (0x0UL)                /*!< Min enumerator value of RATIO field.                                 */
  #define PDM_RATIO_RATIO_Max (0x7UL)                /*!< Max enumerator value of RATIO field.                                 */
  #define PDM_RATIO_RATIO_Ratio32 (0x0UL)            /*!< Ratio of 32                                                          */
  #define PDM_RATIO_RATIO_Ratio48 (0x1UL)            /*!< Ratio of 48                                                          */
  #define PDM_RATIO_RATIO_Ratio50 (0x2UL)            /*!< Ratio of 50                                                          */
  #define PDM_RATIO_RATIO_Ratio64 (0x3UL)            /*!< Ratio of 64                                                          */
  #define PDM_RATIO_RATIO_Ratio80 (0x4UL)            /*!< Ratio of 80                                                          */
  #define PDM_RATIO_RATIO_Ratio96 (0x5UL)            /*!< Ratio of 96                                                          */
  #define PDM_RATIO_RATIO_Ratio100 (0x6UL)           /*!< Ratio of 100                                                         */
  #define PDM_RATIO_RATIO_Ratio128 (0x7UL)           /*!< Ratio of 128                                                         */


/* PDM_PHASE: Selection of delay on the clock line (to avoid potential setup&hold timing violation on input data) */
  #define PDM_PHASE_ResetValue (0x00000000UL)        /*!< Reset value of PHASE register.                                       */

