adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PHASE @Bits 0..3 : To avoid potential setup&hold timing violation on input data, this register provides selection between 14
                      phase delay registers (15 taps), which each provide an additional 31.25ns delay of pdmClockToPad relative
                      to pdmClockToFilter. */

  #define PDM_PHASE_PHASE_Pos (0UL)                  /*!< Position of PHASE field.                                             */
  #define PDM_PHASE_PHASE_Msk (0xFUL << PDM_PHASE_PHASE_Pos) /*!< Bit mask of PHASE field.                                     */
  #define PDM_PHASE_PHASE_Min (0x0UL)                /*!< Min value of PHASE field.                                            */
  #define PDM_PHASE_PHASE_Max (0xEUL)                /*!< Max size of PHASE field.                                             */


/* PDM_MCLKCONFIG: Master clock generator configuration */
  #define PDM_MCLKCONFIG_ResetValue (0x00000000UL)   /*!< Reset value of MCLKCONFIG register.                                  */

/* SRC @Bit 0 : Master clock source selection */
  #define PDM_MCLKCONFIG_SRC_Pos (0UL)               /*!< Position of SRC field.                                               */
  #define PDM_MCLKCONFIG_SRC_Msk (0x1UL << PDM_MCLKCONFIG_SRC_Pos) /*!< Bit mask of SRC field.                                 */
  #define PDM_MCLKCONFIG_SRC_Min (0x0UL)             /*!< Min enumerator value of SRC field.                                   */
  #define PDM_MCLKCONFIG_SRC_Max (0x1UL)             /*!< Max enumerator value of SRC field.                                   */
  #define PDM_MCLKCONFIG_SRC_PCLK32M (0x0UL)         /*!< 32 MHz peripheral clock                                              */
  #define PDM_MCLKCONFIG_SRC_ACLK (0x1UL)            /*!< Audio PLL clock                                                      */

/* JITTER @Bit 9 : Enable jittering master clock. */
  #define PDM_MCLKCONFIG_JITTER_Pos (9UL)            /*!< Position of JITTER field.                                            */
  #define PDM_MCLKCONFIG_JITTER_Msk (0x1UL << PDM_MCLKCONFIG_JITTER_Pos) /*!< Bit mask of JITTER field.                        */
  #define PDM_MCLKCONFIG_JITTER_Min (0x0UL)          /*!< Min enumerator value of JITTER field.                                */
  #define PDM_MCLKCONFIG_JITTER_Max (0x1UL)          /*!< Max enumerator value of JITTER field.                                */
  #define PDM_MCLKCONFIG_JITTER_Disable (0x0UL)      /*!< Disable jitter                                                       */
  #define PDM_MCLKCONFIG_JITTER_Enable (0x1UL)       /*!< Enable jitter                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           POWER                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct POWER_TASKS_SEMAPHORE =============================================== */
/**
  * @brief TASKS_SEMAPHORE [POWER_TASKS_SEMAPHORE] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  ACQUIRE;                           /*!< (@ 0x00000000) Acquire the semaphore for regulator voltage scaling
                                                                         procedure.*/
  __OM  uint32_t  RELEASE;                           /*!< (@ 0x00000004) Release the semaphore for regulator voltage scaling
                                                                         procedure.*/
} NRF_POWER_TASKS_SEMAPHORE_Type;                    /*!< Size = 8 (0x008)                                                     */

/* POWER_TASKS_SEMAPHORE_ACQUIRE: Acquire the semaphore for regulator voltage scaling procedure. */
  #define POWER_TASKS_SEMAPHORE_ACQUIRE_ResetValue (0x00000000UL) /*!< Reset value of ACQUIRE register.                        */

/* ACQUIRE @Bit 0 : Acquire the semaphore for regulator voltage scaling procedure. */
  #define POWER_TASKS_SEMAPHORE_ACQUIRE_ACQUIRE_Pos (0UL) /*!< Position of ACQUIRE field.                                      */
  #define POWER_TASKS_SEMAPHORE_ACQUIRE_ACQUIRE_Msk (0x1UL << POWER_TASKS_SEMAPHORE_ACQUIRE_ACQUIRE_Pos) /*!< Bit mask of
                                                                            ACQUIRE field.*/
  #define POWER_TASKS_SEMAPHORE_ACQUIRE_ACQUIRE_Min (0x1UL) /*!< Min enumerator value of ACQUIRE field.                        */
  #define POWER_TASKS_SEMAPHORE_ACQUIRE_ACQUIRE_Max (0x1UL) /*!< Max enumerator value of ACQUIRE field.                        */
  #define POWER_TASKS_SEMAPHORE_ACQUIRE_ACQUIRE_Trigger (0x1UL) /*!< Trigger task                                              */


/* POWER_TASKS_SEMAPHORE_RELEASE: Release the semaphore for regulator voltage scaling procedure. */
  #define POWER_TASKS_SEMAPHORE_RELEASE_ResetValue (0x00000000UL) /*!< Reset value of RELEASE register.                        */

/* RELEASE @Bit 0 : Release the semaphore for regulator voltage scaling procedure. */
  #define POWER_TASKS_SEMAPHORE_RELEASE_RELEASE_Pos (0UL) /*!< Position of RELEASE field.                                      */
  #define POWER_TASKS_SEMAPHORE_RELEASE_RELEASE_Msk (0x1UL << POWER_TASKS_SEMAPHORE_RELEASE_RELEASE_Pos) /*!< Bit mask of
                                                                            RELEASE field.*/
  #define POWER_TASKS_SEMAPHORE_RELEASE_RELEASE_Min (0x1UL) /*!< Min enumerator value of RELEASE field.                        */
  #define POWER_TASKS_SEMAPHORE_RELEASE_RELEASE_Max (0x1UL) /*!< Max enumerator value of RELEASE field.                        */
  #define POWER_TASKS_SEMAPHORE_RELEASE_RELEASE_Trigger (0x1UL) /*!< Trigger task                                              */



