adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_REGUPDATE @Bit 0 : Update the regulator configuration. */
  #define POWER_TASKS_REGUPDATE_TASKS_REGUPDATE_Pos (0UL) /*!< Position of TASKS_REGUPDATE field.                              */
  #define POWER_TASKS_REGUPDATE_TASKS_REGUPDATE_Msk (0x1UL << POWER_TASKS_REGUPDATE_TASKS_REGUPDATE_Pos) /*!< Bit mask of
                                                                            TASKS_REGUPDATE field.*/
  #define POWER_TASKS_REGUPDATE_TASKS_REGUPDATE_Min (0x1UL) /*!< Min enumerator value of TASKS_REGUPDATE field.                */
  #define POWER_TASKS_REGUPDATE_TASKS_REGUPDATE_Max (0x1UL) /*!< Max enumerator value of TASKS_REGUPDATE field.                */
  #define POWER_TASKS_REGUPDATE_TASKS_REGUPDATE_Trigger (0x1UL) /*!< Trigger task                                              */


/* POWER_TASKS_TDDPDREQCLR: Clear the power domain request for Trace data and debug (TDD). */
  #define POWER_TASKS_TDDPDREQCLR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TDDPDREQCLR register.                    */

/* TASKS_TDDPDREQCLR @Bit 0 : Clear the power domain request for Trace data and debug (TDD). */
  #define POWER_TASKS_TDDPDREQCLR_TASKS_TDDPDREQCLR_Pos (0UL) /*!< Position of TASKS_TDDPDREQCLR field.                        */
  #define POWER_TASKS_TDDPDREQCLR_TASKS_TDDPDREQCLR_Msk (0x1UL << POWER_TASKS_TDDPDREQCLR_TASKS_TDDPDREQCLR_Pos) /*!< Bit mask
                                                                            of TASKS_TDDPDREQCLR field.*/
  #define POWER_TASKS_TDDPDREQCLR_TASKS_TDDPDREQCLR_Min (0x1UL) /*!< Min enumerator value of TASKS_TDDPDREQCLR field.          */
  #define POWER_TASKS_TDDPDREQCLR_TASKS_TDDPDREQCLR_Max (0x1UL) /*!< Max enumerator value of TASKS_TDDPDREQCLR field.          */
  #define POWER_TASKS_TDDPDREQCLR_TASKS_TDDPDREQCLR_Trigger (0x1UL) /*!< Trigger task                                          */


/* POWER_EVENTS_REGUPDATED: Updated the regulator configuration. */
  #define POWER_EVENTS_REGUPDATED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_REGUPDATED register.                    */

/* EVENTS_REGUPDATED @Bit 0 : Updated the regulator configuration. */
  #define POWER_EVENTS_REGUPDATED_EVENTS_REGUPDATED_Pos (0UL) /*!< Position of EVENTS_REGUPDATED field.                        */
  #define POWER_EVENTS_REGUPDATED_EVENTS_REGUPDATED_Msk (0x1UL << POWER_EVENTS_REGUPDATED_EVENTS_REGUPDATED_Pos) /*!< Bit mask
                                                                            of EVENTS_REGUPDATED field.*/
  #define POWER_EVENTS_REGUPDATED_EVENTS_REGUPDATED_Min (0x0UL) /*!< Min enumerator value of EVENTS_REGUPDATED field.          */
  #define POWER_EVENTS_REGUPDATED_EVENTS_REGUPDATED_Max (0x1UL) /*!< Max enumerator value of EVENTS_REGUPDATED field.          */
  #define POWER_EVENTS_REGUPDATED_EVENTS_REGUPDATED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define POWER_EVENTS_REGUPDATED_EVENTS_REGUPDATED_Generated (0x1UL) /*!< Event generated                                     */


/* POWER_EVENTS_ABBLOCK: ABB lock for the ABB domain [n] */
  #define POWER_EVENTS_ABBLOCK_MaxCount (2UL)        /*!< Max size of EVENTS_ABBLOCK[2] array.                                 */
  #define POWER_EVENTS_ABBLOCK_MaxIndex (1UL)        /*!< Max index of EVENTS_ABBLOCK[2] array.                                */
  #define POWER_EVENTS_ABBLOCK_MinIndex (0UL)        /*!< Min index of EVENTS_ABBLOCK[2] array.                                */
  #define POWER_EVENTS_ABBLOCK_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ABBLOCK[2] register.                       */

/* EVENTS_ABBLOCK @Bit 0 : ABB lock for the ABB domain [n] */
  #define POWER_EVENTS_ABBLOCK_EVENTS_ABBLOCK_Pos (0UL) /*!< Position of EVENTS_ABBLOCK field.                                 */
  #define POWER_EVENTS_ABBLOCK_EVENTS_ABBLOCK_Msk (0x1UL << POWER_EVENTS_ABBLOCK_EVENTS_ABBLOCK_Pos) /*!< Bit mask of
                                                                            EVENTS_ABBLOCK field.*/
  #define POWER_EVENTS_ABBLOCK_EVENTS_ABBLOCK_Min (0x0UL) /*!< Min enumerator value of EVENTS_ABBLOCK field.                   */
  #define POWER_EVENTS_ABBLOCK_EVENTS_ABBLOCK_Max (0x1UL) /*!< Max enumerator value of EVENTS_ABBLOCK field.                   */
  #define POWER_EVENTS_ABBLOCK_EVENTS_ABBLOCK_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define POWER_EVENTS_ABBLOCK_EVENTS_ABBLOCK_Generated (0x1UL) /*!< Event generated                                           */


/* POWER_INTEN: Enable or disable interrupt */
  #define POWER_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* SEMAPHOREACQUIRED @Bit 0 : Enable or disable interrupt for event SEMAPHOREACQUIRED */
  #define POWER_INTEN_SEMAPHOREACQUIRED_Pos (0UL)    /*!< Position of SEMAPHOREACQUIRED field.                                 */
  #define POWER_INTEN_SEMAPHOREACQUIRED_Msk (0x1UL << POWER_INTEN_SEMAPHOREACQUIRED_Pos) /*!< Bit mask of SEMAPHOREACQUIRED
                                                                            field.*/
  #define POWER_INTEN_SEMAPHOREACQUIRED_Min (0x0UL)  /*!< Min enumerator value of SEMAPHOREACQUIRED field.                     */
  #define POWER_INTEN_SEMAPHOREACQUIRED_Max (0x1UL)  /*!< Max enumerator value of SEMAPHOREACQUIRED field.                     */
  #define POWER_INTEN_SEMAPHOREACQUIRED_Disabled (0x0UL) /*!< Disable                                                          */
  #define POWER_INTEN_SEMAPHOREACQUIRED_Enabled (0x1UL) /*!< Enable                                                            */

/* SEMAPHORERELEASED @Bit 1 : Enable or disable interrupt for event SEMAPHORERELEASED */
  #define POWER_INTEN_SEMAPHORERELEASED_Pos (1UL)    /*!< Position of SEMAPHORERELEASED field.                                 */
  #define POWER_INTEN_SEMAPHORERELEASED_Msk (0x1UL << POWER_INTEN_SEMAPHORERELEASED_Pos) /*!< Bit mask of SEMAPHORERELEASED
                                                                            field.*/
  #define POWER_INTEN_SEMAPHORERELEASED_Min (0x0UL)  /*!< Min enumerator value of SEMAPHORERELEASED field.                     */
  #define POWER_INTEN_SEMAPHORERELEASED_Max (0x1UL)  /*!< Max enumerator value of SEMAPHORERELEASED field.                     */
  #define POWER_INTEN_SEMAPHORERELEASED_Disabled (0x0UL) /*!< Disable                                                          */
  #define POWER_INTEN_SEMAPHORERELEASED_Enabled (0x1UL) /*!< Enable                                                            */

/* REGUPDATED @Bit 2 : Enable or disable interrupt for event REGUPDATED */
  #define POWER_INTEN_REGUPDATED_Pos (2UL)           /*!< Position of REGUPDATED field.                                        */
  #define POWER_INTEN_REGUPDATED_Msk (0x1UL << POWER_INTEN_REGUPDATED_Pos) /*!< Bit mask of REGUPDATED field.                  */
  #define POWER_INTEN_REGUPDATED_Min (0x0UL)         /*!< Min enumerator value of REGUPDATED field.                            */
  #define POWER_INTEN_REGUPDATED_Max (0x1UL)         /*!< Max enumerator value of REGUPDATED field.                            */
  #define POWER_INTEN_REGUPDATED_Disabled (0x0UL)    /*!< Disable                                                              */
  #define POWER_INTEN_REGUPDATED_Enabled (0x1UL)     /*!< Enable                                                               */

