adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ABBLOCK0 @Bit 3 : Enable or disable interrupt for event ABBLOCK[0] */
  #define POWER_INTEN_ABBLOCK0_Pos (3UL)             /*!< Position of ABBLOCK0 field.                                          */
  #define POWER_INTEN_ABBLOCK0_Msk (0x1UL << POWER_INTEN_ABBLOCK0_Pos) /*!< Bit mask of ABBLOCK0 field.                        */
  #define POWER_INTEN_ABBLOCK0_Min (0x0UL)           /*!< Min enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTEN_ABBLOCK0_Max (0x1UL)           /*!< Max enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTEN_ABBLOCK0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define POWER_INTEN_ABBLOCK0_Enabled (0x1UL)       /*!< Enable                                                               */

/* ABBLOCK1 @Bit 4 : Enable or disable interrupt for event ABBLOCK[1] */
  #define POWER_INTEN_ABBLOCK1_Pos (4UL)             /*!< Position of ABBLOCK1 field.                                          */
  #define POWER_INTEN_ABBLOCK1_Msk (0x1UL << POWER_INTEN_ABBLOCK1_Pos) /*!< Bit mask of ABBLOCK1 field.                        */
  #define POWER_INTEN_ABBLOCK1_Min (0x0UL)           /*!< Min enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTEN_ABBLOCK1_Max (0x1UL)           /*!< Max enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTEN_ABBLOCK1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define POWER_INTEN_ABBLOCK1_Enabled (0x1UL)       /*!< Enable                                                               */


/* POWER_INTENSET: Enable interrupt */
  #define POWER_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* SEMAPHOREACQUIRED @Bit 0 : Write '1' to enable interrupt for event SEMAPHOREACQUIRED */
  #define POWER_INTENSET_SEMAPHOREACQUIRED_Pos (0UL) /*!< Position of SEMAPHOREACQUIRED field.                                 */
  #define POWER_INTENSET_SEMAPHOREACQUIRED_Msk (0x1UL << POWER_INTENSET_SEMAPHOREACQUIRED_Pos) /*!< Bit mask of
                                                                            SEMAPHOREACQUIRED field.*/
  #define POWER_INTENSET_SEMAPHOREACQUIRED_Min (0x0UL) /*!< Min enumerator value of SEMAPHOREACQUIRED field.                   */
  #define POWER_INTENSET_SEMAPHOREACQUIRED_Max (0x1UL) /*!< Max enumerator value of SEMAPHOREACQUIRED field.                   */
  #define POWER_INTENSET_SEMAPHOREACQUIRED_Set (0x1UL) /*!< Enable                                                             */
  #define POWER_INTENSET_SEMAPHOREACQUIRED_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define POWER_INTENSET_SEMAPHOREACQUIRED_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* SEMAPHORERELEASED @Bit 1 : Write '1' to enable interrupt for event SEMAPHORERELEASED */
  #define POWER_INTENSET_SEMAPHORERELEASED_Pos (1UL) /*!< Position of SEMAPHORERELEASED field.                                 */
  #define POWER_INTENSET_SEMAPHORERELEASED_Msk (0x1UL << POWER_INTENSET_SEMAPHORERELEASED_Pos) /*!< Bit mask of
                                                                            SEMAPHORERELEASED field.*/
  #define POWER_INTENSET_SEMAPHORERELEASED_Min (0x0UL) /*!< Min enumerator value of SEMAPHORERELEASED field.                   */
  #define POWER_INTENSET_SEMAPHORERELEASED_Max (0x1UL) /*!< Max enumerator value of SEMAPHORERELEASED field.                   */
  #define POWER_INTENSET_SEMAPHORERELEASED_Set (0x1UL) /*!< Enable                                                             */
  #define POWER_INTENSET_SEMAPHORERELEASED_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define POWER_INTENSET_SEMAPHORERELEASED_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* REGUPDATED @Bit 2 : Write '1' to enable interrupt for event REGUPDATED */
  #define POWER_INTENSET_REGUPDATED_Pos (2UL)        /*!< Position of REGUPDATED field.                                        */
  #define POWER_INTENSET_REGUPDATED_Msk (0x1UL << POWER_INTENSET_REGUPDATED_Pos) /*!< Bit mask of REGUPDATED field.            */
  #define POWER_INTENSET_REGUPDATED_Min (0x0UL)      /*!< Min enumerator value of REGUPDATED field.                            */
  #define POWER_INTENSET_REGUPDATED_Max (0x1UL)      /*!< Max enumerator value of REGUPDATED field.                            */
  #define POWER_INTENSET_REGUPDATED_Set (0x1UL)      /*!< Enable                                                               */
  #define POWER_INTENSET_REGUPDATED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define POWER_INTENSET_REGUPDATED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ABBLOCK0 @Bit 3 : Write '1' to enable interrupt for event ABBLOCK[0] */
  #define POWER_INTENSET_ABBLOCK0_Pos (3UL)          /*!< Position of ABBLOCK0 field.                                          */
  #define POWER_INTENSET_ABBLOCK0_Msk (0x1UL << POWER_INTENSET_ABBLOCK0_Pos) /*!< Bit mask of ABBLOCK0 field.                  */
  #define POWER_INTENSET_ABBLOCK0_Min (0x0UL)        /*!< Min enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTENSET_ABBLOCK0_Max (0x1UL)        /*!< Max enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTENSET_ABBLOCK0_Set (0x1UL)        /*!< Enable                                                               */
  #define POWER_INTENSET_ABBLOCK0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define POWER_INTENSET_ABBLOCK0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* ABBLOCK1 @Bit 4 : Write '1' to enable interrupt for event ABBLOCK[1] */
  #define POWER_INTENSET_ABBLOCK1_Pos (4UL)          /*!< Position of ABBLOCK1 field.                                          */
  #define POWER_INTENSET_ABBLOCK1_Msk (0x1UL << POWER_INTENSET_ABBLOCK1_Pos) /*!< Bit mask of ABBLOCK1 field.                  */
  #define POWER_INTENSET_ABBLOCK1_Min (0x0UL)        /*!< Min enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTENSET_ABBLOCK1_Max (0x1UL)        /*!< Max enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTENSET_ABBLOCK1_Set (0x1UL)        /*!< Enable                                                               */
  #define POWER_INTENSET_ABBLOCK1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define POWER_INTENSET_ABBLOCK1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


