adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* POWER_INTENCLR: Disable interrupt */
  #define POWER_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* SEMAPHOREACQUIRED @Bit 0 : Write '1' to disable interrupt for event SEMAPHOREACQUIRED */
  #define POWER_INTENCLR_SEMAPHOREACQUIRED_Pos (0UL) /*!< Position of SEMAPHOREACQUIRED field.                                 */
  #define POWER_INTENCLR_SEMAPHOREACQUIRED_Msk (0x1UL << POWER_INTENCLR_SEMAPHOREACQUIRED_Pos) /*!< Bit mask of
                                                                            SEMAPHOREACQUIRED field.*/
  #define POWER_INTENCLR_SEMAPHOREACQUIRED_Min (0x0UL) /*!< Min enumerator value of SEMAPHOREACQUIRED field.                   */
  #define POWER_INTENCLR_SEMAPHOREACQUIRED_Max (0x1UL) /*!< Max enumerator value of SEMAPHOREACQUIRED field.                   */
  #define POWER_INTENCLR_SEMAPHOREACQUIRED_Clear (0x1UL) /*!< Disable                                                          */
  #define POWER_INTENCLR_SEMAPHOREACQUIRED_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define POWER_INTENCLR_SEMAPHOREACQUIRED_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* SEMAPHORERELEASED @Bit 1 : Write '1' to disable interrupt for event SEMAPHORERELEASED */
  #define POWER_INTENCLR_SEMAPHORERELEASED_Pos (1UL) /*!< Position of SEMAPHORERELEASED field.                                 */
  #define POWER_INTENCLR_SEMAPHORERELEASED_Msk (0x1UL << POWER_INTENCLR_SEMAPHORERELEASED_Pos) /*!< Bit mask of
                                                                            SEMAPHORERELEASED field.*/
  #define POWER_INTENCLR_SEMAPHORERELEASED_Min (0x0UL) /*!< Min enumerator value of SEMAPHORERELEASED field.                   */
  #define POWER_INTENCLR_SEMAPHORERELEASED_Max (0x1UL) /*!< Max enumerator value of SEMAPHORERELEASED field.                   */
  #define POWER_INTENCLR_SEMAPHORERELEASED_Clear (0x1UL) /*!< Disable                                                          */
  #define POWER_INTENCLR_SEMAPHORERELEASED_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define POWER_INTENCLR_SEMAPHORERELEASED_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* REGUPDATED @Bit 2 : Write '1' to disable interrupt for event REGUPDATED */
  #define POWER_INTENCLR_REGUPDATED_Pos (2UL)        /*!< Position of REGUPDATED field.                                        */
  #define POWER_INTENCLR_REGUPDATED_Msk (0x1UL << POWER_INTENCLR_REGUPDATED_Pos) /*!< Bit mask of REGUPDATED field.            */
  #define POWER_INTENCLR_REGUPDATED_Min (0x0UL)      /*!< Min enumerator value of REGUPDATED field.                            */
  #define POWER_INTENCLR_REGUPDATED_Max (0x1UL)      /*!< Max enumerator value of REGUPDATED field.                            */
  #define POWER_INTENCLR_REGUPDATED_Clear (0x1UL)    /*!< Disable                                                              */
  #define POWER_INTENCLR_REGUPDATED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define POWER_INTENCLR_REGUPDATED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ABBLOCK0 @Bit 3 : Write '1' to disable interrupt for event ABBLOCK[0] */
  #define POWER_INTENCLR_ABBLOCK0_Pos (3UL)          /*!< Position of ABBLOCK0 field.                                          */
  #define POWER_INTENCLR_ABBLOCK0_Msk (0x1UL << POWER_INTENCLR_ABBLOCK0_Pos) /*!< Bit mask of ABBLOCK0 field.                  */
  #define POWER_INTENCLR_ABBLOCK0_Min (0x0UL)        /*!< Min enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTENCLR_ABBLOCK0_Max (0x1UL)        /*!< Max enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTENCLR_ABBLOCK0_Clear (0x1UL)      /*!< Disable                                                              */
  #define POWER_INTENCLR_ABBLOCK0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define POWER_INTENCLR_ABBLOCK0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* ABBLOCK1 @Bit 4 : Write '1' to disable interrupt for event ABBLOCK[1] */
  #define POWER_INTENCLR_ABBLOCK1_Pos (4UL)          /*!< Position of ABBLOCK1 field.                                          */
  #define POWER_INTENCLR_ABBLOCK1_Msk (0x1UL << POWER_INTENCLR_ABBLOCK1_Pos) /*!< Bit mask of ABBLOCK1 field.                  */
  #define POWER_INTENCLR_ABBLOCK1_Min (0x0UL)        /*!< Min enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTENCLR_ABBLOCK1_Max (0x1UL)        /*!< Max enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTENCLR_ABBLOCK1_Clear (0x1UL)      /*!< Disable                                                              */
  #define POWER_INTENCLR_ABBLOCK1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define POWER_INTENCLR_ABBLOCK1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* POWER_INTPEND: Pending interrupts */
  #define POWER_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* SEMAPHOREACQUIRED @Bit 0 : Read pending status of interrupt for event SEMAPHOREACQUIRED */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Pos (0UL)  /*!< Position of SEMAPHOREACQUIRED field.                                 */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Msk (0x1UL << POWER_INTPEND_SEMAPHOREACQUIRED_Pos) /*!< Bit mask of SEMAPHOREACQUIRED
                                                                            field.*/
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Min (0x0UL) /*!< Min enumerator value of SEMAPHOREACQUIRED field.                    */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Max (0x1UL) /*!< Max enumerator value of SEMAPHOREACQUIRED field.                    */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Pending (0x1UL) /*!< Read: Pending                                                   */

/* SEMAPHORERELEASED @Bit 1 : Read pending status of interrupt for event SEMAPHORERELEASED */
  #define POWER_INTPEND_SEMAPHORERELEASED_Pos (1UL)  /*!< Position of SEMAPHORERELEASED field.                                 */
  #define POWER_INTPEND_SEMAPHORERELEASED_Msk (0x1UL << POWER_INTPEND_SEMAPHORERELEASED_Pos) /*!< Bit mask of SEMAPHORERELEASED
                                                                            field.*/
  #define POWER_INTPEND_SEMAPHORERELEASED_Min (0x0UL) /*!< Min enumerator value of SEMAPHORERELEASED field.                    */
  #define POWER_INTPEND_SEMAPHORERELEASED_Max (0x1UL) /*!< Max enumerator value of SEMAPHORERELEASED field.                    */
  #define POWER_INTPEND_SEMAPHORERELEASED_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define POWER_INTPEND_SEMAPHORERELEASED_Pending (0x1UL) /*!< Read: Pending                                                   */

/* REGUPDATED @Bit 2 : Read pending status of interrupt for event REGUPDATED */
  #define POWER_INTPEND_REGUPDATED_Pos (2UL)         /*!< Position of REGUPDATED field.                                        */
  #define POWER_INTPEND_REGUPDATED_Msk (0x1UL << POWER_INTPEND_REGUPDATED_Pos) /*!< Bit mask of REGUPDATED field.              */
  #define POWER_INTPEND_REGUPDATED_Min (0x0UL)       /*!< Min enumerator value of REGUPDATED field.                            */
  #define POWER_INTPEND_REGUPDATED_Max (0x1UL)       /*!< Max enumerator value of REGUPDATED field.                            */
  #define POWER_INTPEND_REGUPDATED_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define POWER_INTPEND_REGUPDATED_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* ABBLOCK0 @Bit 3 : Read pending status of interrupt for event ABBLOCK[0] */
  #define POWER_INTPEND_ABBLOCK0_Pos (3UL)           /*!< Position of ABBLOCK0 field.                                          */
  #define POWER_INTPEND_ABBLOCK0_Msk (0x1UL << POWER_INTPEND_ABBLOCK0_Pos) /*!< Bit mask of ABBLOCK0 field.                    */
  #define POWER_INTPEND_ABBLOCK0_Min (0x0UL)         /*!< Min enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTPEND_ABBLOCK0_Max (0x1UL)         /*!< Max enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTPEND_ABBLOCK0_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define POWER_INTPEND_ABBLOCK0_Pending (0x1UL)     /*!< Read: Pending                                                        */

