adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ABBLOCK1 @Bit 4 : Read pending status of interrupt for event ABBLOCK[1] */
  #define POWER_INTPEND_ABBLOCK1_Pos (4UL)           /*!< Position of ABBLOCK1 field.                                          */
  #define POWER_INTPEND_ABBLOCK1_Msk (0x1UL << POWER_INTPEND_ABBLOCK1_Pos) /*!< Bit mask of ABBLOCK1 field.                    */
  #define POWER_INTPEND_ABBLOCK1_Min (0x0UL)         /*!< Min enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTPEND_ABBLOCK1_Max (0x1UL)         /*!< Max enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTPEND_ABBLOCK1_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define POWER_INTPEND_ABBLOCK1_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* POWER_DFTTAPPINENABLE: Routed to DFT tap controllers and enables target power domain. */
  #define POWER_DFTTAPPINENABLE_ResetValue (0x00000000UL) /*!< Reset value of DFTTAPPINENABLE register.                        */

/* ENABLE @Bits 0..1 : Enable */
  #define POWER_DFTTAPPINENABLE_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define POWER_DFTTAPPINENABLE_ENABLE_Msk (0x3UL << POWER_DFTTAPPINENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */
  #define POWER_DFTTAPPINENABLE_ENABLE_Min (0x0UL)   /*!< Min enumerator value of ENABLE field.                                */
  #define POWER_DFTTAPPINENABLE_ENABLE_Max (0x2UL)   /*!< Max enumerator value of ENABLE field.                                */
  #define POWER_DFTTAPPINENABLE_ENABLE_Disabled (0x0UL) /*!< Tap controllers disabled                                          */
  #define POWER_DFTTAPPINENABLE_ENABLE_EnabledMain (0x1UL) /*!< Main tap enabled                                               */
  #define POWER_DFTTAPPINENABLE_ENABLE_EnabledCryptoIsland (0x2UL) /*!< Crypto island tap enabled                              */


/* POWER_ATBGNDCLAMP: Control of ground clamps for Analog Test Bus lines. */
  #define POWER_ATBGNDCLAMP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ATBGNDCLAMP register.                                */

/* GNDCLAMPCTRL0 @Bit 0 : Enable ground clamp [0] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Pos (0UL)  /*!< Position of GNDCLAMPCTRL0 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Pos) /*!< Bit mask of GNDCLAMPCTRL0
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL0 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL0 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL1 @Bit 1 : Enable ground clamp [1] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Pos (1UL)  /*!< Position of GNDCLAMPCTRL1 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Pos) /*!< Bit mask of GNDCLAMPCTRL1
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL1 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL1 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL2 @Bit 2 : Enable ground clamp [2] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Pos (2UL)  /*!< Position of GNDCLAMPCTRL2 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Pos) /*!< Bit mask of GNDCLAMPCTRL2
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL2 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL2 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL3 @Bit 3 : Enable ground clamp [3] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Pos (3UL)  /*!< Position of GNDCLAMPCTRL3 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Pos) /*!< Bit mask of GNDCLAMPCTRL3
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL3 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL3 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL4 @Bit 4 : Enable ground clamp [4] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Pos (4UL)  /*!< Position of GNDCLAMPCTRL4 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Pos) /*!< Bit mask of GNDCLAMPCTRL4
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL4 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL4 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL5 @Bit 5 : Enable ground clamp [5] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Pos (5UL)  /*!< Position of GNDCLAMPCTRL5 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Pos) /*!< Bit mask of GNDCLAMPCTRL5
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL5 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL5 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL6 @Bit 6 : Enable ground clamp [6] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Pos (6UL)  /*!< Position of GNDCLAMPCTRL6 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Pos) /*!< Bit mask of GNDCLAMPCTRL6
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL6 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL6 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL7 @Bit 7 : Enable ground clamp [7] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Pos (7UL)  /*!< Position of GNDCLAMPCTRL7 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Pos) /*!< Bit mask of GNDCLAMPCTRL7
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL7 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL7 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL8 @Bit 8 : Enable ground clamp [8] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Pos (8UL)  /*!< Position of GNDCLAMPCTRL8 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Pos) /*!< Bit mask of GNDCLAMPCTRL8
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL8 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL8 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

