adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* GNDCLAMPCTRL9 @Bit 9 : Enable ground clamp [9] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Pos (9UL)  /*!< Position of GNDCLAMPCTRL9 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Pos) /*!< Bit mask of GNDCLAMPCTRL9
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL9 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL9 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL10 @Bit 10 : Enable ground clamp [10] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Pos (10UL) /*!< Position of GNDCLAMPCTRL10 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Pos) /*!< Bit mask of GNDCLAMPCTRL10
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL10 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL10 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL11 @Bit 11 : Enable ground clamp [11] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Pos (11UL) /*!< Position of GNDCLAMPCTRL11 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Pos) /*!< Bit mask of GNDCLAMPCTRL11
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL11 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL11 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL12 @Bit 12 : Enable ground clamp [12] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Pos (12UL) /*!< Position of GNDCLAMPCTRL12 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Pos) /*!< Bit mask of GNDCLAMPCTRL12
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL12 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL12 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL13 @Bit 13 : Enable ground clamp [13] */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Pos (13UL) /*!< Position of GNDCLAMPCTRL13 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Pos) /*!< Bit mask of GNDCLAMPCTRL13
                                                                            field.*/
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL13 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL13 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */


/* POWER_REGCONFIG: Regulator configuration */
  #define POWER_REGCONFIG_ResetValue (0x00000007UL)  /*!< Reset value of REGCONFIG register.                                   */

/* VREG1V8 @Bit 0 : Enable 1.8V regulator */
  #define POWER_REGCONFIG_VREG1V8_Pos (0UL)          /*!< Position of VREG1V8 field.                                           */
  #define POWER_REGCONFIG_VREG1V8_Msk (0x1UL << POWER_REGCONFIG_VREG1V8_Pos) /*!< Bit mask of VREG1V8 field.                   */
  #define POWER_REGCONFIG_VREG1V8_Min (0x0UL)        /*!< Min enumerator value of VREG1V8 field.                               */
  #define POWER_REGCONFIG_VREG1V8_Max (0x1UL)        /*!< Max enumerator value of VREG1V8 field.                               */
  #define POWER_REGCONFIG_VREG1V8_Disabled (0x0UL)   /*!< Regulator disabled                                                   */
  #define POWER_REGCONFIG_VREG1V8_Enabled (0x1UL)    /*!< Regulator enabled                                                    */

/* VREG1V0 @Bit 1 : Enable 1.0V regulator */
  #define POWER_REGCONFIG_VREG1V0_Pos (1UL)          /*!< Position of VREG1V0 field.                                           */
  #define POWER_REGCONFIG_VREG1V0_Msk (0x1UL << POWER_REGCONFIG_VREG1V0_Pos) /*!< Bit mask of VREG1V0 field.                   */
  #define POWER_REGCONFIG_VREG1V0_Min (0x0UL)        /*!< Min enumerator value of VREG1V0 field.                               */
  #define POWER_REGCONFIG_VREG1V0_Max (0x1UL)        /*!< Max enumerator value of VREG1V0 field.                               */
  #define POWER_REGCONFIG_VREG1V0_Disabled (0x0UL)   /*!< Regulator disabled                                                   */
  #define POWER_REGCONFIG_VREG1V0_Enabled (0x1UL)    /*!< Regulator enabled                                                    */

/* VREG0V8 @Bit 2 : Enable 0.8V regulator */
  #define POWER_REGCONFIG_VREG0V8_Pos (2UL)          /*!< Position of VREG0V8 field.                                           */
  #define POWER_REGCONFIG_VREG0V8_Msk (0x1UL << POWER_REGCONFIG_VREG0V8_Pos) /*!< Bit mask of VREG0V8 field.                   */
  #define POWER_REGCONFIG_VREG0V8_Min (0x0UL)        /*!< Min enumerator value of VREG0V8 field.                               */
  #define POWER_REGCONFIG_VREG0V8_Max (0x1UL)        /*!< Max enumerator value of VREG0V8 field.                               */
  #define POWER_REGCONFIG_VREG0V8_Disabled (0x0UL)   /*!< Regulator disabled                                                   */
  #define POWER_REGCONFIG_VREG0V8_Enabled (0x1UL)    /*!< Regulator enabled                                                    */

/* VREGVS @Bit 3 : Enable voltage scaled regulator */
  #define POWER_REGCONFIG_VREGVS_Pos (3UL)           /*!< Position of VREGVS field.                                            */
  #define POWER_REGCONFIG_VREGVS_Msk (0x1UL << POWER_REGCONFIG_VREGVS_Pos) /*!< Bit mask of VREGVS field.                      */
  #define POWER_REGCONFIG_VREGVS_Min (0x0UL)         /*!< Min enumerator value of VREGVS field.                                */
  #define POWER_REGCONFIG_VREGVS_Max (0x1UL)         /*!< Max enumerator value of VREGVS field.                                */
  #define POWER_REGCONFIG_VREGVS_Disabled (0x0UL)    /*!< Regulator disabled                                                   */
  #define POWER_REGCONFIG_VREGVS_Enabled (0x1UL)     /*!< Regulator enabled                                                    */

/* VREGMAIN1V8 @Bit 4 : Enable 1.8V rail at VREGMAIN regulator */
  #define POWER_REGCONFIG_VREGMAIN1V8_Pos (4UL)      /*!< Position of VREGMAIN1V8 field.                                       */
  #define POWER_REGCONFIG_VREGMAIN1V8_Msk (0x1UL << POWER_REGCONFIG_VREGMAIN1V8_Pos) /*!< Bit mask of VREGMAIN1V8 field.       */
  #define POWER_REGCONFIG_VREGMAIN1V8_Min (0x0UL)    /*!< Min enumerator value of VREGMAIN1V8 field.                           */
  #define POWER_REGCONFIG_VREGMAIN1V8_Max (0x1UL)    /*!< Max enumerator value of VREGMAIN1V8 field.                           */
  #define POWER_REGCONFIG_VREGMAIN1V8_Disabled (0x0UL) /*!< Regulator disabled                                                 */
  #define POWER_REGCONFIG_VREGMAIN1V8_Enabled (0x1UL) /*!< Regulator enabled                                                   */

/* VREGMAIN1V0 @Bit 5 : Enable 1.0V rail at VREGMAIN regulator */
  #define POWER_REGCONFIG_VREGMAIN1V0_Pos (5UL)      /*!< Position of VREGMAIN1V0 field.                                       */
  #define POWER_REGCONFIG_VREGMAIN1V0_Msk (0x1UL << POWER_REGCONFIG_VREGMAIN1V0_Pos) /*!< Bit mask of VREGMAIN1V0 field.       */
  #define POWER_REGCONFIG_VREGMAIN1V0_Min (0x0UL)    /*!< Min enumerator value of VREGMAIN1V0 field.                           */
  #define POWER_REGCONFIG_VREGMAIN1V0_Max (0x1UL)    /*!< Max enumerator value of VREGMAIN1V0 field.                           */
  #define POWER_REGCONFIG_VREGMAIN1V0_Disabled (0x0UL) /*!< Regulator disabled                                                 */
  #define POWER_REGCONFIG_VREGMAIN1V0_Enabled (0x1UL) /*!< Regulator enabled                                                   */

/* VREGMAINVS @Bit 6 : Enable voltage scaled rail at VREGMAIN regulator */
  #define POWER_REGCONFIG_VREGMAINVS_Pos (6UL)       /*!< Position of VREGMAINVS field.                                        */
  #define POWER_REGCONFIG_VREGMAINVS_Msk (0x1UL << POWER_REGCONFIG_VREGMAINVS_Pos) /*!< Bit mask of VREGMAINVS field.          */
  #define POWER_REGCONFIG_VREGMAINVS_Min (0x0UL)     /*!< Min enumerator value of VREGMAINVS field.                            */
  #define POWER_REGCONFIG_VREGMAINVS_Max (0x1UL)     /*!< Max enumerator value of VREGMAINVS field.                            */
  #define POWER_REGCONFIG_VREGMAINVS_Disabled (0x0UL) /*!< Regulator disabled                                                  */
  #define POWER_REGCONFIG_VREGMAINVS_Enabled (0x1UL) /*!< Regulator enabled                                                    */

/* FORCE @Bit 31 : Force the regulator enable configuration */
  #define POWER_REGCONFIG_FORCE_Pos (31UL)           /*!< Position of FORCE field.                                             */
  #define POWER_REGCONFIG_FORCE_Msk (0x1UL << POWER_REGCONFIG_FORCE_Pos) /*!< Bit mask of FORCE field.                         */
  #define POWER_REGCONFIG_FORCE_Min (0x0UL)          /*!< Min enumerator value of FORCE field.                                 */
  #define POWER_REGCONFIG_FORCE_Max (0x1UL)          /*!< Max enumerator value of FORCE field.                                 */
  #define POWER_REGCONFIG_FORCE_Disabled (0x0UL)     /*!< Force disabled                                                       */
  #define POWER_REGCONFIG_FORCE_Enabled (0x1UL)      /*!< Force enabled                                                        */


