adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* POWER_BLOCKULPMODE: Block entering into ULP mode */
  #define POWER_BLOCKULPMODE_ResetValue (0x00000000UL) /*!< Reset value of BLOCKULPMODE register.                              */

/* BLOCK @Bit 0 : Block ULP mode */
  #define POWER_BLOCKULPMODE_BLOCK_Pos (0UL)         /*!< Position of BLOCK field.                                             */
  #define POWER_BLOCKULPMODE_BLOCK_Msk (0x1UL << POWER_BLOCKULPMODE_BLOCK_Pos) /*!< Bit mask of BLOCK field.                   */
  #define POWER_BLOCKULPMODE_BLOCK_Min (0x0UL)       /*!< Min enumerator value of BLOCK field.                                 */
  #define POWER_BLOCKULPMODE_BLOCK_Max (0x1UL)       /*!< Max enumerator value of BLOCK field.                                 */
  #define POWER_BLOCKULPMODE_BLOCK_Allowed (0x0UL)   /*!< Allowed going into ULP mode                                          */
  #define POWER_BLOCKULPMODE_BLOCK_Blocked (0x1UL)   /*!< Blocked going into ULP mode                                          */


/* POWER_BLOCKULVMODE: Block entering into ULV mode */
  #define POWER_BLOCKULVMODE_ResetValue (0x00000000UL) /*!< Reset value of BLOCKULVMODE register.                              */

/* BLOCK @Bit 0 : Block ULV mode */
  #define POWER_BLOCKULVMODE_BLOCK_Pos (0UL)         /*!< Position of BLOCK field.                                             */
  #define POWER_BLOCKULVMODE_BLOCK_Msk (0x1UL << POWER_BLOCKULVMODE_BLOCK_Pos) /*!< Bit mask of BLOCK field.                   */
  #define POWER_BLOCKULVMODE_BLOCK_Min (0x0UL)       /*!< Min enumerator value of BLOCK field.                                 */
  #define POWER_BLOCKULVMODE_BLOCK_Max (0x1UL)       /*!< Max enumerator value of BLOCK field.                                 */
  #define POWER_BLOCKULVMODE_BLOCK_Allowed (0x0UL)   /*!< Allowed going into ULV mode                                          */
  #define POWER_BLOCKULVMODE_BLOCK_Blocked (0x1UL)   /*!< Blocked going into ULV mode                                          */


/* POWER_SEMAPHORESTATUS: Semaphore status */
  #define POWER_SEMAPHORESTATUS_ResetValue (0x00000000UL) /*!< Reset value of SEMAPHORESTATUS register.                        */

/* STATUS @Bit 0 : Semaphore status */
  #define POWER_SEMAPHORESTATUS_STATUS_Pos (0UL)     /*!< Position of STATUS field.                                            */
  #define POWER_SEMAPHORESTATUS_STATUS_Msk (0x1UL << POWER_SEMAPHORESTATUS_STATUS_Pos) /*!< Bit mask of STATUS field.          */
  #define POWER_SEMAPHORESTATUS_STATUS_Min (0x0UL)   /*!< Min enumerator value of STATUS field.                                */
  #define POWER_SEMAPHORESTATUS_STATUS_Max (0x1UL)   /*!< Max enumerator value of STATUS field.                                */
  #define POWER_SEMAPHORESTATUS_STATUS_Released (0x0UL) /*!< Semaphore released                                                */
  #define POWER_SEMAPHORESTATUS_STATUS_Acquired (0x1UL) /*!< Semaphore acquired                                                */


/* POWER_BILSENABLE: Enable BILS instances */
  #define POWER_BILSENABLE_ResetValue (0x00000000UL) /*!< Reset value of BILSENABLE register.                                  */

/* ENABLE @Bit 0 : Enable */
  #define POWER_BILSENABLE_ENABLE_Pos (0UL)          /*!< Position of ENABLE field.                                            */
  #define POWER_BILSENABLE_ENABLE_Msk (0x1UL << POWER_BILSENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                    */
  #define POWER_BILSENABLE_ENABLE_Min (0x0UL)        /*!< Min enumerator value of ENABLE field.                                */
  #define POWER_BILSENABLE_ENABLE_Max (0x1UL)        /*!< Max enumerator value of ENABLE field.                                */
  #define POWER_BILSENABLE_ENABLE_Disabled (0x0UL)   /*!< All BILS instances are disabled                                      */
  #define POWER_BILSENABLE_ENABLE_Enabled (0x1UL)    /*!< All configured BILS instances are enabled                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           PPIB                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct PPIB_OVERFLOW =================================================== */
/**
  * @brief OVERFLOW [PPIB_OVERFLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEND;                              /*!< (@ 0x00000000) The task overflow for SEND tasks using SUBSCRIBE_SEND.
                                                                         Write 0 to clear.*/
} NRF_PPIB_OVERFLOW_Type;                            /*!< Size = 4 (0x004)                                                     */

/* PPIB_OVERFLOW_SEND: The task overflow for SEND tasks using SUBSCRIBE_SEND. Write 0 to clear. */
  #define PPIB_OVERFLOW_SEND_ResetValue (0x00000000UL) /*!< Reset value of SEND register.                                      */

/* SEND0 @Bit 0 : The status for tasks overflow at SUBSCRIBE_SEND[0]. */
  #define PPIB_OVERFLOW_SEND_SEND0_Pos (0UL)         /*!< Position of SEND0 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND0_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND0_Pos) /*!< Bit mask of SEND0 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND0_Min (0x0UL)       /*!< Min enumerator value of SEND0 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND0_Max (0x1UL)       /*!< Max enumerator value of SEND0 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND0_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND0_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

