adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << PPIB_PUBLISH_RECEIVE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PPIB_PUBLISH_RECEIVE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define PPIB_PUBLISH_RECEIVE_EN_Msk (0x1UL << PPIB_PUBLISH_RECEIVE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define PPIB_PUBLISH_RECEIVE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define PPIB_PUBLISH_RECEIVE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define PPIB_PUBLISH_RECEIVE_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define PPIB_PUBLISH_RECEIVE_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       PROTOTYPEINFO                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct PROTOTYPEINFO =================================================== */
/**
  * @brief Prototype HW information registers.
  */
  typedef struct {                                   /*!< PROTOTYPEINFO Structure                                              */
    __IM uint32_t RESERVED[512];
    __IM uint32_t PSPHWID;                           /*!< (@ 0x00000800) PSP hardware ID register, unique ID for each prototype
                                                                         release. Used to identify RTL release that prototype is
                                                                         based on.*/
    __IM uint32_t FPGATIMESTAMP;                     /*!< (@ 0x00000804) 32-bit timestamp value stored by the FPGA bitstream in
                                                                         format ddddd_MMMM_yyyyyy_hhhhh_mmmmmm_ssssss. Unique
                                                                         for every FPGA netlist implementation, not dependent to
                                                                         RTL synthesis. 0x87654321 set in emulator database.*/
    __IM uint32_t EMULATORSPEEDVALUE;                /*!< (@ 0x00000808) Used to store real speed of emulator is running. Used
                                                                         by SW to config UART speed etc, to ensure correct
                                                                         operation.*/
    __IM uint32_t FPGACLOCKDIVIDERRATIO;             /*!< (@ 0x0000080C) Overall clock divider ratio for FPGA                  */
  } NRF_PROTOTYPEINFO_Type;                          /*!< Size = 2064 (0x810)                                                  */

/* PROTOTYPEINFO_PSPHWID: PSP hardware ID register, unique ID for each prototype release. Used to identify RTL release that
                           prototype is based on. */

  #define PROTOTYPEINFO_PSPHWID_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PSPHWID register.                                */

/* PATCHRELEASEVERSION @Bits 0..7 : PSP patch/bugfix release version */
  #define PROTOTYPEINFO_PSPHWID_PATCHRELEASEVERSION_Pos (0UL) /*!< Position of PATCHRELEASEVERSION field.                      */
  #define PROTOTYPEINFO_PSPHWID_PATCHRELEASEVERSION_Msk (0xFFUL << PROTOTYPEINFO_PSPHWID_PATCHRELEASEVERSION_Pos) /*!< Bit mask
                                                                            of PATCHRELEASEVERSION field.*/

/* HOTFIXRELEASEVERSION @Bits 8..15 : hotfix release version */
  #define PROTOTYPEINFO_PSPHWID_HOTFIXRELEASEVERSION_Pos (8UL) /*!< Position of HOTFIXRELEASEVERSION field.                    */
  #define PROTOTYPEINFO_PSPHWID_HOTFIXRELEASEVERSION_Msk (0xFFUL << PROTOTYPEINFO_PSPHWID_HOTFIXRELEASEVERSION_Pos) /*!< Bit
                                                                            mask of HOTFIXRELEASEVERSION field.*/

/* RTLRELEASEVERSION @Bits 16..23 : First letter of RTL release version in ASCII corresponding to A-Z. */
  #define PROTOTYPEINFO_PSPHWID_RTLRELEASEVERSION_Pos (16UL) /*!< Position of RTLRELEASEVERSION field.                         */
  #define PROTOTYPEINFO_PSPHWID_RTLRELEASEVERSION_Msk (0xFFUL << PROTOTYPEINFO_PSPHWID_RTLRELEASEVERSION_Pos) /*!< Bit mask of
                                                                            RTLRELEASEVERSION field.*/

/* PRODUCTCONFIG @Bits 24..31 : Product Config */
  #define PROTOTYPEINFO_PSPHWID_PRODUCTCONFIG_Pos (24UL) /*!< Position of PRODUCTCONFIG field.                                 */
  #define PROTOTYPEINFO_PSPHWID_PRODUCTCONFIG_Msk (0xFFUL << PROTOTYPEINFO_PSPHWID_PRODUCTCONFIG_Pos) /*!< Bit mask of
                                                                            PRODUCTCONFIG field.*/


/* PROTOTYPEINFO_FPGATIMESTAMP: 32-bit timestamp value stored by the FPGA bitstream in format
                                 ddddd_MMMM_yyyyyy_hhhhh_mmmmmm_ssssss. Unique for every FPGA netlist implementation, not
                                 dependent to RTL synthesis. 0x87654321 set in emulator database. */

  #define PROTOTYPEINFO_FPGATIMESTAMP_ResetValue (0x00000000UL) /*!< Reset value of FPGATIMESTAMP register.                    */

/* FPGATIMESTAMP @Bits 0..31 : ddddd = 5 bits to represent 31 days in a month. MMMM = 4 bits to represent 12 months in a year.
                               yyyyyy = 6 bits to represent 0 to 63 (to note year 2000 to 2063). hhhhh = 5 bits to represent 24
                               hours in a day. mmmmmm = 6 bits to represent 60 minutes in an hour. ssssss = 6 bits to represent
                               60 seconds in a minute. */

  #define PROTOTYPEINFO_FPGATIMESTAMP_FPGATIMESTAMP_Pos (0UL) /*!< Position of FPGATIMESTAMP field.                            */
  #define PROTOTYPEINFO_FPGATIMESTAMP_FPGATIMESTAMP_Msk (0xFFFFFFFFUL << PROTOTYPEINFO_FPGATIMESTAMP_FPGATIMESTAMP_Pos) /*!< Bit
                                                                            mask of FPGATIMESTAMP field.*/


/* PROTOTYPEINFO_EMULATORSPEEDVALUE: Used to store real speed of emulator is running. Used by SW to config UART speed etc, to
                                      ensure correct operation. */

