adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define PROTOTYPEINFO_EMULATORSPEEDVALUE_ResetValue (0x00000000UL) /*!< Reset value of EMULATORSPEEDVALUE register.          */

/* EMULATORSPEEDVALUE @Bits 0..31 : Actual clock speed for FCLK 400M in emulator (Hz). In FPGA set to 0x0. */
  #define PROTOTYPEINFO_EMULATORSPEEDVALUE_EMULATORSPEEDVALUE_Pos (0UL) /*!< Position of EMULATORSPEEDVALUE field.             */
  #define PROTOTYPEINFO_EMULATORSPEEDVALUE_EMULATORSPEEDVALUE_Msk (0xFFFFFFFFUL << PROTOTYPEINFO_EMULATORSPEEDVALUE_EMULATORSPEEDVALUE_Pos)
                                                                            /*!< Bit mask of EMULATORSPEEDVALUE field.*/


/* PROTOTYPEINFO_FPGACLOCKDIVIDERRATIO: Overall clock divider ratio for FPGA */
  #define PROTOTYPEINFO_FPGACLOCKDIVIDERRATIO_ResetValue (0x00000000UL) /*!< Reset value of FPGACLOCKDIVIDERRATIO register.    */

/* FPGACLOCKDIVIDERRATIO @Bits 0..31 : Overall clock divider ratio for FPGA. Set to 0 for emulator database. */
  #define PROTOTYPEINFO_FPGACLOCKDIVIDERRATIO_FPGACLOCKDIVIDERRATIO_Pos (0UL) /*!< Position of FPGACLOCKDIVIDERRATIO field.    */
  #define PROTOTYPEINFO_FPGACLOCKDIVIDERRATIO_FPGACLOCKDIVIDERRATIO_Msk (0xFFFFFFFFUL << PROTOTYPEINFO_FPGACLOCKDIVIDERRATIO_FPGACLOCKDIVIDERRATIO_Pos)
                                                                            /*!< Bit mask of FPGACLOCKDIVIDERRATIO field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PWM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct PWM_TASKS_DMA_SEQ ================================================= */
/**
  * @brief SEQ [PWM_TASKS_DMA_SEQ] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event. After a STOP task, the easyDMA (channel)
                                                                         will also enter its lowest required power level.*/
} NRF_PWM_TASKS_DMA_SEQ_Type;                        /*!< Size = 8 (0x008)                                                     */
  #define PWM_TASKS_DMA_SEQ_MaxCount (2UL)           /*!< Size of SEQ[2] array.                                                */
  #define PWM_TASKS_DMA_SEQ_MaxIndex (1UL)           /*!< Max index of SEQ[2] array.                                           */
  #define PWM_TASKS_DMA_SEQ_MinIndex (0UL)           /*!< Min index of SEQ[2] array.                                           */

/* PWM_TASKS_DMA_SEQ_START: Starts operation using easyDMA to load the values. See peripheral description for operation using
                             easyDMA. */

  #define PWM_TASKS_DMA_SEQ_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                */

/* START @Bit 0 : Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA. */
  #define PWM_TASKS_DMA_SEQ_START_START_Pos (0UL)    /*!< Position of START field.                                             */
  #define PWM_TASKS_DMA_SEQ_START_START_Msk (0x1UL << PWM_TASKS_DMA_SEQ_START_START_Pos) /*!< Bit mask of START field.         */
  #define PWM_TASKS_DMA_SEQ_START_START_Min (0x1UL)  /*!< Min enumerator value of START field.                                 */
  #define PWM_TASKS_DMA_SEQ_START_START_Max (0x1UL)  /*!< Max enumerator value of START field.                                 */
  #define PWM_TASKS_DMA_SEQ_START_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* PWM_TASKS_DMA_SEQ_STOP: Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA
                            (channel) will also enter its lowest required power level. */

  #define PWM_TASKS_DMA_SEQ_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                  */

/* STOP @Bit 0 : Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA (channel)
                 will also enter its lowest required power level. */

  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Pos (0UL)      /*!< Position of STOP field.                                              */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Msk (0x1UL << PWM_TASKS_DMA_SEQ_STOP_STOP_Pos) /*!< Bit mask of STOP field.              */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Min (0x1UL)    /*!< Min enumerator value of STOP field.                                  */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Max (0x1UL)    /*!< Max enumerator value of STOP field.                                  */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */



/* ================================================== Struct PWM_TASKS_DMA =================================================== */
/**
  * @brief TASKS_DMA [PWM_TASKS_DMA] Peripheral tasks.
  */
typedef struct {
  __OM  NRF_PWM_TASKS_DMA_SEQ_Type SEQ[2];           /*!< (@ 0x00000000) Peripheral tasks.                                     */
} NRF_PWM_TASKS_DMA_Type;                            /*!< Size = 16 (0x010)                                                    */


/* ============================================== Struct PWM_SUBSCRIBE_DMA_SEQ =============================================== */
/**
  * @brief SEQ [PWM_SUBSCRIBE_DMA_SEQ] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Subscribe configuration for task START                */
  __IOM uint32_t  STOP;                              /*!< (@ 0x00000004) Subscribe configuration for task STOP                 */
} NRF_PWM_SUBSCRIBE_DMA_SEQ_Type;                    /*!< Size = 8 (0x008)                                                     */
  #define PWM_SUBSCRIBE_DMA_SEQ_MaxCount (2UL)       /*!< Size of SEQ[2] array.                                                */
  #define PWM_SUBSCRIBE_DMA_SEQ_MaxIndex (1UL)       /*!< Max index of SEQ[2] array.                                           */
  #define PWM_SUBSCRIBE_DMA_SEQ_MinIndex (0UL)       /*!< Min index of SEQ[2] array.                                           */

