adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PWM_SUBSCRIBE_NEXTSTEP: Subscribe configuration for task NEXTSTEP */
  #define PWM_SUBSCRIBE_NEXTSTEP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_NEXTSTEP register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task NEXTSTEP will subscribe to */
  #define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Msk (0x1UL << PWM_SUBSCRIBE_NEXTSTEP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* PWM_SUBSCRIBE_SEQABORT: Subscribe configuration for task SEQABORT */
  #define PWM_SUBSCRIBE_SEQABORT_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SEQABORT register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task SEQABORT will subscribe to */
  #define PWM_SUBSCRIBE_SEQABORT_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define PWM_SUBSCRIBE_SEQABORT_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_SEQABORT_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define PWM_SUBSCRIBE_SEQABORT_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define PWM_SUBSCRIBE_SEQABORT_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_SEQABORT_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define PWM_SUBSCRIBE_SEQABORT_EN_Msk (0x1UL << PWM_SUBSCRIBE_SEQABORT_EN_Pos) /*!< Bit mask of EN field.                    */
  #define PWM_SUBSCRIBE_SEQABORT_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_SEQABORT_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_SEQABORT_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define PWM_SUBSCRIBE_SEQABORT_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* PWM_EVENTS_STARTED: Response to START task, emitted when the PWM pulse generation starts */
  #define PWM_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                            */

/* EVENTS_STARTED @Bit 0 : Response to START task, emitted when the PWM pulse generation starts */
  #define PWM_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                   */
  #define PWM_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << PWM_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of EVENTS_STARTED
                                                                            field.*/
  #define PWM_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                     */
  #define PWM_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                     */
  #define PWM_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define PWM_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                             */


/* PWM_EVENTS_STOPPED: Response to STOP task, emitted when PWM pulses are no longer generated */
  #define PWM_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                            */

/* EVENTS_STOPPED @Bit 0 : Response to STOP task, emitted when PWM pulses are no longer generated */
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                   */
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << PWM_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                     */
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                     */
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                             */


/* PWM_EVENTS_SEQSTARTED: First PWM period started on sequence n */
  #define PWM_EVENTS_SEQSTARTED_MaxCount (2UL)       /*!< Max size of EVENTS_SEQSTARTED[2] array.                              */
  #define PWM_EVENTS_SEQSTARTED_MaxIndex (1UL)       /*!< Max index of EVENTS_SEQSTARTED[2] array.                             */
  #define PWM_EVENTS_SEQSTARTED_MinIndex (0UL)       /*!< Min index of EVENTS_SEQSTARTED[2] array.                             */
  #define PWM_EVENTS_SEQSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SEQSTARTED[2] register.                   */

/* EVENTS_SEQSTARTED @Bit 0 : First PWM period started on sequence n */
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Pos (0UL) /*!< Position of EVENTS_SEQSTARTED field.                          */
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Msk (0x1UL << PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_SEQSTARTED field.*/
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SEQSTARTED field.            */
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SEQSTARTED field.            */
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Generated (0x1UL) /*!< Event generated                                       */


/* PWM_EVENTS_SEQEND: Emitted at end of every sequence n, when last value from RAM has been applied to wave counter */
  #define PWM_EVENTS_SEQEND_MaxCount (2UL)           /*!< Max size of EVENTS_SEQEND[2] array.                                  */
  #define PWM_EVENTS_SEQEND_MaxIndex (1UL)           /*!< Max index of EVENTS_SEQEND[2] array.                                 */
  #define PWM_EVENTS_SEQEND_MinIndex (0UL)           /*!< Min index of EVENTS_SEQEND[2] array.                                 */
  #define PWM_EVENTS_SEQEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SEQEND[2] register.                           */

