adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define PWM_PUBLISH_STARTED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << PWM_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define PWM_PUBLISH_STARTED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define PWM_PUBLISH_STARTED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_STARTED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_STARTED_EN_Msk (0x1UL << PWM_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define PWM_PUBLISH_STARTED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_STARTED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_STARTED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define PWM_PUBLISH_STARTED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* PWM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define PWM_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define PWM_PUBLISH_STOPPED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << PWM_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define PWM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define PWM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_STOPPED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_STOPPED_EN_Msk (0x1UL << PWM_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define PWM_PUBLISH_STOPPED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_STOPPED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_STOPPED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define PWM_PUBLISH_STOPPED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* PWM_PUBLISH_SEQSTARTED: Publish configuration for event SEQSTARTED[n] */
  #define PWM_PUBLISH_SEQSTARTED_MaxCount (2UL)      /*!< Max size of PUBLISH_SEQSTARTED[2] array.                             */
  #define PWM_PUBLISH_SEQSTARTED_MaxIndex (1UL)      /*!< Max index of PUBLISH_SEQSTARTED[2] array.                            */
  #define PWM_PUBLISH_SEQSTARTED_MinIndex (0UL)      /*!< Min index of PUBLISH_SEQSTARTED[2] array.                            */
  #define PWM_PUBLISH_SEQSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SEQSTARTED[2] register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that event SEQSTARTED[n] will publish to */
  #define PWM_PUBLISH_SEQSTARTED_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_SEQSTARTED_CHIDX_Msk (0xFFUL << PWM_PUBLISH_SEQSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define PWM_PUBLISH_SEQSTARTED_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define PWM_PUBLISH_SEQSTARTED_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_SEQSTARTED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_SEQSTARTED_EN_Msk (0x1UL << PWM_PUBLISH_SEQSTARTED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define PWM_PUBLISH_SEQSTARTED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_SEQSTARTED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_SEQSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define PWM_PUBLISH_SEQSTARTED_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* PWM_PUBLISH_SEQEND: Publish configuration for event SEQEND[n] */
  #define PWM_PUBLISH_SEQEND_MaxCount (2UL)          /*!< Max size of PUBLISH_SEQEND[2] array.                                 */
  #define PWM_PUBLISH_SEQEND_MaxIndex (1UL)          /*!< Max index of PUBLISH_SEQEND[2] array.                                */
  #define PWM_PUBLISH_SEQEND_MinIndex (0UL)          /*!< Min index of PUBLISH_SEQEND[2] array.                                */
  #define PWM_PUBLISH_SEQEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SEQEND[2] register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event SEQEND[n] will publish to */
  #define PWM_PUBLISH_SEQEND_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_SEQEND_CHIDX_Msk (0xFFUL << PWM_PUBLISH_SEQEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define PWM_PUBLISH_SEQEND_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define PWM_PUBLISH_SEQEND_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_SEQEND_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_SEQEND_EN_Msk (0x1UL << PWM_PUBLISH_SEQEND_EN_Pos) /*!< Bit mask of EN field.                            */
  #define PWM_PUBLISH_SEQEND_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_SEQEND_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_SEQEND_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define PWM_PUBLISH_SEQEND_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


