adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ACCDBL @Bits 0..3 : Register accumulating the number of detected double or illegal transitions. ( SAMPLE = 2 ). */
  #define QDEC_ACCDBL_ACCDBL_Pos (0UL)               /*!< Position of ACCDBL field.                                            */
  #define QDEC_ACCDBL_ACCDBL_Msk (0xFUL << QDEC_ACCDBL_ACCDBL_Pos) /*!< Bit mask of ACCDBL field.                              */
  #define QDEC_ACCDBL_ACCDBL_Min (0x0UL)             /*!< Min value of ACCDBL field.                                           */
  #define QDEC_ACCDBL_ACCDBL_Max (0xFUL)             /*!< Max size of ACCDBL field.                                            */


/* QDEC_ACCDBLREAD: Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL task */
  #define QDEC_ACCDBLREAD_ResetValue (0x00000000UL)  /*!< Reset value of ACCDBLREAD register.                                  */

/* ACCDBLREAD @Bits 0..3 : Snapshot of the ACCDBL register. This field is updated when the READCLRACC or RDCLRDBL task is
                           triggered. */

  #define QDEC_ACCDBLREAD_ACCDBLREAD_Pos (0UL)       /*!< Position of ACCDBLREAD field.                                        */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Msk (0xFUL << QDEC_ACCDBLREAD_ACCDBLREAD_Pos) /*!< Bit mask of ACCDBLREAD field.          */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Min (0x0UL)     /*!< Min value of ACCDBLREAD field.                                       */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Max (0xFUL)     /*!< Max size of ACCDBLREAD field.                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct RADIO_ACQINJ =================================================== */
/**
  * @brief ACQINJ [RADIO_ACQINJ] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CNF[2];                            /*!< (@ 0x00000000) Data acquisition/injection configuration              */
} NRF_RADIO_ACQINJ_Type;                             /*!< Size = 8 (0x008)                                                     */

/* RADIO_ACQINJ_CNF: Data acquisition/injection configuration */
  #define RADIO_ACQINJ_CNF_MaxCount (2UL)            /*!< Max size of CNF[2] array.                                            */
  #define RADIO_ACQINJ_CNF_MaxIndex (1UL)            /*!< Max index of CNF[2] array.                                           */
  #define RADIO_ACQINJ_CNF_MinIndex (0UL)            /*!< Min index of CNF[2] array.                                           */
  #define RADIO_ACQINJ_CNF_ResetValue (0x00000000UL) /*!< Reset value of CNF[2] register.                                      */

/* ACQMODE @Bits 0..4 : Acquisition mode (data from peripheral written to memory) */
  #define RADIO_ACQINJ_CNF_ACQMODE_Pos (0UL)         /*!< Position of ACQMODE field.                                           */
  #define RADIO_ACQINJ_CNF_ACQMODE_Msk (0x1FUL << RADIO_ACQINJ_CNF_ACQMODE_Pos) /*!< Bit mask of ACQMODE field.                */
  #define RADIO_ACQINJ_CNF_ACQMODE_Min (0x0UL)       /*!< Min enumerator value of ACQMODE field.                               */
  #define RADIO_ACQINJ_CNF_ACQMODE_Max (0x14UL)      /*!< Max enumerator value of ACQMODE field.                               */
  #define RADIO_ACQINJ_CNF_ACQMODE_AdcIQ (0x00UL)    /*!< ADC IQ                                                               */
  #define RADIO_ACQINJ_CNF_ACQMODE_AdcIQAndAgcGain (0x02UL) /*!< ADC IQ; AGC settings                                          */
  #define RADIO_ACQINJ_CNF_ACQMODE_AgcGainAndPkd (0x04UL) /*!< AGC settings; peak detects; IF and baseband signal magnitudes   */
  #define RADIO_ACQINJ_CNF_ACQMODE_FeIQ (0x06UL)     /*!< Frontend IQ after decimation, downmix and filtering                  */
  #define RADIO_ACQINJ_CNF_ACQMODE_Rtt (0x07UL)      /*!< Baseband Channel Sounding RTT Data                                   */
  #define RADIO_ACQINJ_CNF_ACQMODE_BbIQ (0x08UL)     /*!< Baseband IQ after frequency offset compensation                      */
  #define RADIO_ACQINJ_CNF_ACQMODE_BbAaIQ (0x09UL)   /*!< Baseband IQ after frequency offset compensation (both Hyper and AA
                                                          demodulator)*/
  #define RADIO_ACQINJ_CNF_ACQMODE_StdBits (0x0AUL)  /*!< Valid serial data from Standard Demodulator                          */
  #define RADIO_ACQINJ_CNF_ACQMODE_HypBits (0x0CUL)  /*!< Valid serial data from Hyper Demodulator                             */
  #define RADIO_ACQINJ_CNF_ACQMODE_AaBits (0x0DUL)   /*!< Valid serial data from AA Demodulator                                */
  #define RADIO_ACQINJ_CNF_ACQMODE_StdHypBitsMux (0x0EUL) /*!< Serial data+valid muxed stream Hyper and Standard demodulators  */
  #define RADIO_ACQINJ_CNF_ACQMODE_StdHypAaBitsMux (0x0FUL) /*!< Serial data+valid muxed stream Hyper, Standard and AA
                                                                 demodulators*/
  #define RADIO_ACQINJ_CNF_ACQMODE_FeDecIQ (0x10UL)  /*!< Frontend IQ after decimation                                         */
  #define RADIO_ACQINJ_CNF_ACQMODE_FeMixIQ (0x12UL)  /*!< Frontend IQ after decimation and downmix                             */
  #define RADIO_ACQINJ_CNF_ACQMODE_AdPllTrace (0x14UL) /*!< ADPLL tracing                                                      */

/* INJMODE @Bits 8..11 : Injection mode (data from memory pushed to peripheral) */
  #define RADIO_ACQINJ_CNF_INJMODE_Pos (8UL)         /*!< Position of INJMODE field.                                           */
  #define RADIO_ACQINJ_CNF_INJMODE_Msk (0xFUL << RADIO_ACQINJ_CNF_INJMODE_Pos) /*!< Bit mask of INJMODE field.                 */
  #define RADIO_ACQINJ_CNF_INJMODE_Min (0x0UL)       /*!< Min enumerator value of INJMODE field.                               */
  #define RADIO_ACQINJ_CNF_INJMODE_Max (0xAUL)       /*!< Max enumerator value of INJMODE field.                               */
  #define RADIO_ACQINJ_CNF_INJMODE_OvrAdcIQ (0x0UL)  /*!< Override ADC IQ                                                      */
  #define RADIO_ACQINJ_CNF_INJMODE_OvrFeMixIQ (0x6UL) /*!< Override Frontend IQ after decimation and downmix                   */
  #define RADIO_ACQINJ_CNF_INJMODE_OvrFeDecIQ (0x8UL) /*!< Override Frontend IQ after decimation                               */
  #define RADIO_ACQINJ_CNF_INJMODE_AdPllMod (0xAUL)  /*!< ADPLL custom modulation source                                       */

