adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK: Pin select for RADIO clock (direct mode, base band debug. txCk and ckDataIn signals) */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TXCLK register.                    */

/* PIN @Bits 0..4 : Pin number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PIN_Pos (0UL) /*!< Position of PIN field.                                        */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PIN_Msk (0x1FUL << RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PIN_Pos) /*!< Bit mask of
                                                                            PIN field.*/
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PIN_Min (0x00UL) /*!< Min value of PIN field.                                    */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PIN_Max (0x1FUL) /*!< Max size of PIN field.                                     */

/* PORT @Bits 5..8 : Port number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PORT_Pos (5UL) /*!< Position of PORT field.                                      */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PORT_Msk (0xFUL << RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PORT_Pos) /*!< Bit mask of
                                                                            PORT field.*/
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PORT_Min (0x0UL) /*!< Min value of PORT field.                                   */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_PORT_Max (0x0UL) /*!< Max size of PORT field.                                    */

/* CONNECT @Bit 31 : Connection */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_CONNECT_Pos (31UL) /*!< Position of CONNECT field.                               */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_CONNECT_Msk (0x1UL << RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_CONNECT_Pos) /*!< Bit
                                                                            mask of CONNECT field.*/
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_CONNECT_Min (0x0UL) /*!< Min enumerator value of CONNECT field.                  */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_CONNECT_Max (0x1UL) /*!< Max enumerator value of CONNECT field.                  */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                     */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXCLK_CONNECT_Connected (0x0UL) /*!< Connect                                           */


/* RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA: Pin select for RADIO data (direct mode, base band debug. txRadioData and dataIn
                                          signals) */

  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TXDATA register.                  */

/* PIN @Bits 0..4 : Pin number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PIN_Pos (0UL) /*!< Position of PIN field.                                       */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PIN_Msk (0x1FUL << RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PIN_Pos) /*!< Bit mask of
                                                                            PIN field.*/
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PIN_Min (0x00UL) /*!< Min value of PIN field.                                   */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PIN_Max (0x1FUL) /*!< Max size of PIN field.                                    */

/* PORT @Bits 5..8 : Port number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PORT_Pos (5UL) /*!< Position of PORT field.                                     */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PORT_Msk (0xFUL << RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PORT_Pos) /*!< Bit mask
                                                                            of PORT field.*/
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PORT_Min (0x0UL) /*!< Min value of PORT field.                                  */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_PORT_Max (0x0UL) /*!< Max size of PORT field.                                   */

/* CONNECT @Bit 31 : Connection */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_CONNECT_Pos (31UL) /*!< Position of CONNECT field.                              */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_CONNECT_Msk (0x1UL << RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_CONNECT_Pos) /*!< Bit
                                                                            mask of CONNECT field.*/
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_CONNECT_Min (0x0UL) /*!< Min enumerator value of CONNECT field.                 */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_CONNECT_Max (0x1UL) /*!< Max enumerator value of CONNECT field.                 */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                    */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_TXDATA_CONNECT_Connected (0x0UL) /*!< Connect                                          */



/* =============================================== Struct RADIO_TESTINTERFACE ================================================ */
/**
  * @brief TESTINTERFACE [RADIO_TESTINTERFACE] 2.4 GHz radio direct test interface
  */
typedef struct {
  __IOM uint32_t  LOCK;                              /*!< (@ 0x00000000) Security LOCK for test interface                      */
  __IOM uint32_t  CONF;                              /*!< (@ 0x00000004) CONFIG for PSEL test interface                        */
  __IOM NRF_RADIO_TESTINTERFACE_DEBUGPSEL_Type DEBUGPSEL; /*!< (@ 0x00000008) (unspecified)                                    */
} NRF_RADIO_TESTINTERFACE_Type;                      /*!< Size = 28 (0x01C)                                                    */

/* RADIO_TESTINTERFACE_LOCK: Security LOCK for test interface */
  #define RADIO_TESTINTERFACE_LOCK_ResetValue (0x00000000UL) /*!< Reset value of LOCK register.                                */

/* LOCK @Bit 0 : Write once to permanently lock or unlock. */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Pos (0UL)    /*!< Position of LOCK field.                                              */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Msk (0x1UL << RADIO_TESTINTERFACE_LOCK_LOCK_Pos) /*!< Bit mask of LOCK field.          */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Min (0x0UL)  /*!< Min enumerator value of LOCK field.                                  */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Max (0x1UL)  /*!< Max enumerator value of LOCK field.                                  */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Lock (0x1UL) /*!< Interface is locked and cannot be enabled.                           */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Unlock (0x0UL) /*!< Interface is unlocked and can be enabled.                          */


/* RADIO_TESTINTERFACE_CONF: CONFIG for PSEL test interface */
  #define RADIO_TESTINTERFACE_CONF_ResetValue (0x00000000UL) /*!< Reset value of CONF register.                                */

/* RXDATASOURCE @Bits 0..1 : Source select for Rx data GPIO output and Rx clock output. Can optionally output Tx data that is
                             transmitted and TX clock */

