adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Pos (0UL) /*!< Position of RXDATASOURCE field.                                 */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Msk (0x3UL << RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Pos) /*!< Bit mask of
                                                                            RXDATASOURCE field.*/
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Min (0x0UL) /*!< Min enumerator value of RXDATASOURCE field.                   */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Max (0x3UL) /*!< Max enumerator value of RXDATASOURCE field.                   */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Standard (0x0UL) /*!< Data and clock source is from standard demodulator       */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Hyper (0x1UL) /*!< Data and clock source is from hyper demodulator             */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_FelisTx (0x2UL) /*!< Data source is Tx data to SphynxSupport.                  */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_MacTx (0x3UL) /*!< Data source is Tx data to FelisTx.                          */

/* TXDATASINK @Bit 8 : Sink select for Tx Data input. TX clock source is always SphynxSupport */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_Pos (8UL) /*!< Position of TXDATASINK field.                                     */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_Msk (0x1UL << RADIO_TESTINTERFACE_CONF_TXDATASINK_Pos) /*!< Bit mask of TXDATASINK
                                                                            field.*/
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_Min (0x0UL) /*!< Min enumerator value of TXDATASINK field.                       */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_Max (0x1UL) /*!< Max enumerator value of TXDATASINK field.                       */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_FelisTx (0x0UL) /*!< TX data sink is FelisTx                                     */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_SphynxSupport (0x1UL) /*!< TX data sink is SphynxSupport                         */



/* ================================================= Struct RADIO_AHBMASTERS ================================================= */
/**
  * @brief AHBMASTERS [RADIO_AHBMASTERS] For setting priorities among RADIO/CRYPTO AHB masters if interfaced with Nordic's AMBA
            Interconnect IP

  */
typedef struct {
  __IOM uint32_t  PRIORITY;                          /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_RADIO_AHBMASTERS_Type;                         /*!< Size = 4 (0x004)                                                     */

/* RADIO_AHBMASTERS_PRIORITY: (unspecified) */
  #define RADIO_AHBMASTERS_PRIORITY_ResetValue (0x00000000UL) /*!< Reset value of PRIORITY register.                           */

/* RADIO @Bit 0 : Priority level for AHB master RADIO */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Pos (0UL)  /*!< Position of RADIO field.                                             */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_RADIO_Pos) /*!< Bit mask of RADIO field.     */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Min (0x0UL) /*!< Min enumerator value of RADIO field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Max (0x1UL) /*!< Max enumerator value of RADIO field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Low (0x0UL) /*!< Lowest Priority Level                                               */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_High (0x1UL) /*!< Highest Priority Level                                             */

/* RADIODFE @Bit 1 : Priority level for AHB master RADIODFE */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Pos (1UL) /*!< Position of RADIODFE field.                                        */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_RADIODFE_Pos) /*!< Bit mask of RADIODFE
                                                                            field.*/
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Min (0x0UL) /*!< Min enumerator value of RADIODFE field.                          */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Max (0x1UL) /*!< Max enumerator value of RADIODFE field.                          */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Low (0x0UL) /*!< Lowest Priority Level                                            */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_High (0x1UL) /*!< Highest Priority Level                                          */

/* RADIOACQINJ0 @Bit 2 : Priority level for AHB master RADIOACQINJ0 */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Pos (2UL) /*!< Position of RADIOACQINJ0 field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Pos) /*!< Bit mask of
                                                                            RADIOACQINJ0 field.*/
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Min (0x0UL) /*!< Min enumerator value of RADIOACQINJ0 field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Max (0x1UL) /*!< Max enumerator value of RADIOACQINJ0 field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Low (0x0UL) /*!< Lowest Priority Level                                        */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_High (0x1UL) /*!< Highest Priority Level                                      */

/* RADIOACQINJ1 @Bit 3 : Priority level for AHB master RADIOACQINJ1 */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Pos (3UL) /*!< Position of RADIOACQINJ1 field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Pos) /*!< Bit mask of
                                                                            RADIOACQINJ1 field.*/
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Min (0x0UL) /*!< Min enumerator value of RADIOACQINJ1 field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Max (0x1UL) /*!< Max enumerator value of RADIOACQINJ1 field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Low (0x0UL) /*!< Lowest Priority Level                                        */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_High (0x1UL) /*!< Highest Priority Level                                      */

