adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CRYPTOGATHER @Bit 4 : Priority level for AHB master CRYPTOGATHER */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Pos (4UL) /*!< Position of CRYPTOGATHER field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Pos) /*!< Bit mask of
                                                                            CRYPTOGATHER field.*/
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Min (0x0UL) /*!< Min enumerator value of CRYPTOGATHER field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Max (0x1UL) /*!< Max enumerator value of CRYPTOGATHER field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Low (0x0UL) /*!< Lowest Priority Level                                        */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_High (0x1UL) /*!< Highest Priority Level                                      */

/* CRYPTOSCATTER @Bit 5 : Priority level for AHB master CRYPTOSCATTER */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Pos (5UL) /*!< Position of CRYPTOSCATTER field.                              */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Pos) /*!< Bit mask of
                                                                            CRYPTOSCATTER field.*/
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Min (0x0UL) /*!< Min enumerator value of CRYPTOSCATTER field.                */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Max (0x1UL) /*!< Max enumerator value of CRYPTOSCATTER field.                */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Low (0x0UL) /*!< Lowest Priority Level                                       */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_High (0x1UL) /*!< Highest Priority Level                                     */



/* ================================================ Struct RADIO_CALIBRATION ================================================= */
/**
  * @brief CALIBRATION [RADIO_CALIBRATION] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TARGET;                            /*!< (@ 0x00000000) Select target for calibration                         */
  __IOM uint32_t  DCCONFIG;                          /*!< (@ 0x00000004) Calibration config when CALTARGET=DC_CAL              */
  __IOM uint32_t  RCCONFIG;                          /*!< (@ 0x00000008) Calibration config when CALTARGET=RC_CAL              */
  __IM  uint32_t  RESULT;                            /*!< (@ 0x0000000C) Calibration result                                    */
} NRF_RADIO_CALIBRATION_Type;                        /*!< Size = 16 (0x010)                                                    */

/* RADIO_CALIBRATION_TARGET: Select target for calibration */
  #define RADIO_CALIBRATION_TARGET_ResetValue (0x00000000UL) /*!< Reset value of TARGET register.                              */

/* CALTARGET @Bit 0 : Calibration target selection for calibration engine, 0: DC_CAL, 1: RC_CAL */
  #define RADIO_CALIBRATION_TARGET_CALTARGET_Pos (0UL) /*!< Position of CALTARGET field.                                       */
  #define RADIO_CALIBRATION_TARGET_CALTARGET_Msk (0x1UL << RADIO_CALIBRATION_TARGET_CALTARGET_Pos) /*!< Bit mask of CALTARGET
                                                                            field.*/


/* RADIO_CALIBRATION_DCCONFIG: Calibration config when CALTARGET=DC_CAL */
  #define RADIO_CALIBRATION_DCCONFIG_ResetValue (0x74021F0DUL) /*!< Reset value of DCCONFIG register.                          */

/* CALTSTART @Bits 0..7 : Startup wait time (default 437.5ns) */
  #define RADIO_CALIBRATION_DCCONFIG_CALTSTART_Pos (0UL) /*!< Position of CALTSTART field.                                     */
  #define RADIO_CALIBRATION_DCCONFIG_CALTSTART_Msk (0xFFUL << RADIO_CALIBRATION_DCCONFIG_CALTSTART_Pos) /*!< Bit mask of
                                                                            CALTSTART field.*/

/* CALTSETTLE @Bits 8..15 : Settle wait time (default 1000ns) */
  #define RADIO_CALIBRATION_DCCONFIG_CALTSETTLE_Pos (8UL) /*!< Position of CALTSETTLE field.                                   */
  #define RADIO_CALIBRATION_DCCONFIG_CALTSETTLE_Msk (0xFFUL << RADIO_CALIBRATION_DCCONFIG_CALTSETTLE_Pos) /*!< Bit mask of
                                                                            CALTSETTLE field.*/

/* CALTCOMPARE @Bits 16..23 : Compare wait time (default 93.75ns) */
  #define RADIO_CALIBRATION_DCCONFIG_CALTCOMPARE_Pos (16UL) /*!< Position of CALTCOMPARE field.                                */
  #define RADIO_CALIBRATION_DCCONFIG_CALTCOMPARE_Msk (0xFFUL << RADIO_CALIBRATION_DCCONFIG_CALTCOMPARE_Pos) /*!< Bit mask of
                                                                            CALTCOMPARE field.*/

/* CALMSB @Bits 24..26 : Index of most significant bit to be calibrated (add 1 to get number of bits) */
  #define RADIO_CALIBRATION_DCCONFIG_CALMSB_Pos (24UL) /*!< Position of CALMSB field.                                          */
  #define RADIO_CALIBRATION_DCCONFIG_CALMSB_Msk (0x7UL << RADIO_CALIBRATION_DCCONFIG_CALMSB_Pos) /*!< Bit mask of CALMSB field.*/

/* CALINVERTCMPI @Bit 28 : 1: invert calCmp1 (I) before it goes into calibration engine #1 */
  #define RADIO_CALIBRATION_DCCONFIG_CALINVERTCMPI_Pos (28UL) /*!< Position of CALINVERTCMPI field.                            */
  #define RADIO_CALIBRATION_DCCONFIG_CALINVERTCMPI_Msk (0x1UL << RADIO_CALIBRATION_DCCONFIG_CALINVERTCMPI_Pos) /*!< Bit mask of
                                                                            CALINVERTCMPI field.*/

/* CALINVERTCMPQ @Bit 29 : 1: invert calCmp2 (Q) before it goes into calibration engine #2 */
  #define RADIO_CALIBRATION_DCCONFIG_CALINVERTCMPQ_Pos (29UL) /*!< Position of CALINVERTCMPQ field.                            */
  #define RADIO_CALIBRATION_DCCONFIG_CALINVERTCMPQ_Msk (0x1UL << RADIO_CALIBRATION_DCCONFIG_CALINVERTCMPQ_Pos) /*!< Bit mask of
                                                                            CALINVERTCMPQ field.*/

