adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CALCODEFORMAT @Bit 30 : 0: 2's complement, 1: sign-magnitude */
  #define RADIO_CALIBRATION_DCCONFIG_CALCODEFORMAT_Pos (30UL) /*!< Position of CALCODEFORMAT field.                            */
  #define RADIO_CALIBRATION_DCCONFIG_CALCODEFORMAT_Msk (0x1UL << RADIO_CALIBRATION_DCCONFIG_CALCODEFORMAT_Pos) /*!< Bit mask of
                                                                            CALCODEFORMAT field.*/


/* RADIO_CALIBRATION_RCCONFIG: Calibration config when CALTARGET=RC_CAL */
  #define RADIO_CALIBRATION_RCCONFIG_ResetValue (0x03165204UL) /*!< Reset value of RCCONFIG register.                          */

/* CALTSTART @Bits 0..7 : Startup wait time (default 156.25ns) */
  #define RADIO_CALIBRATION_RCCONFIG_CALTSTART_Pos (0UL) /*!< Position of CALTSTART field.                                     */
  #define RADIO_CALIBRATION_RCCONFIG_CALTSTART_Msk (0xFFUL << RADIO_CALIBRATION_RCCONFIG_CALTSTART_Pos) /*!< Bit mask of
                                                                            CALTSTART field.*/

/* CALTSETTLE @Bits 8..15 : Settle wait time (default 2593.75ns) */
  #define RADIO_CALIBRATION_RCCONFIG_CALTSETTLE_Pos (8UL) /*!< Position of CALTSETTLE field.                                   */
  #define RADIO_CALIBRATION_RCCONFIG_CALTSETTLE_Msk (0xFFUL << RADIO_CALIBRATION_RCCONFIG_CALTSETTLE_Pos) /*!< Bit mask of
                                                                            CALTSETTLE field.*/

/* CALTCOMPARE @Bits 16..23 : Compare wait time (default 718.75ns) */
  #define RADIO_CALIBRATION_RCCONFIG_CALTCOMPARE_Pos (16UL) /*!< Position of CALTCOMPARE field.                                */
  #define RADIO_CALIBRATION_RCCONFIG_CALTCOMPARE_Msk (0xFFUL << RADIO_CALIBRATION_RCCONFIG_CALTCOMPARE_Pos) /*!< Bit mask of
                                                                            CALTCOMPARE field.*/

/* CALMSB @Bits 24..26 : Index of most significant bit to be calibrated (add 1 to get number of bits) */
  #define RADIO_CALIBRATION_RCCONFIG_CALMSB_Pos (24UL) /*!< Position of CALMSB field.                                          */
  #define RADIO_CALIBRATION_RCCONFIG_CALMSB_Msk (0x7UL << RADIO_CALIBRATION_RCCONFIG_CALMSB_Pos) /*!< Bit mask of CALMSB field.*/

/* CALINVERTCMP @Bit 28 : 1: invert calCmp1 before it goes into calibration engine #1 */
  #define RADIO_CALIBRATION_RCCONFIG_CALINVERTCMP_Pos (28UL) /*!< Position of CALINVERTCMP field.                              */
  #define RADIO_CALIBRATION_RCCONFIG_CALINVERTCMP_Msk (0x1UL << RADIO_CALIBRATION_RCCONFIG_CALINVERTCMP_Pos) /*!< Bit mask of
                                                                            CALINVERTCMP field.*/


/* RADIO_CALIBRATION_RESULT: Calibration result */
  #define RADIO_CALIBRATION_RESULT_ResetValue (0x00000000UL) /*!< Reset value of RESULT register.                              */

/* RCCALCODE @Bits 0..3 : Calibration result from RC calibration */
  #define RADIO_CALIBRATION_RESULT_RCCALCODE_Pos (0UL) /*!< Position of RCCALCODE field.                                       */
  #define RADIO_CALIBRATION_RESULT_RCCALCODE_Msk (0xFUL << RADIO_CALIBRATION_RESULT_RCCALCODE_Pos) /*!< Bit mask of RCCALCODE
                                                                            field.*/

/* RFMIXDCCALI @Bits 8..15 : Calibration result from DC offset calibration on channel I */
  #define RADIO_CALIBRATION_RESULT_RFMIXDCCALI_Pos (8UL) /*!< Position of RFMIXDCCALI field.                                   */
  #define RADIO_CALIBRATION_RESULT_RFMIXDCCALI_Msk (0xFFUL << RADIO_CALIBRATION_RESULT_RFMIXDCCALI_Pos) /*!< Bit mask of
                                                                            RFMIXDCCALI field.*/

/* RFMIXDCCALQ @Bits 16..23 : Calibration result from DC offset calibration on channel Q */
  #define RADIO_CALIBRATION_RESULT_RFMIXDCCALQ_Pos (16UL) /*!< Position of RFMIXDCCALQ field.                                  */
  #define RADIO_CALIBRATION_RESULT_RFMIXDCCALQ_Msk (0xFFUL << RADIO_CALIBRATION_RESULT_RFMIXDCCALQ_Pos) /*!< Bit mask of
                                                                            RFMIXDCCALQ field.*/



/* =============================================== Struct RADIO_SPHYNXANATEST ================================================ */
/**
  * @brief SPHYNXANATEST [RADIO_SPHYNXANATEST] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TEST;                              /*!< (@ 0x00000000) Control of analog and digital test bus output from
                                                                         Sphynx*/
} NRF_RADIO_SPHYNXANATEST_Type;                      /*!< Size = 4 (0x004)                                                     */

/* RADIO_SPHYNXANATEST_TEST: Control of analog and digital test bus output from Sphynx */
  #define RADIO_SPHYNXANATEST_TEST_ResetValue (0x00000000UL) /*!< Reset value of TEST register.                                */

/* SPHYNXATEBIASFS @Bits 0..3 : Analog test enable for BIAS_FS */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATEBIASFS_Pos (0UL) /*!< Position of SPHYNXATEBIASFS field.                           */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATEBIASFS_Msk (0xFUL << RADIO_SPHYNXANATEST_TEST_SPHYNXATEBIASFS_Pos) /*!< Bit mask of
                                                                            SPHYNXATEBIASFS field.*/

/* SPHYNXATEFS @Bits 4..10 : Analog test enable for FS */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATEFS_Pos (4UL) /*!< Position of SPHYNXATEFS field.                                   */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATEFS_Msk (0x7FUL << RADIO_SPHYNXANATEST_TEST_SPHYNXATEFS_Pos) /*!< Bit mask of
                                                                            SPHYNXATEFS field.*/

/* SPHYNXATERXMIX @Bits 11..12 : Analog test enable for RX MIX */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATERXMIX_Pos (11UL) /*!< Position of SPHYNXATERXMIX field.                            */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATERXMIX_Msk (0x3UL << RADIO_SPHYNXANATEST_TEST_SPHYNXATERXMIX_Pos) /*!< Bit mask of
                                                                            SPHYNXATERXMIX field.*/

/* SPHYNXATERXAAF @Bits 13..18 : Analog test enable for RX AAF */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATERXAAF_Pos (13UL) /*!< Position of SPHYNXATERXAAF field.                            */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATERXAAF_Msk (0x3FUL << RADIO_SPHYNXANATEST_TEST_SPHYNXATERXAAF_Pos) /*!< Bit mask of
                                                                            SPHYNXATERXAAF field.*/

/* SPHYNXATERXTX @Bits 19..22 : Analog test enable for RX TX */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATERXTX_Pos (19UL) /*!< Position of SPHYNXATERXTX field.                              */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATERXTX_Msk (0xFUL << RADIO_SPHYNXANATEST_TEST_SPHYNXATERXTX_Pos) /*!< Bit mask of
                                                                            SPHYNXATERXTX field.*/

/* SPHYNXATETXPWRCTRL @Bits 24..25 : Analog test enable for TX PWRCTRL */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATETXPWRCTRL_Pos (24UL) /*!< Position of SPHYNXATETXPWRCTRL field.                    */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXATETXPWRCTRL_Msk (0x3UL << RADIO_SPHYNXANATEST_TEST_SPHYNXATETXPWRCTRL_Pos) /*!< Bit
                                                                            mask of SPHYNXATETXPWRCTRL field.*/

/* SPHYNXDTEFS @Bits 26..28 : Digital test enable for digital logic in analog macro */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXDTEFS_Pos (26UL) /*!< Position of SPHYNXDTEFS field.                                  */
  #define RADIO_SPHYNXANATEST_TEST_SPHYNXDTEFS_Msk (0x7UL << RADIO_SPHYNXANATEST_TEST_SPHYNXDTEFS_Pos) /*!< Bit mask of
                                                                            SPHYNXDTEFS field.*/



/* ================================================= Struct RADIO_SPHYNXANA ================================================== */
/**
  * @brief SPHYNXANA [RADIO_SPHYNXANA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FSCTRL0;                           /*!< (@ 0x00000000) Control to frequency synthesizer of Sphynx            */
  __IOM uint32_t  FSCTRL1;                           /*!< (@ 0x00000004) Control to frequency synthesizer of Sphynx            */
  __IOM uint32_t  FSCTRL2;                           /*!< (@ 0x00000008) Control to frequency synthesizer of Sphynx            */
  __IOM uint32_t  RXCTRL;                            /*!< (@ 0x0000000C) Control to receiver of Sphynx                         */
  __IOM uint32_t  TXCTRL;                            /*!< (@ 0x00000010) Control to transmitter of Sphynx                      */
  __IOM uint32_t  MODEDEPENDENT;                     /*!< (@ 0x00000014) Mode dependent register of Sphynx                     */
  __IOM uint32_t  OVRRXTRIMCODE;                     /*!< (@ 0x00000018) Override trim codes to the receiver of Sphynx         */
  __IM  uint32_t  STATUS;                            /*!< (@ 0x0000001C) Readout raw status of signals output from Sphynx      */
  __IOM uint32_t  OVRRXGAIN;                         /*!< (@ 0x00000020) Analog rx gain override                               */
  __IOM uint32_t  CLOCKSOURCE;                       /*!< (@ 0x00000024) Choose between two clock sources                      */
} NRF_RADIO_SPHYNXANA_Type;                          /*!< Size = 40 (0x028)                                                    */

/* RADIO_SPHYNXANA_FSCTRL0: Control to frequency synthesizer of Sphynx */
  #define RADIO_SPHYNXANA_FSCTRL0_ResetValue (0xA0C58400UL) /*!< Reset value of FSCTRL0 register.                              */

