adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SPHYNXFSLDOBYPASS @Bits 0..5 : Bypass FS LDOs */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSLDOBYPASS_Pos (0UL) /*!< Position of SPHYNXFSLDOBYPASS field.                        */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSLDOBYPASS_Msk (0x3FUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSLDOBYPASS_Pos) /*!< Bit mask
                                                                            of SPHYNXFSLDOBYPASS field.*/

/* SPHYNXFSVCOCTRL @Bits 6..9 : Spare, not used */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOCTRL_Pos (6UL) /*!< Position of SPHYNXFSVCOCTRL field.                            */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOCTRL_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOCTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXFSVCOCTRL field.*/

/* SPHYNXFSVCOSWREF @Bits 10..12 : FS swing calibration */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOSWREF_Pos (10UL) /*!< Position of SPHYNXFSVCOSWREF field.                         */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOSWREF_Msk (0x7UL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOSWREF_Pos) /*!< Bit mask of
                                                                            SPHYNXFSVCOSWREF field.*/

/* SPHYNXFSDIV2CM @Bits 15..18 : Spare, not used */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CM_Pos (15UL) /*!< Position of SPHYNXFSDIV2CM field.                             */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CM_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CM_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDIV2CM field.*/

/* SPHYNXFSDIV2CTRL @Bits 19..21 : Spare, not used */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CTRL_Pos (19UL) /*!< Position of SPHYNXFSDIV2CTRL field.                         */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CTRL_Msk (0x7UL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDIV2CTRL field.*/

/* SPHYNXFSDIV2OSC @Bits 22..26 : Spare, not used */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2OSC_Pos (22UL) /*!< Position of SPHYNXFSDIV2OSC field.                           */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2OSC_Msk (0x1FUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2OSC_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDIV2OSC field.*/

/* SPHYNXFSDTCCTRL @Bits 27..30 : DTC control */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCCTRL_Pos (27UL) /*!< Position of SPHYNXFSDTCCTRL field.                           */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCCTRL_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCCTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDTCCTRL field.*/

/* SPHYNXFSDTCEDGEALIGN @Bit 31 : Resync at flip flop inside DTC */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCEDGEALIGN_Pos (31UL) /*!< Position of SPHYNXFSDTCEDGEALIGN field.                 */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCEDGEALIGN_Msk (0x1UL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCEDGEALIGN_Pos) /*!< Bit
                                                                            mask of SPHYNXFSDTCEDGEALIGN field.*/


/* RADIO_SPHYNXANA_FSCTRL1: Control to frequency synthesizer of Sphynx */
  #define RADIO_SPHYNXANA_FSCTRL1_ResetValue (0x00010060UL) /*!< Reset value of FSCTRL1 register.                              */

/* SPHYNXFSREFIPPTRIM @Bits 0..3 : For current calibration */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFIPPTRIM_Pos (0UL) /*!< Position of SPHYNXFSREFIPPTRIM field.                      */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFIPPTRIM_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFIPPTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXFSREFIPPTRIM field.*/

/* SPHYNXFSREFVTTRIM @Bits 5..6 : For voltage tuning of reference */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFVTTRIM_Pos (5UL) /*!< Position of SPHYNXFSREFVTTRIM field.                        */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFVTTRIM_Msk (0x3UL << RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFVTTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXFSREFVTTRIM field.*/

/* SPHYNXFSDIV2ISW @Bits 14..17 : [2:0] Adjust voltage for back bias of injection switch; [3] Spare */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSDIV2ISW_Pos (14UL) /*!< Position of SPHYNXFSDIV2ISW field.                           */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSDIV2ISW_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSDIV2ISW_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDIV2ISW field.*/

/* SPHYNXFSTDCCTRL @Bits 18..20 : Spare, not used */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSTDCCTRL_Pos (18UL) /*!< Position of SPHYNXFSTDCCTRL field.                           */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSTDCCTRL_Msk (0x7UL << RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSTDCCTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXFSTDCCTRL field.*/


/* RADIO_SPHYNXANA_FSCTRL2: Control to frequency synthesizer of Sphynx */
  #define RADIO_SPHYNXANA_FSCTRL2_ResetValue (0x00000000UL) /*!< Reset value of FSCTRL2 register.                              */

/* SPHYNXBIASTXVREFCFG @Bits 0..3 : BIAS_RXTX_CFG[3:0]: Used for changing TX_PA_GF22N supply. BIAS_TX_VREF_CFG_1V8[3:0] bus in
                                    BIAS_TX_VREF_CFG. */

  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASTXVREFCFG_Pos (0UL) /*!< Position of SPHYNXBIASTXVREFCFG field.                    */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASTXVREFCFG_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASTXVREFCFG_Pos) /*!< Bit
                                                                            mask of SPHYNXBIASTXVREFCFG field.*/

/* SPHYNXBIASRESPROCESS @Bits 4..5 : BIAS_RXTX_CFG[5:4]: RES_PROCESS_1V8[1:0] bus in BIAS_SWAT_IBP_BJT_SPHYNX_WRAP */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASRESPROCESS_Pos (4UL) /*!< Position of SPHYNXBIASRESPROCESS field.                  */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASRESPROCESS_Msk (0x3UL << RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASRESPROCESS_Pos) /*!< Bit
                                                                            mask of SPHYNXBIASRESPROCESS field.*/

/* SPHYNXBIASVREFTRIM @Bits 6..9 : BIAS_RXTX_CFG[9:6]: 2's complement trimming code for VREF_SWAT and IBPSR_4U.
                                   VREF_TRIM_1V8[3:0] bus in BIAS_SWAT_IBP_BJT_SPHYNX_WRAP. */

  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASVREFTRIM_Pos (6UL) /*!< Position of SPHYNXBIASVREFTRIM field.                      */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASVREFTRIM_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASVREFTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXBIASVREFTRIM field.*/

