adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SPHYNXBIASIBPPTRIM @Bits 10..13 : BIAS_RXTX_CFG[13:10]: 2's complement trimming code for IBPP_4U. IBPP_TRIM_1V8[3:0] bus in
                                     BIAS_SWAT_IBP_BJT_SPHYNX_WRAP. */

  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASIBPPTRIM_Pos (10UL) /*!< Position of SPHYNXBIASIBPPTRIM field.                     */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASIBPPTRIM_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASIBPPTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXBIASIBPPTRIM field.*/


/* RADIO_SPHYNXANA_RXCTRL: Control to receiver of Sphynx */
  #define RADIO_SPHYNXANA_RXCTRL_ResetValue (0x00000000UL) /*!< Reset value of RXCTRL register.                                */

/* SPHYNXBYPASSLDORX @Bits 0..2 : Bypass Rx LDOs */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXBYPASSLDORX_Pos (0UL) /*!< Position of SPHYNXBYPASSLDORX field.                         */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXBYPASSLDORX_Msk (0x7UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXBYPASSLDORX_Pos) /*!< Bit mask of
                                                                            SPHYNXBYPASSLDORX field.*/

/* SPHYNXRXMIXQLEADSI @Bit 3 : 1: output from MIX_AMP is Q leading I, 0 output from MIX_AMP is I leading Q */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXMIXQLEADSI_Pos (3UL) /*!< Position of SPHYNXRXMIXQLEADSI field.                       */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXMIXQLEADSI_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXRXMIXQLEADSI_Pos) /*!< Bit mask
                                                                            of SPHYNXRXMIXQLEADSI field.*/

/* SPHYNXRXAAFVCMTRIM @Bits 8..10 : VCM trim values for RX_AAF */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFVCMTRIM_Pos (8UL) /*!< Position of SPHYNXRXAAFVCMTRIM field.                       */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFVCMTRIM_Msk (0x7UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFVCMTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXRXAAFVCMTRIM field.*/

/* SPHYNXLNACFREQ @Bits 11..14 : LNA center frequency settings */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXLNACFREQ_Pos (11UL) /*!< Position of SPHYNXLNACFREQ field.                              */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXLNACFREQ_Msk (0xFUL << RADIO_SPHYNXANA_RXCTRL_SPHYNXLNACFREQ_Pos) /*!< Bit mask of
                                                                            SPHYNXLNACFREQ field.*/

/* SPHYNXLNACURR @Bits 15..17 : LNA current setting */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXLNACURR_Pos (15UL) /*!< Position of SPHYNXLNACURR field.                                */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXLNACURR_Msk (0x7UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXLNACURR_Pos) /*!< Bit mask of
                                                                            SPHYNXLNACURR field.*/

/* SPHYNXADCTIMINGCALC @Bit 18 : ADC_CFG_0V8[0]: Calculation of ADC timing margin */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCTIMINGCALC_Pos (18UL) /*!< Position of SPHYNXADCTIMINGCALC field.                    */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCTIMINGCALC_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXADCTIMINGCALC_Pos) /*!< Bit mask
                                                                            of SPHYNXADCTIMINGCALC field.*/

/* SPHYNXADCOFFSETCALC @Bit 19 : ADC_CFG_0V8[1]: Enabling of offset calculation */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCOFFSETCALC_Pos (19UL) /*!< Position of SPHYNXADCOFFSETCALC field.                    */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCOFFSETCALC_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXADCOFFSETCALC_Pos) /*!< Bit mask
                                                                            of SPHYNXADCOFFSETCALC field.*/

/* SPHYNXADCDYNDUC @Bit 20 : ADC_CFG_0V8[2]: Dynamic duty cycle of sampling clock */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCDYNDUC_Pos (20UL) /*!< Position of SPHYNXADCDYNDUC field.                            */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCDYNDUC_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXADCDYNDUC_Pos) /*!< Bit mask of
                                                                            SPHYNXADCDYNDUC field.*/

/* SPHYNXADCRPLCANC @Bit 21 : ADC_CFG_0V8[3]: Reference voltage ripple cancellation mode */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCRPLCANC_Pos (21UL) /*!< Position of SPHYNXADCRPLCANC field.                          */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCRPLCANC_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXADCRPLCANC_Pos) /*!< Bit mask of
                                                                            SPHYNXADCRPLCANC field.*/

/* SPHYNXADCCHRGINJ @Bit 22 : ADC_CFG_0V8[4]: Reference voltage charge injection mode */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCCHRGINJ_Pos (22UL) /*!< Position of SPHYNXADCCHRGINJ field.                          */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCCHRGINJ_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXADCCHRGINJ_Pos) /*!< Bit mask of
                                                                            SPHYNXADCCHRGINJ field.*/

/* SPHYNXADCVBULKTRIM @Bit 23 : ADC_CFG_0V8[5]: Trim bulks of LVT NFETs */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCVBULKTRIM_Pos (23UL) /*!< Position of SPHYNXADCVBULKTRIM field.                      */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXADCVBULKTRIM_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXADCVBULKTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXADCVBULKTRIM field.*/

/* ENCWLOOPBACK @Bit 24 : Enable CW loopback */
  #define RADIO_SPHYNXANA_RXCTRL_ENCWLOOPBACK_Pos (24UL) /*!< Position of ENCWLOOPBACK field.                                  */
  #define RADIO_SPHYNXANA_RXCTRL_ENCWLOOPBACK_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_ENCWLOOPBACK_Pos) /*!< Bit mask of
                                                                            ENCWLOOPBACK field.*/

/* RXTUNEIN @Bits 25..30 : Controls TX_PWR_0V8/PWRCTR_TX_0V9 when in RX or Loopback */
  #define RADIO_SPHYNXANA_RXCTRL_RXTUNEIN_Pos (25UL) /*!< Position of RXTUNEIN field.                                          */
  #define RADIO_SPHYNXANA_RXCTRL_RXTUNEIN_Msk (0x3FUL << RADIO_SPHYNXANA_RXCTRL_RXTUNEIN_Pos) /*!< Bit mask of RXTUNEIN field. */


/* RADIO_SPHYNXANA_TXCTRL: Control to transmitter of Sphynx */
  #define RADIO_SPHYNXANA_TXCTRL_ResetValue (0x00000000UL) /*!< Reset value of TXCTRL register.                                */

/* SPHYNXBYPASSLDOTX @Bits 0..2 : Bypass Tx LDOs */
  #define RADIO_SPHYNXANA_TXCTRL_SPHYNXBYPASSLDOTX_Pos (0UL) /*!< Position of SPHYNXBYPASSLDOTX field.                         */
  #define RADIO_SPHYNXANA_TXCTRL_SPHYNXBYPASSLDOTX_Msk (0x7UL << RADIO_SPHYNXANA_TXCTRL_SPHYNXBYPASSLDOTX_Pos) /*!< Bit mask of
                                                                            SPHYNXBYPASSLDOTX field.*/

/* SPHYNXTXPASRAMP @Bits 3..5 : TX PA ramp up/down control */
  #define RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPASRAMP_Pos (3UL) /*!< Position of SPHYNXTXPASRAMP field.                             */
  #define RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPASRAMP_Msk (0x7UL << RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPASRAMP_Pos) /*!< Bit mask of
                                                                            SPHYNXTXPASRAMP field.*/

/* SPHYNXTXPWRCTRLTUNE @Bits 6..11 : Digital input signal for tapping the resistor-ladder to create reference voltage in
                                     accordance with the desired peak */

  #define RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPWRCTRLTUNE_Pos (6UL) /*!< Position of SPHYNXTXPWRCTRLTUNE field.                     */
  #define RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPWRCTRLTUNE_Msk (0x3FUL << RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPWRCTRLTUNE_Pos) /*!< Bit
                                                                            mask of SPHYNXTXPWRCTRLTUNE field.*/

/* SPHYNXTXPWRFINE @Bits 16..23 : Radio Tx output power fine tune */
  #define RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPWRFINE_Pos (16UL) /*!< Position of SPHYNXTXPWRFINE field.                            */
  #define RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPWRFINE_Msk (0xFFUL << RADIO_SPHYNXANA_TXCTRL_SPHYNXTXPWRFINE_Pos) /*!< Bit mask of
                                                                            SPHYNXTXPWRFINE field.*/


/* RADIO_SPHYNXANA_MODEDEPENDENT: Mode dependent register of Sphynx */
  #define RADIO_SPHYNXANA_MODEDEPENDENT_ResetValue (0x00000000UL) /*!< Reset value of MODEDEPENDENT register.                  */

/* SPHYNXRXAAFFREQ @Bits 0..1 : Select Cut-Off Frequency for the AAF */
  #define RADIO_SPHYNXANA_MODEDEPENDENT_SPHYNXRXAAFFREQ_Pos (0UL) /*!< Position of SPHYNXRXAAFFREQ field.                      */
  #define RADIO_SPHYNXANA_MODEDEPENDENT_SPHYNXRXAAFFREQ_Msk (0x3UL << RADIO_SPHYNXANA_MODEDEPENDENT_SPHYNXRXAAFFREQ_Pos) /*!<
                                                                            Bit mask of SPHYNXRXAAFFREQ field.*/
  #define RADIO_SPHYNXANA_MODEDEPENDENT_SPHYNXRXAAFFREQ_Min (0x0UL) /*!< Min enumerator value of SPHYNXRXAAFFREQ field.        */
  #define RADIO_SPHYNXANA_MODEDEPENDENT_SPHYNXRXAAFFREQ_Max (0x2UL) /*!< Max enumerator value of SPHYNXRXAAFFREQ field.        */
  #define RADIO_SPHYNXANA_MODEDEPENDENT_SPHYNXRXAAFFREQ_2MHz (0x0UL) /*!< 2 MHz (for 1 MHz IF frequency)                       */
  #define RADIO_SPHYNXANA_MODEDEPENDENT_SPHYNXRXAAFFREQ_4MHz (0x1UL) /*!< 4 MHz (for 2 MHz IF frequency)                       */
  #define RADIO_SPHYNXANA_MODEDEPENDENT_SPHYNXRXAAFFREQ_6MHz (0x2UL) /*!< 6 MHz (for 4 MHz IF frequency)                       */


/* RADIO_SPHYNXANA_OVRRXTRIMCODE: Override trim codes to the receiver of Sphynx */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_ResetValue (0x00000000UL) /*!< Reset value of OVRRXTRIMCODE register.                  */

