adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OVRVALRCCALCODE1M @Bits 0..3 : Override values on RCCAL_CODE and RX_AAF_RCTRIMM (when IF is 1M) */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE1M_Pos (0UL) /*!< Position of OVRVALRCCALCODE1M field.                  */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE1M_Msk (0xFUL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE1M_Pos)
                                                                            /*!< Bit mask of OVRVALRCCALCODE1M field.*/

/* OVRVALRCCALCODE2M @Bits 4..7 : Override values on RCCAL_CODE and RX_AAF_RCTRIMM (when IF is 2M) */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE2M_Pos (4UL) /*!< Position of OVRVALRCCALCODE2M field.                  */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE2M_Msk (0xFUL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE2M_Pos)
                                                                            /*!< Bit mask of OVRVALRCCALCODE2M field.*/

/* OVRVALRCCALCODE4M @Bits 8..11 : Override values on RCCAL_CODE and RX_AAF_RCTRIMM (when IF is 4M) */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE4M_Pos (8UL) /*!< Position of OVRVALRCCALCODE4M field.                  */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE4M_Msk (0xFUL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRCCALCODE4M_Pos)
                                                                            /*!< Bit mask of OVRVALRCCALCODE4M field.*/

/* OVRVALRFMIXDCCALI @Bits 12..19 : Override values on RXMIX_DCCAL_I_0V8 */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRFMIXDCCALI_Pos (12UL) /*!< Position of OVRVALRFMIXDCCALI field.                 */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRFMIXDCCALI_Msk (0xFFUL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRFMIXDCCALI_Pos)
                                                                            /*!< Bit mask of OVRVALRFMIXDCCALI field.*/

/* OVRVALRFMIXDCCALQ @Bits 20..27 : Override values on RXMIX_DCCAL_Q_0V8 */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRFMIXDCCALQ_Pos (20UL) /*!< Position of OVRVALRFMIXDCCALQ field.                 */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRFMIXDCCALQ_Msk (0xFFUL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRVALRFMIXDCCALQ_Pos)
                                                                            /*!< Bit mask of OVRVALRFMIXDCCALQ field.*/

/* OVRENRCCALCODE @Bit 28 : For RCCAL_CODE_0V8, 0: controlled by CalibrationEngine, 1: overridden by register */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRCCALCODE_Pos (28UL) /*!< Position of OVRENRCCALCODE field.                       */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRCCALCODE_Msk (0x1UL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRCCALCODE_Pos) /*!< Bit
                                                                            mask of OVRENRCCALCODE field.*/

/* OVRENRFMIXDCCALI @Bit 29 : For RXMIX_DCCAL_I_0V8, 0: controlled by CalibrationEngine, 1: overridden by register */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALI_Pos (29UL) /*!< Position of OVRENRFMIXDCCALI field.                   */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALI_Msk (0x1UL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALI_Pos) /*!<
                                                                            Bit mask of OVRENRFMIXDCCALI field.*/

/* OVRENRFMIXDCCALQ @Bit 30 : For RXMIX_DCCAL_Q_0V8, 0: controlled by CalibrationEngine, 1: overridden by register */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALQ_Pos (30UL) /*!< Position of OVRENRFMIXDCCALQ field.                   */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALQ_Msk (0x1UL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALQ_Pos) /*!<
                                                                            Bit mask of OVRENRFMIXDCCALQ field.*/


/* RADIO_SPHYNXANA_STATUS: Readout raw status of signals output from Sphynx */
  #define RADIO_SPHYNXANA_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                */

/* SPHYNXADCBIAO @Bits 0..10 : Raw ADC I channel output from RX_SAR2 */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXADCBIAO_Pos (0UL) /*!< Position of SPHYNXADCBIAO field.                                 */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXADCBIAO_Msk (0x7FFUL << RADIO_SPHYNXANA_STATUS_SPHYNXADCBIAO_Pos) /*!< Bit mask of
                                                                            SPHYNXADCBIAO field.*/

/* SPHYNXADCBQAO @Bits 11..21 : Raw ADC Q channel output from RX_SAR2 */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXADCBQAO_Pos (11UL) /*!< Position of SPHYNXADCBQAO field.                                */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXADCBQAO_Msk (0x7FFUL << RADIO_SPHYNXANA_STATUS_SPHYNXADCBQAO_Pos) /*!< Bit mask of
                                                                            SPHYNXADCBQAO field.*/

/* SPHYNXCALCMPRCCALAO @Bit 22 : Raw comparator output of RC calibration from RC_CAL */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXCALCMPRCCALAO_Pos (22UL) /*!< Position of SPHYNXCALCMPRCCALAO field.                    */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXCALCMPRCCALAO_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SPHYNXCALCMPRCCALAO_Pos) /*!< Bit mask
                                                                            of SPHYNXCALCMPRCCALAO field.*/

/* SPHYNXAAFDCCALIAO @Bit 23 : Raw comparator output of DC calibration from RX_AAF I channel */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALIAO_Pos (23UL) /*!< Position of SPHYNXAAFDCCALIAO field.                        */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALIAO_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALIAO_Pos) /*!< Bit mask of
                                                                            SPHYNXAAFDCCALIAO field.*/

/* SPHYNXAAFDCCALQAO @Bit 24 : Raw comparator output of DC calibration from RX_AAF Q channel */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALQAO_Pos (24UL) /*!< Position of SPHYNXAAFDCCALQAO field.                        */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALQAO_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALQAO_Pos) /*!< Bit mask of
                                                                            SPHYNXAAFDCCALQAO field.*/

