adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TPWRUPTXLDOBIT2 @Bits 16..23 : Timing control of PwrupTxLdo[2] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT2_Pos (16UL) /*!< Position of TPWRUPTXLDOBIT2 field.                      */
  #define RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT2_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT2_Pos) /*!< Bit
                                                                            mask of TPWRUPTXLDOBIT2 field.*/

/* TPWRUPTXLDOBIT3 @Bits 24..31 : Timing control of PwrupTxLdo[3] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT3_Pos (24UL) /*!< Position of TPWRUPTXLDOBIT3 field.                      */
  #define RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT3_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT3_Pos) /*!< Bit
                                                                            mask of TPWRUPTXLDOBIT3 field.*/


/* RADIO_TIMINGENGINE_TIMINGTX1: Timing parameters for signals activated in Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGTX1_ResetValue (0x7870806CUL) /*!< Reset value of TIMINGTX1 register.                       */

/* TPWRUPTXLDOBIT4 @Bits 0..7 : Timing control of PwrupTxLdo[4] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXLDOBIT4_Pos (0UL) /*!< Position of TPWRUPTXLDOBIT4 field.                       */
  #define RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXLDOBIT4_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXLDOBIT4_Pos) /*!< Bit
                                                                            mask of TPWRUPTXLDOBIT4 field.*/

/* TPWRUPTXLDOBIT5 @Bits 8..15 : Timing control of PwrupTxLdo[5] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXLDOBIT5_Pos (8UL) /*!< Position of TPWRUPTXLDOBIT5 field.                       */
  #define RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXLDOBIT5_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXLDOBIT5_Pos) /*!< Bit
                                                                            mask of TPWRUPTXLDOBIT5 field.*/

/* TPWRUPTX @Bits 16..23 : Timing control of PwrupTx (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTX_Pos (16UL) /*!< Position of TPWRUPTX field.                                    */
  #define RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTX_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTX_Pos) /*!< Bit mask of
                                                                            TPWRUPTX field.*/

/* TPWRUPTXPWRCTRL @Bits 24..31 : Timing control of PwrupTxPwrCtrl (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXPWRCTRL_Pos (24UL) /*!< Position of TPWRUPTXPWRCTRL field.                      */
  #define RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXPWRCTRL_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX1_TPWRUPTXPWRCTRL_Pos) /*!< Bit
                                                                            mask of TPWRUPTXPWRCTRL field.*/


/* RADIO_TIMINGENGINE_TIMINGTX2: Timing parameters for signals activated in Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGTX2_ResetValue (0x00060078UL) /*!< Reset value of TIMINGTX2 register.                       */

/* TPWRUPTXPA @Bits 0..7 : Timing control of PwrupTxPa (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX2_TPWRUPTXPA_Pos (0UL) /*!< Position of TPWRUPTXPA field.                                 */
  #define RADIO_TIMINGENGINE_TIMINGTX2_TPWRUPTXPA_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX2_TPWRUPTXPA_Pos) /*!< Bit mask of
                                                                            TPWRUPTXPA field.*/

/* TDELTAPIPE @Bits 8..15 : Timing control of DeltaPipe (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX2_TDELTAPIPE_Pos (8UL) /*!< Position of TDELTAPIPE field.                                 */
  #define RADIO_TIMINGENGINE_TIMINGTX2_TDELTAPIPE_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX2_TDELTAPIPE_Pos) /*!< Bit mask of
                                                                            TDELTAPIPE field.*/

/* TDELTAPWRDNPA @Bits 16..23 : Timing control of DeltaPwrdnPa (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX2_TDELTAPWRDNPA_Pos (16UL) /*!< Position of TDELTAPWRDNPA field.                          */
  #define RADIO_TIMINGENGINE_TIMINGTX2_TDELTAPWRDNPA_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX2_TDELTAPWRDNPA_Pos) /*!< Bit
                                                                            mask of TDELTAPWRDNPA field.*/


/* RADIO_TIMINGENGINE_CONFIG: Configuration of timing control */
  #define RADIO_TIMINGENGINE_CONFIG_ResetValue (0x06020464UL) /*!< Reset value of CONFIG register.                             */

/* TREDUCETRXSWITCH @Bits 0..7 : Reduced timing for on-the-fly switch on both Rx->Tx and Tx->Rx (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_CONFIG_TREDUCETRXSWITCH_Pos (0UL) /*!< Position of TREDUCETRXSWITCH field.                        */
  #define RADIO_TIMINGENGINE_CONFIG_TREDUCETRXSWITCH_Msk (0xFFUL << RADIO_TIMINGENGINE_CONFIG_TREDUCETRXSWITCH_Pos) /*!< Bit
                                                                            mask of TREDUCETRXSWITCH field.*/

/* TRXTXTURNAROUNDHOLD @Bits 8..17 : Additional delay to hold Tx/Rx turnaround (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_CONFIG_TRXTXTURNAROUNDHOLD_Pos (8UL) /*!< Position of TRXTXTURNAROUNDHOLD field.                  */
  #define RADIO_TIMINGENGINE_CONFIG_TRXTXTURNAROUNDHOLD_Msk (0x3FFUL << RADIO_TIMINGENGINE_CONFIG_TRXTXTURNAROUNDHOLD_Pos) /*!<
                                                                            Bit mask of TRXTXTURNAROUNDHOLD field.*/

/* TREDUCETRXSWITCHEXTRA @Bits 24..31 : Extra reduced timing for on-the-fly Tx->Rx (select signals) (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_CONFIG_TREDUCETRXSWITCHEXTRA_Pos (24UL) /*!< Position of TREDUCETRXSWITCHEXTRA field.             */
  #define RADIO_TIMINGENGINE_CONFIG_TREDUCETRXSWITCHEXTRA_Msk (0xFFUL << RADIO_TIMINGENGINE_CONFIG_TREDUCETRXSWITCHEXTRA_Pos)
                                                                            /*!< Bit mask of TREDUCETRXSWITCHEXTRA field.*/


/* RADIO_TIMINGENGINE_OVRENALL: Enable or disable override of signals */
  #define RADIO_TIMINGENGINE_OVRENALL_ResetValue (0x00000000UL) /*!< Reset value of OVRENALL register.                         */

/* OVRENRETAINRADIO @Bit 0 : Override enable of RetainRadio */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENRETAINRADIO_Pos (0UL) /*!< Position of OVRENRETAINRADIO field.                      */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENRETAINRADIO_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENALL_OVRENRETAINRADIO_Pos) /*!< Bit
                                                                            mask of OVRENRETAINRADIO field.*/

/* OVRENPWRUPRADIO @Bits 1..2 : Override enable of PwrupRadio */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPRADIO_Pos (1UL) /*!< Position of OVRENPWRUPRADIO field.                        */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPRADIO_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPRADIO_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPRADIO field.*/

/* OVRENPWRUPFSREF @Bits 3..5 : Override enable of PwrupFsRef */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSREF_Pos (3UL) /*!< Position of OVRENPWRUPFSREF field.                        */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSREF_Msk (0x7UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSREF_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPFSREF field.*/

/* OVRENRSTFSLS @Bits 6..8 : Override enable of RstFsLs */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENRSTFSLS_Pos (6UL) /*!< Position of OVRENRSTFSLS field.                              */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENRSTFSLS_Msk (0x7UL << RADIO_TIMINGENGINE_OVRENALL_OVRENRSTFSLS_Pos) /*!< Bit mask of
                                                                            OVRENRSTFSLS field.*/

