adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OVRVALPWRUPFSREF @Bits 3..5 : Override value of PwrupFsRef */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSREF_Pos (3UL) /*!< Position of OVRVALPWRUPFSREF field.                     */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSREF_Msk (0x7UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSREF_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPFSREF field.*/

/* OVRVALRSTFSLS @Bits 6..8 : Override value of RstFsLs */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALRSTFSLS_Pos (6UL) /*!< Position of OVRVALRSTFSLS field.                           */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALRSTFSLS_Msk (0x7UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALRSTFSLS_Pos) /*!< Bit mask
                                                                            of OVRVALRSTFSLS field.*/

/* OVRVALPWRUPFSLDOVCO @Bits 9..10 : Override value of PwrupFsLdoVco */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOVCO_Pos (9UL) /*!< Position of OVRVALPWRUPFSLDOVCO field.               */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOVCO_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOVCO_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPFSLDOVCO field.*/

/* OVRVALPWRUPFSLDODTC @Bits 11..12 : Override value of PwrupFsLdoDtc */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODTC_Pos (11UL) /*!< Position of OVRVALPWRUPFSLDODTC field.              */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODTC_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODTC_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPFSLDODTC field.*/

/* OVRVALPWRUPFSLDODIG @Bits 13..14 : Override value of PwrupFsLdoDig */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODIG_Pos (13UL) /*!< Position of OVRVALPWRUPFSLDODIG field.              */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODIG_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODIG_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPFSLDODIG field.*/

/* OVRVALPWRUPFSLDODIV @Bits 15..16 : Override value of PwrupFsLdoDiv */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODIV_Pos (15UL) /*!< Position of OVRVALPWRUPFSLDODIV field.              */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODIV_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDODIV_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPFSLDODIV field.*/

/* OVRVALPWRUPFSLDOCNT @Bits 17..18 : Override value of PwrupFsLdoCnt */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOCNT_Pos (17UL) /*!< Position of OVRVALPWRUPFSLDOCNT field.              */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOCNT_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOCNT_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPFSLDOCNT field.*/

/* OVRVALPWRUPFSLDOTDC @Bits 19..20 : Override value of PwrupFsLdoTdc */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOTDC_Pos (19UL) /*!< Position of OVRVALPWRUPFSLDOTDC field.              */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOTDC_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSLDOTDC_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPFSLDOTDC field.*/

/* OVRVALPWRUPFSDTC @Bit 21 : Override value of PwrupFsDtc */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDTC_Pos (21UL) /*!< Position of OVRVALPWRUPFSDTC field.                    */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDTC_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDTC_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPFSDTC field.*/

/* OVRVALPWRUPFSTDC @Bit 22 : Override value of PwrupFsTdc */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSTDC_Pos (22UL) /*!< Position of OVRVALPWRUPFSTDC field.                    */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSTDC_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSTDC_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPFSTDC field.*/

/* OVRVALPWRUPFSVCO @Bit 23 : Override value of PwrupFsVco */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSVCO_Pos (23UL) /*!< Position of OVRVALPWRUPFSVCO field.                    */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSVCO_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSVCO_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPFSVCO field.*/

/* OVRVALPWRUPFSDIV2 @Bit 24 : Override value of PwrupFsDiv2 */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDIV2_Pos (24UL) /*!< Position of OVRVALPWRUPFSDIV2 field.                  */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDIV2_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDIV2_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPFSDIV2 field.*/

/* OVRVALPWRUPFSDIV2G4COUNTER @Bit 25 : Override value of PwrupFsDiv2g4Counter */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDIV2G4COUNTER_Pos (25UL) /*!< Position of OVRVALPWRUPFSDIV2G4COUNTER field.*/
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDIV2G4COUNTER_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPFSDIV2G4COUNTER_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPFSDIV2G4COUNTER field.*/

/* OVRVALARSTFS @Bit 26 : Override value of ArstFs */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALARSTFS_Pos (26UL) /*!< Position of OVRVALARSTFS field.                            */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALARSTFS_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALARSTFS_Pos) /*!< Bit mask
                                                                            of OVRVALARSTFS field.*/

