adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OVRVALPWRUPTXPA @Bit 24 : Override value of PwrupTxPa */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXPA_Pos (24UL) /*!< Position of OVRVALPWRUPTXPA field.                     */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXPA_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXPA_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPTXPA field.*/

/* OVRVALPWRUPEXTLNA @Bit 25 : Override value of PwrupExtLna */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPEXTLNA_Pos (25UL) /*!< Position of OVRVALPWRUPEXTLNA field.                 */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPEXTLNA_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPEXTLNA_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPEXTLNA field.*/

/* OVRVALPWRUPEXTPA @Bit 26 : Override value of PwrupExtPa */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPEXTPA_Pos (26UL) /*!< Position of OVRVALPWRUPEXTPA field.                   */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPEXTPA_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPEXTPA_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPEXTPA field.*/

/* OVRVALSETRXIF @Bit 27 : Override value of setRxIf */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALSETRXIF_Pos (27UL) /*!< Position of OVRVALSETRXIF field.                         */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALSETRXIF_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALSETRXIF_Pos) /*!< Bit
                                                                            mask of OVRVALSETRXIF field.*/

/* OVRVALRXAGCEN @Bit 28 : Override value of rxAgcEn */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRXAGCEN_Pos (28UL) /*!< Position of OVRVALRXAGCEN field.                         */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRXAGCEN_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRXAGCEN_Pos) /*!< Bit
                                                                            mask of OVRVALRXAGCEN field.*/

/* OVRVALRXDIGEN @Bit 29 : Override value of rxDigEn */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRXDIGEN_Pos (29UL) /*!< Position of OVRVALRXDIGEN field.                         */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRXDIGEN_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRXDIGEN_Pos) /*!< Bit
                                                                            mask of OVRVALRXDIGEN field.*/

/* OVRVALPWRUPRXLNAPDET @Bit 30 : Override value of PwrupRxLnaPdet */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLNAPDET_Pos (30UL) /*!< Position of OVRVALPWRUPRXLNAPDET field.           */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLNAPDET_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLNAPDET_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPRXLNAPDET field.*/


/* RADIO_TIMINGENGINE_MODEDEPENDENT2: Mode dependent timing controls */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT2_ResetValue (0x00000014UL) /*!< Reset value of MODEDEPENDENT2 register.             */

/* TTXRXTURNAROUNDDELTA @Bits 0..4 : Additional offset in Rx mode, for Rx to be able to be ready earlier, which is required for
                                     2Mbps */

  #define RADIO_TIMINGENGINE_MODEDEPENDENT2_TTXRXTURNAROUNDDELTA_Pos (0UL) /*!< Position of TTXRXTURNAROUNDDELTA field.        */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT2_TTXRXTURNAROUNDDELTA_Msk (0x1FUL << RADIO_TIMINGENGINE_MODEDEPENDENT2_TTXRXTURNAROUNDDELTA_Pos)
                                                                            /*!< Bit mask of TTXRXTURNAROUNDDELTA field.*/

/* TURNOFFRADIOWRTTXDATAVALID @Bit 8 : Turn off radio with regards to txDataValid in addition to radioEn */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT2_TURNOFFRADIOWRTTXDATAVALID_Pos (8UL) /*!< Position of TURNOFFRADIOWRTTXDATAVALID
                                                                            field.*/
  #define RADIO_TIMINGENGINE_MODEDEPENDENT2_TURNOFFRADIOWRTTXDATAVALID_Msk (0x1UL << RADIO_TIMINGENGINE_MODEDEPENDENT2_TURNOFFRADIOWRTTXDATAVALID_Pos)
                                                                            /*!< Bit mask of TURNOFFRADIOWRTTXDATAVALID field.*/



/* =================================================== Struct RADIO_RXAGC ==================================================== */
/**
  * @brief RXAGC [RADIO_RXAGC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  GAIN;                              /*!< (@ 0x00000000) Gain boundary settings and gain steps                 */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Configuration to adjust gain control loop             */
  __IOM uint32_t  CALIBRATION;                       /*!< (@ 0x00000008) Calibrate RSSI and Energy Detect values               */
  __IM  uint32_t  STATUS;                            /*!< (@ 0x0000000C) Readout latest gain control status                    */
} NRF_RADIO_RXAGC_Type;                              /*!< Size = 16 (0x010)                                                    */

/* RADIO_RXAGC_GAIN: Gain boundary settings and gain steps */
  #define RADIO_RXAGC_GAIN_ResetValue (0x11091107UL) /*!< Reset value of GAIN register.                                        */

/* AGCRFGAINMAX @Bits 0..3 : Maximum gain of RF gain */
  #define RADIO_RXAGC_GAIN_AGCRFGAINMAX_Pos (0UL)    /*!< Position of AGCRFGAINMAX field.                                      */
  #define RADIO_RXAGC_GAIN_AGCRFGAINMAX_Msk (0xFUL << RADIO_RXAGC_GAIN_AGCRFGAINMAX_Pos) /*!< Bit mask of AGCRFGAINMAX field.  */

/* AGCRFGAINMIN @Bits 4..7 : Minimum gain of RF gain */
  #define RADIO_RXAGC_GAIN_AGCRFGAINMIN_Pos (4UL)    /*!< Position of AGCRFGAINMIN field.                                      */
  #define RADIO_RXAGC_GAIN_AGCRFGAINMIN_Msk (0xFUL << RADIO_RXAGC_GAIN_AGCRFGAINMIN_Pos) /*!< Bit mask of AGCRFGAINMIN field.  */

/* AGCRFGAINSTEPUP @Bits 8..11 : gain step for increasing RF gain */
  #define RADIO_RXAGC_GAIN_AGCRFGAINSTEPUP_Pos (8UL) /*!< Position of AGCRFGAINSTEPUP field.                                   */
  #define RADIO_RXAGC_GAIN_AGCRFGAINSTEPUP_Msk (0xFUL << RADIO_RXAGC_GAIN_AGCRFGAINSTEPUP_Pos) /*!< Bit mask of AGCRFGAINSTEPUP
                                                                            field.*/

