adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* AGCRFGAINSTEPDOWN @Bits 12..15 : gain step for decreasing RF gain */
  #define RADIO_RXAGC_GAIN_AGCRFGAINSTEPDOWN_Pos (12UL) /*!< Position of AGCRFGAINSTEPDOWN field.                              */
  #define RADIO_RXAGC_GAIN_AGCRFGAINSTEPDOWN_Msk (0xFUL << RADIO_RXAGC_GAIN_AGCRFGAINSTEPDOWN_Pos) /*!< Bit mask of
                                                                            AGCRFGAINSTEPDOWN field.*/

/* AGCIFGAINMAX @Bits 16..19 : Maximum gain of IF gain */
  #define RADIO_RXAGC_GAIN_AGCIFGAINMAX_Pos (16UL)   /*!< Position of AGCIFGAINMAX field.                                      */
  #define RADIO_RXAGC_GAIN_AGCIFGAINMAX_Msk (0xFUL << RADIO_RXAGC_GAIN_AGCIFGAINMAX_Pos) /*!< Bit mask of AGCIFGAINMAX field.  */

/* AGCIFGAINMIN @Bits 20..23 : Minimum gain of IF gain */
  #define RADIO_RXAGC_GAIN_AGCIFGAINMIN_Pos (20UL)   /*!< Position of AGCIFGAINMIN field.                                      */
  #define RADIO_RXAGC_GAIN_AGCIFGAINMIN_Msk (0xFUL << RADIO_RXAGC_GAIN_AGCIFGAINMIN_Pos) /*!< Bit mask of AGCIFGAINMIN field.  */

/* AGCIFGAINSTEPUP @Bits 24..27 : gain step for increasing IF gain */
  #define RADIO_RXAGC_GAIN_AGCIFGAINSTEPUP_Pos (24UL) /*!< Position of AGCIFGAINSTEPUP field.                                  */
  #define RADIO_RXAGC_GAIN_AGCIFGAINSTEPUP_Msk (0xFUL << RADIO_RXAGC_GAIN_AGCIFGAINSTEPUP_Pos) /*!< Bit mask of AGCIFGAINSTEPUP
                                                                            field.*/

/* AGCIFGAINSTEPDOWN @Bits 28..31 : gain step for decreasing IF gain */
  #define RADIO_RXAGC_GAIN_AGCIFGAINSTEPDOWN_Pos (28UL) /*!< Position of AGCIFGAINSTEPDOWN field.                              */
  #define RADIO_RXAGC_GAIN_AGCIFGAINSTEPDOWN_Msk (0xFUL << RADIO_RXAGC_GAIN_AGCIFGAINSTEPDOWN_Pos) /*!< Bit mask of
                                                                            AGCIFGAINSTEPDOWN field.*/


/* RADIO_RXAGC_CONFIG: Configuration to adjust gain control loop */
  #define RADIO_RXAGC_CONFIG_ResetValue (0x001230C3UL) /*!< Reset value of CONFIG register.                                    */

/* AGCENABLEGAINSWITCH @Bit 0 : Causes the RF gain to be decreased and the IF gain to be increased if the overall gain can be
                                maintained */

  #define RADIO_RXAGC_CONFIG_AGCENABLEGAINSWITCH_Pos (0UL) /*!< Position of AGCENABLEGAINSWITCH field.                         */
  #define RADIO_RXAGC_CONFIG_AGCENABLEGAINSWITCH_Msk (0x1UL << RADIO_RXAGC_CONFIG_AGCENABLEGAINSWITCH_Pos) /*!< Bit mask of
                                                                            AGCENABLEGAINSWITCH field.*/

/* AGCRFPKDETRESETCOUNT @Bits 1..4 : The number of clock cycles after the adjustment of gain that the reset signal to the RF
                                     peak detector is set high */

  #define RADIO_RXAGC_CONFIG_AGCRFPKDETRESETCOUNT_Pos (1UL) /*!< Position of AGCRFPKDETRESETCOUNT field.                       */
  #define RADIO_RXAGC_CONFIG_AGCRFPKDETRESETCOUNT_Msk (0xFUL << RADIO_RXAGC_CONFIG_AGCRFPKDETRESETCOUNT_Pos) /*!< Bit mask of
                                                                            AGCRFPKDETRESETCOUNT field.*/

/* AGCWAIT @Bits 5..10 : The number of clock cycles between each adjustment of the gain while addressMatch is low */
  #define RADIO_RXAGC_CONFIG_AGCWAIT_Pos (5UL)       /*!< Position of AGCWAIT field.                                           */
  #define RADIO_RXAGC_CONFIG_AGCWAIT_Msk (0x3FUL << RADIO_RXAGC_CONFIG_AGCWAIT_Pos) /*!< Bit mask of AGCWAIT field.            */

/* AGCWAITPACKET @Bits 11..16 : The number of clock cycles between each adjustment of the gain while addressMatch is high */
  #define RADIO_RXAGC_CONFIG_AGCWAITPACKET_Pos (11UL) /*!< Position of AGCWAITPACKET field.                                    */
  #define RADIO_RXAGC_CONFIG_AGCWAITPACKET_Msk (0x3FUL << RADIO_RXAGC_CONFIG_AGCWAITPACKET_Pos) /*!< Bit mask of AGCWAITPACKET
                                                                            field.*/

/* AGCAAFOVERRIDE @Bits 17..20 : Override value for aafGain */
  #define RADIO_RXAGC_CONFIG_AGCAAFOVERRIDE_Pos (17UL) /*!< Position of AGCAAFOVERRIDE field.                                  */
  #define RADIO_RXAGC_CONFIG_AGCAAFOVERRIDE_Msk (0xFUL << RADIO_RXAGC_CONFIG_AGCAAFOVERRIDE_Pos) /*!< Bit mask of AGCAAFOVERRIDE
                                                                            field.*/

/* AGCMIXOVERRIDE @Bit 21 : Override value for mixGain */
  #define RADIO_RXAGC_CONFIG_AGCMIXOVERRIDE_Pos (21UL) /*!< Position of AGCMIXOVERRIDE field.                                  */
  #define RADIO_RXAGC_CONFIG_AGCMIXOVERRIDE_Msk (0x1UL << RADIO_RXAGC_CONFIG_AGCMIXOVERRIDE_Pos) /*!< Bit mask of AGCMIXOVERRIDE
                                                                            field.*/

/* AGCLNAOVERRIDE @Bits 22..23 : Override value for lnaGain */
  #define RADIO_RXAGC_CONFIG_AGCLNAOVERRIDE_Pos (22UL) /*!< Position of AGCLNAOVERRIDE field.                                  */
  #define RADIO_RXAGC_CONFIG_AGCLNAOVERRIDE_Msk (0x3UL << RADIO_RXAGC_CONFIG_AGCLNAOVERRIDE_Pos) /*!< Bit mask of AGCLNAOVERRIDE
                                                                            field.*/

/* AGCOVERRIDEGAIN @Bit 28 : 0: AGC takes control of all gains, 1: Control all gains (aafGain, mixGain, lnaGain) from registers
                             */

  #define RADIO_RXAGC_CONFIG_AGCOVERRIDEGAIN_Pos (28UL) /*!< Position of AGCOVERRIDEGAIN field.                                */
  #define RADIO_RXAGC_CONFIG_AGCOVERRIDEGAIN_Msk (0x1UL << RADIO_RXAGC_CONFIG_AGCOVERRIDEGAIN_Pos) /*!< Bit mask of
                                                                            AGCOVERRIDEGAIN field.*/

/* AGCTOGGLE @Bits 29..30 : Enable(1) or disable(0) functional testmode for AGC */
  #define RADIO_RXAGC_CONFIG_AGCTOGGLE_Pos (29UL)    /*!< Position of AGCTOGGLE field.                                         */
  #define RADIO_RXAGC_CONFIG_AGCTOGGLE_Msk (0x3UL << RADIO_RXAGC_CONFIG_AGCTOGGLE_Pos) /*!< Bit mask of AGCTOGGLE field.       */

/* AGCENABLEGAINREVERT @Bit 31 : Gain reversion. 0: reduce IF gain before RF gain, 1: reduce RF gain before IF gain. */
  #define RADIO_RXAGC_CONFIG_AGCENABLEGAINREVERT_Pos (31UL) /*!< Position of AGCENABLEGAINREVERT field.                        */
  #define RADIO_RXAGC_CONFIG_AGCENABLEGAINREVERT_Msk (0x1UL << RADIO_RXAGC_CONFIG_AGCENABLEGAINREVERT_Pos) /*!< Bit mask of
                                                                            AGCENABLEGAINREVERT field.*/


/* RADIO_RXAGC_CALIBRATION: Calibrate RSSI and Energy Detect values */
  #define RADIO_RXAGC_CALIBRATION_ResetValue (0x00000000UL) /*!< Reset value of CALIBRATION register.                          */

/* RSSICAL @Bits 0..6 : RSSI calibration value */
  #define RADIO_RXAGC_CALIBRATION_RSSICAL_Pos (0UL)  /*!< Position of RSSICAL field.                                           */
  #define RADIO_RXAGC_CALIBRATION_RSSICAL_Msk (0x7FUL << RADIO_RXAGC_CALIBRATION_RSSICAL_Pos) /*!< Bit mask of RSSICAL field.  */

/* ED154CAL @Bits 7..13 : 802154 Energy Detect calibration value */
  #define RADIO_RXAGC_CALIBRATION_ED154CAL_Pos (7UL) /*!< Position of ED154CAL field.                                          */
  #define RADIO_RXAGC_CALIBRATION_ED154CAL_Msk (0x7FUL << RADIO_RXAGC_CALIBRATION_ED154CAL_Pos) /*!< Bit mask of ED154CAL
                                                                            field.*/


/* RADIO_RXAGC_STATUS: Readout latest gain control status */
  #define RADIO_RXAGC_STATUS_ResetValue (0x0000007FUL) /*!< Reset value of STATUS register.                                    */

/* RSSI @Bits 0..6 : Raw status of received signal strength indicator, directly from RxAgc without buffering */
  #define RADIO_RXAGC_STATUS_RSSI_Pos (0UL)          /*!< Position of RSSI field.                                              */
  #define RADIO_RXAGC_STATUS_RSSI_Msk (0x7FUL << RADIO_RXAGC_STATUS_RSSI_Pos) /*!< Bit mask of RSSI field.                     */

/* AAFGAIN @Bits 8..11 : Raw AAF gain status */
  #define RADIO_RXAGC_STATUS_AAFGAIN_Pos (8UL)       /*!< Position of AAFGAIN field.                                           */
  #define RADIO_RXAGC_STATUS_AAFGAIN_Msk (0xFUL << RADIO_RXAGC_STATUS_AAFGAIN_Pos) /*!< Bit mask of AAFGAIN field.             */

/* MIXGAIN @Bit 12 : Raw mixer gain status */
  #define RADIO_RXAGC_STATUS_MIXGAIN_Pos (12UL)      /*!< Position of MIXGAIN field.                                           */
  #define RADIO_RXAGC_STATUS_MIXGAIN_Msk (0x1UL << RADIO_RXAGC_STATUS_MIXGAIN_Pos) /*!< Bit mask of MIXGAIN field.             */

/* LNAGAIN @Bits 16..17 : Raw LNA gain status */
  #define RADIO_RXAGC_STATUS_LNAGAIN_Pos (16UL)      /*!< Position of LNAGAIN field.                                           */
  #define RADIO_RXAGC_STATUS_LNAGAIN_Msk (0x3UL << RADIO_RXAGC_STATUS_LNAGAIN_Pos) /*!< Bit mask of LNAGAIN field.             */

/* RFPKDET @Bits 24..25 : RF peak detector output after sync. Represent state[5:4] in RxAgc. */
  #define RADIO_RXAGC_STATUS_RFPKDET_Pos (24UL)      /*!< Position of RFPKDET field.                                           */
  #define RADIO_RXAGC_STATUS_RFPKDET_Msk (0x3UL << RADIO_RXAGC_STATUS_RFPKDET_Pos) /*!< Bit mask of RFPKDET field.             */

/* IFPKDET @Bits 26..27 : IF peak detector output. Represent state[3:2] in RxAgc. */
  #define RADIO_RXAGC_STATUS_IFPKDET_Pos (26UL)      /*!< Position of IFPKDET field.                                           */
  #define RADIO_RXAGC_STATUS_IFPKDET_Msk (0x3UL << RADIO_RXAGC_STATUS_IFPKDET_Pos) /*!< Bit mask of IFPKDET field.             */

/* BBPKDET @Bits 28..29 : BB peak detector output. Represent state[1:0] in RxAgc. */
  #define RADIO_RXAGC_STATUS_BBPKDET_Pos (28UL)      /*!< Position of BBPKDET field.                                           */
  #define RADIO_RXAGC_STATUS_BBPKDET_Msk (0x3UL << RADIO_RXAGC_STATUS_BBPKDET_Pos) /*!< Bit mask of BBPKDET field.             */



/* ==================================================== Struct RADIO_RXIF ==================================================== */
/**
  * @brief RXIF [RADIO_RXIF] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RXPEAKDETECT;                      /*!< (@ 0x00000000) Configuration of IF Rx peak detector                  */
} NRF_RADIO_RXIF_Type;                               /*!< Size = 4 (0x004)                                                     */

