adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_RXIF_RXPEAKDETECT: Configuration of IF Rx peak detector */
  #define RADIO_RXIF_RXPEAKDETECT_ResetValue (0x040C8384UL) /*!< Reset value of RXPEAKDETECT register.                         */

/* HIGHTHRES @Bits 0..11 : High threshold of IF peak detector. This valued is based on the 11-bits ADC of SPHYNX_ANA. */
  #define RADIO_RXIF_RXPEAKDETECT_HIGHTHRES_Pos (0UL) /*!< Position of HIGHTHRES field.                                        */
  #define RADIO_RXIF_RXPEAKDETECT_HIGHTHRES_Msk (0xFFFUL << RADIO_RXIF_RXPEAKDETECT_HIGHTHRES_Pos) /*!< Bit mask of HIGHTHRES
                                                                            field.*/

/* LOWTHRES @Bits 12..23 : Low threshold of IF peak detector. This valued is based on the 11-bits ADC of SPHYNX_ANA. */
  #define RADIO_RXIF_RXPEAKDETECT_LOWTHRES_Pos (12UL) /*!< Position of LOWTHRES field.                                         */
  #define RADIO_RXIF_RXPEAKDETECT_LOWTHRES_Msk (0xFFFUL << RADIO_RXIF_RXPEAKDETECT_LOWTHRES_Pos) /*!< Bit mask of LOWTHRES
                                                                            field.*/

/* DECAYSTEP @Bits 24..29 : Constant output reduction step */
  #define RADIO_RXIF_RXPEAKDETECT_DECAYSTEP_Pos (24UL) /*!< Position of DECAYSTEP field.                                       */
  #define RADIO_RXIF_RXPEAKDETECT_DECAYSTEP_Msk (0x3FUL << RADIO_RXIF_RXPEAKDETECT_DECAYSTEP_Pos) /*!< Bit mask of DECAYSTEP
                                                                            field.*/



/* ============================================= Struct RADIO_DECFILTERS_OUTMAIN ============================================= */
/**
  * @brief OUTMAIN [RADIO_DECFILTERS_OUTMAIN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the output outMain          */
} NRF_RADIO_DECFILTERS_OUTMAIN_Type;                 /*!< Size = 4 (0x004)                                                     */

/* RADIO_DECFILTERS_OUTMAIN_CKSEL: Clock select register for the output outMain */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_ResetValue (0x00000002UL) /*!< Reset value of CKSEL register.                         */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */

  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field.                                         */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_Msk (0x7UL << RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_Pos) /*!< Bit mask of CKSEL
                                                                            field.*/
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_Min (0x0UL) /*!< Min enumerator value of CKSEL field.                           */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_Max (0x7UL) /*!< Max enumerator value of CKSEL field.                           */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel32M (0x0UL) /*!< CKSEL_32M                                                */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel16M (0x1UL) /*!< CKSEL_16M                                                */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel8M (0x2UL) /*!< CKSEL_8M                                                  */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel4M (0x3UL) /*!< CKSEL_4M                                                  */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel2M (0x4UL) /*!< CKSEL_2M                                                  */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel1M (0x5UL) /*!< CKSEL_1M                                                  */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel500K (0x6UL) /*!< CKSEL_500K                                              */
  #define RADIO_DECFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSelBypass (0x7UL) /*!< CKSEL_BYPASS                                          */



/* ============================================= Struct RADIO_DECFILTERS_DECFIR0 ============================================= */
/**
  * @brief DECFIR0 [RADIO_DECFILTERS_DECFIR0] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the PUnit decFIR0 of type
                                                                         IP_FIR*/
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000004) Control register for the PUnit decFIR0 of type IP_FIR */
  __IOM uint32_t  COEFFS0;                           /*!< (@ 0x00000008) Coefficient register 0 for the PUnit decFIR0 of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS1;                           /*!< (@ 0x0000000C) Coefficient register 1 for the PUnit decFIR0 of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS2;                           /*!< (@ 0x00000010) Coefficient register 2 for the PUnit decFIR0 of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS3;                           /*!< (@ 0x00000014) Coefficient register 3 for the PUnit decFIR0 of type
                                                                         IP_FIR*/
} NRF_RADIO_DECFILTERS_DECFIR0_Type;                 /*!< Size = 24 (0x018)                                                    */

/* RADIO_DECFILTERS_DECFIR0_CKSEL: Clock select register for the PUnit decFIR0 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_ResetValue (0x00000007UL) /*!< Reset value of CKSEL register.                         */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */

  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field.                                         */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_Msk (0x7UL << RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_Pos) /*!< Bit mask of CKSEL
                                                                            field.*/
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_Min (0x0UL) /*!< Min enumerator value of CKSEL field.                           */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_Max (0x7UL) /*!< Max enumerator value of CKSEL field.                           */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_ClkSel32M (0x0UL) /*!< CKSEL_32M                                                */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_ClkSel16M (0x1UL) /*!< CKSEL_16M                                                */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_ClkSel8M (0x2UL) /*!< CKSEL_8M                                                  */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_ClkSel4M (0x3UL) /*!< CKSEL_4M                                                  */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_ClkSel2M (0x4UL) /*!< CKSEL_2M                                                  */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_ClkSel1M (0x5UL) /*!< CKSEL_1M                                                  */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_ClkSel500K (0x6UL) /*!< CKSEL_500K                                              */
  #define RADIO_DECFILTERS_DECFIR0_CKSEL_CKSEL_ClkSelBypass (0x7UL) /*!< CKSEL_BYPASS                                          */


/* RADIO_DECFILTERS_DECFIR0_CONTROL: Control register for the PUnit decFIR0 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR0_CONTROL_ResetValue (0x00000002UL) /*!< Reset value of CONTROL register.                     */

/* TAPSEL @Bits 0..1 : Tap-select: number of active taps minus 2 */
  #define RADIO_DECFILTERS_DECFIR0_CONTROL_TAPSEL_Pos (0UL) /*!< Position of TAPSEL field.                                     */
  #define RADIO_DECFILTERS_DECFIR0_CONTROL_TAPSEL_Msk (0x3UL << RADIO_DECFILTERS_DECFIR0_CONTROL_TAPSEL_Pos) /*!< Bit mask of
                                                                            TAPSEL field.*/


/* RADIO_DECFILTERS_DECFIR0_COEFFS0: Coefficient register 0 for the PUnit decFIR0 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR0_COEFFS0_ResetValue (0x00000004UL) /*!< Reset value of COEFFS0 register.                     */

/* COEFF0 @Bits 0..3 : Signed filter coefficient 0 */
  #define RADIO_DECFILTERS_DECFIR0_COEFFS0_COEFF0_Pos (0UL) /*!< Position of COEFF0 field.                                     */
  #define RADIO_DECFILTERS_DECFIR0_COEFFS0_COEFF0_Msk (0xFUL << RADIO_DECFILTERS_DECFIR0_COEFFS0_COEFF0_Pos) /*!< Bit mask of
                                                                            COEFF0 field.*/


