adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* COEFF1 @Bits 0..5 : Signed filter coefficient 1 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS1_COEFF1_Pos (0UL) /*!< Position of COEFF1 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS1_COEFF1_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS1_COEFF1_Pos) /*!< Bit mask of
                                                                            COEFF1 field.*/


/* RADIO_DECFILTERS_DECFIR1_COEFFS2: Coefficient register 2 for the PUnit decFIR1 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS2_ResetValue (0x00000018UL) /*!< Reset value of COEFFS2 register.                     */

/* COEFF2 @Bits 0..5 : Signed filter coefficient 2 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS2_COEFF2_Pos (0UL) /*!< Position of COEFF2 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS2_COEFF2_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS2_COEFF2_Pos) /*!< Bit mask of
                                                                            COEFF2 field.*/


/* RADIO_DECFILTERS_DECFIR1_COEFFS3: Coefficient register 3 for the PUnit decFIR1 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS3_ResetValue (0x00000010UL) /*!< Reset value of COEFFS3 register.                     */

/* COEFF3 @Bits 0..5 : Signed filter coefficient 3 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS3_COEFF3_Pos (0UL) /*!< Position of COEFF3 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS3_COEFF3_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS3_COEFF3_Pos) /*!< Bit mask of
                                                                            COEFF3 field.*/


/* RADIO_DECFILTERS_DECFIR1_COEFFS4: Coefficient register 4 for the PUnit decFIR1 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS4_ResetValue (0x00000000UL) /*!< Reset value of COEFFS4 register.                     */

/* COEFF4 @Bits 0..5 : Signed filter coefficient 4 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS4_COEFF4_Pos (0UL) /*!< Position of COEFF4 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS4_COEFF4_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS4_COEFF4_Pos) /*!< Bit mask of
                                                                            COEFF4 field.*/


/* RADIO_DECFILTERS_DECFIR1_COEFFS5: Coefficient register 5 for the PUnit decFIR1 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS5_ResetValue (0x00000000UL) /*!< Reset value of COEFFS5 register.                     */

/* COEFF5 @Bits 0..5 : Signed filter coefficient 5 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS5_COEFF5_Pos (0UL) /*!< Position of COEFF5 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS5_COEFF5_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS5_COEFF5_Pos) /*!< Bit mask of
                                                                            COEFF5 field.*/



/* ============================================= Struct RADIO_DECFILTERS_DECFIR2 ============================================= */
/**
  * @brief DECFIR2 [RADIO_DECFILTERS_DECFIR2] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the PUnit decFIR2 of type
                                                                         IP_FIR*/
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000004) Control register for the PUnit decFIR2 of type IP_FIR */
  __IOM uint32_t  COEFFS0;                           /*!< (@ 0x00000008) Coefficient register 0 for the PUnit decFIR2 of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS1;                           /*!< (@ 0x0000000C) Coefficient register 1 for the PUnit decFIR2 of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS2;                           /*!< (@ 0x00000010) Coefficient register 2 for the PUnit decFIR2 of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS3;                           /*!< (@ 0x00000014) Coefficient register 3 for the PUnit decFIR2 of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS4;                           /*!< (@ 0x00000018) Coefficient register 4 for the PUnit decFIR2 of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS5;                           /*!< (@ 0x0000001C) Coefficient register 5 for the PUnit decFIR2 of type
                                                                         IP_FIR*/
} NRF_RADIO_DECFILTERS_DECFIR2_Type;                 /*!< Size = 32 (0x020)                                                    */

/* RADIO_DECFILTERS_DECFIR2_CKSEL: Clock select register for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_ResetValue (0x00000001UL) /*!< Reset value of CKSEL register.                         */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */

  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field.                                         */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_Msk (0x7UL << RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_Pos) /*!< Bit mask of CKSEL
                                                                            field.*/
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_Min (0x0UL) /*!< Min enumerator value of CKSEL field.                           */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_Max (0x7UL) /*!< Max enumerator value of CKSEL field.                           */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_ClkSel32M (0x0UL) /*!< CKSEL_32M                                                */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_ClkSel16M (0x1UL) /*!< CKSEL_16M                                                */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_ClkSel8M (0x2UL) /*!< CKSEL_8M                                                  */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_ClkSel4M (0x3UL) /*!< CKSEL_4M                                                  */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_ClkSel2M (0x4UL) /*!< CKSEL_2M                                                  */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_ClkSel1M (0x5UL) /*!< CKSEL_1M                                                  */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_ClkSel500K (0x6UL) /*!< CKSEL_500K                                              */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_CKSEL_ClkSelBypass (0x7UL) /*!< CKSEL_BYPASS                                          */


/* RADIO_DECFILTERS_DECFIR2_CONTROL: Control register for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_CONTROL_ResetValue (0x00000004UL) /*!< Reset value of CONTROL register.                     */

/* TAPSEL @Bits 0..2 : Tap-select: number of active taps minus 2 */
  #define RADIO_DECFILTERS_DECFIR2_CONTROL_TAPSEL_Pos (0UL) /*!< Position of TAPSEL field.                                     */
  #define RADIO_DECFILTERS_DECFIR2_CONTROL_TAPSEL_Msk (0x7UL << RADIO_DECFILTERS_DECFIR2_CONTROL_TAPSEL_Pos) /*!< Bit mask of
                                                                            TAPSEL field.*/


/* RADIO_DECFILTERS_DECFIR2_COEFFS0: Coefficient register 0 for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS0_ResetValue (0x00000008UL) /*!< Reset value of COEFFS0 register.                     */

/* COEFF0 @Bits 0..5 : Signed filter coefficient 0 */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS0_COEFF0_Pos (0UL) /*!< Position of COEFF0 field.                                     */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS0_COEFF0_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR2_COEFFS0_COEFF0_Pos) /*!< Bit mask of
                                                                            COEFF0 field.*/


