adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_DECFILTERS_DECFIR2_COEFFS1: Coefficient register 1 for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS1_ResetValue (0x00000010UL) /*!< Reset value of COEFFS1 register.                     */

/* COEFF1 @Bits 0..5 : Signed filter coefficient 1 */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS1_COEFF1_Pos (0UL) /*!< Position of COEFF1 field.                                     */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS1_COEFF1_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR2_COEFFS1_COEFF1_Pos) /*!< Bit mask of
                                                                            COEFF1 field.*/


/* RADIO_DECFILTERS_DECFIR2_COEFFS2: Coefficient register 2 for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS2_ResetValue (0x00000018UL) /*!< Reset value of COEFFS2 register.                     */

/* COEFF2 @Bits 0..5 : Signed filter coefficient 2 */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS2_COEFF2_Pos (0UL) /*!< Position of COEFF2 field.                                     */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS2_COEFF2_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR2_COEFFS2_COEFF2_Pos) /*!< Bit mask of
                                                                            COEFF2 field.*/


/* RADIO_DECFILTERS_DECFIR2_COEFFS3: Coefficient register 3 for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS3_ResetValue (0x00000010UL) /*!< Reset value of COEFFS3 register.                     */

/* COEFF3 @Bits 0..5 : Signed filter coefficient 3 */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS3_COEFF3_Pos (0UL) /*!< Position of COEFF3 field.                                     */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS3_COEFF3_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR2_COEFFS3_COEFF3_Pos) /*!< Bit mask of
                                                                            COEFF3 field.*/


/* RADIO_DECFILTERS_DECFIR2_COEFFS4: Coefficient register 4 for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS4_ResetValue (0x00000000UL) /*!< Reset value of COEFFS4 register.                     */

/* COEFF4 @Bits 0..5 : Signed filter coefficient 4 */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS4_COEFF4_Pos (0UL) /*!< Position of COEFF4 field.                                     */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS4_COEFF4_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR2_COEFFS4_COEFF4_Pos) /*!< Bit mask of
                                                                            COEFF4 field.*/


/* RADIO_DECFILTERS_DECFIR2_COEFFS5: Coefficient register 5 for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS5_ResetValue (0x00000000UL) /*!< Reset value of COEFFS5 register.                     */

/* COEFF5 @Bits 0..5 : Signed filter coefficient 5 */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS5_COEFF5_Pos (0UL) /*!< Position of COEFF5 field.                                     */
  #define RADIO_DECFILTERS_DECFIR2_COEFFS5_COEFF5_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR2_COEFFS5_COEFF5_Pos) /*!< Bit mask of
                                                                            COEFF5 field.*/



/* ================================================= Struct RADIO_DECFILTERS ================================================= */
/**
  * @brief DECFILTERS [RADIO_DECFILTERS] (unspecified)
  */
typedef struct {
  __IOM NRF_RADIO_DECFILTERS_OUTMAIN_Type OUTMAIN;   /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_RADIO_DECFILTERS_DECFIR0_Type DECFIR0;   /*!< (@ 0x00000004) (unspecified)                                         */
  __IOM NRF_RADIO_DECFILTERS_DECFIR1_Type DECFIR1;   /*!< (@ 0x0000001C) (unspecified)                                         */
  __IOM NRF_RADIO_DECFILTERS_DECFIR2_Type DECFIR2;   /*!< (@ 0x0000003C) (unspecified)                                         */
} NRF_RADIO_DECFILTERS_Type;                         /*!< Size = 92 (0x05C)                                                    */


/* =========================================== Struct RADIO_CHANNELFILTERS_OUTMAIN =========================================== */
/**
  * @brief OUTMAIN [RADIO_CHANNELFILTERS_OUTMAIN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the output outMain          */
  __IOM uint32_t  SOURCE;                            /*!< (@ 0x00000004) Source select register for the output outMain         */
} NRF_RADIO_CHANNELFILTERS_OUTMAIN_Type;             /*!< Size = 8 (0x008)                                                     */

/* RADIO_CHANNELFILTERS_OUTMAIN_CKSEL: Clock select register for the output outMain */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_ResetValue (0x00000002UL) /*!< Reset value of CKSEL register.                     */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */

  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field.                                     */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Msk (0x7UL << RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Pos) /*!< Bit mask of
                                                                            CKSEL field.*/
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Min (0x0UL) /*!< Min enumerator value of CKSEL field.                       */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Max (0x7UL) /*!< Max enumerator value of CKSEL field.                       */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel32M (0x0UL) /*!< CKSEL_32M                                            */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel16M (0x1UL) /*!< CKSEL_16M                                            */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel8M (0x2UL) /*!< CKSEL_8M                                              */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel4M (0x3UL) /*!< CKSEL_4M                                              */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel2M (0x4UL) /*!< CKSEL_2M                                              */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel1M (0x5UL) /*!< CKSEL_1M                                              */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel500K (0x6UL) /*!< CKSEL_500K                                          */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSelBypass (0x7UL) /*!< CKSEL_BYPASS                                      */


