adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_CHANNELFILTERS_IIR1_CKSEL: Clock select register for the PUnit IIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_ResetValue (0x00000002UL) /*!< Reset value of CKSEL register.                        */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */

  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field.                                        */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_Msk (0x7UL << RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_Pos) /*!< Bit mask of CKSEL
                                                                            field.*/
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_Min (0x0UL) /*!< Min enumerator value of CKSEL field.                          */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_Max (0x7UL) /*!< Max enumerator value of CKSEL field.                          */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_ClkSel32M (0x0UL) /*!< CKSEL_32M                                               */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_ClkSel16M (0x1UL) /*!< CKSEL_16M                                               */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_ClkSel8M (0x2UL) /*!< CKSEL_8M                                                 */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_ClkSel4M (0x3UL) /*!< CKSEL_4M                                                 */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_ClkSel2M (0x4UL) /*!< CKSEL_2M                                                 */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_ClkSel1M (0x5UL) /*!< CKSEL_1M                                                 */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_ClkSel500K (0x6UL) /*!< CKSEL_500K                                             */
  #define RADIO_CHANNELFILTERS_IIR1_CKSEL_CKSEL_ClkSelBypass (0x7UL) /*!< CKSEL_BYPASS                                         */


/* RADIO_CHANNELFILTERS_IIR1_STATUS: Status register for the PUnit IIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_IIR1_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                      */

/* IQSATURATION @Bits 0..1 : Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear) */
  #define RADIO_CHANNELFILTERS_IIR1_STATUS_IQSATURATION_Pos (0UL) /*!< Position of IQSATURATION field.                         */
  #define RADIO_CHANNELFILTERS_IIR1_STATUS_IQSATURATION_Msk (0x3UL << RADIO_CHANNELFILTERS_IIR1_STATUS_IQSATURATION_Pos) /*!<
                                                                            Bit mask of IQSATURATION field.*/


/* RADIO_CHANNELFILTERS_IIR1_COEFFSB0: Coefficient register B0 for the PUnit IIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB0_ResetValue (0x00000060UL) /*!< Reset value of COEFFSB0 register.                  */

/* COEFFB0 @Bits 0..11 : Signed filter coefficient B0 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB0_COEFFB0_Pos (0UL) /*!< Position of COEFFB0 field.                                 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB0_COEFFB0_Msk (0xFFFUL << RADIO_CHANNELFILTERS_IIR1_COEFFSB0_COEFFB0_Pos) /*!< Bit
                                                                            mask of COEFFB0 field.*/


/* RADIO_CHANNELFILTERS_IIR1_COEFFSB1: Coefficient register B1 for the PUnit IIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB1_ResetValue (0x00000060UL) /*!< Reset value of COEFFSB1 register.                  */

/* COEFFB1 @Bits 0..11 : Signed filter coefficient B1 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB1_COEFFB1_Pos (0UL) /*!< Position of COEFFB1 field.                                 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB1_COEFFB1_Msk (0xFFFUL << RADIO_CHANNELFILTERS_IIR1_COEFFSB1_COEFFB1_Pos) /*!< Bit
                                                                            mask of COEFFB1 field.*/


/* RADIO_CHANNELFILTERS_IIR1_COEFFSB2: Coefficient register B2 for the PUnit IIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB2_ResetValue (0x00000060UL) /*!< Reset value of COEFFSB2 register.                  */

/* COEFFB2 @Bits 0..11 : Signed filter coefficient B2 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB2_COEFFB2_Pos (0UL) /*!< Position of COEFFB2 field.                                 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSB2_COEFFB2_Msk (0xFFFUL << RADIO_CHANNELFILTERS_IIR1_COEFFSB2_COEFFB2_Pos) /*!< Bit
                                                                            mask of COEFFB2 field.*/


/* RADIO_CHANNELFILTERS_IIR1_COEFFSA1: Coefficient register A1 for the PUnit IIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSA1_ResetValue (0x00000A00UL) /*!< Reset value of COEFFSA1 register.                  */

/* COEFFA1 @Bits 0..11 : Signed filter coefficient A1 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSA1_COEFFA1_Pos (0UL) /*!< Position of COEFFA1 field.                                 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSA1_COEFFA1_Msk (0xFFFUL << RADIO_CHANNELFILTERS_IIR1_COEFFSA1_COEFFA1_Pos) /*!< Bit
                                                                            mask of COEFFA1 field.*/


/* RADIO_CHANNELFILTERS_IIR1_COEFFSA2: Coefficient register A2 for the PUnit IIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSA2_ResetValue (0x00000300UL) /*!< Reset value of COEFFSA2 register.                  */

/* COEFFA2 @Bits 0..11 : Signed filter coefficient A2 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSA2_COEFFA2_Pos (0UL) /*!< Position of COEFFA2 field.                                 */
  #define RADIO_CHANNELFILTERS_IIR1_COEFFSA2_COEFFA2_Msk (0xFFFUL << RADIO_CHANNELFILTERS_IIR1_COEFFSA2_COEFFA2_Pos) /*!< Bit
                                                                            mask of COEFFA2 field.*/



