adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* COEFFB0 @Bits 0..11 : Signed filter coefficient B0 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB0_COEFFB0_Pos (0UL) /*!< Position of COEFFB0 field.                            */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB0_COEFFB0_Msk (0xFFFUL << RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB0_COEFFB0_Pos)
                                                                            /*!< Bit mask of COEFFB0 field.*/


/* RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB1: Coefficient register B1 for the PUnit notchIIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB1_ResetValue (0x00000000UL) /*!< Reset value of COEFFSB1 register.             */

/* COEFFB1 @Bits 0..11 : Signed filter coefficient B1 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB1_COEFFB1_Pos (0UL) /*!< Position of COEFFB1 field.                            */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB1_COEFFB1_Msk (0xFFFUL << RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB1_COEFFB1_Pos)
                                                                            /*!< Bit mask of COEFFB1 field.*/


/* RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB2: Coefficient register B2 for the PUnit notchIIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB2_ResetValue (0x00000000UL) /*!< Reset value of COEFFSB2 register.             */

/* COEFFB2 @Bits 0..11 : Signed filter coefficient B2 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB2_COEFFB2_Pos (0UL) /*!< Position of COEFFB2 field.                            */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB2_COEFFB2_Msk (0xFFFUL << RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSB2_COEFFB2_Pos)
                                                                            /*!< Bit mask of COEFFB2 field.*/


/* RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA1: Coefficient register A1 for the PUnit notchIIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA1_ResetValue (0x00000000UL) /*!< Reset value of COEFFSA1 register.             */

/* COEFFA1 @Bits 0..11 : Signed filter coefficient A1 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA1_COEFFA1_Pos (0UL) /*!< Position of COEFFA1 field.                            */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA1_COEFFA1_Msk (0xFFFUL << RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA1_COEFFA1_Pos)
                                                                            /*!< Bit mask of COEFFA1 field.*/


/* RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA2: Coefficient register A2 for the PUnit notchIIR1 of type IP_IIR2 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA2_ResetValue (0x00000000UL) /*!< Reset value of COEFFSA2 register.             */

/* COEFFA2 @Bits 0..11 : Signed filter coefficient A2 */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA2_COEFFA2_Pos (0UL) /*!< Position of COEFFA2 field.                            */
  #define RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA2_COEFFA2_Msk (0xFFFUL << RADIO_CHANNELFILTERS_NOTCHIIR1_COEFFSA2_COEFFA2_Pos)
                                                                            /*!< Bit mask of COEFFA2 field.*/



/* =========================================== Struct RADIO_CHANNELFILTERS_DECFIR ============================================ */
/**
  * @brief DECFIR [RADIO_CHANNELFILTERS_DECFIR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the PUnit decFIR of type
                                                                         IP_FIR*/
  __IOM uint32_t  SOURCE;                            /*!< (@ 0x00000004) Source select register for the PUnit decFIR of type
                                                                         IP_FIR*/
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000008) Control register for the PUnit decFIR of type IP_FIR  */
  __IOM uint32_t  COEFFS0;                           /*!< (@ 0x0000000C) Coefficient register 0 for the PUnit decFIR of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS1;                           /*!< (@ 0x00000010) Coefficient register 1 for the PUnit decFIR of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS2;                           /*!< (@ 0x00000014) Coefficient register 2 for the PUnit decFIR of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS3;                           /*!< (@ 0x00000018) Coefficient register 3 for the PUnit decFIR of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS4;                           /*!< (@ 0x0000001C) Coefficient register 4 for the PUnit decFIR of type
                                                                         IP_FIR*/
  __IOM uint32_t  COEFFS5;                           /*!< (@ 0x00000020) Coefficient register 5 for the PUnit decFIR of type
                                                                         IP_FIR*/
} NRF_RADIO_CHANNELFILTERS_DECFIR_Type;              /*!< Size = 36 (0x024)                                                    */

/* RADIO_CHANNELFILTERS_DECFIR_CKSEL: Clock select register for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_ResetValue (0x00000007UL) /*!< Reset value of CKSEL register.                      */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */

  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field.                                      */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_Msk (0x7UL << RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_Pos) /*!< Bit mask of
                                                                            CKSEL field.*/
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_Min (0x0UL) /*!< Min enumerator value of CKSEL field.                        */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_Max (0x7UL) /*!< Max enumerator value of CKSEL field.                        */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_ClkSel32M (0x0UL) /*!< CKSEL_32M                                             */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_ClkSel16M (0x1UL) /*!< CKSEL_16M                                             */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_ClkSel8M (0x2UL) /*!< CKSEL_8M                                               */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_ClkSel4M (0x3UL) /*!< CKSEL_4M                                               */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_ClkSel2M (0x4UL) /*!< CKSEL_2M                                               */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_ClkSel1M (0x5UL) /*!< CKSEL_1M                                               */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_ClkSel500K (0x6UL) /*!< CKSEL_500K                                           */
  #define RADIO_CHANNELFILTERS_DECFIR_CKSEL_CKSEL_ClkSelBypass (0x7UL) /*!< CKSEL_BYPASS                                       */


/* RADIO_CHANNELFILTERS_DECFIR_SOURCE: Source select register for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_ResetValue (0x00000003UL) /*!< Reset value of SOURCE register.                    */

/* SOURCE @Bits 0..3 : Data source select */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_Pos (0UL) /*!< Position of SOURCE field.                                   */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_Msk (0xFUL << RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_Pos) /*!< Bit mask
                                                                            of SOURCE field.*/
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_Min (0x0UL) /*!< Min enumerator value of SOURCE field.                     */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_Max (0xFUL) /*!< Max enumerator value of SOURCE field.                     */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_SrcInMain (0xFUL) /*!< SRC_INMAIN (NOT LEGAL)                              */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_SrcIIR0 (0x0UL) /*!< SRC_IIR0 (NOT LEGAL)                                  */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_SrcIIR1 (0x1UL) /*!< SRC_IIR1                                              */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_SrcNotchIIR0 (0x2UL) /*!< SRC_NOTCHIIR0 (NOT LEGAL)                        */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_SrcNotchIIR1 (0x3UL) /*!< SRC_NOTCHIIR1                                    */
  #define RADIO_CHANNELFILTERS_DECFIR_SOURCE_SOURCE_SrcDecFIR (0x4UL) /*!< SRC_DECFIR (NOT LEGAL)                              */


/* RADIO_CHANNELFILTERS_DECFIR_CONTROL: Control register for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_CONTROL_ResetValue (0x00000004UL) /*!< Reset value of CONTROL register.                  */

/* TAPSEL @Bits 0..2 : Tap-select: number of active taps minus 2 */
  #define RADIO_CHANNELFILTERS_DECFIR_CONTROL_TAPSEL_Pos (0UL) /*!< Position of TAPSEL field.                                  */
  #define RADIO_CHANNELFILTERS_DECFIR_CONTROL_TAPSEL_Msk (0x7UL << RADIO_CHANNELFILTERS_DECFIR_CONTROL_TAPSEL_Pos) /*!< Bit mask
                                                                            of TAPSEL field.*/


