adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_CNTPSTART_TRIG_Pos (0UL)       /*!< Position of TRIG field.                                              */
  #define RADIO_LBMAC_CNTPSTART_TRIG_Msk (0x1UL << RADIO_LBMAC_CNTPSTART_TRIG_Pos) /*!< Bit mask of TRIG field.                */


/* RADIO_LBMAC_CNTPSTOP: Stop packet counter */
  #define RADIO_LBMAC_CNTPSTOP_ResetValue (0x00000000UL) /*!< Reset value of CNTPSTOP register.                                */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_CNTPSTOP_TRIG_Pos (0UL)        /*!< Position of TRIG field.                                              */
  #define RADIO_LBMAC_CNTPSTOP_TRIG_Msk (0x1UL << RADIO_LBMAC_CNTPSTOP_TRIG_Pos) /*!< Bit mask of TRIG field.                  */


/* RADIO_LBMAC_CNTPCLEAR: Clear packet counter */
  #define RADIO_LBMAC_CNTPCLEAR_ResetValue (0x00000000UL) /*!< Reset value of CNTPCLEAR register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_CNTPCLEAR_TRIG_Pos (0UL)       /*!< Position of TRIG field.                                              */
  #define RADIO_LBMAC_CNTPCLEAR_TRIG_Msk (0x1UL << RADIO_LBMAC_CNTPCLEAR_TRIG_Pos) /*!< Bit mask of TRIG field.                */


/* RADIO_LBMAC_CRCSTATUS: CRC status */
  #define RADIO_LBMAC_CRCSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CRCSTATUS register.                              */

/* CRCSTATUS @Bit 0 : CRC status of packet received */
  #define RADIO_LBMAC_CRCSTATUS_CRCSTATUS_Pos (0UL)  /*!< Position of CRCSTATUS field.                                         */
  #define RADIO_LBMAC_CRCSTATUS_CRCSTATUS_Msk (0x1UL << RADIO_LBMAC_CRCSTATUS_CRCSTATUS_Pos) /*!< Bit mask of CRCSTATUS field. */
  #define RADIO_LBMAC_CRCSTATUS_CRCSTATUS_Min (0x0UL) /*!< Min enumerator value of CRCSTATUS field.                            */
  #define RADIO_LBMAC_CRCSTATUS_CRCSTATUS_Max (0x1UL) /*!< Max enumerator value of CRCSTATUS field.                            */
  #define RADIO_LBMAC_CRCSTATUS_CRCSTATUS_CRCError (0x0UL) /*!< Packet received with CRC error                                 */
  #define RADIO_LBMAC_CRCSTATUS_CRCSTATUS_CRCOk (0x1UL) /*!< Packet received with CRC ok                                       */


/* RADIO_LBMAC_RXMATCH: Received address */
  #define RADIO_LBMAC_RXMATCH_ResetValue (0x00000000UL) /*!< Reset value of RXMATCH register.                                  */

/* RXMATCH @Bits 0..2 : Received address */
  #define RADIO_LBMAC_RXMATCH_RXMATCH_Pos (0UL)      /*!< Position of RXMATCH field.                                           */
  #define RADIO_LBMAC_RXMATCH_RXMATCH_Msk (0x7UL << RADIO_LBMAC_RXMATCH_RXMATCH_Pos) /*!< Bit mask of RXMATCH field.           */


/* RADIO_LBMAC_RXCRC: CRC field of previously received packet */
  #define RADIO_LBMAC_RXCRC_ResetValue (0x00000000UL) /*!< Reset value of RXCRC register.                                      */

/* RXCRC @Bits 0..23 : CRC field of previously received packet */
  #define RADIO_LBMAC_RXCRC_RXCRC_Pos (0UL)          /*!< Position of RXCRC field.                                             */
  #define RADIO_LBMAC_RXCRC_RXCRC_Msk (0xFFFFFFUL << RADIO_LBMAC_RXCRC_RXCRC_Pos) /*!< Bit mask of RXCRC field.                */


/* RADIO_LBMAC_DAI: Device address match index */
  #define RADIO_LBMAC_DAI_ResetValue (0x00000000UL)  /*!< Reset value of DAI register.                                         */

/* DAI @Bits 0..2 : Device address match index */
  #define RADIO_LBMAC_DAI_DAI_Pos (0UL)              /*!< Position of DAI field.                                               */
  #define RADIO_LBMAC_DAI_DAI_Msk (0x7UL << RADIO_LBMAC_DAI_DAI_Pos) /*!< Bit mask of DAI field.                               */


/* RADIO_LBMAC_PDUSTAT: Payload status */
  #define RADIO_LBMAC_PDUSTAT_ResetValue (0x00000000UL) /*!< Reset value of PDUSTAT register.                                  */

/* PDUSTAT @Bit 0 : Status on payload length vs. PCNF1.MAXLEN */
  #define RADIO_LBMAC_PDUSTAT_PDUSTAT_Pos (0UL)      /*!< Position of PDUSTAT field.                                           */
  #define RADIO_LBMAC_PDUSTAT_PDUSTAT_Msk (0x1UL << RADIO_LBMAC_PDUSTAT_PDUSTAT_Pos) /*!< Bit mask of PDUSTAT field.           */
  #define RADIO_LBMAC_PDUSTAT_PDUSTAT_Min (0x0UL)    /*!< Min enumerator value of PDUSTAT field.                               */
  #define RADIO_LBMAC_PDUSTAT_PDUSTAT_Max (0x1UL)    /*!< Max enumerator value of PDUSTAT field.                               */
  #define RADIO_LBMAC_PDUSTAT_PDUSTAT_LessThan (0x0UL) /*!< Payload less than PCNF1.MAXLEN                                     */
  #define RADIO_LBMAC_PDUSTAT_PDUSTAT_GreaterThan (0x1UL) /*!< Payload greater than PCNF1.MAXLEN                               */

/* CISTAT @Bits 1..2 : Status on what rate packet is received with in Long Range */
  #define RADIO_LBMAC_PDUSTAT_CISTAT_Pos (1UL)       /*!< Position of CISTAT field.                                            */
  #define RADIO_LBMAC_PDUSTAT_CISTAT_Msk (0x3UL << RADIO_LBMAC_PDUSTAT_CISTAT_Pos) /*!< Bit mask of CISTAT field.              */
  #define RADIO_LBMAC_PDUSTAT_CISTAT_Min (0x0UL)     /*!< Min enumerator value of CISTAT field.                                */
  #define RADIO_LBMAC_PDUSTAT_CISTAT_Max (0x1UL)     /*!< Max enumerator value of CISTAT field.                                */
  #define RADIO_LBMAC_PDUSTAT_CISTAT_LR125kbit (0x0UL) /*!< Frame is received at 125 kbps                                      */
  #define RADIO_LBMAC_PDUSTAT_CISTAT_LR500kbit (0x1UL) /*!< Frame is received at 500 kbps                                      */


/* RADIO_LBMAC_PCNF0: Packet configuration register 0 */
  #define RADIO_LBMAC_PCNF0_ResetValue (0x00000000UL) /*!< Reset value of PCNF0 register.                                      */

/* LFLEN @Bits 0..3 : Length on air of LENGTH field in number of bits. */
  #define RADIO_LBMAC_PCNF0_LFLEN_Pos (0UL)          /*!< Position of LFLEN field.                                             */
  #define RADIO_LBMAC_PCNF0_LFLEN_Msk (0xFUL << RADIO_LBMAC_PCNF0_LFLEN_Pos) /*!< Bit mask of LFLEN field.                     */

/* LENGTHINCL @Bits 4..5 : Include or exclude LENGTH field in RAM */
  #define RADIO_LBMAC_PCNF0_LENGTHINCL_Pos (4UL)     /*!< Position of LENGTHINCL field.                                        */
  #define RADIO_LBMAC_PCNF0_LENGTHINCL_Msk (0x3UL << RADIO_LBMAC_PCNF0_LENGTHINCL_Pos) /*!< Bit mask of LENGTHINCL field.      */
  #define RADIO_LBMAC_PCNF0_LENGTHINCL_Min (0x0UL)   /*!< Min enumerator value of LENGTHINCL field.                            */
  #define RADIO_LBMAC_PCNF0_LENGTHINCL_Max (0x0UL)   /*!< Max enumerator value of LENGTHINCL field.                            */
  #define RADIO_LBMAC_PCNF0_LENGTHINCL_Automatic (0x0UL) /*!< Include LENGTH field in RAM only if LFLEN > 0                    */

/* S0LEN @Bit 8 : Length on air of S0 field in number of bytes. */
  #define RADIO_LBMAC_PCNF0_S0LEN_Pos (8UL)          /*!< Position of S0LEN field.                                             */
  #define RADIO_LBMAC_PCNF0_S0LEN_Msk (0x1UL << RADIO_LBMAC_PCNF0_S0LEN_Pos) /*!< Bit mask of S0LEN field.                     */

