adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENDIAN @Bit 24 : On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields. */
  #define RADIO_LBMAC_PCNF1_ENDIAN_Pos (24UL)        /*!< Position of ENDIAN field.                                            */
  #define RADIO_LBMAC_PCNF1_ENDIAN_Msk (0x1UL << RADIO_LBMAC_PCNF1_ENDIAN_Pos) /*!< Bit mask of ENDIAN field.                  */
  #define RADIO_LBMAC_PCNF1_ENDIAN_Min (0x0UL)       /*!< Min enumerator value of ENDIAN field.                                */
  #define RADIO_LBMAC_PCNF1_ENDIAN_Max (0x1UL)       /*!< Max enumerator value of ENDIAN field.                                */
  #define RADIO_LBMAC_PCNF1_ENDIAN_Little (0x0UL)    /*!< Least significant bit on air first                                   */
  #define RADIO_LBMAC_PCNF1_ENDIAN_Big (0x1UL)       /*!< Most significant bit on air first                                    */

/* WHITEEN @Bit 25 : Enable or disable packet whitening */
  #define RADIO_LBMAC_PCNF1_WHITEEN_Pos (25UL)       /*!< Position of WHITEEN field.                                           */
  #define RADIO_LBMAC_PCNF1_WHITEEN_Msk (0x1UL << RADIO_LBMAC_PCNF1_WHITEEN_Pos) /*!< Bit mask of WHITEEN field.               */
  #define RADIO_LBMAC_PCNF1_WHITEEN_Min (0x0UL)      /*!< Min enumerator value of WHITEEN field.                               */
  #define RADIO_LBMAC_PCNF1_WHITEEN_Max (0x1UL)      /*!< Max enumerator value of WHITEEN field.                               */
  #define RADIO_LBMAC_PCNF1_WHITEEN_Disabled (0x0UL) /*!< Disable                                                              */
  #define RADIO_LBMAC_PCNF1_WHITEEN_Enabled (0x1UL)  /*!< Enable                                                               */

/* REPEATPAYLOAD @Bit 28 : Used to repeat payload content in Tx mode. Transmits PREAMBLE, ADDRESS once, but S0, LENGTH, S1 field
                           size must be set to 0 to avoid repeating those as well */

  #define RADIO_LBMAC_PCNF1_REPEATPAYLOAD_Pos (28UL) /*!< Position of REPEATPAYLOAD field.                                     */
  #define RADIO_LBMAC_PCNF1_REPEATPAYLOAD_Msk (0x1UL << RADIO_LBMAC_PCNF1_REPEATPAYLOAD_Pos) /*!< Bit mask of REPEATPAYLOAD
                                                                            field.*/
  #define RADIO_LBMAC_PCNF1_REPEATPAYLOAD_Min (0x0UL) /*!< Min enumerator value of REPEATPAYLOAD field.                        */
  #define RADIO_LBMAC_PCNF1_REPEATPAYLOAD_Max (0x1UL) /*!< Max enumerator value of REPEATPAYLOAD field.                        */
  #define RADIO_LBMAC_PCNF1_REPEATPAYLOAD_Disabled (0x0UL) /*!< Disable                                                        */
  #define RADIO_LBMAC_PCNF1_REPEATPAYLOAD_Enabled (0x1UL) /*!< Enable                                                          */

/* TXFROMRAM @Bit 31 : Used to bypass PREAMBLE, ADDRESS, S0, LENGTH, S1 field and go straight to PAYLOAD state */
  #define RADIO_LBMAC_PCNF1_TXFROMRAM_Pos (31UL)     /*!< Position of TXFROMRAM field.                                         */
  #define RADIO_LBMAC_PCNF1_TXFROMRAM_Msk (0x1UL << RADIO_LBMAC_PCNF1_TXFROMRAM_Pos) /*!< Bit mask of TXFROMRAM field.         */
  #define RADIO_LBMAC_PCNF1_TXFROMRAM_Min (0x0UL)    /*!< Min enumerator value of TXFROMRAM field.                             */
  #define RADIO_LBMAC_PCNF1_TXFROMRAM_Max (0x1UL)    /*!< Max enumerator value of TXFROMRAM field.                             */
  #define RADIO_LBMAC_PCNF1_TXFROMRAM_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIO_LBMAC_PCNF1_TXFROMRAM_Bypass (0x1UL) /*!< Bypass                                                               */


/* RADIO_LBMAC_BASE0: Base address 0 */
  #define RADIO_LBMAC_BASE0_ResetValue (0x00000000UL) /*!< Reset value of BASE0 register.                                      */

/* BASE0 @Bits 0..31 : Base address 0 */
  #define RADIO_LBMAC_BASE0_BASE0_Pos (0UL)          /*!< Position of BASE0 field.                                             */
  #define RADIO_LBMAC_BASE0_BASE0_Msk (0xFFFFFFFFUL << RADIO_LBMAC_BASE0_BASE0_Pos) /*!< Bit mask of BASE0 field.              */


/* RADIO_LBMAC_BASE1: Base address 1 */
  #define RADIO_LBMAC_BASE1_ResetValue (0x00000000UL) /*!< Reset value of BASE1 register.                                      */

/* BASE1 @Bits 0..31 : Base address 1 */
  #define RADIO_LBMAC_BASE1_BASE1_Pos (0UL)          /*!< Position of BASE1 field.                                             */
  #define RADIO_LBMAC_BASE1_BASE1_Msk (0xFFFFFFFFUL << RADIO_LBMAC_BASE1_BASE1_Pos) /*!< Bit mask of BASE1 field.              */


/* RADIO_LBMAC_PREFIX0: Prefixes bytes for logical addresses 0-3 */
  #define RADIO_LBMAC_PREFIX0_ResetValue (0x00000000UL) /*!< Reset value of PREFIX0 register.                                  */

/* AP0 @Bits 0..7 : Address prefix 0 */
  #define RADIO_LBMAC_PREFIX0_AP0_Pos (0UL)          /*!< Position of AP0 field.                                               */
  #define RADIO_LBMAC_PREFIX0_AP0_Msk (0xFFUL << RADIO_LBMAC_PREFIX0_AP0_Pos) /*!< Bit mask of AP0 field.                      */

/* AP1 @Bits 8..15 : Address prefix 1 */
  #define RADIO_LBMAC_PREFIX0_AP1_Pos (8UL)          /*!< Position of AP1 field.                                               */
  #define RADIO_LBMAC_PREFIX0_AP1_Msk (0xFFUL << RADIO_LBMAC_PREFIX0_AP1_Pos) /*!< Bit mask of AP1 field.                      */

/* AP2 @Bits 16..23 : Address prefix 2 */
  #define RADIO_LBMAC_PREFIX0_AP2_Pos (16UL)         /*!< Position of AP2 field.                                               */
  #define RADIO_LBMAC_PREFIX0_AP2_Msk (0xFFUL << RADIO_LBMAC_PREFIX0_AP2_Pos) /*!< Bit mask of AP2 field.                      */

/* AP3 @Bits 24..31 : Address prefix 3 */
  #define RADIO_LBMAC_PREFIX0_AP3_Pos (24UL)         /*!< Position of AP3 field.                                               */
  #define RADIO_LBMAC_PREFIX0_AP3_Msk (0xFFUL << RADIO_LBMAC_PREFIX0_AP3_Pos) /*!< Bit mask of AP3 field.                      */


/* RADIO_LBMAC_PREFIX1: Prefixes bytes for logical addresses 4-7 */
  #define RADIO_LBMAC_PREFIX1_ResetValue (0x00000000UL) /*!< Reset value of PREFIX1 register.                                  */

/* AP4 @Bits 0..7 : Address prefix 4 */
  #define RADIO_LBMAC_PREFIX1_AP4_Pos (0UL)          /*!< Position of AP4 field.                                               */
  #define RADIO_LBMAC_PREFIX1_AP4_Msk (0xFFUL << RADIO_LBMAC_PREFIX1_AP4_Pos) /*!< Bit mask of AP4 field.                      */

