adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* AP5 @Bits 8..15 : Address prefix 5 */
  #define RADIO_LBMAC_PREFIX1_AP5_Pos (8UL)          /*!< Position of AP5 field.                                               */
  #define RADIO_LBMAC_PREFIX1_AP5_Msk (0xFFUL << RADIO_LBMAC_PREFIX1_AP5_Pos) /*!< Bit mask of AP5 field.                      */

/* AP6 @Bits 16..23 : Address prefix 6 */
  #define RADIO_LBMAC_PREFIX1_AP6_Pos (16UL)         /*!< Position of AP6 field.                                               */
  #define RADIO_LBMAC_PREFIX1_AP6_Msk (0xFFUL << RADIO_LBMAC_PREFIX1_AP6_Pos) /*!< Bit mask of AP6 field.                      */

/* AP7 @Bits 24..31 : Address prefix 7 */
  #define RADIO_LBMAC_PREFIX1_AP7_Pos (24UL)         /*!< Position of AP7 field.                                               */
  #define RADIO_LBMAC_PREFIX1_AP7_Msk (0xFFUL << RADIO_LBMAC_PREFIX1_AP7_Pos) /*!< Bit mask of AP7 field.                      */


/* RADIO_LBMAC_TXADDRESS: Transmit address select */
  #define RADIO_LBMAC_TXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of TXADDRESS register.                              */

/* TXADDRESS @Bits 0..2 : Transmit address select */
  #define RADIO_LBMAC_TXADDRESS_TXADDRESS_Pos (0UL)  /*!< Position of TXADDRESS field.                                         */
  #define RADIO_LBMAC_TXADDRESS_TXADDRESS_Msk (0x7UL << RADIO_LBMAC_TXADDRESS_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field. */


/* RADIO_LBMAC_RXADDRESSES: Receive address select */
  #define RADIO_LBMAC_RXADDRESSES_ResetValue (0x00000000UL) /*!< Reset value of RXADDRESSES register.                          */

/* ADDR0 @Bit 0 : Enable or disable reception on logical address 0 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR0_Pos (0UL)    /*!< Position of ADDR0 field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_ADDR0_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_ADDR0_Pos) /*!< Bit mask of ADDR0 field.         */
  #define RADIO_LBMAC_RXADDRESSES_ADDR0_Min (0x0UL)  /*!< Min enumerator value of ADDR0 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR0_Max (0x1UL)  /*!< Max enumerator value of ADDR0 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR0_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_LBMAC_RXADDRESSES_ADDR0_Enabled (0x1UL) /*!< Enable                                                            */

/* ADDR1 @Bit 1 : Enable or disable reception on logical address 1 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR1_Pos (1UL)    /*!< Position of ADDR1 field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_ADDR1_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_ADDR1_Pos) /*!< Bit mask of ADDR1 field.         */
  #define RADIO_LBMAC_RXADDRESSES_ADDR1_Min (0x0UL)  /*!< Min enumerator value of ADDR1 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR1_Max (0x1UL)  /*!< Max enumerator value of ADDR1 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR1_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_LBMAC_RXADDRESSES_ADDR1_Enabled (0x1UL) /*!< Enable                                                            */

/* ADDR2 @Bit 2 : Enable or disable reception on logical address 2 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR2_Pos (2UL)    /*!< Position of ADDR2 field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_ADDR2_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_ADDR2_Pos) /*!< Bit mask of ADDR2 field.         */
  #define RADIO_LBMAC_RXADDRESSES_ADDR2_Min (0x0UL)  /*!< Min enumerator value of ADDR2 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR2_Max (0x1UL)  /*!< Max enumerator value of ADDR2 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR2_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_LBMAC_RXADDRESSES_ADDR2_Enabled (0x1UL) /*!< Enable                                                            */

/* ADDR3 @Bit 3 : Enable or disable reception on logical address 3 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR3_Pos (3UL)    /*!< Position of ADDR3 field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_ADDR3_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_ADDR3_Pos) /*!< Bit mask of ADDR3 field.         */
  #define RADIO_LBMAC_RXADDRESSES_ADDR3_Min (0x0UL)  /*!< Min enumerator value of ADDR3 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR3_Max (0x1UL)  /*!< Max enumerator value of ADDR3 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR3_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_LBMAC_RXADDRESSES_ADDR3_Enabled (0x1UL) /*!< Enable                                                            */

/* ADDR4 @Bit 4 : Enable or disable reception on logical address 4 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR4_Pos (4UL)    /*!< Position of ADDR4 field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_ADDR4_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_ADDR4_Pos) /*!< Bit mask of ADDR4 field.         */
  #define RADIO_LBMAC_RXADDRESSES_ADDR4_Min (0x0UL)  /*!< Min enumerator value of ADDR4 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR4_Max (0x1UL)  /*!< Max enumerator value of ADDR4 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR4_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_LBMAC_RXADDRESSES_ADDR4_Enabled (0x1UL) /*!< Enable                                                            */

/* ADDR5 @Bit 5 : Enable or disable reception on logical address 5 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR5_Pos (5UL)    /*!< Position of ADDR5 field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_ADDR5_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_ADDR5_Pos) /*!< Bit mask of ADDR5 field.         */
  #define RADIO_LBMAC_RXADDRESSES_ADDR5_Min (0x0UL)  /*!< Min enumerator value of ADDR5 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR5_Max (0x1UL)  /*!< Max enumerator value of ADDR5 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR5_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_LBMAC_RXADDRESSES_ADDR5_Enabled (0x1UL) /*!< Enable                                                            */

/* ADDR6 @Bit 6 : Enable or disable reception on logical address 6 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR6_Pos (6UL)    /*!< Position of ADDR6 field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_ADDR6_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_ADDR6_Pos) /*!< Bit mask of ADDR6 field.         */
  #define RADIO_LBMAC_RXADDRESSES_ADDR6_Min (0x0UL)  /*!< Min enumerator value of ADDR6 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR6_Max (0x1UL)  /*!< Max enumerator value of ADDR6 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR6_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_LBMAC_RXADDRESSES_ADDR6_Enabled (0x1UL) /*!< Enable                                                            */

/* ADDR7 @Bit 7 : Enable or disable reception on logical address 7 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR7_Pos (7UL)    /*!< Position of ADDR7 field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_ADDR7_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_ADDR7_Pos) /*!< Bit mask of ADDR7 field.         */
  #define RADIO_LBMAC_RXADDRESSES_ADDR7_Min (0x0UL)  /*!< Min enumerator value of ADDR7 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR7_Max (0x1UL)  /*!< Max enumerator value of ADDR7 field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_ADDR7_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_LBMAC_RXADDRESSES_ADDR7_Enabled (0x1UL) /*!< Enable                                                            */

/* HYPER @Bit 16 : Hypermode settings */
  #define RADIO_LBMAC_RXADDRESSES_HYPER_Pos (16UL)   /*!< Position of HYPER field.                                             */
  #define RADIO_LBMAC_RXADDRESSES_HYPER_Msk (0x1UL << RADIO_LBMAC_RXADDRESSES_HYPER_Pos) /*!< Bit mask of HYPER field.         */
  #define RADIO_LBMAC_RXADDRESSES_HYPER_Min (0x0UL)  /*!< Min enumerator value of HYPER field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_HYPER_Max (0x1UL)  /*!< Max enumerator value of HYPER field.                                 */
  #define RADIO_LBMAC_RXADDRESSES_HYPER_B0 (0x0UL)   /*!< Use hypermode for address ADDR0 (base address 0 RADIO.BASE0)         */
  #define RADIO_LBMAC_RXADDRESSES_HYPER_B1 (0x1UL)   /*!< From all of the enabled addresses among ADDR1 through ADDR7, the
                                                          address ADDRn with the highest index number 'n' will use hypermode
                                                          (base address 1 RADIO.BASE1)*/


/* RADIO_LBMAC_CRCCNF: CRC configuration */
  #define RADIO_LBMAC_CRCCNF_ResetValue (0x00000000UL) /*!< Reset value of CRCCNF register.                                    */

/* LEN @Bits 0..1 : CRC length in number of bytes. */
  #define RADIO_LBMAC_CRCCNF_LEN_Pos (0UL)           /*!< Position of LEN field.                                               */
  #define RADIO_LBMAC_CRCCNF_LEN_Msk (0x3UL << RADIO_LBMAC_CRCCNF_LEN_Pos) /*!< Bit mask of LEN field.                         */
  #define RADIO_LBMAC_CRCCNF_LEN_Min (0x1UL)         /*!< Min value of LEN field.                                              */
  #define RADIO_LBMAC_CRCCNF_LEN_Max (0x3UL)         /*!< Max size of LEN field.                                               */
  #define RADIO_LBMAC_CRCCNF_LEN_Disabled (0x0UL)    /*!< CRC length is zero and CRC calculation is disabled                   */
  #define RADIO_LBMAC_CRCCNF_LEN_One (0x1UL)         /*!< CRC length is one byte and CRC calculation is enabled                */
  #define RADIO_LBMAC_CRCCNF_LEN_Two (0x2UL)         /*!< CRC length is two bytes and CRC calculation is enabled               */
  #define RADIO_LBMAC_CRCCNF_LEN_Three (0x3UL)       /*!< CRC length is three bytes and CRC calculation is enabled             */

/* SKIPADDR @Bits 8..9 : Include or exclude packet address field out of CRC calculation. */
  #define RADIO_LBMAC_CRCCNF_SKIPADDR_Pos (8UL)      /*!< Position of SKIPADDR field.                                          */
  #define RADIO_LBMAC_CRCCNF_SKIPADDR_Msk (0x3UL << RADIO_LBMAC_CRCCNF_SKIPADDR_Pos) /*!< Bit mask of SKIPADDR field.          */
  #define RADIO_LBMAC_CRCCNF_SKIPADDR_Min (0x0UL)    /*!< Min enumerator value of SKIPADDR field.                              */
  #define RADIO_LBMAC_CRCCNF_SKIPADDR_Max (0x2UL)    /*!< Max enumerator value of SKIPADDR field.                              */
  #define RADIO_LBMAC_CRCCNF_SKIPADDR_Include (0x0UL) /*!< CRC calculation includes address field                              */
  #define RADIO_LBMAC_CRCCNF_SKIPADDR_Skip (0x1UL)   /*!< CRC calculation does not include address field. The CRC calculation
                                                          will start at the first byte after the address.*/
  #define RADIO_LBMAC_CRCCNF_SKIPADDR_Ieee802154 (0x2UL) /*!< CRC calculation as per 802.15.4 standard. Starting at first byte
                                                              after length field.*/


/* RADIO_LBMAC_CRCPOLY: CRC polynomial */
  #define RADIO_LBMAC_CRCPOLY_ResetValue (0x00000000UL) /*!< Reset value of CRCPOLY register.                                  */

/* CRCPOLY @Bits 0..23 : CRC polynomial */
  #define RADIO_LBMAC_CRCPOLY_CRCPOLY_Pos (0UL)      /*!< Position of CRCPOLY field.                                           */
  #define RADIO_LBMAC_CRCPOLY_CRCPOLY_Msk (0xFFFFFFUL << RADIO_LBMAC_CRCPOLY_CRCPOLY_Pos) /*!< Bit mask of CRCPOLY field.      */


/* RADIO_LBMAC_CRCINIT: CRC initial value */
  #define RADIO_LBMAC_CRCINIT_ResetValue (0x00000000UL) /*!< Reset value of CRCINIT register.                                  */

/* CRCINIT @Bits 0..23 : CRC initial value */
  #define RADIO_LBMAC_CRCINIT_CRCINIT_Pos (0UL)      /*!< Position of CRCINIT field.                                           */
  #define RADIO_LBMAC_CRCINIT_CRCINIT_Msk (0xFFFFFFUL << RADIO_LBMAC_CRCINIT_CRCINIT_Pos) /*!< Bit mask of CRCINIT field.      */


/* RADIO_LBMAC_DAB: Device address base segment n */
  #define RADIO_LBMAC_DAB_MaxCount (8UL)             /*!< Max size of DAB[8] array.                                            */
  #define RADIO_LBMAC_DAB_MaxIndex (7UL)             /*!< Max index of DAB[8] array.                                           */
  #define RADIO_LBMAC_DAB_MinIndex (0UL)             /*!< Min index of DAB[8] array.                                           */
  #define RADIO_LBMAC_DAB_ResetValue (0x00000000UL)  /*!< Reset value of DAB[8] register.                                      */

/* DAB @Bits 0..31 : Device address base segment n */
  #define RADIO_LBMAC_DAB_DAB_Pos (0UL)              /*!< Position of DAB field.                                               */
  #define RADIO_LBMAC_DAB_DAB_Msk (0xFFFFFFFFUL << RADIO_LBMAC_DAB_DAB_Pos) /*!< Bit mask of DAB field.                        */


/* RADIO_LBMAC_DAP: Device address prefix n */
  #define RADIO_LBMAC_DAP_MaxCount (8UL)             /*!< Max size of DAP[8] array.                                            */
  #define RADIO_LBMAC_DAP_MaxIndex (7UL)             /*!< Max index of DAP[8] array.                                           */
  #define RADIO_LBMAC_DAP_MinIndex (0UL)             /*!< Min index of DAP[8] array.                                           */
  #define RADIO_LBMAC_DAP_ResetValue (0x00000000UL)  /*!< Reset value of DAP[8] register.                                      */

/* DAP @Bits 0..15 : Device address prefix n */
  #define RADIO_LBMAC_DAP_DAP_Pos (0UL)              /*!< Position of DAP field.                                               */
  #define RADIO_LBMAC_DAP_DAP_Msk (0xFFFFUL << RADIO_LBMAC_DAP_DAP_Pos) /*!< Bit mask of DAP field.                            */


/* RADIO_LBMAC_DACNF: Device address match configuration */
  #define RADIO_LBMAC_DACNF_ResetValue (0x00000000UL) /*!< Reset value of DACNF register.                                      */

/* ENA0 @Bit 0 : Enable or disable device address matching using device address 0 */
  #define RADIO_LBMAC_DACNF_ENA0_Pos (0UL)           /*!< Position of ENA0 field.                                              */
  #define RADIO_LBMAC_DACNF_ENA0_Msk (0x1UL << RADIO_LBMAC_DACNF_ENA0_Pos) /*!< Bit mask of ENA0 field.                        */
  #define RADIO_LBMAC_DACNF_ENA0_Min (0x0UL)         /*!< Min enumerator value of ENA0 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA0_Max (0x1UL)         /*!< Max enumerator value of ENA0 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA0_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define RADIO_LBMAC_DACNF_ENA0_Enabled (0x1UL)     /*!< Enabled                                                              */

/* ENA1 @Bit 1 : Enable or disable device address matching using device address 1 */
  #define RADIO_LBMAC_DACNF_ENA1_Pos (1UL)           /*!< Position of ENA1 field.                                              */
  #define RADIO_LBMAC_DACNF_ENA1_Msk (0x1UL << RADIO_LBMAC_DACNF_ENA1_Pos) /*!< Bit mask of ENA1 field.                        */
  #define RADIO_LBMAC_DACNF_ENA1_Min (0x0UL)         /*!< Min enumerator value of ENA1 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA1_Max (0x1UL)         /*!< Max enumerator value of ENA1 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA1_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define RADIO_LBMAC_DACNF_ENA1_Enabled (0x1UL)     /*!< Enabled                                                              */

/* ENA2 @Bit 2 : Enable or disable device address matching using device address 2 */
  #define RADIO_LBMAC_DACNF_ENA2_Pos (2UL)           /*!< Position of ENA2 field.                                              */
  #define RADIO_LBMAC_DACNF_ENA2_Msk (0x1UL << RADIO_LBMAC_DACNF_ENA2_Pos) /*!< Bit mask of ENA2 field.                        */
  #define RADIO_LBMAC_DACNF_ENA2_Min (0x0UL)         /*!< Min enumerator value of ENA2 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA2_Max (0x1UL)         /*!< Max enumerator value of ENA2 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA2_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define RADIO_LBMAC_DACNF_ENA2_Enabled (0x1UL)     /*!< Enabled                                                              */

/* ENA3 @Bit 3 : Enable or disable device address matching using device address 3 */
  #define RADIO_LBMAC_DACNF_ENA3_Pos (3UL)           /*!< Position of ENA3 field.                                              */
  #define RADIO_LBMAC_DACNF_ENA3_Msk (0x1UL << RADIO_LBMAC_DACNF_ENA3_Pos) /*!< Bit mask of ENA3 field.                        */
  #define RADIO_LBMAC_DACNF_ENA3_Min (0x0UL)         /*!< Min enumerator value of ENA3 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA3_Max (0x1UL)         /*!< Max enumerator value of ENA3 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA3_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define RADIO_LBMAC_DACNF_ENA3_Enabled (0x1UL)     /*!< Enabled                                                              */

