adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENA4 @Bit 4 : Enable or disable device address matching using device address 4 */
  #define RADIO_LBMAC_DACNF_ENA4_Pos (4UL)           /*!< Position of ENA4 field.                                              */
  #define RADIO_LBMAC_DACNF_ENA4_Msk (0x1UL << RADIO_LBMAC_DACNF_ENA4_Pos) /*!< Bit mask of ENA4 field.                        */
  #define RADIO_LBMAC_DACNF_ENA4_Min (0x0UL)         /*!< Min enumerator value of ENA4 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA4_Max (0x1UL)         /*!< Max enumerator value of ENA4 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA4_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define RADIO_LBMAC_DACNF_ENA4_Enabled (0x1UL)     /*!< Enabled                                                              */

/* ENA5 @Bit 5 : Enable or disable device address matching using device address 5 */
  #define RADIO_LBMAC_DACNF_ENA5_Pos (5UL)           /*!< Position of ENA5 field.                                              */
  #define RADIO_LBMAC_DACNF_ENA5_Msk (0x1UL << RADIO_LBMAC_DACNF_ENA5_Pos) /*!< Bit mask of ENA5 field.                        */
  #define RADIO_LBMAC_DACNF_ENA5_Min (0x0UL)         /*!< Min enumerator value of ENA5 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA5_Max (0x1UL)         /*!< Max enumerator value of ENA5 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA5_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define RADIO_LBMAC_DACNF_ENA5_Enabled (0x1UL)     /*!< Enabled                                                              */

/* ENA6 @Bit 6 : Enable or disable device address matching using device address 6 */
  #define RADIO_LBMAC_DACNF_ENA6_Pos (6UL)           /*!< Position of ENA6 field.                                              */
  #define RADIO_LBMAC_DACNF_ENA6_Msk (0x1UL << RADIO_LBMAC_DACNF_ENA6_Pos) /*!< Bit mask of ENA6 field.                        */
  #define RADIO_LBMAC_DACNF_ENA6_Min (0x0UL)         /*!< Min enumerator value of ENA6 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA6_Max (0x1UL)         /*!< Max enumerator value of ENA6 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA6_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define RADIO_LBMAC_DACNF_ENA6_Enabled (0x1UL)     /*!< Enabled                                                              */

/* ENA7 @Bit 7 : Enable or disable device address matching using device address 7 */
  #define RADIO_LBMAC_DACNF_ENA7_Pos (7UL)           /*!< Position of ENA7 field.                                              */
  #define RADIO_LBMAC_DACNF_ENA7_Msk (0x1UL << RADIO_LBMAC_DACNF_ENA7_Pos) /*!< Bit mask of ENA7 field.                        */
  #define RADIO_LBMAC_DACNF_ENA7_Min (0x0UL)         /*!< Min enumerator value of ENA7 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA7_Max (0x1UL)         /*!< Max enumerator value of ENA7 field.                                  */
  #define RADIO_LBMAC_DACNF_ENA7_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define RADIO_LBMAC_DACNF_ENA7_Enabled (0x1UL)     /*!< Enabled                                                              */

/* TXADD0 @Bit 8 : TxAdd for device address 0 */
  #define RADIO_LBMAC_DACNF_TXADD0_Pos (8UL)         /*!< Position of TXADD0 field.                                            */
  #define RADIO_LBMAC_DACNF_TXADD0_Msk (0x1UL << RADIO_LBMAC_DACNF_TXADD0_Pos) /*!< Bit mask of TXADD0 field.                  */

/* TXADD1 @Bit 9 : TxAdd for device address 1 */
  #define RADIO_LBMAC_DACNF_TXADD1_Pos (9UL)         /*!< Position of TXADD1 field.                                            */
  #define RADIO_LBMAC_DACNF_TXADD1_Msk (0x1UL << RADIO_LBMAC_DACNF_TXADD1_Pos) /*!< Bit mask of TXADD1 field.                  */

/* TXADD2 @Bit 10 : TxAdd for device address 2 */
  #define RADIO_LBMAC_DACNF_TXADD2_Pos (10UL)        /*!< Position of TXADD2 field.                                            */
  #define RADIO_LBMAC_DACNF_TXADD2_Msk (0x1UL << RADIO_LBMAC_DACNF_TXADD2_Pos) /*!< Bit mask of TXADD2 field.                  */

/* TXADD3 @Bit 11 : TxAdd for device address 3 */
  #define RADIO_LBMAC_DACNF_TXADD3_Pos (11UL)        /*!< Position of TXADD3 field.                                            */
  #define RADIO_LBMAC_DACNF_TXADD3_Msk (0x1UL << RADIO_LBMAC_DACNF_TXADD3_Pos) /*!< Bit mask of TXADD3 field.                  */

/* TXADD4 @Bit 12 : TxAdd for device address 4 */
  #define RADIO_LBMAC_DACNF_TXADD4_Pos (12UL)        /*!< Position of TXADD4 field.                                            */
  #define RADIO_LBMAC_DACNF_TXADD4_Msk (0x1UL << RADIO_LBMAC_DACNF_TXADD4_Pos) /*!< Bit mask of TXADD4 field.                  */

/* TXADD5 @Bit 13 : TxAdd for device address 5 */
  #define RADIO_LBMAC_DACNF_TXADD5_Pos (13UL)        /*!< Position of TXADD5 field.                                            */
  #define RADIO_LBMAC_DACNF_TXADD5_Msk (0x1UL << RADIO_LBMAC_DACNF_TXADD5_Pos) /*!< Bit mask of TXADD5 field.                  */

/* TXADD6 @Bit 14 : TxAdd for device address 6 */
  #define RADIO_LBMAC_DACNF_TXADD6_Pos (14UL)        /*!< Position of TXADD6 field.                                            */
  #define RADIO_LBMAC_DACNF_TXADD6_Msk (0x1UL << RADIO_LBMAC_DACNF_TXADD6_Pos) /*!< Bit mask of TXADD6 field.                  */

/* TXADD7 @Bit 15 : TxAdd for device address 7 */
  #define RADIO_LBMAC_DACNF_TXADD7_Pos (15UL)        /*!< Position of TXADD7 field.                                            */
  #define RADIO_LBMAC_DACNF_TXADD7_Msk (0x1UL << RADIO_LBMAC_DACNF_TXADD7_Pos) /*!< Bit mask of TXADD7 field.                  */


/* RADIO_LBMAC_BCC: Bit counter compare */
  #define RADIO_LBMAC_BCC_ResetValue (0x00000000UL)  /*!< Reset value of BCC register.                                         */

/* BCC @Bits 0..31 : Bit counter compare */
  #define RADIO_LBMAC_BCC_BCC_Pos (0UL)              /*!< Position of BCC field.                                               */
  #define RADIO_LBMAC_BCC_BCC_Msk (0xFFFFFFFFUL << RADIO_LBMAC_BCC_BCC_Pos) /*!< Bit mask of BCC field.                        */


/* RADIO_LBMAC_AACHKOVERRIDE: Address Check Override */
  #define RADIO_LBMAC_AACHKOVERRIDE_ResetValue (0x02600000UL) /*!< Reset value of AACHKOVERRIDE register.                      */

