adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CTEINLINERXMODE2US @Bits 13..15 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Pos (13UL) /*!< Position of CTEINLINERXMODE2US field.                   */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Msk (0x7UL << RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Pos) /*!< Bit
                                                                            mask of CTEINLINERXMODE2US field.*/
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Min (0x0UL) /*!< Min enumerator value of CTEINLINERXMODE2US field.      */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Max (0x6UL) /*!< Max enumerator value of CTEINLINERXMODE2US field.      */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_8us (0x0UL) /*!< 8us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_4us (0x1UL) /*!< 4us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_2us (0x2UL) /*!< 2us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_1us (0x3UL) /*!< 1us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_500ns (0x4UL) /*!< 0.5us                                                */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_250ns (0x5UL) /*!< 0.25us                                               */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_125ns (0x6UL) /*!< 0.125us                                              */

/* S0CONF @Bits 16..23 : S0 bit pattern to match */
  #define RADIO_LBMAC_CTEINLINECONF_S0CONF_Pos (16UL) /*!< Position of S0CONF field.                                           */
  #define RADIO_LBMAC_CTEINLINECONF_S0CONF_Msk (0xFFUL << RADIO_LBMAC_CTEINLINECONF_S0CONF_Pos) /*!< Bit mask of S0CONF field. */

/* S0MASK @Bits 24..31 : S0 bit mask to set which bit to match */
  #define RADIO_LBMAC_CTEINLINECONF_S0MASK_Pos (24UL) /*!< Position of S0MASK field.                                           */
  #define RADIO_LBMAC_CTEINLINECONF_S0MASK_Msk (0xFFUL << RADIO_LBMAC_CTEINLINECONF_S0MASK_Pos) /*!< Bit mask of S0MASK field. */


/* RADIO_LBMAC_DMASTART: (unspecified) */
  #define RADIO_LBMAC_DMASTART_ResetValue (0x00000000UL) /*!< Reset value of DMASTART register.                                */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_DMASTART_TRIG_Pos (0UL)        /*!< Position of TRIG field.                                              */
  #define RADIO_LBMAC_DMASTART_TRIG_Msk (0x1UL << RADIO_LBMAC_DMASTART_TRIG_Pos) /*!< Bit mask of TRIG field.                  */


/* RADIO_LBMAC_DMASTOP: (unspecified) */
  #define RADIO_LBMAC_DMASTOP_ResetValue (0x00000000UL) /*!< Reset value of DMASTOP register.                                  */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_DMASTOP_TRIG_Pos (0UL)         /*!< Position of TRIG field.                                              */
  #define RADIO_LBMAC_DMASTOP_TRIG_Msk (0x1UL << RADIO_LBMAC_DMASTOP_TRIG_Pos) /*!< Bit mask of TRIG field.                    */


/* RADIO_LBMAC_DMAENABLE: (unspecified) */
  #define RADIO_LBMAC_DMAENABLE_ResetValue (0x00000000UL) /*!< Reset value of DMAENABLE register.                              */

/* ENABLE @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_DMAENABLE_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define RADIO_LBMAC_DMAENABLE_ENABLE_Msk (0x1UL << RADIO_LBMAC_DMAENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */


/* RADIO_LBMAC_PACKETPTR: (unspecified) */
  #define RADIO_LBMAC_PACKETPTR_ResetValue (0x00000000UL) /*!< Reset value of PACKETPTR register.                              */

/* OFFSET @Bits 0..15 : (unspecified) */
  #define RADIO_LBMAC_PACKETPTR_OFFSET_Pos (0UL)     /*!< Position of OFFSET field.                                            */
  #define RADIO_LBMAC_PACKETPTR_OFFSET_Msk (0xFFFFUL << RADIO_LBMAC_PACKETPTR_OFFSET_Pos) /*!< Bit mask of OFFSET field.       */

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_LBMAC_PACKETPTR_BASE_Pos (29UL)      /*!< Position of BASE field.                                              */
  #define RADIO_LBMAC_PACKETPTR_BASE_Msk (0x1UL << RADIO_LBMAC_PACKETPTR_BASE_Pos) /*!< Bit mask of BASE field.                */


/* RADIO_LBMAC_DMAAMOUNT: (unspecified) */
  #define RADIO_LBMAC_DMAAMOUNT_ResetValue (0x00000000UL) /*!< Reset value of DMAAMOUNT register.                              */

/* AMOUNT @Bits 0..8 : (unspecified) */
  #define RADIO_LBMAC_DMAAMOUNT_AMOUNT_Pos (0UL)     /*!< Position of AMOUNT field.                                            */
  #define RADIO_LBMAC_DMAAMOUNT_AMOUNT_Msk (0x1FFUL << RADIO_LBMAC_DMAAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.        */


/* RADIO_LBMAC_DMAMAXCNT: (unspecified) */
  #define RADIO_LBMAC_DMAMAXCNT_ResetValue (0x00000103UL) /*!< Reset value of DMAMAXCNT register.                              */

/* MAXCNT @Bits 0..11 : (unspecified) */
  #define RADIO_LBMAC_DMAMAXCNT_MAXCNT_Pos (0UL)     /*!< Position of MAXCNT field.                                            */
  #define RADIO_LBMAC_DMAMAXCNT_MAXCNT_Msk (0xFFFUL << RADIO_LBMAC_DMAMAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.        */



/* ================================================== Struct RADIO_CSTONES =================================================== */
/**
  * @brief CSTONES [RADIO_CSTONES] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Selects the mode(s) that are activated on the start
                                                                         signal*/
  __IOM uint32_t  NUMSAMPLES;                        /*!< (@ 0x00000004) Number of input samples at 2MHz sample rate           */
  __IOM uint32_t  NEXTFREQUENCY;                     /*!< (@ 0x00000008) The value of FREQUENCY that will be used in the next
                                                                         step*/
  __IOM uint32_t  FFOIN;                             /*!< (@ 0x0000000C) Override value of FFO (Fractional Frequency Offset) if
                                                                         not to be based on the frequency estimate derived from
                                                                         CnAcc (autocorrelation of the scaled input signal)
                                                                         value*/
  __IOM uint32_t  FFOSOURCE;                         /*!< (@ 0x00000010) Source of FFO                                         */
  __IOM uint32_t  FAEPEER;                           /*!< (@ 0x00000014) FAEPEER (Frequency Actuation Error) of peer if known.
                                                                         Used during Mode 0 steps.*/
  __IOM uint32_t  PHASESHIFT;                        /*!< (@ 0x00000018) Parameter used in TPM, provided by software           */
  __IOM uint32_t  NUMSAMPLESCOEFF;                   /*!< (@ 0x0000001C) Parameter used in TPM, provided by software           */
  __IM  uint32_t  PCT16;                             /*!< (@ 0x00000020) Mean magnitude and mean phase converted to IQ         */
  __IM  uint32_t  MAGPHASEMEAN;                      /*!< (@ 0x00000024) Mean magnitude and phase of the signal before it is
                                                                         converted to PCT16*/
  __IM  uint32_t  IQRAWMEAN;                         /*!< (@ 0x00000028) Mean of IQ values                                     */
  __IM  uint32_t  MAGSTD;                            /*!< (@ 0x0000002C) Magnitude standard deviation approximation            */
  __IM  uint32_t  CNACC;                             /*!< (@ 0x00000030) Output of the autocorrelation of the accumulated IQ
                                                                         signal*/
  __IM  uint32_t  FFOEST;                            /*!< (@ 0x00000034) FFO estimate                                          */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  FINETUNENEXT;                      /*!< (@ 0x0000003C) Number of full ADPLL finetune steps                   */
  __IM  uint32_t  CFOPHASE;                          /*!< (@ 0x00000040) Cordic output of CnAcc                                */
  __IM  uint32_t  FREQOFFSET;                        /*!< (@ 0x00000044) Frequency offset estimate                             */
  __IM  uint32_t  PCT11;                             /*!< (@ 0x00000048) Mean magnitude and mean phase converted to IQ. IQ
                                                                         values limited to [-1024,1023].*/
  __IM  uint32_t  LFAENEXT;                          /*!< (@ 0x0000004C) Quantization error between ADPLL frequency and the
                                                                         desired value of FFO * RF Frequency. Values limited to
                                                                         [-64,63] with units 7.6294 Hz.*/
} NRF_RADIO_CSTONES_Type;                            /*!< Size = 80 (0x050)                                                    */

/* RADIO_CSTONES_MODE: Selects the mode(s) that are activated on the start signal */
  #define RADIO_CSTONES_MODE_ResetValue (0x00000003UL) /*!< Reset value of MODE register.                                      */

/* TPM @Bit 0 : Enable or disable TPM */
  #define RADIO_CSTONES_MODE_TPM_Pos (0UL)           /*!< Position of TPM field.                                               */
  #define RADIO_CSTONES_MODE_TPM_Msk (0x1UL << RADIO_CSTONES_MODE_TPM_Pos) /*!< Bit mask of TPM field.                         */
  #define RADIO_CSTONES_MODE_TPM_Min (0x0UL)         /*!< Min enumerator value of TPM field.                                   */
  #define RADIO_CSTONES_MODE_TPM_Max (0x1UL)         /*!< Max enumerator value of TPM field.                                   */
  #define RADIO_CSTONES_MODE_TPM_Disabled (0x0UL)    /*!< TPM is disabled                                                      */
  #define RADIO_CSTONES_MODE_TPM_Enabled (0x1UL)     /*!< TPM is enabled                                                       */

/* TFM @Bit 1 : Enable or disable TFM */
  #define RADIO_CSTONES_MODE_TFM_Pos (1UL)           /*!< Position of TFM field.                                               */
  #define RADIO_CSTONES_MODE_TFM_Msk (0x1UL << RADIO_CSTONES_MODE_TFM_Pos) /*!< Bit mask of TFM field.                         */
  #define RADIO_CSTONES_MODE_TFM_Min (0x0UL)         /*!< Min enumerator value of TFM field.                                   */
  #define RADIO_CSTONES_MODE_TFM_Max (0x1UL)         /*!< Max enumerator value of TFM field.                                   */
  #define RADIO_CSTONES_MODE_TFM_Disabled (0x0UL)    /*!< TFM is disabled                                                      */
  #define RADIO_CSTONES_MODE_TFM_Enabled (0x1UL)     /*!< TFM is enabled                                                       */


