adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define RADIO_DFT_DTB3CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_DFT_DTB3CONFIG_EN_Msk (0x1UL << RADIO_DFT_DTB3CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_DFT_DTB3CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_DFT_DTB3CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_DFT_DTB3CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define RADIO_DFT_DTB3CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */



/* ============================================== Struct RADIO_PENALTYTRIGPCP4 =============================================== */
/**
  * @brief PENALTYTRIGPCP4 [RADIO_PENALTYTRIGPCP4] (unspecified)
  */
typedef struct {
  __OM  uint32_t  ZERO;                              /*!< (@ 0x00000000) (unspecified)                                         */
  __OM  uint32_t  FULL;                              /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_RADIO_PENALTYTRIGPCP4_Type;                    /*!< Size = 8 (0x008)                                                     */

/* RADIO_PENALTYTRIGPCP4_ZERO: (unspecified) */
  #define RADIO_PENALTYTRIGPCP4_ZERO_ResetValue (0x00000000UL) /*!< Reset value of ZERO register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP4_ZERO_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP4_ZERO_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP4_ZERO_TRIG_Pos) /*!< Bit mask of TRIG field.      */


/* RADIO_PENALTYTRIGPCP4_FULL: (unspecified) */
  #define RADIO_PENALTYTRIGPCP4_FULL_ResetValue (0x00000000UL) /*!< Reset value of FULL register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP4_FULL_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP4_FULL_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP4_FULL_TRIG_Pos) /*!< Bit mask of TRIG field.      */



/* ============================================== Struct RADIO_PENALTYTRIGPCP3 =============================================== */
/**
  * @brief PENALTYTRIGPCP3 [RADIO_PENALTYTRIGPCP3] (unspecified)
  */
typedef struct {
  __OM  uint32_t  ZERO;                              /*!< (@ 0x00000000) (unspecified)                                         */
  __OM  uint32_t  FULL;                              /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_RADIO_PENALTYTRIGPCP3_Type;                    /*!< Size = 8 (0x008)                                                     */

/* RADIO_PENALTYTRIGPCP3_ZERO: (unspecified) */
  #define RADIO_PENALTYTRIGPCP3_ZERO_ResetValue (0x00000000UL) /*!< Reset value of ZERO register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP3_ZERO_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP3_ZERO_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP3_ZERO_TRIG_Pos) /*!< Bit mask of TRIG field.      */


/* RADIO_PENALTYTRIGPCP3_FULL: (unspecified) */
  #define RADIO_PENALTYTRIGPCP3_FULL_ResetValue (0x00000000UL) /*!< Reset value of FULL register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP3_FULL_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP3_FULL_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP3_FULL_TRIG_Pos) /*!< Bit mask of TRIG field.      */



/* ============================================== Struct RADIO_PENALTYTRIGPCP2 =============================================== */
/**
  * @brief PENALTYTRIGPCP2 [RADIO_PENALTYTRIGPCP2] (unspecified)
  */
typedef struct {
  __OM  uint32_t  ZERO;                              /*!< (@ 0x00000000) (unspecified)                                         */
  __OM  uint32_t  FULL;                              /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_RADIO_PENALTYTRIGPCP2_Type;                    /*!< Size = 8 (0x008)                                                     */

/* RADIO_PENALTYTRIGPCP2_ZERO: (unspecified) */
  #define RADIO_PENALTYTRIGPCP2_ZERO_ResetValue (0x00000000UL) /*!< Reset value of ZERO register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP2_ZERO_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP2_ZERO_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP2_ZERO_TRIG_Pos) /*!< Bit mask of TRIG field.      */


/* RADIO_PENALTYTRIGPCP2_FULL: (unspecified) */
  #define RADIO_PENALTYTRIGPCP2_FULL_ResetValue (0x00000000UL) /*!< Reset value of FULL register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP2_FULL_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP2_FULL_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP2_FULL_TRIG_Pos) /*!< Bit mask of TRIG field.      */



/* ============================================== Struct RADIO_PENALTYTRIGPCP1 =============================================== */
/**
  * @brief PENALTYTRIGPCP1 [RADIO_PENALTYTRIGPCP1] (unspecified)
  */
typedef struct {
  __OM  uint32_t  ZERO;                              /*!< (@ 0x00000000) (unspecified)                                         */
  __OM  uint32_t  FULL;                              /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_RADIO_PENALTYTRIGPCP1_Type;                    /*!< Size = 8 (0x008)                                                     */

/* RADIO_PENALTYTRIGPCP1_ZERO: (unspecified) */
  #define RADIO_PENALTYTRIGPCP1_ZERO_ResetValue (0x00000000UL) /*!< Reset value of ZERO register.                              */

