adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP1_ZERO_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP1_ZERO_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP1_ZERO_TRIG_Pos) /*!< Bit mask of TRIG field.      */


/* RADIO_PENALTYTRIGPCP1_FULL: (unspecified) */
  #define RADIO_PENALTYTRIGPCP1_FULL_ResetValue (0x00000000UL) /*!< Reset value of FULL register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP1_FULL_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP1_FULL_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP1_FULL_TRIG_Pos) /*!< Bit mask of TRIG field.      */



/* ============================================== Struct RADIO_PENALTYTRIGPCP0 =============================================== */
/**
  * @brief PENALTYTRIGPCP0 [RADIO_PENALTYTRIGPCP0] (unspecified)
  */
typedef struct {
  __OM  uint32_t  ZERO;                              /*!< (@ 0x00000000) (unspecified)                                         */
  __OM  uint32_t  FULL;                              /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_RADIO_PENALTYTRIGPCP0_Type;                    /*!< Size = 8 (0x008)                                                     */

/* RADIO_PENALTYTRIGPCP0_ZERO: (unspecified) */
  #define RADIO_PENALTYTRIGPCP0_ZERO_ResetValue (0x00000000UL) /*!< Reset value of ZERO register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP0_ZERO_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP0_ZERO_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP0_ZERO_TRIG_Pos) /*!< Bit mask of TRIG field.      */


/* RADIO_PENALTYTRIGPCP0_FULL: (unspecified) */
  #define RADIO_PENALTYTRIGPCP0_FULL_ResetValue (0x00000000UL) /*!< Reset value of FULL register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP0_FULL_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP0_FULL_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP0_FULL_TRIG_Pos) /*!< Bit mask of TRIG field.      */



/* ================================================= Struct RADIO_PENALTYREG ================================================= */
/**
  * @brief PENALTYREG [RADIO_PENALTYREG] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __OM uint32_t PCP0;                              /*!< (@ 0x00000000) (unspecified)                                         */
    __OM uint32_t PCP[5];                            /*!< (@ 0x00000000) (unspecified)                                         */
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
} NRF_RADIO_PENALTYREG_Type;                         /*!< Size = 20 (0x014)                                                    */

/* RADIO_PENALTYREG_PCP0: (unspecified) */
  #define RADIO_PENALTYREG_PCP0_ResetValue (0x00000000UL) /*!< Reset value of PCP0 register.                                   */

/* VALUE @Bits 0..31 : (unspecified) */
  #define RADIO_PENALTYREG_PCP0_VALUE_Pos (0UL)      /*!< Position of VALUE field.                                             */
  #define RADIO_PENALTYREG_PCP0_VALUE_Msk (0xFFFFFFFFUL << RADIO_PENALTYREG_PCP0_VALUE_Pos) /*!< Bit mask of VALUE field.      */


/* RADIO_PENALTYREG_PCP: (unspecified) */
  #define RADIO_PENALTYREG_PCP_MaxCount (4UL)        /*!< Max size of PCP[5] array.                                            */
  #define RADIO_PENALTYREG_PCP_MaxIndex (4UL)        /*!< Max index of PCP[5] array.                                           */
  #define RADIO_PENALTYREG_PCP_MinIndex (1UL)        /*!< Min index of PCP[5] array.                                           */
  #define RADIO_PENALTYREG_PCP_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PCP[5] register.                                  */

/* VALUE @Bits 0..31 : (unspecified) */
  #define RADIO_PENALTYREG_PCP_VALUE_Pos (0UL)       /*!< Position of VALUE field.                                             */
  #define RADIO_PENALTYREG_PCP_VALUE_Msk (0xFFFFFFFFUL << RADIO_PENALTYREG_PCP_VALUE_Pos) /*!< Bit mask of VALUE field.        */



/* =============================================== Struct RADIO_FORCEOVERRIDE ================================================ */
/**
  * @brief FORCEOVERRIDE [RADIO_FORCEOVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PCP[5];                            /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_RADIO_FORCEOVERRIDE_Type;                      /*!< Size = 20 (0x014)                                                    */

/* RADIO_FORCEOVERRIDE_PCP: (unspecified) */
  #define RADIO_FORCEOVERRIDE_PCP_MaxCount (5UL)     /*!< Max size of PCP[5] array.                                            */
  #define RADIO_FORCEOVERRIDE_PCP_MaxIndex (4UL)     /*!< Max index of PCP[5] array.                                           */
  #define RADIO_FORCEOVERRIDE_PCP_MinIndex (0UL)     /*!< Min index of PCP[5] array.                                           */
  #define RADIO_FORCEOVERRIDE_PCP_ResetValue (0x00000000UL) /*!< Reset value of PCP[5] register.                               */

/* CLOCKFORCING @Bit 1 : (unspecified) */
  #define RADIO_FORCEOVERRIDE_PCP_CLOCKFORCING_Pos (1UL) /*!< Position of CLOCKFORCING field.                                  */
  #define RADIO_FORCEOVERRIDE_PCP_CLOCKFORCING_Msk (0x1UL << RADIO_FORCEOVERRIDE_PCP_CLOCKFORCING_Pos) /*!< Bit mask of
                                                                            CLOCKFORCING field.*/

/* DOFORCECLOCK @Bit 7 : (unspecified) */
  #define RADIO_FORCEOVERRIDE_PCP_DOFORCECLOCK_Pos (7UL) /*!< Position of DOFORCECLOCK field.                                  */
  #define RADIO_FORCEOVERRIDE_PCP_DOFORCECLOCK_Msk (0x1UL << RADIO_FORCEOVERRIDE_PCP_DOFORCECLOCK_Pos) /*!< Bit mask of
                                                                            DOFORCECLOCK field.*/


