adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ====================================================== Struct RADIO ======================================================= */
/**
  * @brief 2.4 GHz radio
  */
  typedef struct {                                   /*!< RADIO Structure                                                      */
    __OM uint32_t TASKS_TXEN;                        /*!< (@ 0x00000000) Enable RADIO in TX mode                               */
    __OM uint32_t TASKS_RXEN;                        /*!< (@ 0x00000004) Enable RADIO in RX mode                               */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000008) Start RADIO                                           */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x0000000C) Stop RADIO                                            */
    __OM uint32_t TASKS_DISABLE;                     /*!< (@ 0x00000010) Disable RADIO                                         */
    __OM uint32_t TASKS_RSSISTART;                   /*!< (@ 0x00000014) Start the RSSI and take one single sample of the
                                                                         receive signal strength*/
    __OM uint32_t TASKS_BCSTART;                     /*!< (@ 0x00000018) Start the bit counter                                 */
    __OM uint32_t TASKS_BCSTOP;                      /*!< (@ 0x0000001C) Stop the bit counter                                  */
    __OM uint32_t TASKS_EDSTART;                     /*!< (@ 0x00000020) Start the energy detect measurement used in IEEE
                                                                         802.15.4 mode*/
    __OM uint32_t TASKS_EDSTOP;                      /*!< (@ 0x00000024) Stop the energy detect measurement                    */
    __OM uint32_t TASKS_CCASTART;                    /*!< (@ 0x00000028) Start the clear channel assessment used in IEEE
                                                                         802.15.4 mode*/
    __OM uint32_t TASKS_CCASTOP;                     /*!< (@ 0x0000002C) Stop the clear channel assessment                     */
    __OM uint32_t TASKS_DFESTART;                    /*!< (@ 0x00000030) Start DFE operation                                   */
    __OM uint32_t TASKS_DFESTOP;                     /*!< (@ 0x00000034) Stop DFE operation                                    */
    __OM uint32_t TASKS_ACQINJ0DMASTART;             /*!< (@ 0x00000038) Start DMA transaction                                 */
    __OM uint32_t TASKS_ACQINJ0DMASTOP;              /*!< (@ 0x0000003C) Stop ongoing DMA transaction                          */
    __OM uint32_t TASKS_ACQINJ1DMASTART;             /*!< (@ 0x00000040) Start DMA transaction                                 */
    __OM uint32_t TASKS_ACQINJ1DMASTOP;              /*!< (@ 0x00000044) Stop ongoing DMA transaction                          */
    __IM uint32_t RESERVED[3];
    __OM uint32_t TASKS_LOOPBACKEN;                  /*!< (@ 0x00000054) Enable RADIO in LOOPBACK mode                         */
    __OM uint32_t TASKS_CALSTART;                    /*!< (@ 0x00000058) Start calibration                                     */
    __OM uint32_t TASKS_CALSTOP;                     /*!< (@ 0x0000005C) Stop calibration                                      */
    __IM uint32_t RESERVED1[2];
    __OM uint32_t TASKS_CHNOINCR;                    /*!< (@ 0x00000068) Update RADIO channel based on the current channel and
                                                                         increment it according to chNoIncrStep*/
    __IM uint32_t RESERVED2[2];
    __OM uint32_t TASKS_DFEDMASTART;                 /*!< (@ 0x00000074) Start DFE DMA transaction                             */
    __OM uint32_t TASKS_DFEDMASTOP;                  /*!< (@ 0x00000078) Stop ongoing DFE DMA transaction                      */
    __OM uint32_t TASKS_RELOADFREQ;                  /*!< (@ 0x0000007C) Reload new frequency while radio PLL is active        */
    __IM uint32_t RESERVED3[8];
    __OM uint32_t TASKS_CSTONESSTART;                /*!< (@ 0x000000A0) Channel sounding: Start tone processing               */
    __OM uint32_t TASKS_SOFTRESET;                   /*!< (@ 0x000000A4) Reset all public registers, but with these exceptions:
                                                                         DMA registers and EVENT/INTEN/SUBSCRIBE/PUBLISH
                                                                         registers. Only to be used in DISABLED state.*/
    __IM uint32_t RESERVED4[22];
    __IOM uint32_t SUBSCRIBE_TXEN;                   /*!< (@ 0x00000100) Subscribe configuration for task TXEN                 */
    __IOM uint32_t SUBSCRIBE_RXEN;                   /*!< (@ 0x00000104) Subscribe configuration for task RXEN                 */
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000108) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x0000010C) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_DISABLE;                /*!< (@ 0x00000110) Subscribe configuration for task DISABLE              */
    __IOM uint32_t SUBSCRIBE_RSSISTART;              /*!< (@ 0x00000114) Subscribe configuration for task RSSISTART            */
    __IOM uint32_t SUBSCRIBE_BCSTART;                /*!< (@ 0x00000118) Subscribe configuration for task BCSTART              */
    __IOM uint32_t SUBSCRIBE_BCSTOP;                 /*!< (@ 0x0000011C) Subscribe configuration for task BCSTOP               */
    __IOM uint32_t SUBSCRIBE_EDSTART;                /*!< (@ 0x00000120) Subscribe configuration for task EDSTART              */
    __IOM uint32_t SUBSCRIBE_EDSTOP;                 /*!< (@ 0x00000124) Subscribe configuration for task EDSTOP               */
    __IOM uint32_t SUBSCRIBE_CCASTART;               /*!< (@ 0x00000128) Subscribe configuration for task CCASTART             */
    __IOM uint32_t SUBSCRIBE_CCASTOP;                /*!< (@ 0x0000012C) Subscribe configuration for task CCASTOP              */
    __IOM uint32_t SUBSCRIBE_DFESTART;               /*!< (@ 0x00000130) Subscribe configuration for task DFESTART             */
    __IOM uint32_t SUBSCRIBE_DFESTOP;                /*!< (@ 0x00000134) Subscribe configuration for task DFESTOP              */
    __IOM uint32_t SUBSCRIBE_ACQINJ0DMASTART;        /*!< (@ 0x00000138) Subscribe configuration for task ACQINJ0DMASTART      */
    __IOM uint32_t SUBSCRIBE_ACQINJ0DMASTOP;         /*!< (@ 0x0000013C) Subscribe configuration for task ACQINJ0DMASTOP       */
    __IOM uint32_t SUBSCRIBE_ACQINJ1DMASTART;        /*!< (@ 0x00000140) Subscribe configuration for task ACQINJ1DMASTART      */
    __IOM uint32_t SUBSCRIBE_ACQINJ1DMASTOP;         /*!< (@ 0x00000144) Subscribe configuration for task ACQINJ1DMASTOP       */
    __IM uint32_t RESERVED5[3];
    __IOM uint32_t SUBSCRIBE_LOOPBACKEN;             /*!< (@ 0x00000154) Subscribe configuration for task LOOPBACKEN           */
    __IOM uint32_t SUBSCRIBE_CALSTART;               /*!< (@ 0x00000158) Subscribe configuration for task CALSTART             */
    __IOM uint32_t SUBSCRIBE_CALSTOP;                /*!< (@ 0x0000015C) Subscribe configuration for task CALSTOP              */
    __IM uint32_t RESERVED6[2];
    __IOM uint32_t SUBSCRIBE_CHNOINCR;               /*!< (@ 0x00000168) Subscribe configuration for task CHNOINCR             */
    __IM uint32_t RESERVED7[2];
    __IOM uint32_t SUBSCRIBE_DFEDMASTART;            /*!< (@ 0x00000174) Subscribe configuration for task DFEDMASTART          */
    __IOM uint32_t SUBSCRIBE_DFEDMASTOP;             /*!< (@ 0x00000178) Subscribe configuration for task DFEDMASTOP           */
    __IOM uint32_t SUBSCRIBE_RELOADFREQ;             /*!< (@ 0x0000017C) Subscribe configuration for task RELOADFREQ           */
    __IM uint32_t RESERVED8[8];
    __IOM uint32_t SUBSCRIBE_CSTONESSTART;           /*!< (@ 0x000001A0) Subscribe configuration for task CSTONESSTART         */
    __IOM uint32_t SUBSCRIBE_SOFTRESET;              /*!< (@ 0x000001A4) Subscribe configuration for task SOFTRESET            */
    __IM uint32_t RESERVED9[22];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000200) RADIO has ramped up and is ready to be started        */
    __IOM uint32_t EVENTS_TXREADY;                   /*!< (@ 0x00000204) RADIO has ramped up and is ready to be started TX path*/
    __IOM uint32_t EVENTS_RXREADY;                   /*!< (@ 0x00000208) RADIO has ramped up and is ready to be started RX path*/
    __IOM uint32_t EVENTS_ADDRESS;                   /*!< (@ 0x0000020C) Address sent or received                              */
    __IOM uint32_t EVENTS_FRAMESTART;                /*!< (@ 0x00000210) IEEE 802.15.4 length field received                   */
    __IOM uint32_t EVENTS_PAYLOAD;                   /*!< (@ 0x00000214) Packet payload sent or received                       */
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000218) Packet sent or received                               */
    __IOM uint32_t EVENTS_PHYEND;                    /*!< (@ 0x0000021C) The last bit is sent on air or last bit is received   */
    __IOM uint32_t EVENTS_DISABLED;                  /*!< (@ 0x00000220) RADIO has been disabled                               */
    __IOM uint32_t EVENTS_DEVMATCH;                  /*!< (@ 0x00000224) A device address match occurred on the last received
                                                                         packet*/
    __IOM uint32_t EVENTS_DEVMISS;                   /*!< (@ 0x00000228) No device address match occurred on the last received
                                                                         packet*/
    __IOM uint32_t EVENTS_CRCOK;                     /*!< (@ 0x0000022C) Packet received with CRC ok                           */
    __IOM uint32_t EVENTS_CRCERROR;                  /*!< (@ 0x00000230) Packet received with CRC error                        */
    __IM uint32_t RESERVED10;
    __IOM uint32_t EVENTS_BCMATCH;                   /*!< (@ 0x00000238) Bit counter reached bit count value                   */
    __IOM uint32_t EVENTS_EDEND;                     /*!< (@ 0x0000023C) Sampling of energy detection complete (a new ED sample
                                                                         is ready for readout from the RADIO.EDSAMPLE register)*/
    __IOM uint32_t EVENTS_EDSTOPPED;                 /*!< (@ 0x00000240) The sampling of energy detection has stopped          */
    __IOM uint32_t EVENTS_CCAIDLE;                   /*!< (@ 0x00000244) Wireless medium in idle - clear to send               */
    __IOM uint32_t EVENTS_CCABUSY;                   /*!< (@ 0x00000248) Wireless medium busy - do not send                    */
    __IOM uint32_t EVENTS_CCASTOPPED;                /*!< (@ 0x0000024C) The CCA has stopped                                   */
    __IOM uint32_t EVENTS_RATEBOOST;                 /*!< (@ 0x00000250) Ble_LR CI field received, receive mode is changed from
                                                                         Ble_LR125Kbit to Ble_LR500Kbit*/
    __IOM uint32_t EVENTS_MHRMATCH;                  /*!< (@ 0x00000254) MAC header match found                                */
    __IOM uint32_t EVENTS_SYNC;                      /*!< (@ 0x00000258) Initial sync detected                                 */
    __IOM uint32_t EVENTS_CTEPRESENT;                /*!< (@ 0x0000025C) CTEInfo byte is received                              */
    __IOM uint32_t EVENTS_CTEWARNING;                /*!< (@ 0x00000260) CTEInfo byte received, but contain illegal CTETime or
                                                                         CTEType*/
    __IOM uint32_t EVENTS_DFEEND;                    /*!< (@ 0x00000264) DFE operation has ended                               */
    __IOM uint32_t EVENTS_MODEWRITTEN;               /*!< (@ 0x00000268) Generated on write access to MODE register            */
    __IOM uint32_t EVENTS_MODEREADY;                 /*!< (@ 0x0000026C) Generated immediately on write access to MODE register
                                                                         when MODEPROGENABLE==0, otherwise only manually
                                                                         triggered (SELECT_EVENTS_TRIGGERS=1)*/
    __IOM uint32_t EVENTS_CTEEND;                    /*!< (@ 0x00000270) CTE end                                               */
    __IOM uint32_t EVENTS_LBREADY;                   /*!< (@ 0x00000274) RADIO is ready in loopback mode and is able to transmit
                                                                         and receive data*/
    __IOM uint32_t EVENTS_CALDONE;                   /*!< (@ 0x00000278) RADIO calibration is done                             */
    __IOM uint32_t EVENTS_CHNOUPDATED;               /*!< (@ 0x0000027C) RADIO channel no. is updated                          */
    __IM uint32_t RESERVED11;
    __IOM uint32_t EVENTS_TXTIMERMATCH;              /*!< (@ 0x00000284) Tx timer match                                        */
    __IOM uint32_t EVENTS_RXTIMERMATCH;              /*!< (@ 0x00000288) Rx timer match                                        */
    __IOM uint32_t EVENTS_BESPOKEACK;                /*!< (@ 0x0000028C) Bespoke ACK for UPSCALE                               */
    __IM uint32_t RESERVED12[10];
    __IOM uint32_t EVENTS_TXADDRESS;                 /*!< (@ 0x000002B8) Address sent                                          */
    __IOM uint32_t EVENTS_RXADDRESS;                 /*!< (@ 0x000002BC) Address received                                      */
    __IOM uint32_t EVENTS_ACQINJ0DMAEND;             /*!< (@ 0x000002C0) ACQINJ0 DMA end                                       */
    __IOM uint32_t EVENTS_ACQINJ1DMAEND;             /*!< (@ 0x000002C4) ACQINJ1 DMA end                                       */
    __IOM uint32_t EVENTS_CSTONESEND;                /*!< (@ 0x000002C8) Channel sounding: Tone processing complete, results are
                                                                         available in CSTONES registers*/
    __IM uint32_t RESERVED13[13];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000300) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_TXREADY;                  /*!< (@ 0x00000304) Publish configuration for event TXREADY               */
    __IOM uint32_t PUBLISH_RXREADY;                  /*!< (@ 0x00000308) Publish configuration for event RXREADY               */
    __IOM uint32_t PUBLISH_ADDRESS;                  /*!< (@ 0x0000030C) Publish configuration for event ADDRESS               */
    __IOM uint32_t PUBLISH_FRAMESTART;               /*!< (@ 0x00000310) Publish configuration for event FRAMESTART            */
    __IOM uint32_t PUBLISH_PAYLOAD;                  /*!< (@ 0x00000314) Publish configuration for event PAYLOAD               */
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000318) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_PHYEND;                   /*!< (@ 0x0000031C) Publish configuration for event PHYEND                */
    __IOM uint32_t PUBLISH_DISABLED;                 /*!< (@ 0x00000320) Publish configuration for event DISABLED              */
    __IOM uint32_t PUBLISH_DEVMATCH;                 /*!< (@ 0x00000324) Publish configuration for event DEVMATCH              */
    __IOM uint32_t PUBLISH_DEVMISS;                  /*!< (@ 0x00000328) Publish configuration for event DEVMISS               */
    __IOM uint32_t PUBLISH_CRCOK;                    /*!< (@ 0x0000032C) Publish configuration for event CRCOK                 */
    __IOM uint32_t PUBLISH_CRCERROR;                 /*!< (@ 0x00000330) Publish configuration for event CRCERROR              */
    __IM uint32_t RESERVED14;
    __IOM uint32_t PUBLISH_BCMATCH;                  /*!< (@ 0x00000338) Publish configuration for event BCMATCH               */
    __IOM uint32_t PUBLISH_EDEND;                    /*!< (@ 0x0000033C) Publish configuration for event EDEND                 */
    __IOM uint32_t PUBLISH_EDSTOPPED;                /*!< (@ 0x00000340) Publish configuration for event EDSTOPPED             */
    __IOM uint32_t PUBLISH_CCAIDLE;                  /*!< (@ 0x00000344) Publish configuration for event CCAIDLE               */
    __IOM uint32_t PUBLISH_CCABUSY;                  /*!< (@ 0x00000348) Publish configuration for event CCABUSY               */
    __IOM uint32_t PUBLISH_CCASTOPPED;               /*!< (@ 0x0000034C) Publish configuration for event CCASTOPPED            */
    __IOM uint32_t PUBLISH_RATEBOOST;                /*!< (@ 0x00000350) Publish configuration for event RATEBOOST             */
    __IOM uint32_t PUBLISH_MHRMATCH;                 /*!< (@ 0x00000354) Publish configuration for event MHRMATCH              */
    __IOM uint32_t PUBLISH_SYNC;                     /*!< (@ 0x00000358) Publish configuration for event SYNC                  */
    __IOM uint32_t PUBLISH_CTEPRESENT;               /*!< (@ 0x0000035C) Publish configuration for event CTEPRESENT            */
    __IOM uint32_t PUBLISH_CTEWARNING;               /*!< (@ 0x00000360) Publish configuration for event CTEWARNING            */
    __IOM uint32_t PUBLISH_DFEEND;                   /*!< (@ 0x00000364) Publish configuration for event DFEEND                */
    __IOM uint32_t PUBLISH_MODEWRITTEN;              /*!< (@ 0x00000368) Publish configuration for event MODEWRITTEN           */
    __IOM uint32_t PUBLISH_MODEREADY;                /*!< (@ 0x0000036C) Publish configuration for event MODEREADY             */
    __IOM uint32_t PUBLISH_CTEEND;                   /*!< (@ 0x00000370) Publish configuration for event CTEEND                */
    __IOM uint32_t PUBLISH_LBREADY;                  /*!< (@ 0x00000374) Publish configuration for event LBREADY               */
    __IOM uint32_t PUBLISH_CALDONE;                  /*!< (@ 0x00000378) Publish configuration for event CALDONE               */
    __IOM uint32_t PUBLISH_CHNOUPDATED;              /*!< (@ 0x0000037C) Publish configuration for event CHNOUPDATED           */
    __IM uint32_t RESERVED15;
    __IOM uint32_t PUBLISH_TXTIMERMATCH;             /*!< (@ 0x00000384) Publish configuration for event TXTIMERMATCH          */
    __IOM uint32_t PUBLISH_RXTIMERMATCH;             /*!< (@ 0x00000388) Publish configuration for event RXTIMERMATCH          */
    __IOM uint32_t PUBLISH_BESPOKEACK;               /*!< (@ 0x0000038C) Publish configuration for event BESPOKEACK            */
    __IM uint32_t RESERVED16[10];
    __IOM uint32_t PUBLISH_TXADDRESS;                /*!< (@ 0x000003B8) Publish configuration for event TXADDRESS             */
    __IOM uint32_t PUBLISH_RXADDRESS;                /*!< (@ 0x000003BC) Publish configuration for event RXADDRESS             */
    __IOM uint32_t PUBLISH_ACQINJ0DMAEND;            /*!< (@ 0x000003C0) Publish configuration for event ACQINJ0DMAEND         */
    __IOM uint32_t PUBLISH_ACQINJ1DMAEND;            /*!< (@ 0x000003C4) Publish configuration for event ACQINJ1DMAEND         */
    __IOM uint32_t PUBLISH_CSTONESEND;               /*!< (@ 0x000003C8) Publish configuration for event CSTONESEND            */
    __IM uint32_t RESERVED17[13];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000400) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED18[31];
    __IOM uint32_t INTEN00;                          /*!< (@ 0x00000480) Enable or disable interrupt                           */
    __IOM uint32_t INTEN01;                          /*!< (@ 0x00000484) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET00;                       /*!< (@ 0x00000488) Enable interrupt                                      */
    __IOM uint32_t INTENSET01;                       /*!< (@ 0x0000048C) Enable interrupt                                      */
    __IOM uint32_t INTENCLR00;                       /*!< (@ 0x00000490) Disable interrupt                                     */
    __IOM uint32_t INTENCLR01;                       /*!< (@ 0x00000494) Disable interrupt                                     */
    __IM uint32_t INTPEND00;                         /*!< (@ 0x00000498) Pending interrupts                                    */
    __IM uint32_t INTPEND01;                         /*!< (@ 0x0000049C) Pending interrupts                                    */
    __IOM uint32_t INTEN10;                          /*!< (@ 0x000004A0) Enable or disable interrupt                           */
    __IOM uint32_t INTEN11;                          /*!< (@ 0x000004A4) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET10;                       /*!< (@ 0x000004A8) Enable interrupt                                      */
    __IOM uint32_t INTENSET11;                       /*!< (@ 0x000004AC) Enable interrupt                                      */
    __IOM uint32_t INTENCLR10;                       /*!< (@ 0x000004B0) Disable interrupt                                     */
    __IOM uint32_t INTENCLR11;                       /*!< (@ 0x000004B4) Disable interrupt                                     */
    __IM uint32_t INTPEND10;                         /*!< (@ 0x000004B8) Pending interrupts                                    */
    __IM uint32_t INTPEND11;                         /*!< (@ 0x000004BC) Pending interrupts                                    */
    __IM uint32_t RESERVED19[16];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000500) Data rate and modulation                              */
    __IOM uint32_t MODEINTERNAL;                     /*!< (@ 0x00000504) Internal mode setting, active only when
                                                                         MODEPROGENABLE==1*/
    __IOM uint32_t MODEPROGENABLE;                   /*!< (@ 0x00000508) Switch that enables programmable modes                */
    __IM uint32_t RESERVED20;
    __IOM uint32_t MODECNF;                          /*!< (@ 0x00000510) Radio mode configuration register                     */
    __IOM uint32_t MISC;                             /*!< (@ 0x00000514) Misc configuration collection (to be renamed when more
                                                                         bits are defined)*/
    __IM uint32_t RESERVED21[2];
    __IM uint32_t STATE;                             /*!< (@ 0x00000520) Current radio state                                   */
    __IM uint32_t RESERVED22[3];
    __IOM uint32_t EDCTRL;                           /*!< (@ 0x00000530) IEEE 802.15.4 energy detect control                   */
    __IM uint32_t EDSAMPLE;                          /*!< (@ 0x00000534) IEEE 802.15.4 energy detect level                     */
    __IOM uint32_t CCACTRL;                          /*!< (@ 0x00000538) IEEE 802.15.4 clear channel assessment control        */
    __IM uint32_t RESERVED23;
    __IOM uint32_t DATAWHITEIV;                      /*!< (@ 0x00000540) Data whitening initial value                          */
    __IM uint32_t RESERVED24;
    __IOM NRF_RADIO_ACQINJ_Type ACQINJ;              /*!< (@ 0x00000548) (unspecified)                                         */
    __IOM NRF_RADIO_ACQINJDMA_Type ACQINJDMA[2];     /*!< (@ 0x00000550) (unspecified)                                         */
    __IOM NRF_RADIO_TESTINTERFACE_Type TESTINTERFACE; /*!< (@ 0x00000570) 2.4 GHz radio direct test interface                  */
    __IM uint32_t RESERVED25[5];
    __IM uint32_t GAINOUT;                           /*!< (@ 0x000005A0) Gain readout (LNA_OUT_SPI for nrf52/53)               */
