adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
    __IM uint32_t RESERVED26[15];
    __IOM uint32_t SOFTRESETLEVEL;                   /*!< (@ 0x000005E0) Configure what level of reset is caused by
                                                                         TASKS_SOFTRESET in each of the submodules. At level 0,
                                                                         FSMs and public registers (including non-public fields)
                                                                         are reset. At level 1, also non-public registers are
                                                                         reset.*/
    __IM uint32_t RESERVED27[3];
    __IOM NRF_RADIO_AHBMASTERS_Type AHBMASTERS;      /*!< (@ 0x000005F0) For setting priorities among RADIO/CRYPTO AHB masters
                                                                         if interfaced with Nordic's AMBA Interconnect IP*/
    __IM uint32_t RESERVED28[67];
    __IOM uint32_t SHORTCUTANA;                      /*!< (@ 0x00000700) Internal shortcuts for RADIO PHY                      */
    __IOM uint32_t TIMING;                           /*!< (@ 0x00000704) Timing                                                */
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000708) Frequency                                             */
    __IOM uint32_t FREQUENCYCONFIG;                  /*!< (@ 0x0000070C) Configuration of frequency control                    */
    __IOM uint32_t TXPOWER;                          /*!< (@ 0x00000710) Output power                                          */
    __IOM uint32_t TIFS;                             /*!< (@ 0x00000714) Interframe spacing in us                              */
    __IM uint32_t RSSISAMPLE;                        /*!< (@ 0x00000718) RSSI sample                                           */
    __IOM uint32_t EVENTCONFIG;                      /*!< (@ 0x0000071C) Event configuration                                   */
    __IOM NRF_RADIO_CALIBRATION_Type CALIBRATION;    /*!< (@ 0x00000720) (unspecified)                                         */
    __IOM NRF_RADIO_SPHYNXANATEST_Type SPHYNXANATEST; /*!< (@ 0x00000730) (unspecified)                                        */
    __IOM NRF_RADIO_SPHYNXANA_Type SPHYNXANA;        /*!< (@ 0x00000734) (unspecified)                                         */
    __IM uint32_t RESERVED29[4];
    __IOM uint32_t TEXTAMP;                          /*!< (@ 0x0000076C) Timing control of external RADIO amplifier (LNA/PA)   */
    __IOM NRF_RADIO_TIMINGENGINE_Type TIMINGENGINE;  /*!< (@ 0x00000770) (unspecified)                                         */
    __IOM NRF_RADIO_RXAGC_Type RXAGC;                /*!< (@ 0x000007D0) (unspecified)                                         */
    __IM uint32_t RESERVED30;
    __IOM NRF_RADIO_RXIF_Type RXIF;                  /*!< (@ 0x000007E4) (unspecified)                                         */
    __IOM uint32_t BITCONVERTER;                     /*!< (@ 0x000007E8) Configuration of ADC output to digital front-end      */
    __IM uint32_t RESERVED31[2];
    __IOM uint32_t MODESTANDALONE;                   /*!< (@ 0x000007F4) Data rate and modulation when SPHYNX in standalone
                                                                         mode*/
    __IM uint32_t RESERVED32;
    __IOM uint32_t DEBUGRADIOPHY;                    /*!< (@ 0x000007FC) Debug for radio PHY                                   */
    __IOM uint32_t ADPLLCOMMAND;                     /*!< (@ 0x00000800) Send or receive command directly to the AdPll digital
                                                                         island. Only write to this register when FSASYNCBUSBUSY
                                                                         returns 0*/
    __IOM uint32_t FSFREQFINETUNE;                   /*!< (@ 0x00000804) Allows fine-tuning the RF frequency with a very fine
                                                                         resolution*/
    __IOM uint32_t DEVIATION;                        /*!< (@ 0x00000808) Frequency deviation for modulation                    */
    __IOM uint32_t MODRATE;                          /*!< (@ 0x0000080C) Select modulation rate                                */
    __IOM uint32_t MODFILTERING;                     /*!< (@ 0x00000810) Select gaussian filtering mode                        */
    __IOM uint32_t CUSTOMMODULATION;                 /*!< (@ 0x00000814) Enable reading from memory and passing data over to
                                                                         AdPll*/
    __IOM uint32_t FSCLOCKSELECT;                    /*!< (@ 0x00000818) Set the clock source for the AdPll digital island     */
    __IM uint32_t FSUNITRIGCALVAL;                   /*!< (@ 0x0000081C) Read the calibrated value for the universal trigger   */
    __IOM uint32_t FSUNITRIGMANUAL;                  /*!< (@ 0x00000820) Manual control of the uni trigger signals. Note that
                                                                         fsUniTriggerCalWord is controlled by writing to the
                                                                         separate register FSUNITRIGCALVAL*/
    __IM uint32_t FSUNITRIGCALOUT;                   /*!< (@ 0x00000824) Read the signal directly from fsUniTriggerCalOut      */
    __IOM uint32_t FSASYNCBUSCONF;                   /*!< (@ 0x00000828) Some special settings for the asynchronous bus
                                                                         configuration*/
    __IM uint32_t FSASYNCBUSBUSY;                    /*!< (@ 0x0000082C) Status bit indicating whether the bus is currently busy
                                                                         or not*/
    __IOM uint32_t ADPLLCOMPANIONBACKDOORS;          /*!< (@ 0x00000830) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IM uint32_t RESERVED33[3];
    __IOM uint32_t PVTTOT;                           /*!< (@ 0x00000840) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t KDTC;                             /*!< (@ 0x00000844) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t TXHFGAIN;                         /*!< (@ 0x00000848) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t PVTTOFIX;                         /*!< (@ 0x0000084C) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t TRACING;                          /*!< (@ 0x00000850) Enable tracing from AdPll                             */
    __IOM uint32_t IFFREQ;                           /*!< (@ 0x00000854) Select between two different IF frequencies           */
    __IM uint32_t ADPLLCOMPANIONSTATE;               /*!< (@ 0x00000858) State in the AdPllCompanion state machines            */
    __IM uint32_t RESERVED34[5];
    __IOM uint32_t RELOADFREQINTERNAL;               /*!< (@ 0x00000870) Non-official task: AdPll will reread the frequency
                                                                         input signal*/
    __IOM uint32_t UNITRIGCALSTART;                  /*!< (@ 0x00000874) Non-official task: Start automatic universal trigger
                                                                         calibration*/
    __IOM uint32_t FSSENDSETTINGS;                   /*!< (@ 0x00000878) Non-official task: Send the auto-settings to AdPll
                                                                         again. This also happens at every startup*/
    __IOM uint32_t CHANGEPHASEINTERNAL;              /*!< (@ 0x0000087C) Non-official task: AdPll will change the phase as given
                                                                         by the internal AdPll register PHASE_CHANGE*/
    __IOM uint32_t UNITRIGCALDONE;                   /*!< (@ 0x00000880) Non-official event: Start automatic universal trigger
                                                                         calibration*/
    __IOM uint32_t REJECTEDTRANS;                    /*!< (@ 0x00000884) Non-official event: The command written to AdPll was
                                                                         rejected because of an ongoing transaction*/
    __IOM uint32_t COMPLETETRANS;                    /*!< (@ 0x00000888) Non-official event: Completed a transaction to AdPll
                                                                         successfully (only when CHECKSTATUS is set)*/
    __IOM uint32_t FAILEDTRANS;                      /*!< (@ 0x0000088C) Non-official event: Did not successfully complete a
                                                                         transaction to AdPll. (only when CHECKSTATUS is set)*/
    __IOM uint32_t OVERRIDEFREQ;                     /*!< (@ 0x00000890) Raw frequency configuration which also allows selecting
                                                                         frequency outside the 2.4 GHz band*/
    __IM uint32_t RESERVED35[3];
    __IOM uint32_t ADPLLTRIMCOMMAND0;                /*!< (@ 0x000008A0) This value is written to the AdPll when powering up the
                                                                         digital island. Never reset with SOFTRESET*/
    __IOM uint32_t ADPLLTRIMCOMMAND1;                /*!< (@ 0x000008A4) This value is written to the AdPll when powering up the
                                                                         digital island. Never reset with SOFTRESET*/
    __IOM uint32_t ADPLLTRIMCOMMAND2;                /*!< (@ 0x000008A8) This value is written to the AdPll when powering up the
                                                                         digital island. NEVER reset with SOFTRESET*/
    __IOM uint32_t ADPLLTRIMCOMMAND3;                /*!< (@ 0x000008AC) This value is written to the AdPll when powering up the
                                                                         digital island. NEVER reset with SOFTRESET*/
    __IOM uint32_t ADPLLSTARTUPCOMMAND0;             /*!< (@ 0x000008B0) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t ADPLLSTARTUPCOMMAND1;             /*!< (@ 0x000008B4) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t ADPLLSTARTUPCOMMAND2;             /*!< (@ 0x000008B8) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t ADPLLSTARTUPCOMMAND3;             /*!< (@ 0x000008BC) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t ADPLLSTARTUPCOMMAND4;             /*!< (@ 0x000008C0) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t ADPLLSTARTUPCOMMAND5;             /*!< (@ 0x000008C4) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t ADPLLSTARTUPCOMMAND6;             /*!< (@ 0x000008C8) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IOM uint32_t ADPLLSTARTUPCOMMAND7;             /*!< (@ 0x000008CC) This value is written to the AdPll when powering up the
                                                                         digital island*/
    __IM uint32_t RESERVED36[3];
    __IOM uint32_t ADPLLCOMPANIONINTEN;              /*!< (@ 0x000008DC) (unspecified)                                         */
    __IOM uint32_t ADPLLCOMPANIONINTENSET;           /*!< (@ 0x000008E0) (unspecified)                                         */
    __IOM uint32_t ADPLLCOMPANIONINTENCLR;           /*!< (@ 0x000008E4) (unspecified)                                         */
    __IM uint32_t ADPLLCOMPANIONINTPEND;             /*!< (@ 0x000008E8) (unspecified)                                         */
    __IM uint32_t RESERVED37[5];
    __IOM uint32_t MODECONF;                         /*!< (@ 0x00000900) Mode specific configuration regiser                   */
    __IM uint32_t FESTATUS;                          /*!< (@ 0x00000904) Frontend readout register                             */
    __IOM uint32_t FECONFIG;                         /*!< (@ 0x00000908) Config register                                       */
    __IOM uint32_t IQCALCONF;                        /*!< (@ 0x0000090C) Gain and phase mismatch calibration control for I and
                                                                         Q*/
    __IOM uint32_t BBPKDETCONF;                      /*!< (@ 0x00000910) Configuration for baseband peak detector              */
    __IOM NRF_RADIO_DECFILTERS_Type DECFILTERS;      /*!< (@ 0x00000914) (unspecified)                                         */
    __IOM NRF_RADIO_CHANNELFILTERS_Type CHANNELFILTERS; /*!< (@ 0x00000970) (unspecified)                                      */
    __IM uint32_t RESERVED38[58];
    __IM uint32_t CFO_STAT;                          /*!< (@ 0x00000B00) Carrier freq. offset estimate                         */
    __IOM uint32_t PBTEST;                           /*!< (@ 0x00000B04) Test: PB calibration                                  */
    __IOM uint32_t DBCCOEFFS;                        /*!< (@ 0x00000B08) Test and Debug: DBC coefficients override             */
    __IOM uint32_t QOVERRIDE4;                       /*!< (@ 0x00000B0C) Trim value override register 4 for nRF52              */
    __IOM uint32_t QOVERRIDE5;                       /*!< (@ 0x00000B10) Trim value override register 5 for nRF52              */
    __IOM uint32_t QOVERRIDE6;                       /*!< (@ 0x00000B14) Trim value override register 6 for nRF52              */
    __IOM uint32_t QOVERRIDE9;                       /*!< (@ 0x00000B18) Trim value override register 9 for nRF52              */
    __IM uint32_t RESERVED39[2];
    __IOM uint32_t QOVERRIDE12;                      /*!< (@ 0x00000B24) Trim value override register 12 for nRF52             */
    __IOM uint32_t QOVERRIDE23;                      /*!< (@ 0x00000B28) Trim value override register 23 for nRF52             */
    __IOM uint32_t LELRMISC;                         /*!< (@ 0x00000B2C) Miscellaneous Controls for Long Range                 */
    __IOM uint32_t QOVERRIDE25;                      /*!< (@ 0x00000B30) TODO                                                  */
    __IOM uint32_t DBCPEAKDETTHR;                    /*!< (@ 0x00000B34) Thresholds for each peak detector instance            */
    __IM uint32_t BITSLICERSTAT;                     /*!< (@ 0x00000B38) Payload status                                        */
    __IOM uint32_t BBCTRL;                           /*!< (@ 0x00000B3C) Miscellaneous mode bits                               */
    __IOM uint32_t DBCCORR;                          /*!< (@ 0x00000B40) Thresholds for the double correlator                  */
    __IOM uint32_t BSCONFIG;                         /*!< (@ 0x00000B44) Bitslicer configuration                               */
    __IOM uint32_t MFB;                              /*!< (@ 0x00000B48) Matched Filter Bank (MFB) configuration               */
    __IOM uint32_t CN;                               /*!< (@ 0x00000B4C) Configuration for the CNRIPPLEWARN functionality used
                                                                         for BLE LR. Configuration is only enabled when
                                                                         OVRENCNRIPPLEWARNCFG in OVERRIDE23 is set*/
    __IOM uint32_t PEAK;                             /*!< (@ 0x00000B50) Peak detector configuration                           */
    __IOM uint32_t BBCKSEL;                          /*!< (@ 0x00000B54) Clock rates                                           */
    __IOM uint32_t DBCORRADAP;                       /*!< (@ 0x00000B58) Adaptive thresholds for double correlator.            */
    __IM uint32_t MNSTORED;                          /*!< (@ 0x00000B5C) Stored value of Cn and Pn from the double correlator at
                                                                         the last detect*/
    __IM uint32_t CNEARLYLATE;                       /*!< (@ 0x00000B60) The Cn value associated with the clock cycle before and
                                                                         after the actually double correlator peak was found
                                                                         (detect)*/
    __IOM uint32_t MFBSTTCNFG;                       /*!< (@ 0x00000B64) Matched Filter Bank (MFB) symbol time tracking
                                                                         configuration*/
    __IOM uint32_t RXAA;                             /*!< (@ 0x00000B68) 32-bit Hyper Access Address as decoded; for 1M, 2M and
                                                                         4M BLE and proprietary modes*/
    __IM uint32_t RESERVED40;
    __IOM uint32_t STTCNFG_LR;                       /*!< (@ 0x00000B70) Strobe time tracking configuration in long range mode */
    __IOM uint32_t STTCNFG;                          /*!< (@ 0x00000B74) Strobe time tracking Configuration (Symbol Timing)    */
    __IOM uint32_t DRIFTLR;                          /*!< (@ 0x00000B78) Drift Controls in Long Range                          */
    __IOM uint32_t DRIFT1;                           /*!< (@ 0x00000B7C) Drift Estimator configuration                         */
    __IOM uint32_t DRIFT2;                           /*!< (@ 0x00000B80) Drift Estimator configuration                         */
    __IOM uint32_t DSSS;                             /*!< (@ 0x00000B84) DSSS synchronizer trim values                         */
    __IOM uint32_t AUTOCORR;                         /*!< (@ 0x00000B88) Autocorrelator configuration                          */
    __IOM uint32_t LRSYNC;                           /*!< (@ 0x00000B8C) LrSyncEngine configuration                            */
    __IOM uint32_t QOVERRIDE26;                      /*!< (@ 0x00000B90) Override for selecting whether to use LrSyncEngine or
                                                                         the classic demodulator.*/
    __IOM uint32_t QOVERRIDE27;                      /*!< (@ 0x00000B94) Override for selecting whether to use enhanced IEEE
                                                                         802.15.4 or the classic IEEE 802.15.4 demodulator.*/
    __IOM uint32_t RXSYNC;                           /*!< (@ 0x00000B98) RxSyncEngine configuration                            */
    __IM uint32_t RESERVED41[25];
    __IOM uint32_t TXCONFIG;                         /*!< (@ 0x00000C00) Tx configuration                                      */
    __IOM uint32_t TXCTRL;                           /*!< (@ 0x00000C04) Tx control                                            */
    __IM uint32_t RESERVED42[62];
    __IOM uint32_t DFEMODE;                          /*!< (@ 0x00000D00) Whether to use Angle-of-Arrival (AOA) or
                                                                         Angle-of-Departure (AOD)*/
    __IM uint32_t DFESTATUS;                         /*!< (@ 0x00000D04) DFE status information                                */
    __IM uint32_t RESERVED43[2];
    __IOM uint32_t DFECTRL1;                         /*!< (@ 0x00000D10) Various configuration for Direction finding           */
    __IOM uint32_t DFECTRL2;                         /*!< (@ 0x00000D14) Start offset for Direction finding                    */
    __IOM uint32_t DFECTRL3;                         /*!< (@ 0x00000D18) Various hacker/tuning configuration for Direction
                                                                         finding*/
    __IOM uint32_t DFECTRL4;                         /*!< (@ 0x00000D1C) Various hacker/tuning configuration for Direction
                                                                         finding*/
    __IOM uint32_t DFECTRL5;                         /*!< (@ 0x00000D20) Various hacker/tuning configuration for Direction
                                                                         finding*/
    __IM uint32_t RESERVED44;
    __IOM uint32_t SWITCHPATTERN;                    /*!< (@ 0x00000D28) GPIO patterns to be used for each antenna             */
    __OM uint32_t CLEARPATTERN;                      /*!< (@ 0x00000D2C) Clear the GPIO pattern array for antenna control      */
    __IOM NRF_RADIO_PSEL_Type PSEL;                  /*!< (@ 0x00000D30) (unspecified)                                         */
    __IOM NRF_RADIO_DFEPACKET_Type DFEPACKET;        /*!< (@ 0x00000D50) DFE packet EasyDMA channel                            */
    __OM uint32_t DFEDMASTART;                       /*!< (@ 0x00000D68) Manually start DmaChannelPeripheral for DFE           */
    __OM uint32_t DFEDMASTOP;                        /*!< (@ 0x00000D6C) Force stop DmaChannelPeripheral for DFE               */
    __IM uint32_t DFEDMAAHBERROR;                    /*!< (@ 0x00000D70) Points to where the AHB error occured                 */
    __IM uint32_t RESERVED45[35];
    __OM uint32_t CNTPSTART;                         /*!< (@ 0x00000E00) Start packet counter                                  */
    __OM uint32_t CNTPSTOP;                          /*!< (@ 0x00000E04) Stop packet counter                                   */
    __OM uint32_t CNTPCLEAR;                         /*!< (@ 0x00000E08) Clear packet counter                                  */
    __IM uint32_t CRCSTATUS;                         /*!< (@ 0x00000E0C) CRC status                                            */
    __IM uint32_t RXMATCH;                           /*!< (@ 0x00000E10) Received address                                      */
    __IM uint32_t RXCRC;                             /*!< (@ 0x00000E14) CRC field of previously received packet               */
    __IM uint32_t DAI;                               /*!< (@ 0x00000E18) Device address match index                            */
    __IM uint32_t PDUSTAT;                           /*!< (@ 0x00000E1C) Payload status                                        */
    __IOM uint32_t PCNF0;                            /*!< (@ 0x00000E20) Packet configuration register 0                       */
    __IOM uint32_t PCNF0SEC;                         /*!< (@ 0x00000E24) Packet configuration register 0 in concurrent receive
                                                                         mode in BLE LR*/
    __IOM uint32_t PCNF1;                            /*!< (@ 0x00000E28) Packet configuration register 1                       */
    __IOM uint32_t BASE0;                            /*!< (@ 0x00000E2C) Base address 0                                        */
    __IOM uint32_t BASE1;                            /*!< (@ 0x00000E30) Base address 1                                        */
    __IOM uint32_t PREFIX0;                          /*!< (@ 0x00000E34) Prefixes bytes for logical addresses 0-3              */
