adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
    __IOM uint32_t PREFIX1;                          /*!< (@ 0x00000E38) Prefixes bytes for logical addresses 4-7              */
    __IOM uint32_t TXADDRESS;                        /*!< (@ 0x00000E3C) Transmit address select                               */
    __IOM uint32_t RXADDRESSES;                      /*!< (@ 0x00000E40) Receive address select                                */
    __IOM uint32_t CRCCNF;                           /*!< (@ 0x00000E44) CRC configuration                                     */
    __IOM uint32_t CRCPOLY;                          /*!< (@ 0x00000E48) CRC polynomial                                        */
    __IOM uint32_t CRCINIT;                          /*!< (@ 0x00000E4C) CRC initial value                                     */
    __IOM uint32_t DAB[8];                           /*!< (@ 0x00000E50) Device address base segment n                         */
    __IOM uint32_t DAP[8];                           /*!< (@ 0x00000E70) Device address prefix n                               */
    __IOM uint32_t DACNF;                            /*!< (@ 0x00000E90) Device address match configuration                    */
    __IOM uint32_t BCC;                              /*!< (@ 0x00000E94) Bit counter compare                                   */
    __IOM uint32_t AACHKOVERRIDE;                    /*!< (@ 0x00000E98) Address Check Override                                */
    __IM uint32_t PACKETCNTR1;                       /*!< (@ 0x00000E9C) (unspecified)                                         */
    __IM uint32_t PACKETCNTR2;                       /*!< (@ 0x00000EA0) (unspecified)                                         */
    __IM uint32_t CTESTATUS;                         /*!< (@ 0x00000EA4) CTEInfo parsed from received packet                   */
    __IM uint32_t HYPSTDCHECKSTAT;                   /*!< (@ 0x00000EA8) Address Check Override                                */
    __IM uint32_t HYPSTDAADIFFVEC;                   /*!< (@ 0x00000EAC) Address Diff Vector                                   */
    __IOM uint32_t ADDRWINSIZE;                      /*!< (@ 0x00000EB0) Address match safe window size (the number of bits
                                                                         after detect is asserted, before starting to look for
                                                                         address match). Only valid when
                                                                         OVERRIDE22.DISABLEADDRWINDOW is '0'.*/
    __IOM uint32_t MHRMATCHCONF;                     /*!< (@ 0x00000EB4) Search pattern configuration                          */
    __IOM uint32_t MHRMATCHMASK;                     /*!< (@ 0x00000EB8) Pattern mask                                          */
    __IOM uint32_t SFD;                              /*!< (@ 0x00000EBC) IEEE 802.15.4 start of frame delimiter                */
    __IOM uint32_t CTEINLINECONF;                    /*!< (@ 0x00000EC0) Configuration for CTE inline mode                     */
    __OM uint32_t DMASTART;                          /*!< (@ 0x00000EC4) (unspecified)                                         */
    __OM uint32_t DMASTOP;                           /*!< (@ 0x00000EC8) (unspecified)                                         */
    __IOM uint32_t DMAENABLE;                        /*!< (@ 0x00000ECC) (unspecified)                                         */
    __IOM uint32_t PACKETPTR;                        /*!< (@ 0x00000ED0) (unspecified)                                         */
    __IM uint32_t DMAAMOUNT;                         /*!< (@ 0x00000ED4) (unspecified)                                         */
    __IOM uint32_t DMAMAXCNT;                        /*!< (@ 0x00000ED8) (unspecified)                                         */
    __IM uint32_t RESERVED46[9];
    __IOM NRF_RADIO_LBMAC_Type LBMAC;                /*!< (@ 0x00000F00) (unspecified)                                         */
    __IM uint32_t RESERVED47[9];
    __IOM NRF_RADIO_CSTONES_Type CSTONES;            /*!< (@ 0x00001000) (unspecified)                                         */
    __IOM NRF_RADIO_RTT_Type RTT;                    /*!< (@ 0x00001050) (unspecified)                                         */
    __IM uint32_t RESERVED48[807];
    __IOM NRF_RADIO_DFT_Type DFT;                    /*!< (@ 0x00001D00) (unspecified)                                         */
    __IM uint32_t RESERVED49[124];
    __IOM NRF_RADIO_PENALTYTRIGPCP4_Type PENALTYTRIGPCP4; /*!< (@ 0x00001F00) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYTRIGPCP3_Type PENALTYTRIGPCP3; /*!< (@ 0x00001F08) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYTRIGPCP2_Type PENALTYTRIGPCP2; /*!< (@ 0x00001F10) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYTRIGPCP1_Type PENALTYTRIGPCP1; /*!< (@ 0x00001F18) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYTRIGPCP0_Type PENALTYTRIGPCP0; /*!< (@ 0x00001F20) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYREG_Type PENALTYREG;      /*!< (@ 0x00001F28) (unspecified)                                         */
    __IM uint32_t AUTOCLOCKSOURCEREQ;                /*!< (@ 0x00001F3C) (unspecified)                                         */
    __IOM NRF_RADIO_FORCEOVERRIDE_Type FORCEOVERRIDE; /*!< (@ 0x00001F40) (unspecified)                                        */
  } NRF_RADIO_Type;                                  /*!< Size = 8020 (0x1F54)                                                 */

/* RADIO_TASKS_TXEN: Enable RADIO in TX mode */
  #define RADIO_TASKS_TXEN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TXEN register.                                  */

/* TASKS_TXEN @Bit 0 : Enable RADIO in TX mode */
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Pos (0UL)      /*!< Position of TASKS_TXEN field.                                        */
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Msk (0x1UL << RADIO_TASKS_TXEN_TASKS_TXEN_Pos) /*!< Bit mask of TASKS_TXEN field.        */
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Min (0x1UL)    /*!< Min enumerator value of TASKS_TXEN field.                            */
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Max (0x1UL)    /*!< Max enumerator value of TASKS_TXEN field.                            */
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RADIO_TASKS_RXEN: Enable RADIO in RX mode */
  #define RADIO_TASKS_RXEN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RXEN register.                                  */

/* TASKS_RXEN @Bit 0 : Enable RADIO in RX mode */
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Pos (0UL)      /*!< Position of TASKS_RXEN field.                                        */
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Msk (0x1UL << RADIO_TASKS_RXEN_TASKS_RXEN_Pos) /*!< Bit mask of TASKS_RXEN field.        */
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Min (0x1UL)    /*!< Min enumerator value of TASKS_RXEN field.                            */
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Max (0x1UL)    /*!< Max enumerator value of TASKS_RXEN field.                            */
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RADIO_TASKS_START: Start RADIO */
  #define RADIO_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start RADIO */
  #define RADIO_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define RADIO_TASKS_START_TASKS_START_Msk (0x1UL << RADIO_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define RADIO_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define RADIO_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define RADIO_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* RADIO_TASKS_STOP: Stop RADIO */
  #define RADIO_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop RADIO */
  #define RADIO_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define RADIO_TASKS_STOP_TASKS_STOP_Msk (0x1UL << RADIO_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define RADIO_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define RADIO_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define RADIO_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RADIO_TASKS_DISABLE: Disable RADIO */
  #define RADIO_TASKS_DISABLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DISABLE register.                            */

