adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_TASKS_CHNOINCR: Update RADIO channel based on the current channel and increment it according to chNoIncrStep */
  #define RADIO_TASKS_CHNOINCR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CHNOINCR register.                          */

/* TASKS_CHNOINCR @Bit 0 : Update RADIO channel based on the current channel and increment it according to chNoIncrStep */
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Pos (0UL) /*!< Position of TASKS_CHNOINCR field.                                 */
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Msk (0x1UL << RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Pos) /*!< Bit mask of
                                                                            TASKS_CHNOINCR field.*/
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Min (0x1UL) /*!< Min enumerator value of TASKS_CHNOINCR field.                   */
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Max (0x1UL) /*!< Max enumerator value of TASKS_CHNOINCR field.                   */
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Trigger (0x1UL) /*!< Trigger task                                                */


/* RADIO_TASKS_DFEDMASTART: Start DFE DMA transaction */
  #define RADIO_TASKS_DFEDMASTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DFEDMASTART register.                    */

/* TASKS_DFEDMASTART @Bit 0 : Start DFE DMA transaction */
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Pos (0UL) /*!< Position of TASKS_DFEDMASTART field.                        */
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Msk (0x1UL << RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Pos) /*!< Bit mask
                                                                            of TASKS_DFEDMASTART field.*/
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Min (0x1UL) /*!< Min enumerator value of TASKS_DFEDMASTART field.          */
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Max (0x1UL) /*!< Max enumerator value of TASKS_DFEDMASTART field.          */
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Trigger (0x1UL) /*!< Trigger task                                          */


/* RADIO_TASKS_DFEDMASTOP: Stop ongoing DFE DMA transaction */
  #define RADIO_TASKS_DFEDMASTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DFEDMASTOP register.                      */

/* TASKS_DFEDMASTOP @Bit 0 : Stop ongoing DFE DMA transaction */
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Pos (0UL) /*!< Position of TASKS_DFEDMASTOP field.                           */
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Msk (0x1UL << RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Pos) /*!< Bit mask of
                                                                            TASKS_DFEDMASTOP field.*/
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_DFEDMASTOP field.             */
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_DFEDMASTOP field.             */
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Trigger (0x1UL) /*!< Trigger task                                            */


/* RADIO_TASKS_RELOADFREQ: Reload new frequency while radio PLL is active */
  #define RADIO_TASKS_RELOADFREQ_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RELOADFREQ register.                      */

/* TASKS_RELOADFREQ @Bit 0 : Reload new frequency while radio PLL is active */
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Pos (0UL) /*!< Position of TASKS_RELOADFREQ field.                           */
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Msk (0x1UL << RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Pos) /*!< Bit mask of
                                                                            TASKS_RELOADFREQ field.*/
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Min (0x1UL) /*!< Min enumerator value of TASKS_RELOADFREQ field.             */
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Max (0x1UL) /*!< Max enumerator value of TASKS_RELOADFREQ field.             */
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Trigger (0x1UL) /*!< Trigger task                                            */


/* RADIO_TASKS_CSTONESSTART: Channel sounding: Start tone processing */
  #define RADIO_TASKS_CSTONESSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CSTONESSTART register.                  */

/* TASKS_CSTONESSTART @Bit 0 : Channel sounding: Start tone processing */
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Pos (0UL) /*!< Position of TASKS_CSTONESSTART field.                     */
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Msk (0x1UL << RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Pos) /*!< Bit
                                                                            mask of TASKS_CSTONESSTART field.*/
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_CSTONESSTART field.       */
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_CSTONESSTART field.       */
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Trigger (0x1UL) /*!< Trigger task                                        */


/* RADIO_TASKS_SOFTRESET: Reset all public registers, but with these exceptions: DMA registers and EVENT/INTEN/SUBSCRIBE/PUBLISH
                           registers. Only to be used in DISABLED state. */

  #define RADIO_TASKS_SOFTRESET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SOFTRESET register.                        */

/* TASKS_SOFTRESET @Bit 0 : Reset all public registers, but with these exceptions: DMA registers and
                            EVENT/INTEN/SUBSCRIBE/PUBLISH registers. Only to be used in DISABLED state. */

  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Pos (0UL) /*!< Position of TASKS_SOFTRESET field.                              */
  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Msk (0x1UL << RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Pos) /*!< Bit mask of
                                                                            TASKS_SOFTRESET field.*/
  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Min (0x1UL) /*!< Min enumerator value of TASKS_SOFTRESET field.                */
  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Max (0x1UL) /*!< Max enumerator value of TASKS_SOFTRESET field.                */
  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Trigger (0x1UL) /*!< Trigger task                                              */


/* RADIO_SUBSCRIBE_TXEN: Subscribe configuration for task TXEN */
  #define RADIO_SUBSCRIBE_TXEN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_TXEN register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task TXEN will subscribe to */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_TXEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_TXEN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_TXEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_TXEN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_SUBSCRIBE_TXEN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_TXEN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_TXEN_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define RADIO_SUBSCRIBE_TXEN_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_RXEN: Subscribe configuration for task RXEN */
  #define RADIO_SUBSCRIBE_RXEN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RXEN register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task RXEN will subscribe to */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_RXEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_RXEN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_RXEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_RXEN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_SUBSCRIBE_RXEN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RXEN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RXEN_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define RADIO_SUBSCRIBE_RXEN_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_START: Subscribe configuration for task START */
  #define RADIO_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                        */

