adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define RADIO_SUBSCRIBE_START_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_SUBSCRIBE_START_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_START_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_START_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_START_EN_Msk (0x1UL << RADIO_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_SUBSCRIBE_START_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_START_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_START_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define RADIO_SUBSCRIBE_START_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define RADIO_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define RADIO_SUBSCRIBE_STOP_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define RADIO_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_STOP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_STOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_SUBSCRIBE_STOP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_STOP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_STOP_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define RADIO_SUBSCRIBE_STOP_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_DISABLE: Subscribe configuration for task DISABLE */
  #define RADIO_SUBSCRIBE_DISABLE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DISABLE register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task DISABLE will subscribe to */
  #define RADIO_SUBSCRIBE_DISABLE_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_DISABLE_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DISABLE_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_SUBSCRIBE_DISABLE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_DISABLE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DISABLE_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_DISABLE_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DISABLE_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_SUBSCRIBE_DISABLE_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DISABLE_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DISABLE_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define RADIO_SUBSCRIBE_DISABLE_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_RSSISTART: Subscribe configuration for task RSSISTART */
  #define RADIO_SUBSCRIBE_RSSISTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RSSISTART register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task RSSISTART will subscribe to */
  #define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_RSSISTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_RSSISTART_EN_Pos) /*!< Bit mask of EN field.              */
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* RADIO_SUBSCRIBE_BCSTART: Subscribe configuration for task BCSTART */
  #define RADIO_SUBSCRIBE_BCSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_BCSTART register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task BCSTART will subscribe to */
  #define RADIO_SUBSCRIBE_BCSTART_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_BCSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_BCSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_SUBSCRIBE_BCSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_BCSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_BCSTART_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_BCSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_BCSTART_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_SUBSCRIBE_BCSTART_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_BCSTART_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_BCSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define RADIO_SUBSCRIBE_BCSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_BCSTOP: Subscribe configuration for task BCSTOP */
  #define RADIO_SUBSCRIBE_BCSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_BCSTOP register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task BCSTOP will subscribe to */
  #define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_BCSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_BCSTOP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_EDSTART: Subscribe configuration for task EDSTART */
  #define RADIO_SUBSCRIBE_EDSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_EDSTART register.                    */

