adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_SUBSCRIBE_LOOPBACKEN: Subscribe configuration for task LOOPBACKEN */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_LOOPBACKEN register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task LOOPBACKEN will subscribe to */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_LOOPBACKEN_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* RADIO_SUBSCRIBE_CALSTART: Subscribe configuration for task CALSTART */
  #define RADIO_SUBSCRIBE_CALSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CALSTART register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that task CALSTART will subscribe to */
  #define RADIO_SUBSCRIBE_CALSTART_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CALSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CALSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_SUBSCRIBE_CALSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_SUBSCRIBE_CALSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CALSTART_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* RADIO_SUBSCRIBE_CALSTOP: Subscribe configuration for task CALSTOP */
  #define RADIO_SUBSCRIBE_CALSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CALSTOP register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task CALSTOP will subscribe to */
  #define RADIO_SUBSCRIBE_CALSTOP_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CALSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CALSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_SUBSCRIBE_CALSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_CALSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CALSTOP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_CHNOINCR: Subscribe configuration for task CHNOINCR */
  #define RADIO_SUBSCRIBE_CHNOINCR_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CHNOINCR register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that task CHNOINCR will subscribe to */
  #define RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CHNOINCR_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* RADIO_SUBSCRIBE_DFEDMASTART: Subscribe configuration for task DFEDMASTART */
  #define RADIO_SUBSCRIBE_DFEDMASTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DFEDMASTART register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task DFEDMASTART will subscribe to */
  #define RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DFEDMASTART_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Enabled (0x1UL) /*!< Enable subscription                                              */


/* RADIO_SUBSCRIBE_DFEDMASTOP: Subscribe configuration for task DFEDMASTOP */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DFEDMASTOP register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task DFEDMASTOP will subscribe to */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DFEDMASTOP_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* RADIO_SUBSCRIBE_RELOADFREQ: Subscribe configuration for task RELOADFREQ */
  #define RADIO_SUBSCRIBE_RELOADFREQ_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RELOADFREQ register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task RELOADFREQ will subscribe to */
  #define RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Msk (0x1UL << RADIO_SUBSCRIBE_RELOADFREQ_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* RADIO_SUBSCRIBE_CSTONESSTART: Subscribe configuration for task CSTONESSTART */
  #define RADIO_SUBSCRIBE_CSTONESSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CSTONESSTART register.          */

/* CHIDX @Bits 0..7 : DPPI channel that task CSTONESSTART will subscribe to */
  #define RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                       */
  #define RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CSTONESSTART_EN_Pos) /*!< Bit mask of EN field.        */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                           */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                             */


/* RADIO_SUBSCRIBE_SOFTRESET: Subscribe configuration for task SOFTRESET */
  #define RADIO_SUBSCRIBE_SOFTRESET_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SOFTRESET register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task SOFTRESET will subscribe to */
  #define RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Msk (0x1UL << RADIO_SUBSCRIBE_SOFTRESET_EN_Pos) /*!< Bit mask of EN field.              */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* RADIO_EVENTS_READY: RADIO has ramped up and is ready to be started */
  #define RADIO_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                              */

