adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_EVENTS_MODEREADY: Generated immediately on write access to MODE register when MODEPROGENABLE==0, otherwise only
                            manually triggered (SELECT_EVENTS_TRIGGERS=1) */

  #define RADIO_EVENTS_MODEREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MODEREADY register.                      */

/* EVENTS_MODEREADY @Bit 0 : Generated immediately on write access to MODE register when MODEPROGENABLE==0, otherwise only
                             manually triggered (SELECT_EVENTS_TRIGGERS=1) */

  #define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Pos (0UL) /*!< Position of EVENTS_MODEREADY field.                           */
  #define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Msk (0x1UL << RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Pos) /*!< Bit mask of
                                                                            EVENTS_MODEREADY field.*/
  #define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_MODEREADY field.             */
  #define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_MODEREADY field.             */
  #define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Generated (0x1UL) /*!< Event generated                                       */


/* RADIO_EVENTS_CTEEND: CTE end */
  #define RADIO_EVENTS_CTEEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CTEEND register.                            */

/* EVENTS_CTEEND @Bit 0 : CTE end */
  #define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Pos (0UL) /*!< Position of EVENTS_CTEEND field.                                    */
  #define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Msk (0x1UL << RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Pos) /*!< Bit mask of EVENTS_CTEEND
                                                                            field.*/
  #define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_CTEEND field.                      */
  #define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_CTEEND field.                      */
  #define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Generated (0x1UL) /*!< Event generated                                             */


/* RADIO_EVENTS_LBREADY: RADIO is ready in loopback mode and is able to transmit and receive data */
  #define RADIO_EVENTS_LBREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LBREADY register.                          */

/* EVENTS_LBREADY @Bit 0 : RADIO is ready in loopback mode and is able to transmit and receive data */
  #define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Pos (0UL) /*!< Position of EVENTS_LBREADY field.                                 */
  #define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Msk (0x1UL << RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Pos) /*!< Bit mask of
                                                                            EVENTS_LBREADY field.*/
  #define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_LBREADY field.                   */
  #define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_LBREADY field.                   */
  #define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Generated (0x1UL) /*!< Event generated                                           */


/* RADIO_EVENTS_CALDONE: RADIO calibration is done */
  #define RADIO_EVENTS_CALDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CALDONE register.                          */

/* EVENTS_CALDONE @Bit 0 : RADIO calibration is done */
  #define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Pos (0UL) /*!< Position of EVENTS_CALDONE field.                                 */
  #define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Msk (0x1UL << RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_CALDONE field.*/
  #define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_CALDONE field.                   */
  #define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_CALDONE field.                   */
  #define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Generated (0x1UL) /*!< Event generated                                           */


/* RADIO_EVENTS_CHNOUPDATED: RADIO channel no. is updated */
  #define RADIO_EVENTS_CHNOUPDATED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CHNOUPDATED register.                  */

/* EVENTS_CHNOUPDATED @Bit 0 : RADIO channel no. is updated */
  #define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Pos (0UL) /*!< Position of EVENTS_CHNOUPDATED field.                     */
  #define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Msk (0x1UL << RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Pos) /*!< Bit
                                                                            mask of EVENTS_CHNOUPDATED field.*/
  #define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Min (0x0UL) /*!< Min enumerator value of EVENTS_CHNOUPDATED field.       */
  #define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Max (0x1UL) /*!< Max enumerator value of EVENTS_CHNOUPDATED field.       */
  #define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Generated (0x1UL) /*!< Event generated                                   */


/* RADIO_EVENTS_TXTIMERMATCH: Tx timer match */
  #define RADIO_EVENTS_TXTIMERMATCH_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXTIMERMATCH register.                */

/* EVENTS_TXTIMERMATCH @Bit 0 : Tx timer match */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Pos (0UL) /*!< Position of EVENTS_TXTIMERMATCH field.                  */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Msk (0x1UL << RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Pos) /*!<
                                                                            Bit mask of EVENTS_TXTIMERMATCH field.*/
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXTIMERMATCH field.    */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXTIMERMATCH field.    */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Generated (0x1UL) /*!< Event generated                                 */


