adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_EVENTS_RXTIMERMATCH: Rx timer match */
  #define RADIO_EVENTS_RXTIMERMATCH_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXTIMERMATCH register.                */

/* EVENTS_RXTIMERMATCH @Bit 0 : Rx timer match */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Pos (0UL) /*!< Position of EVENTS_RXTIMERMATCH field.                  */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Msk (0x1UL << RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Pos) /*!<
                                                                            Bit mask of EVENTS_RXTIMERMATCH field.*/
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXTIMERMATCH field.    */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXTIMERMATCH field.    */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Generated (0x1UL) /*!< Event generated                                 */


/* RADIO_EVENTS_BESPOKEACK: Bespoke ACK for UPSCALE */
  #define RADIO_EVENTS_BESPOKEACK_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BESPOKEACK register.                    */

/* EVENTS_BESPOKEACK @Bit 0 : Bespoke ACK for UPSCALE */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Pos (0UL) /*!< Position of EVENTS_BESPOKEACK field.                        */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Msk (0x1UL << RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Pos) /*!< Bit mask
                                                                            of EVENTS_BESPOKEACK field.*/
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Min (0x0UL) /*!< Min enumerator value of EVENTS_BESPOKEACK field.          */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Max (0x1UL) /*!< Max enumerator value of EVENTS_BESPOKEACK field.          */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Generated (0x1UL) /*!< Event generated                                     */


/* RADIO_EVENTS_TXADDRESS: Address sent */
  #define RADIO_EVENTS_TXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXADDRESS register.                      */

/* EVENTS_TXADDRESS @Bit 0 : Address sent */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Pos (0UL) /*!< Position of EVENTS_TXADDRESS field.                           */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Msk (0x1UL << RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Pos) /*!< Bit mask of
                                                                            EVENTS_TXADDRESS field.*/
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXADDRESS field.             */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXADDRESS field.             */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Generated (0x1UL) /*!< Event generated                                       */


/* RADIO_EVENTS_RXADDRESS: Address received */
  #define RADIO_EVENTS_RXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXADDRESS register.                      */

/* EVENTS_RXADDRESS @Bit 0 : Address received */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Pos (0UL) /*!< Position of EVENTS_RXADDRESS field.                           */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Msk (0x1UL << RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Pos) /*!< Bit mask of
                                                                            EVENTS_RXADDRESS field.*/
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXADDRESS field.             */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXADDRESS field.             */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Generated (0x1UL) /*!< Event generated                                       */


/* RADIO_EVENTS_ACQINJ0DMAEND: ACQINJ0 DMA end */
  #define RADIO_EVENTS_ACQINJ0DMAEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ACQINJ0DMAEND register.              */

/* EVENTS_ACQINJ0DMAEND @Bit 0 : ACQINJ0 DMA end */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Pos (0UL) /*!< Position of EVENTS_ACQINJ0DMAEND field.               */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Msk (0x1UL << RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Pos)
                                                                            /*!< Bit mask of EVENTS_ACQINJ0DMAEND field.*/
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACQINJ0DMAEND field. */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACQINJ0DMAEND field. */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Generated (0x1UL) /*!< Event generated                               */


/* RADIO_EVENTS_ACQINJ1DMAEND: ACQINJ1 DMA end */
  #define RADIO_EVENTS_ACQINJ1DMAEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ACQINJ1DMAEND register.              */

/* EVENTS_ACQINJ1DMAEND @Bit 0 : ACQINJ1 DMA end */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Pos (0UL) /*!< Position of EVENTS_ACQINJ1DMAEND field.               */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Msk (0x1UL << RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Pos)
                                                                            /*!< Bit mask of EVENTS_ACQINJ1DMAEND field.*/
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACQINJ1DMAEND field. */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACQINJ1DMAEND field. */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Generated (0x1UL) /*!< Event generated                               */


