adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event TXADDRESS will publish to */
  #define RADIO_PUBLISH_TXADDRESS_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_TXADDRESS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_TXADDRESS_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_PUBLISH_TXADDRESS_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_TXADDRESS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_TXADDRESS_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_TXADDRESS_EN_Msk (0x1UL << RADIO_PUBLISH_TXADDRESS_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_PUBLISH_TXADDRESS_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXADDRESS_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXADDRESS_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define RADIO_PUBLISH_TXADDRESS_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_RXADDRESS: Publish configuration for event RXADDRESS */
  #define RADIO_PUBLISH_RXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXADDRESS register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event RXADDRESS will publish to */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RXADDRESS_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RXADDRESS_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_RXADDRESS_EN_Msk (0x1UL << RADIO_PUBLISH_RXADDRESS_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_PUBLISH_RXADDRESS_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXADDRESS_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXADDRESS_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define RADIO_PUBLISH_RXADDRESS_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_ACQINJ0DMAEND: Publish configuration for event ACQINJ0DMAEND */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ACQINJ0DMAEND register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event ACQINJ0DMAEND will publish to */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Msk (0x1UL << RADIO_PUBLISH_ACQINJ0DMAEND_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* RADIO_PUBLISH_ACQINJ1DMAEND: Publish configuration for event ACQINJ1DMAEND */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ACQINJ1DMAEND register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event ACQINJ1DMAEND will publish to */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Msk (0x1UL << RADIO_PUBLISH_ACQINJ1DMAEND_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* RADIO_PUBLISH_CSTONESEND: Publish configuration for event CSTONESEND */
  #define RADIO_PUBLISH_CSTONESEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CSTONESEND register.                  */

