adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* READY_EDSTART @Bit 14 : Shortcut between event READY and task EDSTART */
  #define RADIO_SHORTS_READY_EDSTART_Pos (14UL)      /*!< Position of READY_EDSTART field.                                     */
  #define RADIO_SHORTS_READY_EDSTART_Msk (0x1UL << RADIO_SHORTS_READY_EDSTART_Pos) /*!< Bit mask of READY_EDSTART field.       */
  #define RADIO_SHORTS_READY_EDSTART_Min (0x0UL)     /*!< Min enumerator value of READY_EDSTART field.                         */
  #define RADIO_SHORTS_READY_EDSTART_Max (0x1UL)     /*!< Max enumerator value of READY_EDSTART field.                         */
  #define RADIO_SHORTS_READY_EDSTART_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_READY_EDSTART_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* EDEND_DISABLE @Bit 15 : Shortcut between event EDEND and task DISABLE */
  #define RADIO_SHORTS_EDEND_DISABLE_Pos (15UL)      /*!< Position of EDEND_DISABLE field.                                     */
  #define RADIO_SHORTS_EDEND_DISABLE_Msk (0x1UL << RADIO_SHORTS_EDEND_DISABLE_Pos) /*!< Bit mask of EDEND_DISABLE field.       */
  #define RADIO_SHORTS_EDEND_DISABLE_Min (0x0UL)     /*!< Min enumerator value of EDEND_DISABLE field.                         */
  #define RADIO_SHORTS_EDEND_DISABLE_Max (0x1UL)     /*!< Max enumerator value of EDEND_DISABLE field.                         */
  #define RADIO_SHORTS_EDEND_DISABLE_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_EDEND_DISABLE_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* CCAIDLE_STOP @Bit 16 : Shortcut between event CCAIDLE and task STOP */
  #define RADIO_SHORTS_CCAIDLE_STOP_Pos (16UL)       /*!< Position of CCAIDLE_STOP field.                                      */
  #define RADIO_SHORTS_CCAIDLE_STOP_Msk (0x1UL << RADIO_SHORTS_CCAIDLE_STOP_Pos) /*!< Bit mask of CCAIDLE_STOP field.          */
  #define RADIO_SHORTS_CCAIDLE_STOP_Min (0x0UL)      /*!< Min enumerator value of CCAIDLE_STOP field.                          */
  #define RADIO_SHORTS_CCAIDLE_STOP_Max (0x1UL)      /*!< Max enumerator value of CCAIDLE_STOP field.                          */
  #define RADIO_SHORTS_CCAIDLE_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_CCAIDLE_STOP_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* TXREADY_START @Bit 17 : Shortcut between event TXREADY and task START */
  #define RADIO_SHORTS_TXREADY_START_Pos (17UL)      /*!< Position of TXREADY_START field.                                     */
  #define RADIO_SHORTS_TXREADY_START_Msk (0x1UL << RADIO_SHORTS_TXREADY_START_Pos) /*!< Bit mask of TXREADY_START field.       */
  #define RADIO_SHORTS_TXREADY_START_Min (0x0UL)     /*!< Min enumerator value of TXREADY_START field.                         */
  #define RADIO_SHORTS_TXREADY_START_Max (0x1UL)     /*!< Max enumerator value of TXREADY_START field.                         */
  #define RADIO_SHORTS_TXREADY_START_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_TXREADY_START_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* RXREADY_START @Bit 18 : Shortcut between event RXREADY and task START */
  #define RADIO_SHORTS_RXREADY_START_Pos (18UL)      /*!< Position of RXREADY_START field.                                     */
  #define RADIO_SHORTS_RXREADY_START_Msk (0x1UL << RADIO_SHORTS_RXREADY_START_Pos) /*!< Bit mask of RXREADY_START field.       */
  #define RADIO_SHORTS_RXREADY_START_Min (0x0UL)     /*!< Min enumerator value of RXREADY_START field.                         */
  #define RADIO_SHORTS_RXREADY_START_Max (0x1UL)     /*!< Max enumerator value of RXREADY_START field.                         */
  #define RADIO_SHORTS_RXREADY_START_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_RXREADY_START_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* PHYEND_DISABLE @Bit 19 : Shortcut between event PHYEND and task DISABLE */
  #define RADIO_SHORTS_PHYEND_DISABLE_Pos (19UL)     /*!< Position of PHYEND_DISABLE field.                                    */
  #define RADIO_SHORTS_PHYEND_DISABLE_Msk (0x1UL << RADIO_SHORTS_PHYEND_DISABLE_Pos) /*!< Bit mask of PHYEND_DISABLE field.    */
  #define RADIO_SHORTS_PHYEND_DISABLE_Min (0x0UL)    /*!< Min enumerator value of PHYEND_DISABLE field.                        */
  #define RADIO_SHORTS_PHYEND_DISABLE_Max (0x1UL)    /*!< Max enumerator value of PHYEND_DISABLE field.                        */
  #define RADIO_SHORTS_PHYEND_DISABLE_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define RADIO_SHORTS_PHYEND_DISABLE_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* PHYEND_START @Bit 20 : Shortcut between event PHYEND and task START */
  #define RADIO_SHORTS_PHYEND_START_Pos (20UL)       /*!< Position of PHYEND_START field.                                      */
  #define RADIO_SHORTS_PHYEND_START_Msk (0x1UL << RADIO_SHORTS_PHYEND_START_Pos) /*!< Bit mask of PHYEND_START field.          */
  #define RADIO_SHORTS_PHYEND_START_Min (0x0UL)      /*!< Min enumerator value of PHYEND_START field.                          */
  #define RADIO_SHORTS_PHYEND_START_Max (0x1UL)      /*!< Max enumerator value of PHYEND_START field.                          */
  #define RADIO_SHORTS_PHYEND_START_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_PHYEND_START_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* DFEEND_STOP @Bit 21 : Shortcut between event DFEEND and task STOP */
  #define RADIO_SHORTS_DFEEND_STOP_Pos (21UL)        /*!< Position of DFEEND_STOP field.                                       */
  #define RADIO_SHORTS_DFEEND_STOP_Msk (0x1UL << RADIO_SHORTS_DFEEND_STOP_Pos) /*!< Bit mask of DFEEND_STOP field.             */
  #define RADIO_SHORTS_DFEEND_STOP_Min (0x0UL)       /*!< Min enumerator value of DFEEND_STOP field.                           */
  #define RADIO_SHORTS_DFEEND_STOP_Max (0x1UL)       /*!< Max enumerator value of DFEEND_STOP field.                           */
  #define RADIO_SHORTS_DFEEND_STOP_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_DFEEND_STOP_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* DISABLED_LOOPBACKEN @Bit 22 : Shortcut between event DISABLED and task LOOPBACKEN */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Pos (22UL) /*!< Position of DISABLED_LOOPBACKEN field.                              */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Msk (0x1UL << RADIO_SHORTS_DISABLED_LOOPBACKEN_Pos) /*!< Bit mask of
                                                                            DISABLED_LOOPBACKEN field.*/
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Min (0x0UL) /*!< Min enumerator value of DISABLED_LOOPBACKEN field.                 */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Max (0x1UL) /*!< Max enumerator value of DISABLED_LOOPBACKEN field.                 */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Disabled (0x0UL) /*!< Disable shortcut                                              */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Enabled (0x1UL) /*!< Enable shortcut                                                */

/* DISABLED_CHNOINCR @Bit 23 : Shortcut between event DISABLED and task CHNOINCR */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Pos (23UL)  /*!< Position of DISABLED_CHNOINCR field.                                 */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Msk (0x1UL << RADIO_SHORTS_DISABLED_CHNOINCR_Pos) /*!< Bit mask of DISABLED_CHNOINCR
                                                                            field.*/
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Min (0x0UL) /*!< Min enumerator value of DISABLED_CHNOINCR field.                     */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Max (0x1UL) /*!< Max enumerator value of DISABLED_CHNOINCR field.                     */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Disabled (0x0UL) /*!< Disable shortcut                                                */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Enabled (0x1UL) /*!< Enable shortcut                                                  */

