adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHNOUPDATED_TXEN @Bit 24 : Shortcut between event CHNOUPDATED and task TXEN */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Pos (24UL)   /*!< Position of CHNOUPDATED_TXEN field.                                  */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_TXEN_Pos) /*!< Bit mask of CHNOUPDATED_TXEN
                                                                            field.*/
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Min (0x0UL)  /*!< Min enumerator value of CHNOUPDATED_TXEN field.                      */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Max (0x1UL)  /*!< Max enumerator value of CHNOUPDATED_TXEN field.                      */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* CHNOUPDATED_RXEN @Bit 25 : Shortcut between event CHNOUPDATED and task RXEN */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Pos (25UL)   /*!< Position of CHNOUPDATED_RXEN field.                                  */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_RXEN_Pos) /*!< Bit mask of CHNOUPDATED_RXEN
                                                                            field.*/
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Min (0x0UL)  /*!< Min enumerator value of CHNOUPDATED_RXEN field.                      */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Max (0x1UL)  /*!< Max enumerator value of CHNOUPDATED_RXEN field.                      */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* CHNOUPDATED_LOOPBACKEN @Bit 26 : Shortcut between event CHNOUPDATED and task LOOPBACKEN */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Pos (26UL) /*!< Position of CHNOUPDATED_LOOPBACKEN field.                        */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Pos) /*!< Bit mask of
                                                                            CHNOUPDATED_LOOPBACKEN field.*/
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Min (0x0UL) /*!< Min enumerator value of CHNOUPDATED_LOOPBACKEN field.           */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Max (0x1UL) /*!< Max enumerator value of CHNOUPDATED_LOOPBACKEN field.           */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Disabled (0x0UL) /*!< Disable shortcut                                           */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Enabled (0x1UL) /*!< Enable shortcut                                             */


/* RADIO_INTEN00: Enable or disable interrupt */
  #define RADIO_INTEN00_ResetValue (0x00000000UL)    /*!< Reset value of INTEN00 register.                                     */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define RADIO_INTEN00_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define RADIO_INTEN00_READY_Msk (0x1UL << RADIO_INTEN00_READY_Pos) /*!< Bit mask of READY field.                             */
  #define RADIO_INTEN00_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTEN00_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTEN00_READY_Disabled (0x0UL)       /*!< Disable                                                              */
  #define RADIO_INTEN00_READY_Enabled (0x1UL)        /*!< Enable                                                               */

/* TXREADY @Bit 1 : Enable or disable interrupt for event TXREADY */
  #define RADIO_INTEN00_TXREADY_Pos (1UL)            /*!< Position of TXREADY field.                                           */
  #define RADIO_INTEN00_TXREADY_Msk (0x1UL << RADIO_INTEN00_TXREADY_Pos) /*!< Bit mask of TXREADY field.                       */
  #define RADIO_INTEN00_TXREADY_Min (0x0UL)          /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTEN00_TXREADY_Max (0x1UL)          /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTEN00_TXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_TXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* RXREADY @Bit 2 : Enable or disable interrupt for event RXREADY */
  #define RADIO_INTEN00_RXREADY_Pos (2UL)            /*!< Position of RXREADY field.                                           */
  #define RADIO_INTEN00_RXREADY_Msk (0x1UL << RADIO_INTEN00_RXREADY_Pos) /*!< Bit mask of RXREADY field.                       */
  #define RADIO_INTEN00_RXREADY_Min (0x0UL)          /*!< Min enumerator value of RXREADY field.                               */
  #define RADIO_INTEN00_RXREADY_Max (0x1UL)          /*!< Max enumerator value of RXREADY field.                               */
  #define RADIO_INTEN00_RXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_RXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* ADDRESS @Bit 3 : Enable or disable interrupt for event ADDRESS */
  #define RADIO_INTEN00_ADDRESS_Pos (3UL)            /*!< Position of ADDRESS field.                                           */
  #define RADIO_INTEN00_ADDRESS_Msk (0x1UL << RADIO_INTEN00_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                       */
  #define RADIO_INTEN00_ADDRESS_Min (0x0UL)          /*!< Min enumerator value of ADDRESS field.                               */
  #define RADIO_INTEN00_ADDRESS_Max (0x1UL)          /*!< Max enumerator value of ADDRESS field.                               */
  #define RADIO_INTEN00_ADDRESS_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_ADDRESS_Enabled (0x1UL)      /*!< Enable                                                               */

