adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FRAMESTART @Bit 4 : Enable or disable interrupt for event FRAMESTART */
  #define RADIO_INTEN00_FRAMESTART_Pos (4UL)         /*!< Position of FRAMESTART field.                                        */
  #define RADIO_INTEN00_FRAMESTART_Msk (0x1UL << RADIO_INTEN00_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.              */
  #define RADIO_INTEN00_FRAMESTART_Min (0x0UL)       /*!< Min enumerator value of FRAMESTART field.                            */
  #define RADIO_INTEN00_FRAMESTART_Max (0x1UL)       /*!< Max enumerator value of FRAMESTART field.                            */
  #define RADIO_INTEN00_FRAMESTART_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN00_FRAMESTART_Enabled (0x1UL)   /*!< Enable                                                               */

/* PAYLOAD @Bit 5 : Enable or disable interrupt for event PAYLOAD */
  #define RADIO_INTEN00_PAYLOAD_Pos (5UL)            /*!< Position of PAYLOAD field.                                           */
  #define RADIO_INTEN00_PAYLOAD_Msk (0x1UL << RADIO_INTEN00_PAYLOAD_Pos) /*!< Bit mask of PAYLOAD field.                       */
  #define RADIO_INTEN00_PAYLOAD_Min (0x0UL)          /*!< Min enumerator value of PAYLOAD field.                               */
  #define RADIO_INTEN00_PAYLOAD_Max (0x1UL)          /*!< Max enumerator value of PAYLOAD field.                               */
  #define RADIO_INTEN00_PAYLOAD_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_PAYLOAD_Enabled (0x1UL)      /*!< Enable                                                               */

/* END @Bit 6 : Enable or disable interrupt for event END */
  #define RADIO_INTEN00_END_Pos (6UL)                /*!< Position of END field.                                               */
  #define RADIO_INTEN00_END_Msk (0x1UL << RADIO_INTEN00_END_Pos) /*!< Bit mask of END field.                                   */
  #define RADIO_INTEN00_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define RADIO_INTEN00_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define RADIO_INTEN00_END_Disabled (0x0UL)         /*!< Disable                                                              */
  #define RADIO_INTEN00_END_Enabled (0x1UL)          /*!< Enable                                                               */

/* PHYEND @Bit 7 : Enable or disable interrupt for event PHYEND */
  #define RADIO_INTEN00_PHYEND_Pos (7UL)             /*!< Position of PHYEND field.                                            */
  #define RADIO_INTEN00_PHYEND_Msk (0x1UL << RADIO_INTEN00_PHYEND_Pos) /*!< Bit mask of PHYEND field.                          */
  #define RADIO_INTEN00_PHYEND_Min (0x0UL)           /*!< Min enumerator value of PHYEND field.                                */
  #define RADIO_INTEN00_PHYEND_Max (0x1UL)           /*!< Max enumerator value of PHYEND field.                                */
  #define RADIO_INTEN00_PHYEND_Disabled (0x0UL)      /*!< Disable                                                              */
  #define RADIO_INTEN00_PHYEND_Enabled (0x1UL)       /*!< Enable                                                               */

/* DISABLED @Bit 8 : Enable or disable interrupt for event DISABLED */
  #define RADIO_INTEN00_DISABLED_Pos (8UL)           /*!< Position of DISABLED field.                                          */
  #define RADIO_INTEN00_DISABLED_Msk (0x1UL << RADIO_INTEN00_DISABLED_Pos) /*!< Bit mask of DISABLED field.                    */
  #define RADIO_INTEN00_DISABLED_Min (0x0UL)         /*!< Min enumerator value of DISABLED field.                              */
  #define RADIO_INTEN00_DISABLED_Max (0x1UL)         /*!< Max enumerator value of DISABLED field.                              */
  #define RADIO_INTEN00_DISABLED_Disabled (0x0UL)    /*!< Disable                                                              */
  #define RADIO_INTEN00_DISABLED_Enabled (0x1UL)     /*!< Enable                                                               */

/* DEVMATCH @Bit 9 : Enable or disable interrupt for event DEVMATCH */
  #define RADIO_INTEN00_DEVMATCH_Pos (9UL)           /*!< Position of DEVMATCH field.                                          */
  #define RADIO_INTEN00_DEVMATCH_Msk (0x1UL << RADIO_INTEN00_DEVMATCH_Pos) /*!< Bit mask of DEVMATCH field.                    */
  #define RADIO_INTEN00_DEVMATCH_Min (0x0UL)         /*!< Min enumerator value of DEVMATCH field.                              */
  #define RADIO_INTEN00_DEVMATCH_Max (0x1UL)         /*!< Max enumerator value of DEVMATCH field.                              */
  #define RADIO_INTEN00_DEVMATCH_Disabled (0x0UL)    /*!< Disable                                                              */
  #define RADIO_INTEN00_DEVMATCH_Enabled (0x1UL)     /*!< Enable                                                               */

/* DEVMISS @Bit 10 : Enable or disable interrupt for event DEVMISS */
  #define RADIO_INTEN00_DEVMISS_Pos (10UL)           /*!< Position of DEVMISS field.                                           */
  #define RADIO_INTEN00_DEVMISS_Msk (0x1UL << RADIO_INTEN00_DEVMISS_Pos) /*!< Bit mask of DEVMISS field.                       */
  #define RADIO_INTEN00_DEVMISS_Min (0x0UL)          /*!< Min enumerator value of DEVMISS field.                               */
  #define RADIO_INTEN00_DEVMISS_Max (0x1UL)          /*!< Max enumerator value of DEVMISS field.                               */
  #define RADIO_INTEN00_DEVMISS_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_DEVMISS_Enabled (0x1UL)      /*!< Enable                                                               */

/* CRCOK @Bit 11 : Enable or disable interrupt for event CRCOK */
  #define RADIO_INTEN00_CRCOK_Pos (11UL)             /*!< Position of CRCOK field.                                             */
  #define RADIO_INTEN00_CRCOK_Msk (0x1UL << RADIO_INTEN00_CRCOK_Pos) /*!< Bit mask of CRCOK field.                             */
  #define RADIO_INTEN00_CRCOK_Min (0x0UL)            /*!< Min enumerator value of CRCOK field.                                 */
  #define RADIO_INTEN00_CRCOK_Max (0x1UL)            /*!< Max enumerator value of CRCOK field.                                 */
  #define RADIO_INTEN00_CRCOK_Disabled (0x0UL)       /*!< Disable                                                              */
  #define RADIO_INTEN00_CRCOK_Enabled (0x1UL)        /*!< Enable                                                               */

/* CRCERROR @Bit 12 : Enable or disable interrupt for event CRCERROR */
  #define RADIO_INTEN00_CRCERROR_Pos (12UL)          /*!< Position of CRCERROR field.                                          */
  #define RADIO_INTEN00_CRCERROR_Msk (0x1UL << RADIO_INTEN00_CRCERROR_Pos) /*!< Bit mask of CRCERROR field.                    */
  #define RADIO_INTEN00_CRCERROR_Min (0x0UL)         /*!< Min enumerator value of CRCERROR field.                              */
  #define RADIO_INTEN00_CRCERROR_Max (0x1UL)         /*!< Max enumerator value of CRCERROR field.                              */
  #define RADIO_INTEN00_CRCERROR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define RADIO_INTEN00_CRCERROR_Enabled (0x1UL)     /*!< Enable                                                               */

