adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BCMATCH @Bit 14 : Enable or disable interrupt for event BCMATCH */
  #define RADIO_INTEN00_BCMATCH_Pos (14UL)           /*!< Position of BCMATCH field.                                           */
  #define RADIO_INTEN00_BCMATCH_Msk (0x1UL << RADIO_INTEN00_BCMATCH_Pos) /*!< Bit mask of BCMATCH field.                       */
  #define RADIO_INTEN00_BCMATCH_Min (0x0UL)          /*!< Min enumerator value of BCMATCH field.                               */
  #define RADIO_INTEN00_BCMATCH_Max (0x1UL)          /*!< Max enumerator value of BCMATCH field.                               */
  #define RADIO_INTEN00_BCMATCH_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_BCMATCH_Enabled (0x1UL)      /*!< Enable                                                               */

/* EDEND @Bit 15 : Enable or disable interrupt for event EDEND */
  #define RADIO_INTEN00_EDEND_Pos (15UL)             /*!< Position of EDEND field.                                             */
  #define RADIO_INTEN00_EDEND_Msk (0x1UL << RADIO_INTEN00_EDEND_Pos) /*!< Bit mask of EDEND field.                             */
  #define RADIO_INTEN00_EDEND_Min (0x0UL)            /*!< Min enumerator value of EDEND field.                                 */
  #define RADIO_INTEN00_EDEND_Max (0x1UL)            /*!< Max enumerator value of EDEND field.                                 */
  #define RADIO_INTEN00_EDEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define RADIO_INTEN00_EDEND_Enabled (0x1UL)        /*!< Enable                                                               */

/* EDSTOPPED @Bit 16 : Enable or disable interrupt for event EDSTOPPED */
  #define RADIO_INTEN00_EDSTOPPED_Pos (16UL)         /*!< Position of EDSTOPPED field.                                         */
  #define RADIO_INTEN00_EDSTOPPED_Msk (0x1UL << RADIO_INTEN00_EDSTOPPED_Pos) /*!< Bit mask of EDSTOPPED field.                 */
  #define RADIO_INTEN00_EDSTOPPED_Min (0x0UL)        /*!< Min enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTEN00_EDSTOPPED_Max (0x1UL)        /*!< Max enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTEN00_EDSTOPPED_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN00_EDSTOPPED_Enabled (0x1UL)    /*!< Enable                                                               */

/* CCAIDLE @Bit 17 : Enable or disable interrupt for event CCAIDLE */
  #define RADIO_INTEN00_CCAIDLE_Pos (17UL)           /*!< Position of CCAIDLE field.                                           */
  #define RADIO_INTEN00_CCAIDLE_Msk (0x1UL << RADIO_INTEN00_CCAIDLE_Pos) /*!< Bit mask of CCAIDLE field.                       */
  #define RADIO_INTEN00_CCAIDLE_Min (0x0UL)          /*!< Min enumerator value of CCAIDLE field.                               */
  #define RADIO_INTEN00_CCAIDLE_Max (0x1UL)          /*!< Max enumerator value of CCAIDLE field.                               */
  #define RADIO_INTEN00_CCAIDLE_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_CCAIDLE_Enabled (0x1UL)      /*!< Enable                                                               */

/* CCABUSY @Bit 18 : Enable or disable interrupt for event CCABUSY */
  #define RADIO_INTEN00_CCABUSY_Pos (18UL)           /*!< Position of CCABUSY field.                                           */
  #define RADIO_INTEN00_CCABUSY_Msk (0x1UL << RADIO_INTEN00_CCABUSY_Pos) /*!< Bit mask of CCABUSY field.                       */
  #define RADIO_INTEN00_CCABUSY_Min (0x0UL)          /*!< Min enumerator value of CCABUSY field.                               */
  #define RADIO_INTEN00_CCABUSY_Max (0x1UL)          /*!< Max enumerator value of CCABUSY field.                               */
  #define RADIO_INTEN00_CCABUSY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_CCABUSY_Enabled (0x1UL)      /*!< Enable                                                               */

/* CCASTOPPED @Bit 19 : Enable or disable interrupt for event CCASTOPPED */
  #define RADIO_INTEN00_CCASTOPPED_Pos (19UL)        /*!< Position of CCASTOPPED field.                                        */
  #define RADIO_INTEN00_CCASTOPPED_Msk (0x1UL << RADIO_INTEN00_CCASTOPPED_Pos) /*!< Bit mask of CCASTOPPED field.              */
  #define RADIO_INTEN00_CCASTOPPED_Min (0x0UL)       /*!< Min enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTEN00_CCASTOPPED_Max (0x1UL)       /*!< Max enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTEN00_CCASTOPPED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN00_CCASTOPPED_Enabled (0x1UL)   /*!< Enable                                                               */

/* RATEBOOST @Bit 20 : Enable or disable interrupt for event RATEBOOST */
  #define RADIO_INTEN00_RATEBOOST_Pos (20UL)         /*!< Position of RATEBOOST field.                                         */
  #define RADIO_INTEN00_RATEBOOST_Msk (0x1UL << RADIO_INTEN00_RATEBOOST_Pos) /*!< Bit mask of RATEBOOST field.                 */
  #define RADIO_INTEN00_RATEBOOST_Min (0x0UL)        /*!< Min enumerator value of RATEBOOST field.                             */
  #define RADIO_INTEN00_RATEBOOST_Max (0x1UL)        /*!< Max enumerator value of RATEBOOST field.                             */
  #define RADIO_INTEN00_RATEBOOST_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN00_RATEBOOST_Enabled (0x1UL)    /*!< Enable                                                               */

/* MHRMATCH @Bit 21 : Enable or disable interrupt for event MHRMATCH */
  #define RADIO_INTEN00_MHRMATCH_Pos (21UL)          /*!< Position of MHRMATCH field.                                          */
  #define RADIO_INTEN00_MHRMATCH_Msk (0x1UL << RADIO_INTEN00_MHRMATCH_Pos) /*!< Bit mask of MHRMATCH field.                    */
  #define RADIO_INTEN00_MHRMATCH_Min (0x0UL)         /*!< Min enumerator value of MHRMATCH field.                              */
  #define RADIO_INTEN00_MHRMATCH_Max (0x1UL)         /*!< Max enumerator value of MHRMATCH field.                              */
  #define RADIO_INTEN00_MHRMATCH_Disabled (0x0UL)    /*!< Disable                                                              */
  #define RADIO_INTEN00_MHRMATCH_Enabled (0x1UL)     /*!< Enable                                                               */

/* SYNC @Bit 22 : Enable or disable interrupt for event SYNC */
  #define RADIO_INTEN00_SYNC_Pos (22UL)              /*!< Position of SYNC field.                                              */
  #define RADIO_INTEN00_SYNC_Msk (0x1UL << RADIO_INTEN00_SYNC_Pos) /*!< Bit mask of SYNC field.                                */
  #define RADIO_INTEN00_SYNC_Min (0x0UL)             /*!< Min enumerator value of SYNC field.                                  */
  #define RADIO_INTEN00_SYNC_Max (0x1UL)             /*!< Max enumerator value of SYNC field.                                  */
  #define RADIO_INTEN00_SYNC_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RADIO_INTEN00_SYNC_Enabled (0x1UL)         /*!< Enable                                                               */

/* CTEPRESENT @Bit 23 : Enable or disable interrupt for event CTEPRESENT */
  #define RADIO_INTEN00_CTEPRESENT_Pos (23UL)        /*!< Position of CTEPRESENT field.                                        */
  #define RADIO_INTEN00_CTEPRESENT_Msk (0x1UL << RADIO_INTEN00_CTEPRESENT_Pos) /*!< Bit mask of CTEPRESENT field.              */
  #define RADIO_INTEN00_CTEPRESENT_Min (0x0UL)       /*!< Min enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTEN00_CTEPRESENT_Max (0x1UL)       /*!< Max enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTEN00_CTEPRESENT_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN00_CTEPRESENT_Enabled (0x1UL)   /*!< Enable                                                               */

