adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CTEWARNING @Bit 24 : Enable or disable interrupt for event CTEWARNING */
  #define RADIO_INTEN00_CTEWARNING_Pos (24UL)        /*!< Position of CTEWARNING field.                                        */
  #define RADIO_INTEN00_CTEWARNING_Msk (0x1UL << RADIO_INTEN00_CTEWARNING_Pos) /*!< Bit mask of CTEWARNING field.              */
  #define RADIO_INTEN00_CTEWARNING_Min (0x0UL)       /*!< Min enumerator value of CTEWARNING field.                            */
  #define RADIO_INTEN00_CTEWARNING_Max (0x1UL)       /*!< Max enumerator value of CTEWARNING field.                            */
  #define RADIO_INTEN00_CTEWARNING_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN00_CTEWARNING_Enabled (0x1UL)   /*!< Enable                                                               */

/* DFEEND @Bit 25 : Enable or disable interrupt for event DFEEND */
  #define RADIO_INTEN00_DFEEND_Pos (25UL)            /*!< Position of DFEEND field.                                            */
  #define RADIO_INTEN00_DFEEND_Msk (0x1UL << RADIO_INTEN00_DFEEND_Pos) /*!< Bit mask of DFEEND field.                          */
  #define RADIO_INTEN00_DFEEND_Min (0x0UL)           /*!< Min enumerator value of DFEEND field.                                */
  #define RADIO_INTEN00_DFEEND_Max (0x1UL)           /*!< Max enumerator value of DFEEND field.                                */
  #define RADIO_INTEN00_DFEEND_Disabled (0x0UL)      /*!< Disable                                                              */
  #define RADIO_INTEN00_DFEEND_Enabled (0x1UL)       /*!< Enable                                                               */

/* MODEWRITTEN @Bit 26 : Enable or disable interrupt for event MODEWRITTEN */
  #define RADIO_INTEN00_MODEWRITTEN_Pos (26UL)       /*!< Position of MODEWRITTEN field.                                       */
  #define RADIO_INTEN00_MODEWRITTEN_Msk (0x1UL << RADIO_INTEN00_MODEWRITTEN_Pos) /*!< Bit mask of MODEWRITTEN field.           */
  #define RADIO_INTEN00_MODEWRITTEN_Min (0x0UL)      /*!< Min enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTEN00_MODEWRITTEN_Max (0x1UL)      /*!< Max enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTEN00_MODEWRITTEN_Disabled (0x0UL) /*!< Disable                                                              */
  #define RADIO_INTEN00_MODEWRITTEN_Enabled (0x1UL)  /*!< Enable                                                               */

/* MODEREADY @Bit 27 : Enable or disable interrupt for event MODEREADY */
  #define RADIO_INTEN00_MODEREADY_Pos (27UL)         /*!< Position of MODEREADY field.                                         */
  #define RADIO_INTEN00_MODEREADY_Msk (0x1UL << RADIO_INTEN00_MODEREADY_Pos) /*!< Bit mask of MODEREADY field.                 */
  #define RADIO_INTEN00_MODEREADY_Min (0x0UL)        /*!< Min enumerator value of MODEREADY field.                             */
  #define RADIO_INTEN00_MODEREADY_Max (0x1UL)        /*!< Max enumerator value of MODEREADY field.                             */
  #define RADIO_INTEN00_MODEREADY_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN00_MODEREADY_Enabled (0x1UL)    /*!< Enable                                                               */

/* CTEEND @Bit 28 : Enable or disable interrupt for event CTEEND */
  #define RADIO_INTEN00_CTEEND_Pos (28UL)            /*!< Position of CTEEND field.                                            */
  #define RADIO_INTEN00_CTEEND_Msk (0x1UL << RADIO_INTEN00_CTEEND_Pos) /*!< Bit mask of CTEEND field.                          */
  #define RADIO_INTEN00_CTEEND_Min (0x0UL)           /*!< Min enumerator value of CTEEND field.                                */
  #define RADIO_INTEN00_CTEEND_Max (0x1UL)           /*!< Max enumerator value of CTEEND field.                                */
  #define RADIO_INTEN00_CTEEND_Disabled (0x0UL)      /*!< Disable                                                              */
  #define RADIO_INTEN00_CTEEND_Enabled (0x1UL)       /*!< Enable                                                               */

/* LBREADY @Bit 29 : Enable or disable interrupt for event LBREADY */
  #define RADIO_INTEN00_LBREADY_Pos (29UL)           /*!< Position of LBREADY field.                                           */
  #define RADIO_INTEN00_LBREADY_Msk (0x1UL << RADIO_INTEN00_LBREADY_Pos) /*!< Bit mask of LBREADY field.                       */
  #define RADIO_INTEN00_LBREADY_Min (0x0UL)          /*!< Min enumerator value of LBREADY field.                               */
  #define RADIO_INTEN00_LBREADY_Max (0x1UL)          /*!< Max enumerator value of LBREADY field.                               */
  #define RADIO_INTEN00_LBREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_LBREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* CALDONE @Bit 30 : Enable or disable interrupt for event CALDONE */
  #define RADIO_INTEN00_CALDONE_Pos (30UL)           /*!< Position of CALDONE field.                                           */
  #define RADIO_INTEN00_CALDONE_Msk (0x1UL << RADIO_INTEN00_CALDONE_Pos) /*!< Bit mask of CALDONE field.                       */
  #define RADIO_INTEN00_CALDONE_Min (0x0UL)          /*!< Min enumerator value of CALDONE field.                               */
  #define RADIO_INTEN00_CALDONE_Max (0x1UL)          /*!< Max enumerator value of CALDONE field.                               */
  #define RADIO_INTEN00_CALDONE_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_CALDONE_Enabled (0x1UL)      /*!< Enable                                                               */

/* CHNOUPDATED @Bit 31 : Enable or disable interrupt for event CHNOUPDATED */
  #define RADIO_INTEN00_CHNOUPDATED_Pos (31UL)       /*!< Position of CHNOUPDATED field.                                       */
  #define RADIO_INTEN00_CHNOUPDATED_Msk (0x1UL << RADIO_INTEN00_CHNOUPDATED_Pos) /*!< Bit mask of CHNOUPDATED field.           */
  #define RADIO_INTEN00_CHNOUPDATED_Min (0x0UL)      /*!< Min enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTEN00_CHNOUPDATED_Max (0x1UL)      /*!< Max enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTEN00_CHNOUPDATED_Disabled (0x0UL) /*!< Disable                                                              */
  #define RADIO_INTEN00_CHNOUPDATED_Enabled (0x1UL)  /*!< Enable                                                               */


/* RADIO_INTEN01: Enable or disable interrupt */
  #define RADIO_INTEN01_ResetValue (0x00000000UL)    /*!< Reset value of INTEN01 register.                                     */

/* TXTIMERMATCH @Bit 1 : Enable or disable interrupt for event TXTIMERMATCH */
  #define RADIO_INTEN01_TXTIMERMATCH_Pos (1UL)       /*!< Position of TXTIMERMATCH field.                                      */
  #define RADIO_INTEN01_TXTIMERMATCH_Msk (0x1UL << RADIO_INTEN01_TXTIMERMATCH_Pos) /*!< Bit mask of TXTIMERMATCH field.        */
  #define RADIO_INTEN01_TXTIMERMATCH_Min (0x0UL)     /*!< Min enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTEN01_TXTIMERMATCH_Max (0x1UL)     /*!< Max enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTEN01_TXTIMERMATCH_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIO_INTEN01_TXTIMERMATCH_Enabled (0x1UL) /*!< Enable                                                               */

