adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RXTIMERMATCH @Bit 2 : Enable or disable interrupt for event RXTIMERMATCH */
  #define RADIO_INTEN01_RXTIMERMATCH_Pos (2UL)       /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTEN01_RXTIMERMATCH_Msk (0x1UL << RADIO_INTEN01_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.        */
  #define RADIO_INTEN01_RXTIMERMATCH_Min (0x0UL)     /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTEN01_RXTIMERMATCH_Max (0x1UL)     /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTEN01_RXTIMERMATCH_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIO_INTEN01_RXTIMERMATCH_Enabled (0x1UL) /*!< Enable                                                               */

/* BESPOKEACK @Bit 3 : Enable or disable interrupt for event BESPOKEACK */
  #define RADIO_INTEN01_BESPOKEACK_Pos (3UL)         /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTEN01_BESPOKEACK_Msk (0x1UL << RADIO_INTEN01_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.              */
  #define RADIO_INTEN01_BESPOKEACK_Min (0x0UL)       /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTEN01_BESPOKEACK_Max (0x1UL)       /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTEN01_BESPOKEACK_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN01_BESPOKEACK_Enabled (0x1UL)   /*!< Enable                                                               */

/* TXADDRESS @Bit 14 : Enable or disable interrupt for event TXADDRESS */
  #define RADIO_INTEN01_TXADDRESS_Pos (14UL)         /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTEN01_TXADDRESS_Msk (0x1UL << RADIO_INTEN01_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.                 */
  #define RADIO_INTEN01_TXADDRESS_Min (0x0UL)        /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTEN01_TXADDRESS_Max (0x1UL)        /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTEN01_TXADDRESS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN01_TXADDRESS_Enabled (0x1UL)    /*!< Enable                                                               */

/* RXADDRESS @Bit 15 : Enable or disable interrupt for event RXADDRESS */
  #define RADIO_INTEN01_RXADDRESS_Pos (15UL)         /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTEN01_RXADDRESS_Msk (0x1UL << RADIO_INTEN01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.                 */
  #define RADIO_INTEN01_RXADDRESS_Min (0x0UL)        /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTEN01_RXADDRESS_Max (0x1UL)        /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTEN01_RXADDRESS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN01_RXADDRESS_Enabled (0x1UL)    /*!< Enable                                                               */

/* ACQINJ0DMAEND @Bit 16 : Enable or disable interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Pos (16UL)     /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTEN01_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND field.     */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Min (0x0UL)    /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Max (0x1UL)    /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Enabled (0x1UL) /*!< Enable                                                              */

/* ACQINJ1DMAEND @Bit 17 : Enable or disable interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTEN01_ACQINJ1DMAEND_Pos (17UL)     /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTEN01_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTEN01_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND field.     */
  #define RADIO_INTEN01_ACQINJ1DMAEND_Min (0x0UL)    /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTEN01_ACQINJ1DMAEND_Max (0x1UL)    /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTEN01_ACQINJ1DMAEND_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIO_INTEN01_ACQINJ1DMAEND_Enabled (0x1UL) /*!< Enable                                                              */

/* CSTONESEND @Bit 18 : Enable or disable interrupt for event CSTONESEND */
  #define RADIO_INTEN01_CSTONESEND_Pos (18UL)        /*!< Position of CSTONESEND field.                                        */
  #define RADIO_INTEN01_CSTONESEND_Msk (0x1UL << RADIO_INTEN01_CSTONESEND_Pos) /*!< Bit mask of CSTONESEND field.              */
  #define RADIO_INTEN01_CSTONESEND_Min (0x0UL)       /*!< Min enumerator value of CSTONESEND field.                            */
  #define RADIO_INTEN01_CSTONESEND_Max (0x1UL)       /*!< Max enumerator value of CSTONESEND field.                            */
  #define RADIO_INTEN01_CSTONESEND_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN01_CSTONESEND_Enabled (0x1UL)   /*!< Enable                                                               */


/* RADIO_INTENSET00: Enable interrupt */
  #define RADIO_INTENSET00_ResetValue (0x00000000UL) /*!< Reset value of INTENSET00 register.                                  */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define RADIO_INTENSET00_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define RADIO_INTENSET00_READY_Msk (0x1UL << RADIO_INTENSET00_READY_Pos) /*!< Bit mask of READY field.                       */
  #define RADIO_INTENSET00_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTENSET00_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTENSET00_READY_Set (0x1UL)         /*!< Enable                                                               */
  #define RADIO_INTENSET00_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET00_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* TXREADY @Bit 1 : Write '1' to enable interrupt for event TXREADY */
  #define RADIO_INTENSET00_TXREADY_Pos (1UL)         /*!< Position of TXREADY field.                                           */
  #define RADIO_INTENSET00_TXREADY_Msk (0x1UL << RADIO_INTENSET00_TXREADY_Pos) /*!< Bit mask of TXREADY field.                 */
  #define RADIO_INTENSET00_TXREADY_Min (0x0UL)       /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTENSET00_TXREADY_Max (0x1UL)       /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTENSET00_TXREADY_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET00_TXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET00_TXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

