adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RXTIMERMATCH @Bit 2 : Write '1' to enable interrupt for event RXTIMERMATCH */
  #define RADIO_INTENSET01_RXTIMERMATCH_Pos (2UL)    /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTENSET01_RXTIMERMATCH_Msk (0x1UL << RADIO_INTENSET01_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.  */
  #define RADIO_INTENSET01_RXTIMERMATCH_Min (0x0UL)  /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTENSET01_RXTIMERMATCH_Max (0x1UL)  /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTENSET01_RXTIMERMATCH_Set (0x1UL)  /*!< Enable                                                               */
  #define RADIO_INTENSET01_RXTIMERMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIO_INTENSET01_RXTIMERMATCH_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* BESPOKEACK @Bit 3 : Write '1' to enable interrupt for event BESPOKEACK */
  #define RADIO_INTENSET01_BESPOKEACK_Pos (3UL)      /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTENSET01_BESPOKEACK_Msk (0x1UL << RADIO_INTENSET01_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.        */
  #define RADIO_INTENSET01_BESPOKEACK_Min (0x0UL)    /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTENSET01_BESPOKEACK_Max (0x1UL)    /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTENSET01_BESPOKEACK_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET01_BESPOKEACK_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET01_BESPOKEACK_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TXADDRESS @Bit 14 : Write '1' to enable interrupt for event TXADDRESS */
  #define RADIO_INTENSET01_TXADDRESS_Pos (14UL)      /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTENSET01_TXADDRESS_Msk (0x1UL << RADIO_INTENSET01_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.           */
  #define RADIO_INTENSET01_TXADDRESS_Min (0x0UL)     /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTENSET01_TXADDRESS_Max (0x1UL)     /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTENSET01_TXADDRESS_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET01_TXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET01_TXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* RXADDRESS @Bit 15 : Write '1' to enable interrupt for event RXADDRESS */
  #define RADIO_INTENSET01_RXADDRESS_Pos (15UL)      /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTENSET01_RXADDRESS_Msk (0x1UL << RADIO_INTENSET01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.           */
  #define RADIO_INTENSET01_RXADDRESS_Min (0x0UL)     /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENSET01_RXADDRESS_Max (0x1UL)     /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENSET01_RXADDRESS_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET01_RXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET01_RXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ACQINJ0DMAEND @Bit 16 : Write '1' to enable interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Pos (16UL)  /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTENSET01_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND
                                                                            field.*/
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Min (0x0UL) /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Max (0x1UL) /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Set (0x1UL) /*!< Enable                                                               */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* ACQINJ1DMAEND @Bit 17 : Write '1' to enable interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Pos (17UL)  /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTENSET01_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND
                                                                            field.*/
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Min (0x0UL) /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Max (0x1UL) /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Set (0x1UL) /*!< Enable                                                               */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* CSTONESEND @Bit 18 : Write '1' to enable interrupt for event CSTONESEND */
  #define RADIO_INTENSET01_CSTONESEND_Pos (18UL)     /*!< Position of CSTONESEND field.                                        */
  #define RADIO_INTENSET01_CSTONESEND_Msk (0x1UL << RADIO_INTENSET01_CSTONESEND_Pos) /*!< Bit mask of CSTONESEND field.        */
  #define RADIO_INTENSET01_CSTONESEND_Min (0x0UL)    /*!< Min enumerator value of CSTONESEND field.                            */
  #define RADIO_INTENSET01_CSTONESEND_Max (0x1UL)    /*!< Max enumerator value of CSTONESEND field.                            */
  #define RADIO_INTENSET01_CSTONESEND_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET01_CSTONESEND_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET01_CSTONESEND_Enabled (0x1UL) /*!< Read: Enabled                                                       */


