adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_INTENCLR01: Disable interrupt */
  #define RADIO_INTENCLR01_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR01 register.                                  */

/* TXTIMERMATCH @Bit 1 : Write '1' to disable interrupt for event TXTIMERMATCH */
  #define RADIO_INTENCLR01_TXTIMERMATCH_Pos (1UL)    /*!< Position of TXTIMERMATCH field.                                      */
  #define RADIO_INTENCLR01_TXTIMERMATCH_Msk (0x1UL << RADIO_INTENCLR01_TXTIMERMATCH_Pos) /*!< Bit mask of TXTIMERMATCH field.  */
  #define RADIO_INTENCLR01_TXTIMERMATCH_Min (0x0UL)  /*!< Min enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTENCLR01_TXTIMERMATCH_Max (0x1UL)  /*!< Max enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTENCLR01_TXTIMERMATCH_Clear (0x1UL) /*!< Disable                                                             */
  #define RADIO_INTENCLR01_TXTIMERMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIO_INTENCLR01_TXTIMERMATCH_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* RXTIMERMATCH @Bit 2 : Write '1' to disable interrupt for event RXTIMERMATCH */
  #define RADIO_INTENCLR01_RXTIMERMATCH_Pos (2UL)    /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTENCLR01_RXTIMERMATCH_Msk (0x1UL << RADIO_INTENCLR01_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.  */
  #define RADIO_INTENCLR01_RXTIMERMATCH_Min (0x0UL)  /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTENCLR01_RXTIMERMATCH_Max (0x1UL)  /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTENCLR01_RXTIMERMATCH_Clear (0x1UL) /*!< Disable                                                             */
  #define RADIO_INTENCLR01_RXTIMERMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIO_INTENCLR01_RXTIMERMATCH_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* BESPOKEACK @Bit 3 : Write '1' to disable interrupt for event BESPOKEACK */
  #define RADIO_INTENCLR01_BESPOKEACK_Pos (3UL)      /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTENCLR01_BESPOKEACK_Msk (0x1UL << RADIO_INTENCLR01_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.        */
  #define RADIO_INTENCLR01_BESPOKEACK_Min (0x0UL)    /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTENCLR01_BESPOKEACK_Max (0x1UL)    /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTENCLR01_BESPOKEACK_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIO_INTENCLR01_BESPOKEACK_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENCLR01_BESPOKEACK_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TXADDRESS @Bit 14 : Write '1' to disable interrupt for event TXADDRESS */
  #define RADIO_INTENCLR01_TXADDRESS_Pos (14UL)      /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTENCLR01_TXADDRESS_Msk (0x1UL << RADIO_INTENCLR01_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.           */
  #define RADIO_INTENCLR01_TXADDRESS_Min (0x0UL)     /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTENCLR01_TXADDRESS_Max (0x1UL)     /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTENCLR01_TXADDRESS_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIO_INTENCLR01_TXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENCLR01_TXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* RXADDRESS @Bit 15 : Write '1' to disable interrupt for event RXADDRESS */
  #define RADIO_INTENCLR01_RXADDRESS_Pos (15UL)      /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTENCLR01_RXADDRESS_Msk (0x1UL << RADIO_INTENCLR01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.           */
  #define RADIO_INTENCLR01_RXADDRESS_Min (0x0UL)     /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENCLR01_RXADDRESS_Max (0x1UL)     /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENCLR01_RXADDRESS_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIO_INTENCLR01_RXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENCLR01_RXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ACQINJ0DMAEND @Bit 16 : Write '1' to disable interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Pos (16UL)  /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTENCLR01_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND
                                                                            field.*/
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Min (0x0UL) /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Max (0x1UL) /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* ACQINJ1DMAEND @Bit 17 : Write '1' to disable interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Pos (17UL)  /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTENCLR01_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND
                                                                            field.*/
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Min (0x0UL) /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Max (0x1UL) /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* CSTONESEND @Bit 18 : Write '1' to disable interrupt for event CSTONESEND */
  #define RADIO_INTENCLR01_CSTONESEND_Pos (18UL)     /*!< Position of CSTONESEND field.                                        */
  #define RADIO_INTENCLR01_CSTONESEND_Msk (0x1UL << RADIO_INTENCLR01_CSTONESEND_Pos) /*!< Bit mask of CSTONESEND field.        */
  #define RADIO_INTENCLR01_CSTONESEND_Min (0x0UL)    /*!< Min enumerator value of CSTONESEND field.                            */
  #define RADIO_INTENCLR01_CSTONESEND_Max (0x1UL)    /*!< Max enumerator value of CSTONESEND field.                            */
  #define RADIO_INTENCLR01_CSTONESEND_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIO_INTENCLR01_CSTONESEND_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENCLR01_CSTONESEND_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* RADIO_INTPEND00: Pending interrupts */
  #define RADIO_INTPEND00_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND00 register.                                   */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define RADIO_INTPEND00_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define RADIO_INTPEND00_READY_Msk (0x1UL << RADIO_INTPEND00_READY_Pos) /*!< Bit mask of READY field.                         */
  #define RADIO_INTPEND00_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTPEND00_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTPEND00_READY_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_READY_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* TXREADY @Bit 1 : Read pending status of interrupt for event TXREADY */
  #define RADIO_INTPEND00_TXREADY_Pos (1UL)          /*!< Position of TXREADY field.                                           */
  #define RADIO_INTPEND00_TXREADY_Msk (0x1UL << RADIO_INTPEND00_TXREADY_Pos) /*!< Bit mask of TXREADY field.                   */
  #define RADIO_INTPEND00_TXREADY_Min (0x0UL)        /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTPEND00_TXREADY_Max (0x1UL)        /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTPEND00_TXREADY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_TXREADY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RXREADY @Bit 2 : Read pending status of interrupt for event RXREADY */
  #define RADIO_INTPEND00_RXREADY_Pos (2UL)          /*!< Position of RXREADY field.                                           */
  #define RADIO_INTPEND00_RXREADY_Msk (0x1UL << RADIO_INTPEND00_RXREADY_Pos) /*!< Bit mask of RXREADY field.                   */
  #define RADIO_INTPEND00_RXREADY_Min (0x0UL)        /*!< Min enumerator value of RXREADY field.                               */
  #define RADIO_INTPEND00_RXREADY_Max (0x1UL)        /*!< Max enumerator value of RXREADY field.                               */
  #define RADIO_INTPEND00_RXREADY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_RXREADY_Pending (0x1UL)    /*!< Read: Pending                                                        */

