adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DFEEND @Bit 25 : Read pending status of interrupt for event DFEEND */
  #define RADIO_INTPEND00_DFEEND_Pos (25UL)          /*!< Position of DFEEND field.                                            */
  #define RADIO_INTPEND00_DFEEND_Msk (0x1UL << RADIO_INTPEND00_DFEEND_Pos) /*!< Bit mask of DFEEND field.                      */
  #define RADIO_INTPEND00_DFEEND_Min (0x0UL)         /*!< Min enumerator value of DFEEND field.                                */
  #define RADIO_INTPEND00_DFEEND_Max (0x1UL)         /*!< Max enumerator value of DFEEND field.                                */
  #define RADIO_INTPEND00_DFEEND_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_DFEEND_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* MODEWRITTEN @Bit 26 : Read pending status of interrupt for event MODEWRITTEN */
  #define RADIO_INTPEND00_MODEWRITTEN_Pos (26UL)     /*!< Position of MODEWRITTEN field.                                       */
  #define RADIO_INTPEND00_MODEWRITTEN_Msk (0x1UL << RADIO_INTPEND00_MODEWRITTEN_Pos) /*!< Bit mask of MODEWRITTEN field.       */
  #define RADIO_INTPEND00_MODEWRITTEN_Min (0x0UL)    /*!< Min enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTPEND00_MODEWRITTEN_Max (0x1UL)    /*!< Max enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTPEND00_MODEWRITTEN_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define RADIO_INTPEND00_MODEWRITTEN_Pending (0x1UL) /*!< Read: Pending                                                       */

/* MODEREADY @Bit 27 : Read pending status of interrupt for event MODEREADY */
  #define RADIO_INTPEND00_MODEREADY_Pos (27UL)       /*!< Position of MODEREADY field.                                         */
  #define RADIO_INTPEND00_MODEREADY_Msk (0x1UL << RADIO_INTPEND00_MODEREADY_Pos) /*!< Bit mask of MODEREADY field.             */
  #define RADIO_INTPEND00_MODEREADY_Min (0x0UL)      /*!< Min enumerator value of MODEREADY field.                             */
  #define RADIO_INTPEND00_MODEREADY_Max (0x1UL)      /*!< Max enumerator value of MODEREADY field.                             */
  #define RADIO_INTPEND00_MODEREADY_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND00_MODEREADY_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* CTEEND @Bit 28 : Read pending status of interrupt for event CTEEND */
  #define RADIO_INTPEND00_CTEEND_Pos (28UL)          /*!< Position of CTEEND field.                                            */
  #define RADIO_INTPEND00_CTEEND_Msk (0x1UL << RADIO_INTPEND00_CTEEND_Pos) /*!< Bit mask of CTEEND field.                      */
  #define RADIO_INTPEND00_CTEEND_Min (0x0UL)         /*!< Min enumerator value of CTEEND field.                                */
  #define RADIO_INTPEND00_CTEEND_Max (0x1UL)         /*!< Max enumerator value of CTEEND field.                                */
  #define RADIO_INTPEND00_CTEEND_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_CTEEND_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* LBREADY @Bit 29 : Read pending status of interrupt for event LBREADY */
  #define RADIO_INTPEND00_LBREADY_Pos (29UL)         /*!< Position of LBREADY field.                                           */
  #define RADIO_INTPEND00_LBREADY_Msk (0x1UL << RADIO_INTPEND00_LBREADY_Pos) /*!< Bit mask of LBREADY field.                   */
  #define RADIO_INTPEND00_LBREADY_Min (0x0UL)        /*!< Min enumerator value of LBREADY field.                               */
  #define RADIO_INTPEND00_LBREADY_Max (0x1UL)        /*!< Max enumerator value of LBREADY field.                               */
  #define RADIO_INTPEND00_LBREADY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_LBREADY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CALDONE @Bit 30 : Read pending status of interrupt for event CALDONE */
  #define RADIO_INTPEND00_CALDONE_Pos (30UL)         /*!< Position of CALDONE field.                                           */
  #define RADIO_INTPEND00_CALDONE_Msk (0x1UL << RADIO_INTPEND00_CALDONE_Pos) /*!< Bit mask of CALDONE field.                   */
  #define RADIO_INTPEND00_CALDONE_Min (0x0UL)        /*!< Min enumerator value of CALDONE field.                               */
  #define RADIO_INTPEND00_CALDONE_Max (0x1UL)        /*!< Max enumerator value of CALDONE field.                               */
  #define RADIO_INTPEND00_CALDONE_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_CALDONE_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CHNOUPDATED @Bit 31 : Read pending status of interrupt for event CHNOUPDATED */
  #define RADIO_INTPEND00_CHNOUPDATED_Pos (31UL)     /*!< Position of CHNOUPDATED field.                                       */
  #define RADIO_INTPEND00_CHNOUPDATED_Msk (0x1UL << RADIO_INTPEND00_CHNOUPDATED_Pos) /*!< Bit mask of CHNOUPDATED field.       */
  #define RADIO_INTPEND00_CHNOUPDATED_Min (0x0UL)    /*!< Min enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTPEND00_CHNOUPDATED_Max (0x1UL)    /*!< Max enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTPEND00_CHNOUPDATED_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define RADIO_INTPEND00_CHNOUPDATED_Pending (0x1UL) /*!< Read: Pending                                                       */


/* RADIO_INTPEND01: Pending interrupts */
  #define RADIO_INTPEND01_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND01 register.                                   */

/* TXTIMERMATCH @Bit 1 : Read pending status of interrupt for event TXTIMERMATCH */
  #define RADIO_INTPEND01_TXTIMERMATCH_Pos (1UL)     /*!< Position of TXTIMERMATCH field.                                      */
  #define RADIO_INTPEND01_TXTIMERMATCH_Msk (0x1UL << RADIO_INTPEND01_TXTIMERMATCH_Pos) /*!< Bit mask of TXTIMERMATCH field.    */
  #define RADIO_INTPEND01_TXTIMERMATCH_Min (0x0UL)   /*!< Min enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTPEND01_TXTIMERMATCH_Max (0x1UL)   /*!< Max enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTPEND01_TXTIMERMATCH_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define RADIO_INTPEND01_TXTIMERMATCH_Pending (0x1UL) /*!< Read: Pending                                                      */

/* RXTIMERMATCH @Bit 2 : Read pending status of interrupt for event RXTIMERMATCH */
  #define RADIO_INTPEND01_RXTIMERMATCH_Pos (2UL)     /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTPEND01_RXTIMERMATCH_Msk (0x1UL << RADIO_INTPEND01_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.    */
  #define RADIO_INTPEND01_RXTIMERMATCH_Min (0x0UL)   /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTPEND01_RXTIMERMATCH_Max (0x1UL)   /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTPEND01_RXTIMERMATCH_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define RADIO_INTPEND01_RXTIMERMATCH_Pending (0x1UL) /*!< Read: Pending                                                      */

/* BESPOKEACK @Bit 3 : Read pending status of interrupt for event BESPOKEACK */
  #define RADIO_INTPEND01_BESPOKEACK_Pos (3UL)       /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTPEND01_BESPOKEACK_Msk (0x1UL << RADIO_INTPEND01_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.          */
  #define RADIO_INTPEND01_BESPOKEACK_Min (0x0UL)     /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTPEND01_BESPOKEACK_Max (0x1UL)     /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTPEND01_BESPOKEACK_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND01_BESPOKEACK_Pending (0x1UL) /*!< Read: Pending                                                        */

/* TXADDRESS @Bit 14 : Read pending status of interrupt for event TXADDRESS */
  #define RADIO_INTPEND01_TXADDRESS_Pos (14UL)       /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTPEND01_TXADDRESS_Msk (0x1UL << RADIO_INTPEND01_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.             */
  #define RADIO_INTPEND01_TXADDRESS_Min (0x0UL)      /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTPEND01_TXADDRESS_Max (0x1UL)      /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTPEND01_TXADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND01_TXADDRESS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* RXADDRESS @Bit 15 : Read pending status of interrupt for event RXADDRESS */
  #define RADIO_INTPEND01_RXADDRESS_Pos (15UL)       /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTPEND01_RXADDRESS_Msk (0x1UL << RADIO_INTPEND01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.             */
  #define RADIO_INTPEND01_RXADDRESS_Min (0x0UL)      /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTPEND01_RXADDRESS_Max (0x1UL)      /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTPEND01_RXADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND01_RXADDRESS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* ACQINJ0DMAEND @Bit 16 : Read pending status of interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Pos (16UL)   /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTPEND01_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND field. */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Min (0x0UL)  /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Max (0x1UL)  /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Pending (0x1UL) /*!< Read: Pending                                                     */

/* ACQINJ1DMAEND @Bit 17 : Read pending status of interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Pos (17UL)   /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTPEND01_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND field. */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Min (0x0UL)  /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Max (0x1UL)  /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Pending (0x1UL) /*!< Read: Pending                                                     */

/* CSTONESEND @Bit 18 : Read pending status of interrupt for event CSTONESEND */
  #define RADIO_INTPEND01_CSTONESEND_Pos (18UL)      /*!< Position of CSTONESEND field.                                        */
  #define RADIO_INTPEND01_CSTONESEND_Msk (0x1UL << RADIO_INTPEND01_CSTONESEND_Pos) /*!< Bit mask of CSTONESEND field.          */
  #define RADIO_INTPEND01_CSTONESEND_Min (0x0UL)     /*!< Min enumerator value of CSTONESEND field.                            */
  #define RADIO_INTPEND01_CSTONESEND_Max (0x1UL)     /*!< Max enumerator value of CSTONESEND field.                            */
  #define RADIO_INTPEND01_CSTONESEND_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND01_CSTONESEND_Pending (0x1UL) /*!< Read: Pending                                                        */


/* RADIO_INTEN10: Enable or disable interrupt */
  #define RADIO_INTEN10_ResetValue (0x00000000UL)    /*!< Reset value of INTEN10 register.                                     */

