adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RATEBOOST @Bit 20 : Enable or disable interrupt for event RATEBOOST */
  #define RADIO_INTEN10_RATEBOOST_Pos (20UL)         /*!< Position of RATEBOOST field.                                         */
  #define RADIO_INTEN10_RATEBOOST_Msk (0x1UL << RADIO_INTEN10_RATEBOOST_Pos) /*!< Bit mask of RATEBOOST field.                 */
  #define RADIO_INTEN10_RATEBOOST_Min (0x0UL)        /*!< Min enumerator value of RATEBOOST field.                             */
  #define RADIO_INTEN10_RATEBOOST_Max (0x1UL)        /*!< Max enumerator value of RATEBOOST field.                             */
  #define RADIO_INTEN10_RATEBOOST_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN10_RATEBOOST_Enabled (0x1UL)    /*!< Enable                                                               */

/* MHRMATCH @Bit 21 : Enable or disable interrupt for event MHRMATCH */
  #define RADIO_INTEN10_MHRMATCH_Pos (21UL)          /*!< Position of MHRMATCH field.                                          */
  #define RADIO_INTEN10_MHRMATCH_Msk (0x1UL << RADIO_INTEN10_MHRMATCH_Pos) /*!< Bit mask of MHRMATCH field.                    */
  #define RADIO_INTEN10_MHRMATCH_Min (0x0UL)         /*!< Min enumerator value of MHRMATCH field.                              */
  #define RADIO_INTEN10_MHRMATCH_Max (0x1UL)         /*!< Max enumerator value of MHRMATCH field.                              */
  #define RADIO_INTEN10_MHRMATCH_Disabled (0x0UL)    /*!< Disable                                                              */
  #define RADIO_INTEN10_MHRMATCH_Enabled (0x1UL)     /*!< Enable                                                               */

/* SYNC @Bit 22 : Enable or disable interrupt for event SYNC */
  #define RADIO_INTEN10_SYNC_Pos (22UL)              /*!< Position of SYNC field.                                              */
  #define RADIO_INTEN10_SYNC_Msk (0x1UL << RADIO_INTEN10_SYNC_Pos) /*!< Bit mask of SYNC field.                                */
  #define RADIO_INTEN10_SYNC_Min (0x0UL)             /*!< Min enumerator value of SYNC field.                                  */
  #define RADIO_INTEN10_SYNC_Max (0x1UL)             /*!< Max enumerator value of SYNC field.                                  */
  #define RADIO_INTEN10_SYNC_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RADIO_INTEN10_SYNC_Enabled (0x1UL)         /*!< Enable                                                               */

/* CTEPRESENT @Bit 23 : Enable or disable interrupt for event CTEPRESENT */
  #define RADIO_INTEN10_CTEPRESENT_Pos (23UL)        /*!< Position of CTEPRESENT field.                                        */
  #define RADIO_INTEN10_CTEPRESENT_Msk (0x1UL << RADIO_INTEN10_CTEPRESENT_Pos) /*!< Bit mask of CTEPRESENT field.              */
  #define RADIO_INTEN10_CTEPRESENT_Min (0x0UL)       /*!< Min enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTEN10_CTEPRESENT_Max (0x1UL)       /*!< Max enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTEN10_CTEPRESENT_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN10_CTEPRESENT_Enabled (0x1UL)   /*!< Enable                                                               */

/* CTEWARNING @Bit 24 : Enable or disable interrupt for event CTEWARNING */
  #define RADIO_INTEN10_CTEWARNING_Pos (24UL)        /*!< Position of CTEWARNING field.                                        */
  #define RADIO_INTEN10_CTEWARNING_Msk (0x1UL << RADIO_INTEN10_CTEWARNING_Pos) /*!< Bit mask of CTEWARNING field.              */
  #define RADIO_INTEN10_CTEWARNING_Min (0x0UL)       /*!< Min enumerator value of CTEWARNING field.                            */
  #define RADIO_INTEN10_CTEWARNING_Max (0x1UL)       /*!< Max enumerator value of CTEWARNING field.                            */
  #define RADIO_INTEN10_CTEWARNING_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN10_CTEWARNING_Enabled (0x1UL)   /*!< Enable                                                               */

/* DFEEND @Bit 25 : Enable or disable interrupt for event DFEEND */
  #define RADIO_INTEN10_DFEEND_Pos (25UL)            /*!< Position of DFEEND field.                                            */
  #define RADIO_INTEN10_DFEEND_Msk (0x1UL << RADIO_INTEN10_DFEEND_Pos) /*!< Bit mask of DFEEND field.                          */
  #define RADIO_INTEN10_DFEEND_Min (0x0UL)           /*!< Min enumerator value of DFEEND field.                                */
  #define RADIO_INTEN10_DFEEND_Max (0x1UL)           /*!< Max enumerator value of DFEEND field.                                */
  #define RADIO_INTEN10_DFEEND_Disabled (0x0UL)      /*!< Disable                                                              */
  #define RADIO_INTEN10_DFEEND_Enabled (0x1UL)       /*!< Enable                                                               */

/* MODEWRITTEN @Bit 26 : Enable or disable interrupt for event MODEWRITTEN */
  #define RADIO_INTEN10_MODEWRITTEN_Pos (26UL)       /*!< Position of MODEWRITTEN field.                                       */
  #define RADIO_INTEN10_MODEWRITTEN_Msk (0x1UL << RADIO_INTEN10_MODEWRITTEN_Pos) /*!< Bit mask of MODEWRITTEN field.           */
  #define RADIO_INTEN10_MODEWRITTEN_Min (0x0UL)      /*!< Min enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTEN10_MODEWRITTEN_Max (0x1UL)      /*!< Max enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTEN10_MODEWRITTEN_Disabled (0x0UL) /*!< Disable                                                              */
  #define RADIO_INTEN10_MODEWRITTEN_Enabled (0x1UL)  /*!< Enable                                                               */

/* MODEREADY @Bit 27 : Enable or disable interrupt for event MODEREADY */
  #define RADIO_INTEN10_MODEREADY_Pos (27UL)         /*!< Position of MODEREADY field.                                         */
  #define RADIO_INTEN10_MODEREADY_Msk (0x1UL << RADIO_INTEN10_MODEREADY_Pos) /*!< Bit mask of MODEREADY field.                 */
  #define RADIO_INTEN10_MODEREADY_Min (0x0UL)        /*!< Min enumerator value of MODEREADY field.                             */
  #define RADIO_INTEN10_MODEREADY_Max (0x1UL)        /*!< Max enumerator value of MODEREADY field.                             */
  #define RADIO_INTEN10_MODEREADY_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN10_MODEREADY_Enabled (0x1UL)    /*!< Enable                                                               */

/* CTEEND @Bit 28 : Enable or disable interrupt for event CTEEND */
  #define RADIO_INTEN10_CTEEND_Pos (28UL)            /*!< Position of CTEEND field.                                            */
  #define RADIO_INTEN10_CTEEND_Msk (0x1UL << RADIO_INTEN10_CTEEND_Pos) /*!< Bit mask of CTEEND field.                          */
  #define RADIO_INTEN10_CTEEND_Min (0x0UL)           /*!< Min enumerator value of CTEEND field.                                */
  #define RADIO_INTEN10_CTEEND_Max (0x1UL)           /*!< Max enumerator value of CTEEND field.                                */
  #define RADIO_INTEN10_CTEEND_Disabled (0x0UL)      /*!< Disable                                                              */
  #define RADIO_INTEN10_CTEEND_Enabled (0x1UL)       /*!< Enable                                                               */

/* LBREADY @Bit 29 : Enable or disable interrupt for event LBREADY */
  #define RADIO_INTEN10_LBREADY_Pos (29UL)           /*!< Position of LBREADY field.                                           */
  #define RADIO_INTEN10_LBREADY_Msk (0x1UL << RADIO_INTEN10_LBREADY_Pos) /*!< Bit mask of LBREADY field.                       */
  #define RADIO_INTEN10_LBREADY_Min (0x0UL)          /*!< Min enumerator value of LBREADY field.                               */
  #define RADIO_INTEN10_LBREADY_Max (0x1UL)          /*!< Max enumerator value of LBREADY field.                               */
  #define RADIO_INTEN10_LBREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN10_LBREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* CALDONE @Bit 30 : Enable or disable interrupt for event CALDONE */
  #define RADIO_INTEN10_CALDONE_Pos (30UL)           /*!< Position of CALDONE field.                                           */
  #define RADIO_INTEN10_CALDONE_Msk (0x1UL << RADIO_INTEN10_CALDONE_Pos) /*!< Bit mask of CALDONE field.                       */
  #define RADIO_INTEN10_CALDONE_Min (0x0UL)          /*!< Min enumerator value of CALDONE field.                               */
  #define RADIO_INTEN10_CALDONE_Max (0x1UL)          /*!< Max enumerator value of CALDONE field.                               */
  #define RADIO_INTEN10_CALDONE_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN10_CALDONE_Enabled (0x1UL)      /*!< Enable                                                               */

