adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHNOUPDATED @Bit 31 : Enable or disable interrupt for event CHNOUPDATED */
  #define RADIO_INTEN10_CHNOUPDATED_Pos (31UL)       /*!< Position of CHNOUPDATED field.                                       */
  #define RADIO_INTEN10_CHNOUPDATED_Msk (0x1UL << RADIO_INTEN10_CHNOUPDATED_Pos) /*!< Bit mask of CHNOUPDATED field.           */
  #define RADIO_INTEN10_CHNOUPDATED_Min (0x0UL)      /*!< Min enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTEN10_CHNOUPDATED_Max (0x1UL)      /*!< Max enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTEN10_CHNOUPDATED_Disabled (0x0UL) /*!< Disable                                                              */
  #define RADIO_INTEN10_CHNOUPDATED_Enabled (0x1UL)  /*!< Enable                                                               */


/* RADIO_INTEN11: Enable or disable interrupt */
  #define RADIO_INTEN11_ResetValue (0x00000000UL)    /*!< Reset value of INTEN11 register.                                     */

/* TXTIMERMATCH @Bit 1 : Enable or disable interrupt for event TXTIMERMATCH */
  #define RADIO_INTEN11_TXTIMERMATCH_Pos (1UL)       /*!< Position of TXTIMERMATCH field.                                      */
  #define RADIO_INTEN11_TXTIMERMATCH_Msk (0x1UL << RADIO_INTEN11_TXTIMERMATCH_Pos) /*!< Bit mask of TXTIMERMATCH field.        */
  #define RADIO_INTEN11_TXTIMERMATCH_Min (0x0UL)     /*!< Min enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTEN11_TXTIMERMATCH_Max (0x1UL)     /*!< Max enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTEN11_TXTIMERMATCH_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIO_INTEN11_TXTIMERMATCH_Enabled (0x1UL) /*!< Enable                                                               */

/* RXTIMERMATCH @Bit 2 : Enable or disable interrupt for event RXTIMERMATCH */
  #define RADIO_INTEN11_RXTIMERMATCH_Pos (2UL)       /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTEN11_RXTIMERMATCH_Msk (0x1UL << RADIO_INTEN11_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.        */
  #define RADIO_INTEN11_RXTIMERMATCH_Min (0x0UL)     /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTEN11_RXTIMERMATCH_Max (0x1UL)     /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTEN11_RXTIMERMATCH_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIO_INTEN11_RXTIMERMATCH_Enabled (0x1UL) /*!< Enable                                                               */

/* BESPOKEACK @Bit 3 : Enable or disable interrupt for event BESPOKEACK */
  #define RADIO_INTEN11_BESPOKEACK_Pos (3UL)         /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTEN11_BESPOKEACK_Msk (0x1UL << RADIO_INTEN11_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.              */
  #define RADIO_INTEN11_BESPOKEACK_Min (0x0UL)       /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTEN11_BESPOKEACK_Max (0x1UL)       /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTEN11_BESPOKEACK_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN11_BESPOKEACK_Enabled (0x1UL)   /*!< Enable                                                               */

/* TXADDRESS @Bit 14 : Enable or disable interrupt for event TXADDRESS */
  #define RADIO_INTEN11_TXADDRESS_Pos (14UL)         /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTEN11_TXADDRESS_Msk (0x1UL << RADIO_INTEN11_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.                 */
  #define RADIO_INTEN11_TXADDRESS_Min (0x0UL)        /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTEN11_TXADDRESS_Max (0x1UL)        /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTEN11_TXADDRESS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN11_TXADDRESS_Enabled (0x1UL)    /*!< Enable                                                               */

/* RXADDRESS @Bit 15 : Enable or disable interrupt for event RXADDRESS */
  #define RADIO_INTEN11_RXADDRESS_Pos (15UL)         /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTEN11_RXADDRESS_Msk (0x1UL << RADIO_INTEN11_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.                 */
  #define RADIO_INTEN11_RXADDRESS_Min (0x0UL)        /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTEN11_RXADDRESS_Max (0x1UL)        /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTEN11_RXADDRESS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN11_RXADDRESS_Enabled (0x1UL)    /*!< Enable                                                               */

/* ACQINJ0DMAEND @Bit 16 : Enable or disable interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTEN11_ACQINJ0DMAEND_Pos (16UL)     /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTEN11_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTEN11_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND field.     */
  #define RADIO_INTEN11_ACQINJ0DMAEND_Min (0x0UL)    /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTEN11_ACQINJ0DMAEND_Max (0x1UL)    /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTEN11_ACQINJ0DMAEND_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIO_INTEN11_ACQINJ0DMAEND_Enabled (0x1UL) /*!< Enable                                                              */

