adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DFEEND @Bit 25 : Write '1' to enable interrupt for event DFEEND */
  #define RADIO_INTENSET10_DFEEND_Pos (25UL)         /*!< Position of DFEEND field.                                            */
  #define RADIO_INTENSET10_DFEEND_Msk (0x1UL << RADIO_INTENSET10_DFEEND_Pos) /*!< Bit mask of DFEEND field.                    */
  #define RADIO_INTENSET10_DFEEND_Min (0x0UL)        /*!< Min enumerator value of DFEEND field.                                */
  #define RADIO_INTENSET10_DFEEND_Max (0x1UL)        /*!< Max enumerator value of DFEEND field.                                */
  #define RADIO_INTENSET10_DFEEND_Set (0x1UL)        /*!< Enable                                                               */
  #define RADIO_INTENSET10_DFEEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_DFEEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* MODEWRITTEN @Bit 26 : Write '1' to enable interrupt for event MODEWRITTEN */
  #define RADIO_INTENSET10_MODEWRITTEN_Pos (26UL)    /*!< Position of MODEWRITTEN field.                                       */
  #define RADIO_INTENSET10_MODEWRITTEN_Msk (0x1UL << RADIO_INTENSET10_MODEWRITTEN_Pos) /*!< Bit mask of MODEWRITTEN field.     */
  #define RADIO_INTENSET10_MODEWRITTEN_Min (0x0UL)   /*!< Min enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTENSET10_MODEWRITTEN_Max (0x1UL)   /*!< Max enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTENSET10_MODEWRITTEN_Set (0x1UL)   /*!< Enable                                                               */
  #define RADIO_INTENSET10_MODEWRITTEN_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define RADIO_INTENSET10_MODEWRITTEN_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* MODEREADY @Bit 27 : Write '1' to enable interrupt for event MODEREADY */
  #define RADIO_INTENSET10_MODEREADY_Pos (27UL)      /*!< Position of MODEREADY field.                                         */
  #define RADIO_INTENSET10_MODEREADY_Msk (0x1UL << RADIO_INTENSET10_MODEREADY_Pos) /*!< Bit mask of MODEREADY field.           */
  #define RADIO_INTENSET10_MODEREADY_Min (0x0UL)     /*!< Min enumerator value of MODEREADY field.                             */
  #define RADIO_INTENSET10_MODEREADY_Max (0x1UL)     /*!< Max enumerator value of MODEREADY field.                             */
  #define RADIO_INTENSET10_MODEREADY_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET10_MODEREADY_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET10_MODEREADY_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* CTEEND @Bit 28 : Write '1' to enable interrupt for event CTEEND */
  #define RADIO_INTENSET10_CTEEND_Pos (28UL)         /*!< Position of CTEEND field.                                            */
  #define RADIO_INTENSET10_CTEEND_Msk (0x1UL << RADIO_INTENSET10_CTEEND_Pos) /*!< Bit mask of CTEEND field.                    */
  #define RADIO_INTENSET10_CTEEND_Min (0x0UL)        /*!< Min enumerator value of CTEEND field.                                */
  #define RADIO_INTENSET10_CTEEND_Max (0x1UL)        /*!< Max enumerator value of CTEEND field.                                */
  #define RADIO_INTENSET10_CTEEND_Set (0x1UL)        /*!< Enable                                                               */
  #define RADIO_INTENSET10_CTEEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_CTEEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* LBREADY @Bit 29 : Write '1' to enable interrupt for event LBREADY */
  #define RADIO_INTENSET10_LBREADY_Pos (29UL)        /*!< Position of LBREADY field.                                           */
  #define RADIO_INTENSET10_LBREADY_Msk (0x1UL << RADIO_INTENSET10_LBREADY_Pos) /*!< Bit mask of LBREADY field.                 */
  #define RADIO_INTENSET10_LBREADY_Min (0x0UL)       /*!< Min enumerator value of LBREADY field.                               */
  #define RADIO_INTENSET10_LBREADY_Max (0x1UL)       /*!< Max enumerator value of LBREADY field.                               */
  #define RADIO_INTENSET10_LBREADY_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_LBREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_LBREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CALDONE @Bit 30 : Write '1' to enable interrupt for event CALDONE */
  #define RADIO_INTENSET10_CALDONE_Pos (30UL)        /*!< Position of CALDONE field.                                           */
  #define RADIO_INTENSET10_CALDONE_Msk (0x1UL << RADIO_INTENSET10_CALDONE_Pos) /*!< Bit mask of CALDONE field.                 */
  #define RADIO_INTENSET10_CALDONE_Min (0x0UL)       /*!< Min enumerator value of CALDONE field.                               */
  #define RADIO_INTENSET10_CALDONE_Max (0x1UL)       /*!< Max enumerator value of CALDONE field.                               */
  #define RADIO_INTENSET10_CALDONE_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_CALDONE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_CALDONE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CHNOUPDATED @Bit 31 : Write '1' to enable interrupt for event CHNOUPDATED */
  #define RADIO_INTENSET10_CHNOUPDATED_Pos (31UL)    /*!< Position of CHNOUPDATED field.                                       */
  #define RADIO_INTENSET10_CHNOUPDATED_Msk (0x1UL << RADIO_INTENSET10_CHNOUPDATED_Pos) /*!< Bit mask of CHNOUPDATED field.     */
  #define RADIO_INTENSET10_CHNOUPDATED_Min (0x0UL)   /*!< Min enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTENSET10_CHNOUPDATED_Max (0x1UL)   /*!< Max enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTENSET10_CHNOUPDATED_Set (0x1UL)   /*!< Enable                                                               */
  #define RADIO_INTENSET10_CHNOUPDATED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define RADIO_INTENSET10_CHNOUPDATED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* RADIO_INTENSET11: Enable interrupt */
  #define RADIO_INTENSET11_ResetValue (0x00000000UL) /*!< Reset value of INTENSET11 register.                                  */

/* TXTIMERMATCH @Bit 1 : Write '1' to enable interrupt for event TXTIMERMATCH */
  #define RADIO_INTENSET11_TXTIMERMATCH_Pos (1UL)    /*!< Position of TXTIMERMATCH field.                                      */
  #define RADIO_INTENSET11_TXTIMERMATCH_Msk (0x1UL << RADIO_INTENSET11_TXTIMERMATCH_Pos) /*!< Bit mask of TXTIMERMATCH field.  */
  #define RADIO_INTENSET11_TXTIMERMATCH_Min (0x0UL)  /*!< Min enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTENSET11_TXTIMERMATCH_Max (0x1UL)  /*!< Max enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTENSET11_TXTIMERMATCH_Set (0x1UL)  /*!< Enable                                                               */
  #define RADIO_INTENSET11_TXTIMERMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIO_INTENSET11_TXTIMERMATCH_Enabled (0x1UL) /*!< Read: Enabled                                                     */

