adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ADDRESS @Bit 3 : Read pending status of interrupt for event ADDRESS */
  #define RADIO_INTPEND10_ADDRESS_Pos (3UL)          /*!< Position of ADDRESS field.                                           */
  #define RADIO_INTPEND10_ADDRESS_Msk (0x1UL << RADIO_INTPEND10_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                   */
  #define RADIO_INTPEND10_ADDRESS_Min (0x0UL)        /*!< Min enumerator value of ADDRESS field.                               */
  #define RADIO_INTPEND10_ADDRESS_Max (0x1UL)        /*!< Max enumerator value of ADDRESS field.                               */
  #define RADIO_INTPEND10_ADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_ADDRESS_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* FRAMESTART @Bit 4 : Read pending status of interrupt for event FRAMESTART */
  #define RADIO_INTPEND10_FRAMESTART_Pos (4UL)       /*!< Position of FRAMESTART field.                                        */
  #define RADIO_INTPEND10_FRAMESTART_Msk (0x1UL << RADIO_INTPEND10_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.          */
  #define RADIO_INTPEND10_FRAMESTART_Min (0x0UL)     /*!< Min enumerator value of FRAMESTART field.                            */
  #define RADIO_INTPEND10_FRAMESTART_Max (0x1UL)     /*!< Max enumerator value of FRAMESTART field.                            */
  #define RADIO_INTPEND10_FRAMESTART_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND10_FRAMESTART_Pending (0x1UL) /*!< Read: Pending                                                        */

/* PAYLOAD @Bit 5 : Read pending status of interrupt for event PAYLOAD */
  #define RADIO_INTPEND10_PAYLOAD_Pos (5UL)          /*!< Position of PAYLOAD field.                                           */
  #define RADIO_INTPEND10_PAYLOAD_Msk (0x1UL << RADIO_INTPEND10_PAYLOAD_Pos) /*!< Bit mask of PAYLOAD field.                   */
  #define RADIO_INTPEND10_PAYLOAD_Min (0x0UL)        /*!< Min enumerator value of PAYLOAD field.                               */
  #define RADIO_INTPEND10_PAYLOAD_Max (0x1UL)        /*!< Max enumerator value of PAYLOAD field.                               */
  #define RADIO_INTPEND10_PAYLOAD_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_PAYLOAD_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* END @Bit 6 : Read pending status of interrupt for event END */
  #define RADIO_INTPEND10_END_Pos (6UL)              /*!< Position of END field.                                               */
  #define RADIO_INTPEND10_END_Msk (0x1UL << RADIO_INTPEND10_END_Pos) /*!< Bit mask of END field.                               */
  #define RADIO_INTPEND10_END_Min (0x0UL)            /*!< Min enumerator value of END field.                                   */
  #define RADIO_INTPEND10_END_Max (0x1UL)            /*!< Max enumerator value of END field.                                   */
  #define RADIO_INTPEND10_END_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_END_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* PHYEND @Bit 7 : Read pending status of interrupt for event PHYEND */
  #define RADIO_INTPEND10_PHYEND_Pos (7UL)           /*!< Position of PHYEND field.                                            */
  #define RADIO_INTPEND10_PHYEND_Msk (0x1UL << RADIO_INTPEND10_PHYEND_Pos) /*!< Bit mask of PHYEND field.                      */
  #define RADIO_INTPEND10_PHYEND_Min (0x0UL)         /*!< Min enumerator value of PHYEND field.                                */
  #define RADIO_INTPEND10_PHYEND_Max (0x1UL)         /*!< Max enumerator value of PHYEND field.                                */
  #define RADIO_INTPEND10_PHYEND_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_PHYEND_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* DISABLED @Bit 8 : Read pending status of interrupt for event DISABLED */
  #define RADIO_INTPEND10_DISABLED_Pos (8UL)         /*!< Position of DISABLED field.                                          */
  #define RADIO_INTPEND10_DISABLED_Msk (0x1UL << RADIO_INTPEND10_DISABLED_Pos) /*!< Bit mask of DISABLED field.                */
  #define RADIO_INTPEND10_DISABLED_Min (0x0UL)       /*!< Min enumerator value of DISABLED field.                              */
  #define RADIO_INTPEND10_DISABLED_Max (0x1UL)       /*!< Max enumerator value of DISABLED field.                              */
  #define RADIO_INTPEND10_DISABLED_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define RADIO_INTPEND10_DISABLED_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* DEVMATCH @Bit 9 : Read pending status of interrupt for event DEVMATCH */
  #define RADIO_INTPEND10_DEVMATCH_Pos (9UL)         /*!< Position of DEVMATCH field.                                          */
  #define RADIO_INTPEND10_DEVMATCH_Msk (0x1UL << RADIO_INTPEND10_DEVMATCH_Pos) /*!< Bit mask of DEVMATCH field.                */
  #define RADIO_INTPEND10_DEVMATCH_Min (0x0UL)       /*!< Min enumerator value of DEVMATCH field.                              */
  #define RADIO_INTPEND10_DEVMATCH_Max (0x1UL)       /*!< Max enumerator value of DEVMATCH field.                              */
  #define RADIO_INTPEND10_DEVMATCH_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define RADIO_INTPEND10_DEVMATCH_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* DEVMISS @Bit 10 : Read pending status of interrupt for event DEVMISS */
  #define RADIO_INTPEND10_DEVMISS_Pos (10UL)         /*!< Position of DEVMISS field.                                           */
  #define RADIO_INTPEND10_DEVMISS_Msk (0x1UL << RADIO_INTPEND10_DEVMISS_Pos) /*!< Bit mask of DEVMISS field.                   */
  #define RADIO_INTPEND10_DEVMISS_Min (0x0UL)        /*!< Min enumerator value of DEVMISS field.                               */
  #define RADIO_INTPEND10_DEVMISS_Max (0x1UL)        /*!< Max enumerator value of DEVMISS field.                               */
  #define RADIO_INTPEND10_DEVMISS_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_DEVMISS_Pending (0x1UL)    /*!< Read: Pending                                                        */

