adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DFEEND @Bit 25 : Read pending status of interrupt for event DFEEND */
  #define RADIO_INTPEND10_DFEEND_Pos (25UL)          /*!< Position of DFEEND field.                                            */
  #define RADIO_INTPEND10_DFEEND_Msk (0x1UL << RADIO_INTPEND10_DFEEND_Pos) /*!< Bit mask of DFEEND field.                      */
  #define RADIO_INTPEND10_DFEEND_Min (0x0UL)         /*!< Min enumerator value of DFEEND field.                                */
  #define RADIO_INTPEND10_DFEEND_Max (0x1UL)         /*!< Max enumerator value of DFEEND field.                                */
  #define RADIO_INTPEND10_DFEEND_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_DFEEND_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* MODEWRITTEN @Bit 26 : Read pending status of interrupt for event MODEWRITTEN */
  #define RADIO_INTPEND10_MODEWRITTEN_Pos (26UL)     /*!< Position of MODEWRITTEN field.                                       */
  #define RADIO_INTPEND10_MODEWRITTEN_Msk (0x1UL << RADIO_INTPEND10_MODEWRITTEN_Pos) /*!< Bit mask of MODEWRITTEN field.       */
  #define RADIO_INTPEND10_MODEWRITTEN_Min (0x0UL)    /*!< Min enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTPEND10_MODEWRITTEN_Max (0x1UL)    /*!< Max enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTPEND10_MODEWRITTEN_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define RADIO_INTPEND10_MODEWRITTEN_Pending (0x1UL) /*!< Read: Pending                                                       */

/* MODEREADY @Bit 27 : Read pending status of interrupt for event MODEREADY */
  #define RADIO_INTPEND10_MODEREADY_Pos (27UL)       /*!< Position of MODEREADY field.                                         */
  #define RADIO_INTPEND10_MODEREADY_Msk (0x1UL << RADIO_INTPEND10_MODEREADY_Pos) /*!< Bit mask of MODEREADY field.             */
  #define RADIO_INTPEND10_MODEREADY_Min (0x0UL)      /*!< Min enumerator value of MODEREADY field.                             */
  #define RADIO_INTPEND10_MODEREADY_Max (0x1UL)      /*!< Max enumerator value of MODEREADY field.                             */
  #define RADIO_INTPEND10_MODEREADY_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND10_MODEREADY_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* CTEEND @Bit 28 : Read pending status of interrupt for event CTEEND */
  #define RADIO_INTPEND10_CTEEND_Pos (28UL)          /*!< Position of CTEEND field.                                            */
  #define RADIO_INTPEND10_CTEEND_Msk (0x1UL << RADIO_INTPEND10_CTEEND_Pos) /*!< Bit mask of CTEEND field.                      */
  #define RADIO_INTPEND10_CTEEND_Min (0x0UL)         /*!< Min enumerator value of CTEEND field.                                */
  #define RADIO_INTPEND10_CTEEND_Max (0x1UL)         /*!< Max enumerator value of CTEEND field.                                */
  #define RADIO_INTPEND10_CTEEND_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_CTEEND_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* LBREADY @Bit 29 : Read pending status of interrupt for event LBREADY */
  #define RADIO_INTPEND10_LBREADY_Pos (29UL)         /*!< Position of LBREADY field.                                           */
  #define RADIO_INTPEND10_LBREADY_Msk (0x1UL << RADIO_INTPEND10_LBREADY_Pos) /*!< Bit mask of LBREADY field.                   */
  #define RADIO_INTPEND10_LBREADY_Min (0x0UL)        /*!< Min enumerator value of LBREADY field.                               */
  #define RADIO_INTPEND10_LBREADY_Max (0x1UL)        /*!< Max enumerator value of LBREADY field.                               */
  #define RADIO_INTPEND10_LBREADY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_LBREADY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CALDONE @Bit 30 : Read pending status of interrupt for event CALDONE */
  #define RADIO_INTPEND10_CALDONE_Pos (30UL)         /*!< Position of CALDONE field.                                           */
  #define RADIO_INTPEND10_CALDONE_Msk (0x1UL << RADIO_INTPEND10_CALDONE_Pos) /*!< Bit mask of CALDONE field.                   */
  #define RADIO_INTPEND10_CALDONE_Min (0x0UL)        /*!< Min enumerator value of CALDONE field.                               */
  #define RADIO_INTPEND10_CALDONE_Max (0x1UL)        /*!< Max enumerator value of CALDONE field.                               */
  #define RADIO_INTPEND10_CALDONE_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_CALDONE_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CHNOUPDATED @Bit 31 : Read pending status of interrupt for event CHNOUPDATED */
  #define RADIO_INTPEND10_CHNOUPDATED_Pos (31UL)     /*!< Position of CHNOUPDATED field.                                       */
  #define RADIO_INTPEND10_CHNOUPDATED_Msk (0x1UL << RADIO_INTPEND10_CHNOUPDATED_Pos) /*!< Bit mask of CHNOUPDATED field.       */
  #define RADIO_INTPEND10_CHNOUPDATED_Min (0x0UL)    /*!< Min enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTPEND10_CHNOUPDATED_Max (0x1UL)    /*!< Max enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTPEND10_CHNOUPDATED_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define RADIO_INTPEND10_CHNOUPDATED_Pending (0x1UL) /*!< Read: Pending                                                       */


