adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_INTPEND11: Pending interrupts */
  #define RADIO_INTPEND11_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND11 register.                                   */

/* TXTIMERMATCH @Bit 1 : Read pending status of interrupt for event TXTIMERMATCH */
  #define RADIO_INTPEND11_TXTIMERMATCH_Pos (1UL)     /*!< Position of TXTIMERMATCH field.                                      */
  #define RADIO_INTPEND11_TXTIMERMATCH_Msk (0x1UL << RADIO_INTPEND11_TXTIMERMATCH_Pos) /*!< Bit mask of TXTIMERMATCH field.    */
  #define RADIO_INTPEND11_TXTIMERMATCH_Min (0x0UL)   /*!< Min enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTPEND11_TXTIMERMATCH_Max (0x1UL)   /*!< Max enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTPEND11_TXTIMERMATCH_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define RADIO_INTPEND11_TXTIMERMATCH_Pending (0x1UL) /*!< Read: Pending                                                      */

/* RXTIMERMATCH @Bit 2 : Read pending status of interrupt for event RXTIMERMATCH */
  #define RADIO_INTPEND11_RXTIMERMATCH_Pos (2UL)     /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTPEND11_RXTIMERMATCH_Msk (0x1UL << RADIO_INTPEND11_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.    */
  #define RADIO_INTPEND11_RXTIMERMATCH_Min (0x0UL)   /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTPEND11_RXTIMERMATCH_Max (0x1UL)   /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTPEND11_RXTIMERMATCH_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define RADIO_INTPEND11_RXTIMERMATCH_Pending (0x1UL) /*!< Read: Pending                                                      */

/* BESPOKEACK @Bit 3 : Read pending status of interrupt for event BESPOKEACK */
  #define RADIO_INTPEND11_BESPOKEACK_Pos (3UL)       /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTPEND11_BESPOKEACK_Msk (0x1UL << RADIO_INTPEND11_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.          */
  #define RADIO_INTPEND11_BESPOKEACK_Min (0x0UL)     /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTPEND11_BESPOKEACK_Max (0x1UL)     /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTPEND11_BESPOKEACK_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND11_BESPOKEACK_Pending (0x1UL) /*!< Read: Pending                                                        */

/* TXADDRESS @Bit 14 : Read pending status of interrupt for event TXADDRESS */
  #define RADIO_INTPEND11_TXADDRESS_Pos (14UL)       /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTPEND11_TXADDRESS_Msk (0x1UL << RADIO_INTPEND11_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.             */
  #define RADIO_INTPEND11_TXADDRESS_Min (0x0UL)      /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTPEND11_TXADDRESS_Max (0x1UL)      /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTPEND11_TXADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND11_TXADDRESS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* RXADDRESS @Bit 15 : Read pending status of interrupt for event RXADDRESS */
  #define RADIO_INTPEND11_RXADDRESS_Pos (15UL)       /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTPEND11_RXADDRESS_Msk (0x1UL << RADIO_INTPEND11_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.             */
  #define RADIO_INTPEND11_RXADDRESS_Min (0x0UL)      /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTPEND11_RXADDRESS_Max (0x1UL)      /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTPEND11_RXADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND11_RXADDRESS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* ACQINJ0DMAEND @Bit 16 : Read pending status of interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Pos (16UL)   /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTPEND11_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND field. */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Min (0x0UL)  /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Max (0x1UL)  /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Pending (0x1UL) /*!< Read: Pending                                                     */

/* ACQINJ1DMAEND @Bit 17 : Read pending status of interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Pos (17UL)   /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTPEND11_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND field. */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Min (0x0UL)  /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Max (0x1UL)  /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Pending (0x1UL) /*!< Read: Pending                                                     */

/* CSTONESEND @Bit 18 : Read pending status of interrupt for event CSTONESEND */
  #define RADIO_INTPEND11_CSTONESEND_Pos (18UL)      /*!< Position of CSTONESEND field.                                        */
  #define RADIO_INTPEND11_CSTONESEND_Msk (0x1UL << RADIO_INTPEND11_CSTONESEND_Pos) /*!< Bit mask of CSTONESEND field.          */
  #define RADIO_INTPEND11_CSTONESEND_Min (0x0UL)     /*!< Min enumerator value of CSTONESEND field.                            */
  #define RADIO_INTPEND11_CSTONESEND_Max (0x1UL)     /*!< Max enumerator value of CSTONESEND field.                            */
  #define RADIO_INTPEND11_CSTONESEND_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND11_CSTONESEND_Pending (0x1UL) /*!< Read: Pending                                                        */


/* RADIO_MODE: Data rate and modulation */
  #define RADIO_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..3 : Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation. */
  #define RADIO_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define RADIO_MODE_MODE_Msk (0xFUL << RADIO_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define RADIO_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define RADIO_MODE_MODE_Max (0xFUL)                /*!< Max enumerator value of MODE field.                                  */
  #define RADIO_MODE_MODE_Nrf_1Mbit (0x0UL)          /*!< 1 Mbps Nordic proprietary radio mode                                 */
  #define RADIO_MODE_MODE_Nrf_2Mbit (0x1UL)          /*!< 2 Mbps Nordic proprietary radio mode                                 */
  #define RADIO_MODE_MODE_Nrf_250Kbit (0x2UL)        /*!< 250 kbps Nordic proprietary radio mode                               */
  #define RADIO_MODE_MODE_Ble_1Mbit (0x3UL)          /*!< 1 Mbps BLE                                                           */
  #define RADIO_MODE_MODE_Ble_2Mbit (0x4UL)          /*!< 2 Mbps BLE                                                           */
  #define RADIO_MODE_MODE_Ble_LR125Kbit (0x5UL)      /*!< Long range 125 kbps TX, 125 kbps and 500 kbps RX                     */
  #define RADIO_MODE_MODE_Ble_LR500Kbit (0x6UL)      /*!< Long range 500 kbps TX, 125 kbps and 500 kbps RX                     */
  #define RADIO_MODE_MODE_Nrf_4Mbit0_5 (0x9UL)       /*!< 4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.5)                  */
  #define RADIO_MODE_MODE_Nrf_4Mbit0_25 (0xAUL)      /*!< 4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.25)                 */
  #define RADIO_MODE_MODE_Ieee802154_250Kbit (0xFUL) /*!< IEEE 802.15.4-2006 250 kbps                                          */


/* RADIO_MODEINTERNAL: Internal mode setting, active only when MODEPROGENABLE==1 */
  #define RADIO_MODEINTERNAL_ResetValue (0x00000000UL) /*!< Reset value of MODEINTERNAL register.                              */

/* MODEINTERNAL @Bits 0..3 : Radio data rate and modulation setting. Same definition as MODE. */
  #define RADIO_MODEINTERNAL_MODEINTERNAL_Pos (0UL)  /*!< Position of MODEINTERNAL field.                                      */
  #define RADIO_MODEINTERNAL_MODEINTERNAL_Msk (0xFUL << RADIO_MODEINTERNAL_MODEINTERNAL_Pos) /*!< Bit mask of MODEINTERNAL
                                                                            field.*/


/* RADIO_MODEPROGENABLE: Switch that enables programmable modes */
  #define RADIO_MODEPROGENABLE_ResetValue (0x00000000UL) /*!< Reset value of MODEPROGENABLE register.                          */

/* MODEPROGENABLE @Bit 0 : Enable manual triggering of MODEREADY event and activate MODEINTERNAL register (ie. MODEINTERNAL
                           overrides MODE register) */

  #define RADIO_MODEPROGENABLE_MODEPROGENABLE_Pos (0UL) /*!< Position of MODEPROGENABLE field.                                 */
  #define RADIO_MODEPROGENABLE_MODEPROGENABLE_Msk (0x1UL << RADIO_MODEPROGENABLE_MODEPROGENABLE_Pos) /*!< Bit mask of
                                                                            MODEPROGENABLE field.*/


/* RADIO_MODECNF: Radio mode configuration register */
  #define RADIO_MODECNF_ResetValue (0x00000010UL)    /*!< Reset value of MODECNF register.                                     */

/* ZEROIF @Bit 1 : Zero-IF mode */
  #define RADIO_MODECNF_ZEROIF_Pos (1UL)             /*!< Position of ZEROIF field.                                            */
  #define RADIO_MODECNF_ZEROIF_Msk (0x1UL << RADIO_MODECNF_ZEROIF_Pos) /*!< Bit mask of ZEROIF field.                          */
  #define RADIO_MODECNF_ZEROIF_Min (0x0UL)           /*!< Min enumerator value of ZEROIF field.                                */
  #define RADIO_MODECNF_ZEROIF_Max (0x1UL)           /*!< Max enumerator value of ZEROIF field.                                */
  #define RADIO_MODECNF_ZEROIF_Default (0x0UL)       /*!< Default mode (heterodyne)                                            */
  #define RADIO_MODECNF_ZEROIF_ZeroIF (0x1UL)        /*!< Zero-IF mode                                                         */

/* SSEL @Bit 2 : Sideband select */
  #define RADIO_MODECNF_SSEL_Pos (2UL)               /*!< Position of SSEL field.                                              */
  #define RADIO_MODECNF_SSEL_Msk (0x1UL << RADIO_MODECNF_SSEL_Pos) /*!< Bit mask of SSEL field.                                */
  #define RADIO_MODECNF_SSEL_Min (0x0UL)             /*!< Min enumerator value of SSEL field.                                  */
  #define RADIO_MODECNF_SSEL_Max (0x1UL)             /*!< Max enumerator value of SSEL field.                                  */
  #define RADIO_MODECNF_SSEL_Low (0x0UL)             /*!< Low-side LO                                                          */
  #define RADIO_MODECNF_SSEL_High (0x1UL)            /*!< High-side LO                                                         */

/* DTX @Bits 3..4 : Default TX value. Specifies what the RADIO will transmit when it is not started, i.e. between:
                    RADIO.EVENTS_READY and RADIO.TASKS_START RADIO.EVENTS_END and RADIO.TASKS_START RADIO.EVENTS_END and
                    RADIO.EVENTS_DISABLED) */

  #define RADIO_MODECNF_DTX_Pos (3UL)                /*!< Position of DTX field.                                               */
  #define RADIO_MODECNF_DTX_Msk (0x3UL << RADIO_MODECNF_DTX_Pos) /*!< Bit mask of DTX field.                                   */
  #define RADIO_MODECNF_DTX_Min (0x0UL)              /*!< Min enumerator value of DTX field.                                   */
  #define RADIO_MODECNF_DTX_Max (0x2UL)              /*!< Max enumerator value of DTX field.                                   */
  #define RADIO_MODECNF_DTX_B1 (0x0UL)               /*!< Transmit '1'                                                         */
  #define RADIO_MODECNF_DTX_B0 (0x1UL)               /*!< Transmit '0'                                                         */
  #define RADIO_MODECNF_DTX_Center (0x2UL)           /*!< Transmit center frequency When tuning the crystal for centre
                                                          frequency, the RADIO must be set in DTX = Center mode to be able to
                                                          achieve the expected accuracy. This is only a valid setting for
                                                          Nrf_1Mbit, Nrf_2Mbit, Nrf_250kbit, Ble_1Mbit and Ble_2Mbit.*/

/* IQMODLOOPBACK @Bit 5 : Loopback from IQ modulator */
  #define RADIO_MODECNF_IQMODLOOPBACK_Pos (5UL)      /*!< Position of IQMODLOOPBACK field.                                     */
  #define RADIO_MODECNF_IQMODLOOPBACK_Msk (0x1UL << RADIO_MODECNF_IQMODLOOPBACK_Pos) /*!< Bit mask of IQMODLOOPBACK field.     */
  #define RADIO_MODECNF_IQMODLOOPBACK_Min (0x0UL)    /*!< Min enumerator value of IQMODLOOPBACK field.                         */
  #define RADIO_MODECNF_IQMODLOOPBACK_Max (0x1UL)    /*!< Max enumerator value of IQMODLOOPBACK field.                         */
  #define RADIO_MODECNF_IQMODLOOPBACK_Off (0x0UL)    /*!< Digital loopback off                                                 */
  #define RADIO_MODECNF_IQMODLOOPBACK_On (0x1UL)     /*!< Digital loopback on                                                  */

/* IQRAMSEL @Bit 6 : IQ RAM select */
  #define RADIO_MODECNF_IQRAMSEL_Pos (6UL)           /*!< Position of IQRAMSEL field.                                          */
  #define RADIO_MODECNF_IQRAMSEL_Msk (0x1UL << RADIO_MODECNF_IQRAMSEL_Pos) /*!< Bit mask of IQRAMSEL field.                    */
  #define RADIO_MODECNF_IQRAMSEL_Min (0x0UL)         /*!< Min enumerator value of IQRAMSEL field.                              */
  #define RADIO_MODECNF_IQRAMSEL_Max (0x1UL)         /*!< Max enumerator value of IQRAMSEL field.                              */
  #define RADIO_MODECNF_IQRAMSEL_off (0x0UL)         /*!< IQ RAM select off                                                    */
  #define RADIO_MODECNF_IQRAMSEL_on (0x1UL)          /*!< IQ RAM select on                                                     */


/* RADIO_MISC: Misc configuration collection (to be renamed when more bits are defined) */
  #define RADIO_MISC_ResetValue (0x00000004UL)       /*!< Reset value of MISC register.                                        */

/* DISABLEADDRWINDOW @Bit 0 : (unspecified) */
  #define RADIO_MISC_DISABLEADDRWINDOW_Pos (0UL)     /*!< Position of DISABLEADDRWINDOW field.                                 */
  #define RADIO_MISC_DISABLEADDRWINDOW_Msk (0x1UL << RADIO_MISC_DISABLEADDRWINDOW_Pos) /*!< Bit mask of DISABLEADDRWINDOW
                                                                            field.*/
  #define RADIO_MISC_DISABLEADDRWINDOW_Min (0x0UL)   /*!< Min enumerator value of DISABLEADDRWINDOW field.                     */
  #define RADIO_MISC_DISABLEADDRWINDOW_Max (0x1UL)   /*!< Max enumerator value of DISABLEADDRWINDOW field.                     */
  #define RADIO_MISC_DISABLEADDRWINDOW_Disabled (0x1UL) /*!< Disable                                                           */
  #define RADIO_MISC_DISABLEADDRWINDOW_Enabled (0x0UL) /*!< Enable                                                             */

