adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* AGCFREEZEAFTERREF @Bit 1 : (unspecified) */
  #define RADIO_MISC_AGCFREEZEAFTERREF_Pos (1UL)     /*!< Position of AGCFREEZEAFTERREF field.                                 */
  #define RADIO_MISC_AGCFREEZEAFTERREF_Msk (0x1UL << RADIO_MISC_AGCFREEZEAFTERREF_Pos) /*!< Bit mask of AGCFREEZEAFTERREF
                                                                            field.*/
  #define RADIO_MISC_AGCFREEZEAFTERREF_Min (0x0UL)   /*!< Min enumerator value of AGCFREEZEAFTERREF field.                     */
  #define RADIO_MISC_AGCFREEZEAFTERREF_Max (0x1UL)   /*!< Max enumerator value of AGCFREEZEAFTERREF field.                     */
  #define RADIO_MISC_AGCFREEZEAFTERREF_EntireCTE (0x0UL) /*!< Gain freeze will apply to whole CTE,                             */
  #define RADIO_MISC_AGCFREEZEAFTERREF_AfterRefPeriod (0x1UL) /*!< Gain freeze will apply to only after reference period of
                                                                   CTE.*/

/* AGCFREEZEGAINENABLE @Bit 2 : Override AGC gain setting during CTE (from QOVERRIDE10) */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Pos (2UL)   /*!< Position of AGCFREEZEGAINENABLE field.                               */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Msk (0x1UL << RADIO_MISC_AGCFREEZEGAINENABLE_Pos) /*!< Bit mask of AGCFREEZEGAINENABLE
                                                                            field.*/
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Min (0x0UL) /*!< Min enumerator value of AGCFREEZEGAINENABLE field.                   */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Max (0x1UL) /*!< Max enumerator value of AGCFREEZEGAINENABLE field.                   */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Adjust (0x0UL) /*!< AGC gain settings will keep adjusting during CTE                  */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Freeze (0x1UL) /*!< AGC gain settings will freeze (not keep adjusting) during CTE     */


/* RADIO_STATE: Current radio state */
  #define RADIO_STATE_ResetValue (0x00000000UL)      /*!< Reset value of STATE register.                                       */

/* STATE @Bits 0..3 : Current radio state */
  #define RADIO_STATE_STATE_Pos (0UL)                /*!< Position of STATE field.                                             */
  #define RADIO_STATE_STATE_Msk (0xFUL << RADIO_STATE_STATE_Pos) /*!< Bit mask of STATE field.                                 */
  #define RADIO_STATE_STATE_Min (0x0UL)              /*!< Min enumerator value of STATE field.                                 */
  #define RADIO_STATE_STATE_Max (0xCUL)              /*!< Max enumerator value of STATE field.                                 */
  #define RADIO_STATE_STATE_Disabled (0x0UL)         /*!< RADIO is in the Disabled state                                       */
  #define RADIO_STATE_STATE_RxRu (0x1UL)             /*!< RADIO is in the RXRU state                                           */
  #define RADIO_STATE_STATE_RxIdle (0x2UL)           /*!< RADIO is in the RXIDLE state                                         */
  #define RADIO_STATE_STATE_Rx (0x3UL)               /*!< RADIO is in the RX state                                             */
  #define RADIO_STATE_STATE_RxDisable (0x4UL)        /*!< RADIO is in the RXDISABLED state                                     */
  #define RADIO_STATE_STATE_TxRu (0x9UL)             /*!< RADIO is in the TXRU state                                           */
  #define RADIO_STATE_STATE_TxIdle (0xAUL)           /*!< RADIO is in the TXIDLE state                                         */
  #define RADIO_STATE_STATE_Tx (0xBUL)               /*!< RADIO is in the TX state                                             */
  #define RADIO_STATE_STATE_TxDisable (0xCUL)        /*!< RADIO is in the TXDISABLED state                                     */


/* RADIO_EDCTRL: IEEE 802.15.4 energy detect control */
  #define RADIO_EDCTRL_ResetValue (0x20000000UL)     /*!< Reset value of EDCTRL register.                                      */

/* EDCNT @Bits 0..20 : IEEE 802.15.4 energy detect loop count */
  #define RADIO_EDCTRL_EDCNT_Pos (0UL)               /*!< Position of EDCNT field.                                             */
  #define RADIO_EDCTRL_EDCNT_Msk (0x1FFFFFUL << RADIO_EDCTRL_EDCNT_Pos) /*!< Bit mask of EDCNT field.                          */

/* EDPERIOD @Bits 24..29 : IEEE 802.15.4 energy detect period, 4us resolution, no averaging except the IEEE 802.15.4 ED range
                           128us (32) */

  #define RADIO_EDCTRL_EDPERIOD_Pos (24UL)           /*!< Position of EDPERIOD field.                                          */
  #define RADIO_EDCTRL_EDPERIOD_Msk (0x3FUL << RADIO_EDCTRL_EDPERIOD_Pos) /*!< Bit mask of EDPERIOD field.                     */


/* RADIO_EDSAMPLE: IEEE 802.15.4 energy detect level */
  #define RADIO_EDSAMPLE_ResetValue (0x00000000UL)   /*!< Reset value of EDSAMPLE register.                                    */

/* EDLVL @Bits 0..7 : IEEE 802.15.4 energy detect level */
  #define RADIO_EDSAMPLE_EDLVL_Pos (0UL)             /*!< Position of EDLVL field.                                             */
  #define RADIO_EDSAMPLE_EDLVL_Msk (0xFFUL << RADIO_EDSAMPLE_EDLVL_Pos) /*!< Bit mask of EDLVL field.                          */
  #define RADIO_EDSAMPLE_EDLVL_Min (0x00UL)          /*!< Min value of EDLVL field.                                            */
  #define RADIO_EDSAMPLE_EDLVL_Max (0x7FUL)          /*!< Max size of EDLVL field.                                             */


/* RADIO_CCACTRL: IEEE 802.15.4 clear channel assessment control */
  #define RADIO_CCACTRL_ResetValue (0x052D0000UL)    /*!< Reset value of CCACTRL register.                                     */

/* CCAMODE @Bits 0..2 : CCA mode of operation */
  #define RADIO_CCACTRL_CCAMODE_Pos (0UL)            /*!< Position of CCAMODE field.                                           */
  #define RADIO_CCACTRL_CCAMODE_Msk (0x7UL << RADIO_CCACTRL_CCAMODE_Pos) /*!< Bit mask of CCAMODE field.                       */
  #define RADIO_CCACTRL_CCAMODE_Min (0x0UL)          /*!< Min enumerator value of CCAMODE field.                               */
  #define RADIO_CCACTRL_CCAMODE_Max (0x4UL)          /*!< Max enumerator value of CCAMODE field.                               */
  #define RADIO_CCACTRL_CCAMODE_EdMode (0x0UL)       /*!< Energy above threshold                                               */
  #define RADIO_CCACTRL_CCAMODE_CarrierMode (0x1UL)  /*!< Carrier seen                                                         */
  #define RADIO_CCACTRL_CCAMODE_CarrierAndEdMode (0x2UL) /*!< Energy above threshold AND carrier seen                          */
  #define RADIO_CCACTRL_CCAMODE_CarrierOrEdMode (0x3UL) /*!< Energy above threshold OR carrier seen                            */
  #define RADIO_CCACTRL_CCAMODE_EdModeTest1 (0x4UL)  /*!< Energy above threshold test mode that will abort when first ED
                                                          measurement over threshold is seen. No averaging.*/

