adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CCAEDTHRES @Bits 8..15 : CCA energy busy threshold. Used in all the CCA modes except CarrierMode. */
  #define RADIO_CCACTRL_CCAEDTHRES_Pos (8UL)         /*!< Position of CCAEDTHRES field.                                        */
  #define RADIO_CCACTRL_CCAEDTHRES_Msk (0xFFUL << RADIO_CCACTRL_CCAEDTHRES_Pos) /*!< Bit mask of CCAEDTHRES field.             */

/* CCACORRTHRES @Bits 16..23 : CCA correlator busy threshold. Only relevant to CarrierMode, CarrierAndEdMode, and
                               CarrierOrEdMode. */

  #define RADIO_CCACTRL_CCACORRTHRES_Pos (16UL)      /*!< Position of CCACORRTHRES field.                                      */
  #define RADIO_CCACTRL_CCACORRTHRES_Msk (0xFFUL << RADIO_CCACTRL_CCACORRTHRES_Pos) /*!< Bit mask of CCACORRTHRES field.       */

/* CCACORRCNT @Bits 24..31 : Limit for occurances above CCACORRTHRES. When not equal to zero the corrolator based signal detect
                             is enabled. */

  #define RADIO_CCACTRL_CCACORRCNT_Pos (24UL)        /*!< Position of CCACORRCNT field.                                        */
  #define RADIO_CCACTRL_CCACORRCNT_Msk (0xFFUL << RADIO_CCACTRL_CCACORRCNT_Pos) /*!< Bit mask of CCACORRCNT field.             */


/* RADIO_DATAWHITEIV: Data whitening initial value */
  #define RADIO_DATAWHITEIV_ResetValue (0x00000040UL) /*!< Reset value of DATAWHITEIV register.                                */

/* DATAWHITEIV @Bits 0..5 : (unspecified) */
  #define RADIO_DATAWHITEIV_DATAWHITEIV_Pos (0UL)    /*!< Position of DATAWHITEIV field.                                       */
  #define RADIO_DATAWHITEIV_DATAWHITEIV_Msk (0x3FUL << RADIO_DATAWHITEIV_DATAWHITEIV_Pos) /*!< Bit mask of DATAWHITEIV field.  */


/* RADIO_GAINOUT: Gain readout (LNA_OUT_SPI for nrf52/53) */
  #define RADIO_GAINOUT_ResetValue (0x00000000UL)    /*!< Reset value of GAINOUT register.                                     */

/* LNAGAIN @Bits 0..1 : (unspecified) */
  #define RADIO_GAINOUT_LNAGAIN_Pos (0UL)            /*!< Position of LNAGAIN field.                                           */
  #define RADIO_GAINOUT_LNAGAIN_Msk (0x3UL << RADIO_GAINOUT_LNAGAIN_Pos) /*!< Bit mask of LNAGAIN field.                       */

/* MIXGAIN @Bit 8 : (unspecified) */
  #define RADIO_GAINOUT_MIXGAIN_Pos (8UL)            /*!< Position of MIXGAIN field.                                           */
  #define RADIO_GAINOUT_MIXGAIN_Msk (0x1UL << RADIO_GAINOUT_MIXGAIN_Pos) /*!< Bit mask of MIXGAIN field.                       */

/* AAFGAIN @Bits 12..15 : (unspecified) */
  #define RADIO_GAINOUT_AAFGAIN_Pos (12UL)           /*!< Position of AAFGAIN field.                                           */
  #define RADIO_GAINOUT_AAFGAIN_Msk (0xFUL << RADIO_GAINOUT_AAFGAIN_Pos) /*!< Bit mask of AAFGAIN field.                       */


/* RADIO_SOFTRESETLEVEL: Configure what level of reset is caused by TASKS_SOFTRESET in each of the submodules. At level 0, FSMs
                          and public registers (including non-public fields) are reset. At level 1, also non-public registers
                          are reset. */

  #define RADIO_SOFTRESETLEVEL_ResetValue (0x00000000UL) /*!< Reset value of SOFTRESETLEVEL register.                          */

/* MODEM @Bit 0 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_MODEM_Pos (0UL)       /*!< Position of MODEM field.                                             */
  #define RADIO_SOFTRESETLEVEL_MODEM_Msk (0x1UL << RADIO_SOFTRESETLEVEL_MODEM_Pos) /*!< Bit mask of MODEM field.               */

/* RADIOANA @Bit 1 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_RADIOANA_Pos (1UL)    /*!< Position of RADIOANA field.                                          */
  #define RADIO_SOFTRESETLEVEL_RADIOANA_Msk (0x1UL << RADIO_SOFTRESETLEVEL_RADIOANA_Pos) /*!< Bit mask of RADIOANA field.      */

/* ADPLLCOMP @Bit 2 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_ADPLLCOMP_Pos (2UL)   /*!< Position of ADPLLCOMP field.                                         */
  #define RADIO_SOFTRESETLEVEL_ADPLLCOMP_Msk (0x1UL << RADIO_SOFTRESETLEVEL_ADPLLCOMP_Pos) /*!< Bit mask of ADPLLCOMP field.   */

/* RXFE @Bit 3 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_RXFE_Pos (3UL)        /*!< Position of RXFE field.                                              */
  #define RADIO_SOFTRESETLEVEL_RXFE_Msk (0x1UL << RADIO_SOFTRESETLEVEL_RXFE_Pos) /*!< Bit mask of RXFE field.                  */

/* RXBB @Bit 4 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_RXBB_Pos (4UL)        /*!< Position of RXBB field.                                              */
  #define RADIO_SOFTRESETLEVEL_RXBB_Msk (0x1UL << RADIO_SOFTRESETLEVEL_RXBB_Pos) /*!< Bit mask of RXBB field.                  */

/* TX @Bit 5 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_TX_Pos (5UL)          /*!< Position of TX field.                                                */
  #define RADIO_SOFTRESETLEVEL_TX_Msk (0x1UL << RADIO_SOFTRESETLEVEL_TX_Pos) /*!< Bit mask of TX field.                        */

/* DFE @Bit 6 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_DFE_Pos (6UL)         /*!< Position of DFE field.                                               */
  #define RADIO_SOFTRESETLEVEL_DFE_Msk (0x1UL << RADIO_SOFTRESETLEVEL_DFE_Pos) /*!< Bit mask of DFE field.                     */

/* MAC @Bit 7 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_MAC_Pos (7UL)         /*!< Position of MAC field.                                               */
  #define RADIO_SOFTRESETLEVEL_MAC_Msk (0x1UL << RADIO_SOFTRESETLEVEL_MAC_Pos) /*!< Bit mask of MAC field.                     */

/* LBMAC @Bit 8 : (unspecified) */
  #define RADIO_SOFTRESETLEVEL_LBMAC_Pos (8UL)       /*!< Position of LBMAC field.                                             */
  #define RADIO_SOFTRESETLEVEL_LBMAC_Msk (0x1UL << RADIO_SOFTRESETLEVEL_LBMAC_Pos) /*!< Bit mask of LBMAC field.               */


/* RADIO_SHORTCUTANA: Internal shortcuts for RADIO PHY */
  #define RADIO_SHORTCUTANA_ResetValue (0x00000000UL) /*!< Reset value of SHORTCUTANA register.                                */

/* TXREADYCALSTART @Bit 0 : Internal shortcut */
  #define RADIO_SHORTCUTANA_TXREADYCALSTART_Pos (0UL) /*!< Position of TXREADYCALSTART field.                                  */
  #define RADIO_SHORTCUTANA_TXREADYCALSTART_Msk (0x1UL << RADIO_SHORTCUTANA_TXREADYCALSTART_Pos) /*!< Bit mask of
                                                                            TXREADYCALSTART field.*/

/* RXREADYCALSTART @Bit 1 : Internal shortcut */
  #define RADIO_SHORTCUTANA_RXREADYCALSTART_Pos (1UL) /*!< Position of RXREADYCALSTART field.                                  */
  #define RADIO_SHORTCUTANA_RXREADYCALSTART_Msk (0x1UL << RADIO_SHORTCUTANA_RXREADYCALSTART_Pos) /*!< Bit mask of
                                                                            RXREADYCALSTART field.*/

/* LBREADYCALSTART @Bit 2 : Internal shortcut */
  #define RADIO_SHORTCUTANA_LBREADYCALSTART_Pos (2UL) /*!< Position of LBREADYCALSTART field.                                  */
  #define RADIO_SHORTCUTANA_LBREADYCALSTART_Msk (0x1UL << RADIO_SHORTCUTANA_LBREADYCALSTART_Pos) /*!< Bit mask of
                                                                            LBREADYCALSTART field.*/

/* CALDONEDISABLE @Bit 5 : Internal shortcut */
  #define RADIO_SHORTCUTANA_CALDONEDISABLE_Pos (5UL) /*!< Position of CALDONEDISABLE field.                                    */
  #define RADIO_SHORTCUTANA_CALDONEDISABLE_Msk (0x1UL << RADIO_SHORTCUTANA_CALDONEDISABLE_Pos) /*!< Bit mask of CALDONEDISABLE
                                                                            field.*/


/* RADIO_TIMING: Timing */
  #define RADIO_TIMING_ResetValue (0x00000001UL)     /*!< Reset value of TIMING register.                                      */

