adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RU @Bit 0 : 0: Legacy ramp-up time, compatible with 180nm radio. 1: Default fast ramp-up. */
  #define RADIO_TIMING_RU_Pos (0UL)                  /*!< Position of RU field.                                                */
  #define RADIO_TIMING_RU_Msk (0x1UL << RADIO_TIMING_RU_Pos) /*!< Bit mask of RU field.                                        */


/* RADIO_FREQUENCY: Frequency */
  #define RADIO_FREQUENCY_ResetValue (0x00000002UL)  /*!< Reset value of FREQUENCY register.                                   */

/* FREQUENCY @Bits 0..6 : Radio channel frequency. Frequency = 2400 + FREQUENCY (MHz). */
  #define RADIO_FREQUENCY_FREQUENCY_Pos (0UL)        /*!< Position of FREQUENCY field.                                         */
  #define RADIO_FREQUENCY_FREQUENCY_Msk (0x7FUL << RADIO_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field.            */

/* MAP @Bit 8 : Channel map selection. 0: Channel map between 2400 MHZ to 2500 MHz, Frequency = 2400 + FREQUENCY (MHz). 1:
                Channel map between 2360 MHZ to 2460 MHz, Frequency = 2360 + FREQUENCY (MHz). */

  #define RADIO_FREQUENCY_MAP_Pos (8UL)              /*!< Position of MAP field.                                               */
  #define RADIO_FREQUENCY_MAP_Msk (0x1UL << RADIO_FREQUENCY_MAP_Pos) /*!< Bit mask of MAP field.                               */


/* RADIO_FREQUENCYCONFIG: Configuration of frequency control */
  #define RADIO_FREQUENCYCONFIG_ResetValue (0x80000001UL) /*!< Reset value of FREQUENCYCONFIG register.                        */

/* FSCHNOINCRSTEP @Bits 0..5 : Radio channel incremental step unit */
  #define RADIO_FREQUENCYCONFIG_FSCHNOINCRSTEP_Pos (0UL) /*!< Position of FSCHNOINCRSTEP field.                                */
  #define RADIO_FREQUENCYCONFIG_FSCHNOINCRSTEP_Msk (0x3FUL << RADIO_FREQUENCYCONFIG_FSCHNOINCRSTEP_Pos) /*!< Bit mask of
                                                                            FSCHNOINCRSTEP field.*/

/* BUFFEREDFSCH @Bit 31 : Set to high to buffer FREQUENCY register so that sub-modules in the MMI will only update next
                          frequency config at TX_EN, RX_EN and LB_EN. Set to low if special test is needed for FS test. */

  #define RADIO_FREQUENCYCONFIG_BUFFEREDFSCH_Pos (31UL) /*!< Position of BUFFEREDFSCH field.                                   */
  #define RADIO_FREQUENCYCONFIG_BUFFEREDFSCH_Msk (0x1UL << RADIO_FREQUENCYCONFIG_BUFFEREDFSCH_Pos) /*!< Bit mask of BUFFEREDFSCH
                                                                            field.*/


/* RADIO_TXPOWER: Output power */
  #define RADIO_TXPOWER_ResetValue (0x0000000EUL)    /*!< Reset value of TXPOWER register.                                     */

/* TXPOWER @Bits 0..4 : RADIO output power */
  #define RADIO_TXPOWER_TXPOWER_Pos (0UL)            /*!< Position of TXPOWER field.                                           */
  #define RADIO_TXPOWER_TXPOWER_Msk (0x1FUL << RADIO_TXPOWER_TXPOWER_Pos) /*!< Bit mask of TXPOWER field.                      */
  #define RADIO_TXPOWER_TXPOWER_Min (0x0UL)          /*!< Min enumerator value of TXPOWER field.                               */
  #define RADIO_TXPOWER_TXPOWER_Max (0x1FUL)         /*!< Max enumerator value of TXPOWER field.                               */
  #define RADIO_TXPOWER_TXPOWER_Pos10dBm (0x01FUL)   /*!< +10 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Pos9dBm (0x01DUL)    /*!< +9 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos8dBm (0x01CUL)    /*!< +8 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos7dBm (0x01BUL)    /*!< +7 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos6dBm (0x01AUL)    /*!< +6 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos5dBm (0x019UL)    /*!< +5 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos4dBm (0x018UL)    /*!< +4 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos3dBm (0x017UL)    /*!< +3 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos2dBm (0x016UL)    /*!< +2 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos1dBm (0x00FUL)    /*!< +1 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_0dBm (0x00EUL)       /*!< 0 dBm                                                                */
  #define RADIO_TXPOWER_TXPOWER_Neg1dBm (0x00DUL)    /*!< -1 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg2dBm (0x00CUL)    /*!< -2 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg4dBm (0x00BUL)    /*!< -4 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg8dBm (0x00AUL)    /*!< -8 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg12dBm (0x009UL)   /*!< -12 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg16dBm (0x008UL)   /*!< -16 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg20dBm (0x003UL)   /*!< -20 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg30dBm (0x002UL)   /*!< -30 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg40dBm (0x001UL)   /*!< -40 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg70dBm (0x000UL)   /*!< -70 dBm                                                              */


/* RADIO_TIFS: Interframe spacing in us */
  #define RADIO_TIFS_ResetValue (0x00000000UL)       /*!< Reset value of TIFS register.                                        */

/* TIFS @Bits 0..9 : Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is
                     defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of
                     the first bit of the subsequent packet. */

  #define RADIO_TIFS_TIFS_Pos (0UL)                  /*!< Position of TIFS field.                                              */
  #define RADIO_TIFS_TIFS_Msk (0x3FFUL << RADIO_TIFS_TIFS_Pos) /*!< Bit mask of TIFS field.                                    */


