adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIO_RSSISAMPLE: RSSI sample */
  #define RADIO_RSSISAMPLE_ResetValue (0x0000007FUL) /*!< Reset value of RSSISAMPLE register.                                  */

/* RSSISAMPLE @Bits 0..6 : RSSI sample result. The value of this register is read as a positive value while the actual received
                           signal strength is a negative value. Actual received signal strength is therefore as follows:
                           received signal strength = -A dBm. */

  #define RADIO_RSSISAMPLE_RSSISAMPLE_Pos (0UL)      /*!< Position of RSSISAMPLE field.                                        */
  #define RADIO_RSSISAMPLE_RSSISAMPLE_Msk (0x7FUL << RADIO_RSSISAMPLE_RSSISAMPLE_Pos) /*!< Bit mask of RSSISAMPLE field.       */


/* RADIO_EVENTCONFIG: Event configuration */
  #define RADIO_EVENTCONFIG_ResetValue (0x00000000UL) /*!< Reset value of EVENTCONFIG register.                                */

/* TTXDISABLE @Bits 0..4 : Transition time from TXDISABLE state to DISABLED state Configurable time, in us, between
                           RADIO.EVENTS_END and RADIO.EVENTS_DISABLED when using the shortcut between RADIO.EVENTS_END and
                           RADIO.TASKS_DISABLE. The minimum time between RADIO.TASKS_DISABLE and RADIO.EVENTS_DISABLED is
                           described in the electrical parameters. The minimum time will be used if the configured time is set
                           shorter than the minimum time. Depending on configuration setting the DISABLED event may experience
                           some jitter, see electrical parameters for more information. Note: The RADIO shall be disabled as
                           normal when DISABLE task is triggered, it is only the DISABLED event that can be delayed. Note: The
                           TIFS mechanism shall not be affected by the value specified in this field. (unit: 1us) */

  #define RADIO_EVENTCONFIG_TTXDISABLE_Pos (0UL)     /*!< Position of TTXDISABLE field.                                        */
  #define RADIO_EVENTCONFIG_TTXDISABLE_Msk (0x1FUL << RADIO_EVENTCONFIG_TTXDISABLE_Pos) /*!< Bit mask of TTXDISABLE field.     */

/* TRXDISABLE @Bits 8..12 : Transition time from RXDISABLE state to DISABLED state Configurable time, in us, between
                            RADIO.EVENTS_END and RADIO.EVENTS_DISABLED when using the shortcut between RADIO.EVENTS_END and
                            RADIO.TASKS_DISABLE. The minimum time between RADIO.TASKS_DISABLE and RADIO.EVENTS_DISABLED is
                            described in electrical parameters. The minimum time will be used if the configured time is set
                            shorter than the minimum time. Depending on configuration setting the DISABLED event may experience
                            some jitter, see electrical parameters for more information. (unit: 1us) */

  #define RADIO_EVENTCONFIG_TRXDISABLE_Pos (8UL)     /*!< Position of TRXDISABLE field.                                        */
  #define RADIO_EVENTCONFIG_TRXDISABLE_Msk (0x1FUL << RADIO_EVENTCONFIG_TRXDISABLE_Pos) /*!< Bit mask of TRXDISABLE field.     */


/* RADIO_TEXTAMP: Timing control of external RADIO amplifier (LNA/PA) */
  #define RADIO_TEXTAMP_ResetValue (0x00007868UL)    /*!< Reset value of TEXTAMP register.                                     */

/* TPWRUPEXTLNA @Bits 0..7 : Timing control of PwrupExtLna (unit: 0.25us) */
  #define RADIO_TEXTAMP_TPWRUPEXTLNA_Pos (0UL)       /*!< Position of TPWRUPEXTLNA field.                                      */
  #define RADIO_TEXTAMP_TPWRUPEXTLNA_Msk (0xFFUL << RADIO_TEXTAMP_TPWRUPEXTLNA_Pos) /*!< Bit mask of TPWRUPEXTLNA field.       */

/* TPWRUPEXTPA @Bits 8..15 : Timing control of PwrupExtPa (unit: 0.25us) */
  #define RADIO_TEXTAMP_TPWRUPEXTPA_Pos (8UL)        /*!< Position of TPWRUPEXTPA field.                                       */
  #define RADIO_TEXTAMP_TPWRUPEXTPA_Msk (0xFFUL << RADIO_TEXTAMP_TPWRUPEXTPA_Pos) /*!< Bit mask of TPWRUPEXTPA field.          */

/* PWRUPEXTLNABEFORERAMPUP @Bit 30 : In legacy timing mode, pwrupExtLna can be powered on before starting to ramp up by setting
                                     this registers to 1 */

  #define RADIO_TEXTAMP_PWRUPEXTLNABEFORERAMPUP_Pos (30UL) /*!< Position of PWRUPEXTLNABEFORERAMPUP field.                     */
  #define RADIO_TEXTAMP_PWRUPEXTLNABEFORERAMPUP_Msk (0x1UL << RADIO_TEXTAMP_PWRUPEXTLNABEFORERAMPUP_Pos) /*!< Bit mask of
                                                                            PWRUPEXTLNABEFORERAMPUP field.*/
  #define RADIO_TEXTAMP_PWRUPEXTLNABEFORERAMPUP_Min (0x0UL) /*!< Min enumerator value of PWRUPEXTLNABEFORERAMPUP field.        */
  #define RADIO_TEXTAMP_PWRUPEXTLNABEFORERAMPUP_Max (0x1UL) /*!< Max enumerator value of PWRUPEXTLNABEFORERAMPUP field.        */
  #define RADIO_TEXTAMP_PWRUPEXTLNABEFORERAMPUP_AfterRampup (0x0UL) /*!< Power up external LNA at (RADIO_rampup_start_time +
                                                                         TPWRUPEXTLNA)*/
  #define RADIO_TEXTAMP_PWRUPEXTLNABEFORERAMPUP_BeforeRampup (0x1UL) /*!< Power up external LNA at (RADIO_rampup_start_time -
                                                                          TPWRUPEXTLNA)*/

/* PWRUPEXTPABEFORERAMPUP @Bit 31 : In legacy timing mode, pwrupExtPa can be powered on before starting to ramp up by setting
                                    this registers to 1 */

  #define RADIO_TEXTAMP_PWRUPEXTPABEFORERAMPUP_Pos (31UL) /*!< Position of PWRUPEXTPABEFORERAMPUP field.                       */
  #define RADIO_TEXTAMP_PWRUPEXTPABEFORERAMPUP_Msk (0x1UL << RADIO_TEXTAMP_PWRUPEXTPABEFORERAMPUP_Pos) /*!< Bit mask of
                                                                            PWRUPEXTPABEFORERAMPUP field.*/
  #define RADIO_TEXTAMP_PWRUPEXTPABEFORERAMPUP_Min (0x0UL) /*!< Min enumerator value of PWRUPEXTPABEFORERAMPUP field.          */
  #define RADIO_TEXTAMP_PWRUPEXTPABEFORERAMPUP_Max (0x1UL) /*!< Max enumerator value of PWRUPEXTPABEFORERAMPUP field.          */
  #define RADIO_TEXTAMP_PWRUPEXTPABEFORERAMPUP_AfterRampup (0x0UL) /*!< Power up external PA at (RADIO_rampup_start_time +
                                                                        TPWRUPEXTPA)*/
  #define RADIO_TEXTAMP_PWRUPEXTPABEFORERAMPUP_BeforeRampup (0x1UL) /*!< Power up external PA at (RADIO_rampup_start_time -
                                                                         TPWRUPEXTPA)*/


/* RADIO_BITCONVERTER: Configuration of ADC output to digital front-end */
  #define RADIO_BITCONVERTER_ResetValue (0x003FF3FFUL) /*!< Reset value of BITCONVERTER register.                              */

/* FINALCALOFFSETI @Bits 0..11 : ADC offset compensation of channel I (unsigned) */
  #define RADIO_BITCONVERTER_FINALCALOFFSETI_Pos (0UL) /*!< Position of FINALCALOFFSETI field.                                 */
  #define RADIO_BITCONVERTER_FINALCALOFFSETI_Msk (0xFFFUL << RADIO_BITCONVERTER_FINALCALOFFSETI_Pos) /*!< Bit mask of
                                                                            FINALCALOFFSETI field.*/

