adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FINALCALOFFSETQ @Bits 12..23 : ADC offset compensation of channel Q (unsigned) */
  #define RADIO_BITCONVERTER_FINALCALOFFSETQ_Pos (12UL) /*!< Position of FINALCALOFFSETQ field.                                */
  #define RADIO_BITCONVERTER_FINALCALOFFSETQ_Msk (0xFFFUL << RADIO_BITCONVERTER_FINALCALOFFSETQ_Pos) /*!< Bit mask of
                                                                            FINALCALOFFSETQ field.*/


/* RADIO_MODESTANDALONE: Data rate and modulation when SPHYNX in standalone mode */
  #define RADIO_MODESTANDALONE_ResetValue (0x00000000UL) /*!< Reset value of MODESTANDALONE register.                          */

/* RADIOMODEINT @Bits 0..7 : Internal radio mode consists of sSel, zeroIf, deModN and mode[3:0] */
  #define RADIO_MODESTANDALONE_RADIOMODEINT_Pos (0UL) /*!< Position of RADIOMODEINT field.                                     */
  #define RADIO_MODESTANDALONE_RADIOMODEINT_Msk (0xFFUL << RADIO_MODESTANDALONE_RADIOMODEINT_Pos) /*!< Bit mask of RADIOMODEINT
                                                                            field.*/

/* USERADIOMODEINT @Bit 31 : 0: use radioMode/radioModeUpdate from port (controlled from top), 1: use radioMode/radioModeUpdate
                             from registers in this IP */

  #define RADIO_MODESTANDALONE_USERADIOMODEINT_Pos (31UL) /*!< Position of USERADIOMODEINT field.                              */
  #define RADIO_MODESTANDALONE_USERADIOMODEINT_Msk (0x1UL << RADIO_MODESTANDALONE_USERADIOMODEINT_Pos) /*!< Bit mask of
                                                                            USERADIOMODEINT field.*/


/* RADIO_DEBUGRADIOPHY: Debug for radio PHY */
  #define RADIO_DEBUGRADIOPHY_ResetValue (0x00000100UL) /*!< Reset value of DEBUGRADIOPHY register.                            */

/* BUFFEREDTXPWR @Bit 8 : Set to high to buffer TXPOWER so that sub-modules in the MMI will only update next tx power config at
                          TX_EN, RX_EN and LB_EN. Set to low if special test is needed for Tx test. */

  #define RADIO_DEBUGRADIOPHY_BUFFEREDTXPWR_Pos (8UL) /*!< Position of BUFFEREDTXPWR field.                                    */
  #define RADIO_DEBUGRADIOPHY_BUFFEREDTXPWR_Msk (0x1UL << RADIO_DEBUGRADIOPHY_BUFFEREDTXPWR_Pos) /*!< Bit mask of BUFFEREDTXPWR
                                                                            field.*/

/* TIEADCBITOZERO @Bit 9 : 0: output normal adcBinaryBI, 1: tie adcBinaryBI to zero */
  #define RADIO_DEBUGRADIOPHY_TIEADCBITOZERO_Pos (9UL) /*!< Position of TIEADCBITOZERO field.                                  */
  #define RADIO_DEBUGRADIOPHY_TIEADCBITOZERO_Msk (0x1UL << RADIO_DEBUGRADIOPHY_TIEADCBITOZERO_Pos) /*!< Bit mask of
                                                                            TIEADCBITOZERO field.*/

/* TIEADCBQTOZERO @Bit 10 : 0: output normal adcBinaryBQ, 1: tie adcBinaryBQ to zero */
  #define RADIO_DEBUGRADIOPHY_TIEADCBQTOZERO_Pos (10UL) /*!< Position of TIEADCBQTOZERO field.                                 */
  #define RADIO_DEBUGRADIOPHY_TIEADCBQTOZERO_Msk (0x1UL << RADIO_DEBUGRADIOPHY_TIEADCBQTOZERO_Pos) /*!< Bit mask of
                                                                            TIEADCBQTOZERO field.*/

/* CALINVERTCODE @Bit 11 : 1: Invert all calibration codes */
  #define RADIO_DEBUGRADIOPHY_CALINVERTCODE_Pos (11UL) /*!< Position of CALINVERTCODE field.                                   */
  #define RADIO_DEBUGRADIOPHY_CALINVERTCODE_Msk (0x1UL << RADIO_DEBUGRADIOPHY_CALINVERTCODE_Pos) /*!< Bit mask of CALINVERTCODE
                                                                            field.*/

/* USEMODEDEPENDENTTDELTA @Bit 13 : 1: use TDELTAPIPE and TDELTAPWRDNPA from MODEDEPENDENT register instead of TIMINGTX2 */
  #define RADIO_DEBUGRADIOPHY_USEMODEDEPENDENTTDELTA_Pos (13UL) /*!< Position of USEMODEDEPENDENTTDELTA field.                 */
  #define RADIO_DEBUGRADIOPHY_USEMODEDEPENDENTTDELTA_Msk (0x1UL << RADIO_DEBUGRADIOPHY_USEMODEDEPENDENTTDELTA_Pos) /*!< Bit mask
                                                                            of USEMODEDEPENDENTTDELTA field.*/


/* RADIO_ADPLLCOMMAND: Send or receive command directly to the AdPll digital island. Only write to this register when
                        FSASYNCBUSBUSY returns 0 */

  #define RADIO_ADPLLCOMMAND_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMMAND register.                              */

/* ADPLLCOMMAND @Bits 0..27 : Controls the asynch interface, bits[27:16] are address, bits [15:0] are command/data field */
  #define RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Pos (0UL)  /*!< Position of ADPLLCOMMAND field.                                      */
  #define RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Msk (0xFFFFFFFUL << RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Pos) /*!< Bit mask of ADPLLCOMMAND
                                                                            field.*/

/* READ @Bit 31 : When 1, a read transaction is initiated. When the event COMPLETETRANS is set, read back this register */
  #define RADIO_ADPLLCOMMAND_READ_Pos (31UL)         /*!< Position of READ field.                                              */
  #define RADIO_ADPLLCOMMAND_READ_Msk (0x1UL << RADIO_ADPLLCOMMAND_READ_Pos) /*!< Bit mask of READ field.                      */


/* RADIO_FSFREQFINETUNE: Allows fine-tuning the RF frequency with a very fine resolution */
  #define RADIO_FSFREQFINETUNE_ResetValue (0x00000000UL) /*!< Reset value of FSFREQFINETUNE register.                          */

/* FSFREQFINETUNE @Bits 0..12 : 2-complement number for fine-tuning the frequency in steps of 488.28 Hz */
  #define RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Pos (0UL) /*!< Position of FSFREQFINETUNE field.                                 */
  #define RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Msk (0x1FFFUL << RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Pos) /*!< Bit mask of
                                                                            FSFREQFINETUNE field.*/


/* RADIO_DEVIATION: Frequency deviation for modulation */
  #define RADIO_DEVIATION_ResetValue (0x00000055UL)  /*!< Reset value of DEVIATION register.                                   */

/* DEVIATION @Bits 0..9 : Frequency deviation for modulation */
  #define RADIO_DEVIATION_DEVIATION_Pos (0UL)        /*!< Position of DEVIATION field.                                         */
  #define RADIO_DEVIATION_DEVIATION_Msk (0x3FFUL << RADIO_DEVIATION_DEVIATION_Pos) /*!< Bit mask of DEVIATION field.           */


