adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define RADIO_ADPLLCOMPANIONBACKDOORS_OVRVALCK32MCORE_Pos (3UL) /*!< Position of OVRVALCK32MCORE field.                      */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_OVRVALCK32MCORE_Msk (0x1UL << RADIO_ADPLLCOMPANIONBACKDOORS_OVRVALCK32MCORE_Pos) /*!<
                                                                            Bit mask of OVRVALCK32MCORE field.*/

/* ONTHEFLYWILLTRIGGER @Bits 4..5 : 0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_ONTHEFLYWILLTRIGGER_Pos (4UL) /*!< Position of ONTHEFLYWILLTRIGGER field.              */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_ONTHEFLYWILLTRIGGER_Msk (0x3UL << RADIO_ADPLLCOMPANIONBACKDOORS_ONTHEFLYWILLTRIGGER_Pos)
                                                                            /*!< Bit mask of ONTHEFLYWILLTRIGGER field.*/

/* RELOADFREQWILLTRIGGER @Bits 8..9 : 0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_RELOADFREQWILLTRIGGER_Pos (8UL) /*!< Position of RELOADFREQWILLTRIGGER field.          */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_RELOADFREQWILLTRIGGER_Msk (0x3UL << RADIO_ADPLLCOMPANIONBACKDOORS_RELOADFREQWILLTRIGGER_Pos)
                                                                            /*!< Bit mask of RELOADFREQWILLTRIGGER field.*/


/* RADIO_PVTTOT: This value is written to the AdPll when powering up the digital island */
  #define RADIO_PVTTOT_ResetValue (0x80000000UL)     /*!< Reset value of PVTTOT register.                                      */

/* PVTTOT @Bits 0..8 : The ratio between PVT and the total cap ratio. Used for Estkmod, Estkdtc and TdcReadout */
  #define RADIO_PVTTOT_PVTTOT_Pos (0UL)              /*!< Position of PVTTOT field.                                            */
  #define RADIO_PVTTOT_PVTTOT_Msk (0x1FFUL << RADIO_PVTTOT_PVTTOT_Pos) /*!< Bit mask of PVTTOT field.                          */

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_PVTTOT_DONOTTRANSFER_Pos (31UL)      /*!< Position of DONOTTRANSFER field.                                     */
  #define RADIO_PVTTOT_DONOTTRANSFER_Msk (0x1UL << RADIO_PVTTOT_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field.       */


/* RADIO_KDTC: This value is written to the AdPll when powering up the digital island */
  #define RADIO_KDTC_ResetValue (0x80000000UL)       /*!< Reset value of KDTC register.                                        */

/* KDTC @Bits 0..11 : The estimated kDTV value in typical */
  #define RADIO_KDTC_KDTC_Pos (0UL)                  /*!< Position of KDTC field.                                              */
  #define RADIO_KDTC_KDTC_Msk (0xFFFUL << RADIO_KDTC_KDTC_Pos) /*!< Bit mask of KDTC field.                                    */

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_KDTC_DONOTTRANSFER_Pos (31UL)        /*!< Position of DONOTTRANSFER field.                                     */
  #define RADIO_KDTC_DONOTTRANSFER_Msk (0x1UL << RADIO_KDTC_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field.           */


/* RADIO_TXHFGAIN: This value is written to the AdPll when powering up the digital island */
  #define RADIO_TXHFGAIN_ResetValue (0x80000000UL)   /*!< Reset value of TXHFGAIN register.                                    */

/* TXHFGAIN @Bits 0..9 : The gain for the HF path */
  #define RADIO_TXHFGAIN_TXHFGAIN_Pos (0UL)          /*!< Position of TXHFGAIN field.                                          */
  #define RADIO_TXHFGAIN_TXHFGAIN_Msk (0x3FFUL << RADIO_TXHFGAIN_TXHFGAIN_Pos) /*!< Bit mask of TXHFGAIN field.                */

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_TXHFGAIN_DONOTTRANSFER_Pos (31UL)    /*!< Position of DONOTTRANSFER field.                                     */
  #define RADIO_TXHFGAIN_DONOTTRANSFER_Msk (0x1UL << RADIO_TXHFGAIN_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field.   */


/* RADIO_PVTTOFIX: This value is written to the AdPll when powering up the digital island */
  #define RADIO_PVTTOFIX_ResetValue (0x80000000UL)   /*!< Reset value of PVTTOFIX register.                                    */

/* PVTTOFIX @Bits 0..10 : Calibration value for the PLL */
  #define RADIO_PVTTOFIX_PVTTOFIX_Pos (0UL)          /*!< Position of PVTTOFIX field.                                          */
  #define RADIO_PVTTOFIX_PVTTOFIX_Msk (0x7FFUL << RADIO_PVTTOFIX_PVTTOFIX_Pos) /*!< Bit mask of PVTTOFIX field.                */

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_PVTTOFIX_DONOTTRANSFER_Pos (31UL)    /*!< Position of DONOTTRANSFER field.                                     */
  #define RADIO_PVTTOFIX_DONOTTRANSFER_Msk (0x1UL << RADIO_PVTTOFIX_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field.   */


/* RADIO_TRACING: Enable tracing from AdPll */
  #define RADIO_TRACING_ResetValue (0x00000000UL)    /*!< Reset value of TRACING register.                                     */

/* ENABLE @Bit 0 : Enable tracing from AdPll */
  #define RADIO_TRACING_ENABLE_Pos (0UL)             /*!< Position of ENABLE field.                                            */
  #define RADIO_TRACING_ENABLE_Msk (0x1UL << RADIO_TRACING_ENABLE_Pos) /*!< Bit mask of ENABLE field.                          */


/* RADIO_IFFREQ: Select between two different IF frequencies */
  #define RADIO_IFFREQ_ResetValue (0x00000000UL)     /*!< Reset value of IFFREQ register.                                      */

/* IFFREQ @Bits 0..1 : Select which IF frequency to use */
  #define RADIO_IFFREQ_IFFREQ_Pos (0UL)              /*!< Position of IFFREQ field.                                            */
  #define RADIO_IFFREQ_IFFREQ_Msk (0x3UL << RADIO_IFFREQ_IFFREQ_Pos) /*!< Bit mask of IFFREQ field.                            */
  #define RADIO_IFFREQ_IFFREQ_Min (0x0UL)            /*!< Min enumerator value of IFFREQ field.                                */
  #define RADIO_IFFREQ_IFFREQ_Max (0x3UL)            /*!< Max enumerator value of IFFREQ field.                                */
  #define RADIO_IFFREQ_IFFREQ_1MHz (0x0UL)           /*!< 1 MHz IF                                                             */
  #define RADIO_IFFREQ_IFFREQ_2MHz (0x1UL)           /*!< 2 MHz IF                                                             */
  #define RADIO_IFFREQ_IFFREQ_4MHz (0x3UL)           /*!< 4 MHz IF                                                             */


/* RADIO_ADPLLCOMPANIONSTATE: State in the AdPllCompanion state machines */
  #define RADIO_ADPLLCOMPANIONSTATE_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMPANIONSTATE register.                */

/* BUSSCHEDULERSTATE @Bits 0..2 : The state of the state machine which sends commands automatically at startup */
  #define RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Pos (0UL) /*!< Position of BUSSCHEDULERSTATE field.                      */
  #define RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Msk (0x7UL << RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Pos) /*!< Bit
                                                                            mask of BUSSCHEDULERSTATE field.*/

/* BUSMASTERSTATE @Bits 4..5 : The state of the async bus master */
  #define RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Pos (4UL) /*!< Position of BUSMASTERSTATE field.                            */
  #define RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Msk (0x3UL << RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Pos) /*!< Bit mask of
                                                                            BUSMASTERSTATE field.*/

/* CLOCKSWITCHSTATE @Bits 8..9 : The state of the clock switching state machine */
  #define RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Pos (8UL) /*!< Position of CLOCKSWITCHSTATE field.                        */
  #define RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Msk (0x3UL << RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Pos) /*!< Bit mask
                                                                            of CLOCKSWITCHSTATE field.*/

/* UNITRIGCALSTATE @Bits 12..14 : The state of the universal trigger calibration routine */
  #define RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Pos (12UL) /*!< Position of UNITRIGCALSTATE field.                         */
  #define RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Msk (0x7UL << RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Pos) /*!< Bit mask
                                                                            of UNITRIGCALSTATE field.*/


