adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLTRIMCOMMAND1_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLTRIMCOMMAND1_VALUE_Msk (0xFFFFUL << RADIO_ADPLLTRIMCOMMAND1_VALUE_Pos) /*!< Bit mask of VALUE field.      */

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLTRIMCOMMAND1_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                           */
  #define RADIO_ADPLLTRIMCOMMAND1_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLTRIMCOMMAND1_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLTRIMCOMMAND1_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                               */
  #define RADIO_ADPLLTRIMCOMMAND1_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLTRIMCOMMAND1_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/


/* RADIO_ADPLLTRIMCOMMAND2: This value is written to the AdPll when powering up the digital island. NEVER reset with SOFTRESET */
  #define RADIO_ADPLLTRIMCOMMAND2_ResetValue (0x80000000UL) /*!< Reset value of ADPLLTRIMCOMMAND2 register.                    */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLTRIMCOMMAND2_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLTRIMCOMMAND2_VALUE_Msk (0xFFFFUL << RADIO_ADPLLTRIMCOMMAND2_VALUE_Pos) /*!< Bit mask of VALUE field.      */

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLTRIMCOMMAND2_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                           */
  #define RADIO_ADPLLTRIMCOMMAND2_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLTRIMCOMMAND2_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLTRIMCOMMAND2_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                               */
  #define RADIO_ADPLLTRIMCOMMAND2_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLTRIMCOMMAND2_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/


/* RADIO_ADPLLTRIMCOMMAND3: This value is written to the AdPll when powering up the digital island. NEVER reset with SOFTRESET */
  #define RADIO_ADPLLTRIMCOMMAND3_ResetValue (0x80000000UL) /*!< Reset value of ADPLLTRIMCOMMAND3 register.                    */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLTRIMCOMMAND3_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLTRIMCOMMAND3_VALUE_Msk (0xFFFFUL << RADIO_ADPLLTRIMCOMMAND3_VALUE_Pos) /*!< Bit mask of VALUE field.      */

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLTRIMCOMMAND3_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                           */
  #define RADIO_ADPLLTRIMCOMMAND3_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLTRIMCOMMAND3_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLTRIMCOMMAND3_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                               */
  #define RADIO_ADPLLTRIMCOMMAND3_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLTRIMCOMMAND3_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/


/* RADIO_ADPLLSTARTUPCOMMAND0: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND0_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND0 register.              */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND0_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND0_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND0_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND0_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND0_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND0_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND0_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND0_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND0_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/


/* RADIO_ADPLLSTARTUPCOMMAND1: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND1_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND1 register.              */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND1_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND1_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND1_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND1_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND1_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND1_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND1_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND1_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND1_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/


