adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND6_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND6_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND6_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND6_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND6_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND6_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND6_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND6_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND6_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/


/* RADIO_ADPLLSTARTUPCOMMAND7: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND7_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND7 register.              */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND7_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND7_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND7_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND7_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND7_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND7_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND7_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND7_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND7_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/


/* RADIO_ADPLLCOMPANIONINTEN: (unspecified) */
  #define RADIO_ADPLLCOMPANIONINTEN_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMPANIONINTEN register.                */

/* EVENTS @Bits 0..3 : Interrupt enable register for events (unused since IRQ not connected) */
  #define RADIO_ADPLLCOMPANIONINTEN_EVENTS_Pos (0UL) /*!< Position of EVENTS field.                                            */
  #define RADIO_ADPLLCOMPANIONINTEN_EVENTS_Msk (0xFUL << RADIO_ADPLLCOMPANIONINTEN_EVENTS_Pos) /*!< Bit mask of EVENTS field.  */


/* RADIO_ADPLLCOMPANIONINTENSET: (unspecified) */
  #define RADIO_ADPLLCOMPANIONINTENSET_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMPANIONINTENSET register.          */

/* EVENTS @Bits 0..3 : Interrupt set register for events (unused since IRQ not connected) */
  #define RADIO_ADPLLCOMPANIONINTENSET_EVENTS_Pos (0UL) /*!< Position of EVENTS field.                                         */
  #define RADIO_ADPLLCOMPANIONINTENSET_EVENTS_Msk (0xFUL << RADIO_ADPLLCOMPANIONINTENSET_EVENTS_Pos) /*!< Bit mask of EVENTS
                                                                            field.*/


/* RADIO_ADPLLCOMPANIONINTENCLR: (unspecified) */
  #define RADIO_ADPLLCOMPANIONINTENCLR_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMPANIONINTENCLR register.          */

/* EVENTS @Bits 0..3 : Interrupt clear register for events (unused since IRQ not connected) */
  #define RADIO_ADPLLCOMPANIONINTENCLR_EVENTS_Pos (0UL) /*!< Position of EVENTS field.                                         */
  #define RADIO_ADPLLCOMPANIONINTENCLR_EVENTS_Msk (0xFUL << RADIO_ADPLLCOMPANIONINTENCLR_EVENTS_Pos) /*!< Bit mask of EVENTS
                                                                            field.*/


/* RADIO_ADPLLCOMPANIONINTPEND: (unspecified) */
  #define RADIO_ADPLLCOMPANIONINTPEND_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMPANIONINTPEND register.            */

/* EVENTS @Bits 0..3 : (unspecified) */
  #define RADIO_ADPLLCOMPANIONINTPEND_EVENTS_Pos (0UL) /*!< Position of EVENTS field.                                          */
  #define RADIO_ADPLLCOMPANIONINTPEND_EVENTS_Msk (0xFUL << RADIO_ADPLLCOMPANIONINTPEND_EVENTS_Pos) /*!< Bit mask of EVENTS
                                                                            field.*/


/* RADIO_MODECONF: Mode specific configuration regiser */
  #define RADIO_MODECONF_ResetValue (0x00010203UL)   /*!< Reset value of MODECONF register.                                    */

/* SATDLYCHAN @Bits 0..2 : Mode dependent saturation delay for different modes */
  #define RADIO_MODECONF_SATDLYCHAN_Pos (0UL)        /*!< Position of SATDLYCHAN field.                                        */
  #define RADIO_MODECONF_SATDLYCHAN_Msk (0x7UL << RADIO_MODECONF_SATDLYCHAN_Pos) /*!< Bit mask of SATDLYCHAN field.            */

/* SATDLYDEC @Bits 8..9 : Mode dependent saturation delay in decimation filters for different modes */
  #define RADIO_MODECONF_SATDLYDEC_Pos (8UL)         /*!< Position of SATDLYDEC field.                                         */
  #define RADIO_MODECONF_SATDLYDEC_Msk (0x3UL << RADIO_MODECONF_SATDLYDEC_Pos) /*!< Bit mask of SATDLYDEC field.               */

/* HIGHIFMODE @Bit 16 : Selects mixing frequency. Setting this register to 0 halves the mixing frequency. */
  #define RADIO_MODECONF_HIGHIFMODE_Pos (16UL)       /*!< Position of HIGHIFMODE field.                                        */
  #define RADIO_MODECONF_HIGHIFMODE_Msk (0x1UL << RADIO_MODECONF_HIGHIFMODE_Pos) /*!< Bit mask of HIGHIFMODE field.            */


/* RADIO_FESTATUS: Frontend readout register */
  #define RADIO_FESTATUS_ResetValue (0x00001010UL)   /*!< Reset value of FESTATUS register.                                    */

