adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CALPHI @Bits 0..4 : calPhi from IQCal */
  #define RADIO_FESTATUS_CALPHI_Pos (0UL)            /*!< Position of CALPHI field.                                            */
  #define RADIO_FESTATUS_CALPHI_Msk (0x1FUL << RADIO_FESTATUS_CALPHI_Pos) /*!< Bit mask of CALPHI field.                       */

/* CALAMP @Bits 8..12 : calAmp from IQCal */
  #define RADIO_FESTATUS_CALAMP_Pos (8UL)            /*!< Position of CALAMP field.                                            */
  #define RADIO_FESTATUS_CALAMP_Msk (0x1FUL << RADIO_FESTATUS_CALAMP_Pos) /*!< Bit mask of CALAMP field.                       */

/* CALFIN @Bit 15 : High when IQCal search finished */
  #define RADIO_FESTATUS_CALFIN_Pos (15UL)           /*!< Position of CALFIN field.                                            */
  #define RADIO_FESTATUS_CALFIN_Msk (0x1UL << RADIO_FESTATUS_CALFIN_Pos) /*!< Bit mask of CALFIN field.                        */

/* MAGNITUDE @Bits 16..27 : Magnitude output from BB peak detector */
  #define RADIO_FESTATUS_MAGNITUDE_Pos (16UL)        /*!< Position of MAGNITUDE field.                                         */
  #define RADIO_FESTATUS_MAGNITUDE_Msk (0xFFFUL << RADIO_FESTATUS_MAGNITUDE_Pos) /*!< Bit mask of MAGNITUDE field.             */


/* RADIO_FECONFIG: Config register */
  #define RADIO_FECONFIG_ResetValue (0x10800005UL)   /*!< Reset value of FECONFIG register.                                    */

/* ALPHA @Bits 0..7 : Alpha for IIR filter used in logMag calculation */
  #define RADIO_FECONFIG_ALPHA_Pos (0UL)             /*!< Position of ALPHA field.                                             */
  #define RADIO_FECONFIG_ALPHA_Msk (0xFFUL << RADIO_FECONFIG_ALPHA_Pos) /*!< Bit mask of ALPHA field.                          */

/* SCALERDECAY @Bits 8..13 : The number of clock cycles to wait before stepping down the internal memory for the scaling. The
                             value 0 means that the decay feature is off. */

  #define RADIO_FECONFIG_SCALERDECAY_Pos (8UL)       /*!< Position of SCALERDECAY field.                                       */
  #define RADIO_FECONFIG_SCALERDECAY_Msk (0x3FUL << RADIO_FECONFIG_SCALERDECAY_Pos) /*!< Bit mask of SCALERDECAY field.        */

/* SCALECONST @Bits 16..19 : A constant scaling that overrides dynamic scaling behaviour in the IQ Scaler. Value != 0 enables
                             constant scaling. */

  #define RADIO_FECONFIG_SCALECONST_Pos (16UL)       /*!< Position of SCALECONST field.                                        */
  #define RADIO_FECONFIG_SCALECONST_Msk (0xFUL << RADIO_FECONFIG_SCALECONST_Pos) /*!< Bit mask of SCALECONST field.            */

/* SCALERMODE @Bit 20 : Mode for narrow scaling output. */
  #define RADIO_FECONFIG_SCALERMODE_Pos (20UL)       /*!< Position of SCALERMODE field.                                        */
  #define RADIO_FECONFIG_SCALERMODE_Msk (0x1UL << RADIO_FECONFIG_SCALERMODE_Pos) /*!< Bit mask of SCALERMODE field.            */
  #define RADIO_FECONFIG_SCALERMODE_Min (0x0UL)      /*!< Min enumerator value of SCALERMODE field.                            */
  #define RADIO_FECONFIG_SCALERMODE_Max (0x1UL)      /*!< Max enumerator value of SCALERMODE field.                            */
  #define RADIO_FECONFIG_SCALERMODE_Disabled (0x0UL) /*!< Classic log based scaling mode.                                      */
  #define RADIO_FECONFIG_SCALERMODE_Enabled (0x1UL)  /*!< LUT based scaling mode.                                              */

/* SCALERWRAPPROTEN @Bit 23 : Wraparound protection in IQ Scaler. */
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Pos (23UL) /*!< Position of SCALERWRAPPROTEN field.                                  */
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Msk (0x1UL << RADIO_FECONFIG_SCALERWRAPPROTEN_Pos) /*!< Bit mask of SCALERWRAPPROTEN
                                                                            field.*/
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Min (0x0UL) /*!< Min enumerator value of SCALERWRAPPROTEN field.                     */
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Max (0x1UL) /*!< Max enumerator value of SCALERWRAPPROTEN field.                     */
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Disabled (0x0UL) /*!< Disable wraparound protection. Not recommended to disable with
                                                                constant scaling.*/
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Enabled (0x1UL) /*!< Disable wraparound protection. Scaled input is set to max or min
                                                               instead of wrapping around.*/

/* QDISABLE @Bit 24 : Disable Q samples to save power */
  #define RADIO_FECONFIG_QDISABLE_Pos (24UL)         /*!< Position of QDISABLE field.                                          */
  #define RADIO_FECONFIG_QDISABLE_Msk (0x1UL << RADIO_FECONFIG_QDISABLE_Pos) /*!< Bit mask of QDISABLE field.                  */

/* INVERTI @Bit 28 : Invert I channel in case Q channel leads I */
  #define RADIO_FECONFIG_INVERTI_Pos (28UL)          /*!< Position of INVERTI field.                                           */
  #define RADIO_FECONFIG_INVERTI_Msk (0x1UL << RADIO_FECONFIG_INVERTI_Pos) /*!< Bit mask of INVERTI field.                     */

/* SELINPUTMIX @Bit 29 : Mixer Input Select between Decimator's Output and Injection DMA, i.e., SELINPUTMIX = 0 for Decimator;
                         SELINPUTMIX = 1 for Injection DMA */

  #define RADIO_FECONFIG_SELINPUTMIX_Pos (29UL)      /*!< Position of SELINPUTMIX field.                                       */
  #define RADIO_FECONFIG_SELINPUTMIX_Msk (0x1UL << RADIO_FECONFIG_SELINPUTMIX_Pos) /*!< Bit mask of SELINPUTMIX field.         */

/* SELINPUTCHAN @Bit 30 : Channel Filters Input Select between Mixer and Injection DMA, i.e., SELINPUTCHAN = 0 for Mixer;
                          SELINPUTCHAN = 1 for Injection DMA */

  #define RADIO_FECONFIG_SELINPUTCHAN_Pos (30UL)     /*!< Position of SELINPUTCHAN field.                                      */
  #define RADIO_FECONFIG_SELINPUTCHAN_Msk (0x1UL << RADIO_FECONFIG_SELINPUTCHAN_Pos) /*!< Bit mask of SELINPUTCHAN field.      */


