adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VBGTRIM @Bits 8..11 : Trim code for VBG to FS_VCOREG */
  #define RADIO_PBTEST_VBGTRIM_Pos (8UL)             /*!< Position of VBGTRIM field.                                           */
  #define RADIO_PBTEST_VBGTRIM_Msk (0xFUL << RADIO_PBTEST_VBGTRIM_Pos) /*!< Bit mask of VBGTRIM field.                         */

/* OVRENPBIBPSTRIM @Bit 30 : if '1' enable override for PBIBPSTRIM */
  #define RADIO_PBTEST_OVRENPBIBPSTRIM_Pos (30UL)    /*!< Position of OVRENPBIBPSTRIM field.                                   */
  #define RADIO_PBTEST_OVRENPBIBPSTRIM_Msk (0x1UL << RADIO_PBTEST_OVRENPBIBPSTRIM_Pos) /*!< Bit mask of OVRENPBIBPSTRIM field. */

/* OVRENVBGTRIM @Bit 31 : if '1' enable override for VBGTRIM */
  #define RADIO_PBTEST_OVRENVBGTRIM_Pos (31UL)       /*!< Position of OVRENVBGTRIM field.                                      */
  #define RADIO_PBTEST_OVRENVBGTRIM_Msk (0x1UL << RADIO_PBTEST_OVRENVBGTRIM_Pos) /*!< Bit mask of OVRENVBGTRIM field.          */


/* RADIO_DBCCOEFFS: Test and Debug: DBC coefficients override */
  #define RADIO_DBCCOEFFS_ResetValue (0x00000000UL)  /*!< Reset value of DBCCOEFFS register.                                   */

/* PADDRUPDATEOVREN @Bit 10 : paddrUpdateOvrEn */
  #define RADIO_DBCCOEFFS_PADDRUPDATEOVREN_Pos (10UL) /*!< Position of PADDRUPDATEOVREN field.                                 */
  #define RADIO_DBCCOEFFS_PADDRUPDATEOVREN_Msk (0x1UL << RADIO_DBCCOEFFS_PADDRUPDATEOVREN_Pos) /*!< Bit mask of PADDRUPDATEOVREN
                                                                            field.*/

/* PADDRUPDATEOVRVAL @Bit 11 : paddrUpdateOvrVal */
  #define RADIO_DBCCOEFFS_PADDRUPDATEOVRVAL_Pos (11UL) /*!< Position of PADDRUPDATEOVRVAL field.                               */
  #define RADIO_DBCCOEFFS_PADDRUPDATEOVRVAL_Msk (0x1UL << RADIO_DBCCOEFFS_PADDRUPDATEOVRVAL_Pos) /*!< Bit mask of
                                                                            PADDRUPDATEOVRVAL field.*/

/* OVRALWAYSUPDATE @Bit 12 : Zero means coefficients only updated when needed (default), set to 1 coefficients are always
                             updated when the radio is enabled. */

  #define RADIO_DBCCOEFFS_OVRALWAYSUPDATE_Pos (12UL) /*!< Position of OVRALWAYSUPDATE field.                                   */
  #define RADIO_DBCCOEFFS_OVRALWAYSUPDATE_Msk (0x1UL << RADIO_DBCCOEFFS_OVRALWAYSUPDATE_Pos) /*!< Bit mask of OVRALWAYSUPDATE
                                                                            field.*/


/* RADIO_QOVERRIDE4: Trim value override register 4 for nRF52 */
  #define RADIO_QOVERRIDE4_ResetValue (0x00140000UL) /*!< Reset value of QOVERRIDE4 register.                                  */

/* PREAMBFILTTH @Bits 16..24 : Threshold for the preamble filter */
  #define RADIO_QOVERRIDE4_PREAMBFILTTH_Pos (16UL)   /*!< Position of PREAMBFILTTH field.                                      */
  #define RADIO_QOVERRIDE4_PREAMBFILTTH_Msk (0x1FFUL << RADIO_QOVERRIDE4_PREAMBFILTTH_Pos) /*!< Bit mask of PREAMBFILTTH field.*/

/* ENPREAMBFILT @Bit 25 : Enable preamble filter */
  #define RADIO_QOVERRIDE4_ENPREAMBFILT_Pos (25UL)   /*!< Position of ENPREAMBFILT field.                                      */
  #define RADIO_QOVERRIDE4_ENPREAMBFILT_Msk (0x1UL << RADIO_QOVERRIDE4_ENPREAMBFILT_Pos) /*!< Bit mask of ENPREAMBFILT field.  */


/* RADIO_QOVERRIDE5: Trim value override register 5 for nRF52 */
  #define RADIO_QOVERRIDE5_ResetValue (0x00060020UL) /*!< Reset value of QOVERRIDE5 register.                                  */

/* PREAMBFILTCYCLES @Bits 0..7 : Override value for preambFiltCycles */
  #define RADIO_QOVERRIDE5_PREAMBFILTCYCLES_Pos (0UL) /*!< Position of PREAMBFILTCYCLES field.                                 */
  #define RADIO_QOVERRIDE5_PREAMBFILTCYCLES_Msk (0xFFUL << RADIO_QOVERRIDE5_PREAMBFILTCYCLES_Pos) /*!< Bit mask of
                                                                            PREAMBFILTCYCLES field.*/

/* BITSLICERSWINGTH @Bits 8..15 : Override value for bitSlicerSwingTh */
  #define RADIO_QOVERRIDE5_BITSLICERSWINGTH_Pos (8UL) /*!< Position of BITSLICERSWINGTH field.                                 */
  #define RADIO_QOVERRIDE5_BITSLICERSWINGTH_Msk (0xFFUL << RADIO_QOVERRIDE5_BITSLICERSWINGTH_Pos) /*!< Bit mask of
                                                                            BITSLICERSWINGTH field.*/

/* PREAMBFILTMINSTRLEN @Bits 16..18 : Override value for preambFiltMinStrLen */
  #define RADIO_QOVERRIDE5_PREAMBFILTMINSTRLEN_Pos (16UL) /*!< Position of PREAMBFILTMINSTRLEN field.                          */
  #define RADIO_QOVERRIDE5_PREAMBFILTMINSTRLEN_Msk (0x7UL << RADIO_QOVERRIDE5_PREAMBFILTMINSTRLEN_Pos) /*!< Bit mask of
                                                                            PREAMBFILTMINSTRLEN field.*/


/* RADIO_QOVERRIDE6: Trim value override register 6 for nRF52 */
  #define RADIO_QOVERRIDE6_ResetValue (0x40000000UL) /*!< Reset value of QOVERRIDE6 register.                                  */

/* DBCENABLESRC @Bits 8..9 : Override value for dbcEnableSrc */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Pos (8UL)    /*!< Position of DBCENABLESRC field.                                      */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Msk (0x3UL << RADIO_QOVERRIDE6_DBCENABLESRC_Pos) /*!< Bit mask of DBCENABLESRC field.  */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Min (0x0UL)  /*!< Min enumerator value of DBCENABLESRC field.                          */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Max (0x3UL)  /*!< Max enumerator value of DBCENABLESRC field.                          */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_AlwaysOn (0x0UL) /*!< Always on when not address match                                 */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_BBLogMag (0x1UL) /*!< When bbLogMag is above a threshold                               */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_BitSlicerSwing (0x2UL) /*!< When a certain time has gone since the input to the
                                                                    bitslicer was above BITSLICERSWINGTH*/
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Both (0x3UL) /*!< Both BBLogMag and BitSlicerSwing                                     */

/* DBCTIMEOUT @Bits 16..23 : Override value for correlator timeout,in bit periods (hypermode) */
  #define RADIO_QOVERRIDE6_DBCTIMEOUT_Pos (16UL)     /*!< Position of DBCTIMEOUT field.                                        */
  #define RADIO_QOVERRIDE6_DBCTIMEOUT_Msk (0xFFUL << RADIO_QOVERRIDE6_DBCTIMEOUT_Pos) /*!< Bit mask of DBCTIMEOUT field.       */

/* DBCENABLETH @Bits 24..29 : Override value for correlator enable threshold */
  #define RADIO_QOVERRIDE6_DBCENABLETH_Pos (24UL)    /*!< Position of DBCENABLETH field.                                       */
  #define RADIO_QOVERRIDE6_DBCENABLETH_Msk (0x3FUL << RADIO_QOVERRIDE6_DBCENABLETH_Pos) /*!< Bit mask of DBCENABLETH field.    */

/* ENCHECKMULTIPEAKS @Bit 30 : Enable checking of several correlator peaks in hypermode */
  #define RADIO_QOVERRIDE6_ENCHECKMULTIPEAKS_Pos (30UL) /*!< Position of ENCHECKMULTIPEAKS field.                              */
  #define RADIO_QOVERRIDE6_ENCHECKMULTIPEAKS_Msk (0x1UL << RADIO_QOVERRIDE6_ENCHECKMULTIPEAKS_Pos) /*!< Bit mask of
                                                                            ENCHECKMULTIPEAKS field.*/

/* DBCCORRTHEN @Bit 31 : Override value enable for DBCCORRTH and MFBSTRBOFFSET */
  #define RADIO_QOVERRIDE6_DBCCORRTHEN_Pos (31UL)    /*!< Position of DBCCORRTHEN field.                                       */
  #define RADIO_QOVERRIDE6_DBCCORRTHEN_Msk (0x1UL << RADIO_QOVERRIDE6_DBCCORRTHEN_Pos) /*!< Bit mask of DBCCORRTHEN field.     */


/* RADIO_QOVERRIDE9: Trim value override register 9 for nRF52 */
  #define RADIO_QOVERRIDE9_ResetValue (0x00000053UL) /*!< Reset value of QOVERRIDE9 register.                                  */

