adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PSDDEMODDELAY @Bits 0..1 : Override value for psdDemodDelay (standard mode) */
  #define RADIO_QOVERRIDE9_PSDDEMODDELAY_Pos (0UL)   /*!< Position of PSDDEMODDELAY field.                                     */
  #define RADIO_QOVERRIDE9_PSDDEMODDELAY_Msk (0x3UL << RADIO_QOVERRIDE9_PSDDEMODDELAY_Pos) /*!< Bit mask of PSDDEMODDELAY
                                                                            field.*/

/* DEMODINVERT @Bit 2 : Override value for demodInvert (standard and hyper) */
  #define RADIO_QOVERRIDE9_DEMODINVERT_Pos (2UL)     /*!< Position of DEMODINVERT field.                                       */
  #define RADIO_QOVERRIDE9_DEMODINVERT_Msk (0x1UL << RADIO_QOVERRIDE9_DEMODINVERT_Pos) /*!< Bit mask of DEMODINVERT field.     */

/* DELAYBITOUTSTDDEMOD @Bits 4..6 : Override value for delayBitOutStdDemod (standard mode) */
  #define RADIO_QOVERRIDE9_DELAYBITOUTSTDDEMOD_Pos (4UL) /*!< Position of DELAYBITOUTSTDDEMOD field.                           */
  #define RADIO_QOVERRIDE9_DELAYBITOUTSTDDEMOD_Msk (0x7UL << RADIO_QOVERRIDE9_DELAYBITOUTSTDDEMOD_Pos) /*!< Bit mask of
                                                                            DELAYBITOUTSTDDEMOD field.*/

/* BITSLICERSWINGTIME @Bits 8..15 : Bit slicer swing time */
  #define RADIO_QOVERRIDE9_BITSLICERSWINGTIME_Pos (8UL) /*!< Position of BITSLICERSWINGTIME field.                             */
  #define RADIO_QOVERRIDE9_BITSLICERSWINGTIME_Msk (0xFFUL << RADIO_QOVERRIDE9_BITSLICERSWINGTIME_Pos) /*!< Bit mask of
                                                                            BITSLICERSWINGTIME field.*/

/* SCALERDECAYDELAY @Bits 20..25 : Decay delay for the IQ scaler */
  #define RADIO_QOVERRIDE9_SCALERDECAYDELAY_Pos (20UL) /*!< Position of SCALERDECAYDELAY field.                                */
  #define RADIO_QOVERRIDE9_SCALERDECAYDELAY_Msk (0x3FUL << RADIO_QOVERRIDE9_SCALERDECAYDELAY_Pos) /*!< Bit mask of
                                                                            SCALERDECAYDELAY field.*/

/* SCALERMODE @Bit 28 : Scaler mode. Set to 1 for LUT based scaling */
  #define RADIO_QOVERRIDE9_SCALERMODE_Pos (28UL)     /*!< Position of SCALERMODE field.                                        */
  #define RADIO_QOVERRIDE9_SCALERMODE_Msk (0x1UL << RADIO_QOVERRIDE9_SCALERMODE_Pos) /*!< Bit mask of SCALERMODE field.        */


/* RADIO_QOVERRIDE12: Trim value override register 12 for nRF52 */
  #define RADIO_QOVERRIDE12_ResetValue (0x01F4044CUL) /*!< Reset value of QOVERRIDE12 register.                                */

/* IFPKDETHIGHTHRES @Bits 0..11 : Override value for IfpkDetHighThres */
  #define RADIO_QOVERRIDE12_IFPKDETHIGHTHRES_Pos (0UL) /*!< Position of IFPKDETHIGHTHRES field.                                */
  #define RADIO_QOVERRIDE12_IFPKDETHIGHTHRES_Msk (0xFFFUL << RADIO_QOVERRIDE12_IFPKDETHIGHTHRES_Pos) /*!< Bit mask of
                                                                            IFPKDETHIGHTHRES field.*/

/* SATDELAYCORRECTION @Bits 12..15 : Signed correction value for how much the saturation information is delayed from the input
                                     ADC samples to the samples being stored to RAM in direction finding operation */

  #define RADIO_QOVERRIDE12_SATDELAYCORRECTION_Pos (12UL) /*!< Position of SATDELAYCORRECTION field.                           */
  #define RADIO_QOVERRIDE12_SATDELAYCORRECTION_Msk (0xFUL << RADIO_QOVERRIDE12_SATDELAYCORRECTION_Pos) /*!< Bit mask of
                                                                            SATDELAYCORRECTION field.*/

/* IFPKDETLOWTHRES @Bits 16..27 : Override value for IfpkDetLowThres */
  #define RADIO_QOVERRIDE12_IFPKDETLOWTHRES_Pos (16UL) /*!< Position of IFPKDETLOWTHRES field.                                 */
  #define RADIO_QOVERRIDE12_IFPKDETLOWTHRES_Msk (0xFFFUL << RADIO_QOVERRIDE12_IFPKDETLOWTHRES_Pos) /*!< Bit mask of
                                                                            IFPKDETLOWTHRES field.*/


/* RADIO_QOVERRIDE23: Trim value override register 23 for nRF52 */
  #define RADIO_QOVERRIDE23_ResetValue (0x00002800UL) /*!< Reset value of QOVERRIDE23 register.                                */

/* OVRENCNRIPPLEWARNCFG @Bit 5 : Override enable for CNPEAKMINTHR and CNABSMAXTHR in the CNRIPPLEWARNCFG register */
  #define RADIO_QOVERRIDE23_OVRENCNRIPPLEWARNCFG_Pos (5UL) /*!< Position of OVRENCNRIPPLEWARNCFG field.                        */
  #define RADIO_QOVERRIDE23_OVRENCNRIPPLEWARNCFG_Msk (0x1UL << RADIO_QOVERRIDE23_OVRENCNRIPPLEWARNCFG_Pos) /*!< Bit mask of
                                                                            OVRENCNRIPPLEWARNCFG field.*/

/* DISABLEDRIFT @Bit 6 : Disable option for RxDrift. */
  #define RADIO_QOVERRIDE23_DISABLEDRIFT_Pos (6UL)   /*!< Position of DISABLEDRIFT field.                                      */
  #define RADIO_QOVERRIDE23_DISABLEDRIFT_Msk (0x1UL << RADIO_QOVERRIDE23_DISABLEDRIFT_Pos) /*!< Bit mask of DISABLEDRIFT field.*/

/* HIGHERTHANMARGINDBC @Bits 8..15 : Required peak height required for a double correlator peak to be considered higher than
                                     previous ones. The register value will be multiplied by 25 to obtain the actual margin. The
                                     bitfield is NOT subject to the enable override at bit position 31, and will always be
                                     enabled for hypermode. */

  #define RADIO_QOVERRIDE23_HIGHERTHANMARGINDBC_Pos (8UL) /*!< Position of HIGHERTHANMARGINDBC field.                          */
  #define RADIO_QOVERRIDE23_HIGHERTHANMARGINDBC_Msk (0xFFUL << RADIO_QOVERRIDE23_HIGHERTHANMARGINDBC_Pos) /*!< Bit mask of
                                                                            HIGHERTHANMARGINDBC field.*/

/* KEEPSTDINDSSS @Bit 16 : Keep standard demod in DSSS mode */
  #define RADIO_QOVERRIDE23_KEEPSTDINDSSS_Pos (16UL) /*!< Position of KEEPSTDINDSSS field.                                     */
  #define RADIO_QOVERRIDE23_KEEPSTDINDSSS_Msk (0x1UL << RADIO_QOVERRIDE23_KEEPSTDINDSSS_Pos) /*!< Bit mask of KEEPSTDINDSSS
                                                                            field.*/

/* DISABLESYMBOLTRACK @Bit 17 : Disable symbol tracking for IEEE 802.15.4 and BLE LR 125K modes */
  #define RADIO_QOVERRIDE23_DISABLESYMBOLTRACK_Pos (17UL) /*!< Position of DISABLESYMBOLTRACK field.                           */
  #define RADIO_QOVERRIDE23_DISABLESYMBOLTRACK_Msk (0x1UL << RADIO_QOVERRIDE23_DISABLESYMBOLTRACK_Pos) /*!< Bit mask of
                                                                            DISABLESYMBOLTRACK field.*/


/* RADIO_LELRMISC: Miscellaneous Controls for Long Range */
  #define RADIO_LELRMISC_ResetValue (0x58780114UL)   /*!< Reset value of LELRMISC register.                                    */

/* LRFRAMERRTRSH @Bits 0..3 : Framer Receive Threshold */
  #define RADIO_LELRMISC_LRFRAMERRTRSH_Pos (0UL)     /*!< Position of LRFRAMERRTRSH field.                                     */
  #define RADIO_LELRMISC_LRFRAMERRTRSH_Msk (0xFUL << RADIO_LELRMISC_LRFRAMERRTRSH_Pos) /*!< Bit mask of LRFRAMERRTRSH field.   */

