adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VITERBIUSESTATEZERO @Bit 4 : Use Viterbi state zero when flushing out bits for BLE LR */
  #define RADIO_LELRMISC_VITERBIUSESTATEZERO_Pos (4UL) /*!< Position of VITERBIUSESTATEZERO field.                             */
  #define RADIO_LELRMISC_VITERBIUSESTATEZERO_Msk (0x1UL << RADIO_LELRMISC_VITERBIUSESTATEZERO_Pos) /*!< Bit mask of
                                                                            VITERBIUSESTATEZERO field.*/

/* KEEPMFBONINBLELR125 @Bit 5 : Do not stop the clock to RxMFB in BLE LR 125 mode */
  #define RADIO_LELRMISC_KEEPMFBONINBLELR125_Pos (5UL) /*!< Position of KEEPMFBONINBLELR125 field.                             */
  #define RADIO_LELRMISC_KEEPMFBONINBLELR125_Msk (0x1UL << RADIO_LELRMISC_KEEPMFBONINBLELR125_Pos) /*!< Bit mask of
                                                                            KEEPMFBONINBLELR125 field.*/

/* KEEPDESPREADONINBLELR500 @Bit 6 : Do not stop the clock to the Despreader in BLE LR 500 mode */
  #define RADIO_LELRMISC_KEEPDESPREADONINBLELR500_Pos (6UL) /*!< Position of KEEPDESPREADONINBLELR500 field.                   */
  #define RADIO_LELRMISC_KEEPDESPREADONINBLELR500_Msk (0x1UL << RADIO_LELRMISC_KEEPDESPREADONINBLELR500_Pos) /*!< Bit mask of
                                                                            KEEPDESPREADONINBLELR500 field.*/

/* DISABLEFRAMESYNCLRTIMEOUT @Bit 7 : Disable framesync timeout (early address match timeout) for BLE LR mode (hypermode). */
  #define RADIO_LELRMISC_DISABLEFRAMESYNCLRTIMEOUT_Pos (7UL) /*!< Position of DISABLEFRAMESYNCLRTIMEOUT field.                 */
  #define RADIO_LELRMISC_DISABLEFRAMESYNCLRTIMEOUT_Msk (0x1UL << RADIO_LELRMISC_DISABLEFRAMESYNCLRTIMEOUT_Pos) /*!< Bit mask of
                                                                            DISABLEFRAMESYNCLRTIMEOUT field.*/

/* LELROFFADDRCHECK @Bits 8..10 : The number of chip periods earlier which it is allowed to declare frameSync in DecodeLELong */
  #define RADIO_LELRMISC_LELROFFADDRCHECK_Pos (8UL)  /*!< Position of LELROFFADDRCHECK field.                                  */
  #define RADIO_LELRMISC_LELROFFADDRCHECK_Msk (0x7UL << RADIO_LELRMISC_LELROFFADDRCHECK_Pos) /*!< Bit mask of LELROFFADDRCHECK
                                                                            field.*/

/* CODEPOLY0 @Bits 16..22 : Code Polynom 0 */
  #define RADIO_LELRMISC_CODEPOLY0_Pos (16UL)        /*!< Position of CODEPOLY0 field.                                         */
  #define RADIO_LELRMISC_CODEPOLY0_Msk (0x7FUL << RADIO_LELRMISC_CODEPOLY0_Pos) /*!< Bit mask of CODEPOLY0 field.              */

/* CODEPOLY1 @Bits 24..30 : Code Polynom 1 */
  #define RADIO_LELRMISC_CODEPOLY1_Pos (24UL)        /*!< Position of CODEPOLY1 field.                                         */
  #define RADIO_LELRMISC_CODEPOLY1_Msk (0x7FUL << RADIO_LELRMISC_CODEPOLY1_Pos) /*!< Bit mask of CODEPOLY1 field.              */

/* LRDESPREADSWAP @Bit 31 : Swap de-spreader */
  #define RADIO_LELRMISC_LRDESPREADSWAP_Pos (31UL)   /*!< Position of LRDESPREADSWAP field.                                    */
  #define RADIO_LELRMISC_LRDESPREADSWAP_Msk (0x1UL << RADIO_LELRMISC_LRDESPREADSWAP_Pos) /*!< Bit mask of LRDESPREADSWAP field.*/


/* RADIO_QOVERRIDE25: TODO */
  #define RADIO_QOVERRIDE25_ResetValue (0x00000000UL) /*!< Reset value of QOVERRIDE25 register.                                */

/* DBCCORRTHSTRICT @Bits 0..7 : Correlation threshold for double correlator used in BleLr mode to resync to another preamble
                                while already working on a previous preamble. */

  #define RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Pos (0UL) /*!< Position of DBCCORRTHSTRICT field.                                  */
  #define RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Msk (0xFFUL << RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Pos) /*!< Bit mask of
                                                                            DBCCORRTHSTRICT field.*/

/* DBCCORRTHPREVREQUIR @Bits 8..15 : Correlation threshold for double correlator used in BleLr mode to reject a later resync
                                     using DBCCORRTHSTRICT. */

  #define RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Pos (8UL) /*!< Position of DBCCORRTHPREVREQUIR field.                          */
  #define RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Msk (0xFFUL << RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Pos) /*!< Bit mask of
                                                                            DBCCORRTHPREVREQUIR field.*/

/* MINPEAKCOUNTSTRICT @Bits 16..18 : Min number of peaks to detect before resyncing to another preamble while already working on
                                     a previous preamble in BleLrx. */

  #define RADIO_QOVERRIDE25_MINPEAKCOUNTSTRICT_Pos (16UL) /*!< Position of MINPEAKCOUNTSTRICT field.                           */
  #define RADIO_QOVERRIDE25_MINPEAKCOUNTSTRICT_Msk (0x7UL << RADIO_QOVERRIDE25_MINPEAKCOUNTSTRICT_Pos) /*!< Bit mask of
                                                                            MINPEAKCOUNTSTRICT field.*/

/* DBCPEAKDETSEL @Bit 27 : DBC peak detector selection */
  #define RADIO_QOVERRIDE25_DBCPEAKDETSEL_Pos (27UL) /*!< Position of DBCPEAKDETSEL field.                                     */
  #define RADIO_QOVERRIDE25_DBCPEAKDETSEL_Msk (0x1UL << RADIO_QOVERRIDE25_DBCPEAKDETSEL_Pos) /*!< Bit mask of DBCPEAKDETSEL
                                                                            field.*/
  #define RADIO_QOVERRIDE25_DBCPEAKDETSEL_Min (0x0UL) /*!< Min enumerator value of DBCPEAKDETSEL field.                        */
  #define RADIO_QOVERRIDE25_DBCPEAKDETSEL_Max (0x1UL) /*!< Max enumerator value of DBCPEAKDETSEL field.                        */
  #define RADIO_QOVERRIDE25_DBCPEAKDETSEL_Classic (0x0UL) /*!< Use classic peak detector (backward compatible behavior)        */
  #define RADIO_QOVERRIDE25_DBCPEAKDETSEL_Differential (0x1UL) /*!< Use differential peak detector                             */

/* OVRENDBCCORRTHSTRICT @Bit 28 : Override enable for DBCCORRTHSTRICT */
  #define RADIO_QOVERRIDE25_OVRENDBCCORRTHSTRICT_Pos (28UL) /*!< Position of OVRENDBCCORRTHSTRICT field.                       */
  #define RADIO_QOVERRIDE25_OVRENDBCCORRTHSTRICT_Msk (0x1UL << RADIO_QOVERRIDE25_OVRENDBCCORRTHSTRICT_Pos) /*!< Bit mask of
                                                                            OVRENDBCCORRTHSTRICT field.*/

/* OVRENDBCCORRTHPREVREQUIR @Bit 29 : Override enable for DBCCORRTHPREVREQUIR */
  #define RADIO_QOVERRIDE25_OVRENDBCCORRTHPREVREQUIR_Pos (29UL) /*!< Position of OVRENDBCCORRTHPREVREQUIR field.               */
  #define RADIO_QOVERRIDE25_OVRENDBCCORRTHPREVREQUIR_Msk (0x1UL << RADIO_QOVERRIDE25_OVRENDBCCORRTHPREVREQUIR_Pos) /*!< Bit mask
                                                                            of OVRENDBCCORRTHPREVREQUIR field.*/

/* OVRENMINPEAKCOUNTSTRICT @Bit 30 : Override enable for MINPEAKCOUNTSTRICT */
  #define RADIO_QOVERRIDE25_OVRENMINPEAKCOUNTSTRICT_Pos (30UL) /*!< Position of OVRENMINPEAKCOUNTSTRICT field.                 */
  #define RADIO_QOVERRIDE25_OVRENMINPEAKCOUNTSTRICT_Msk (0x1UL << RADIO_QOVERRIDE25_OVRENMINPEAKCOUNTSTRICT_Pos) /*!< Bit mask
                                                                            of OVRENMINPEAKCOUNTSTRICT field.*/


/* RADIO_DBCPEAKDETTHR: Thresholds for each peak detector instance */
  #define RADIO_DBCPEAKDETTHR_ResetValue (0x0C0C0C0CUL) /*!< Reset value of DBCPEAKDETTHR register.                            */

/* THR0 @Bits 0..7 : Diff threshold 0 */
  #define RADIO_DBCPEAKDETTHR_THR0_Pos (0UL)         /*!< Position of THR0 field.                                              */
  #define RADIO_DBCPEAKDETTHR_THR0_Msk (0xFFUL << RADIO_DBCPEAKDETTHR_THR0_Pos) /*!< Bit mask of THR0 field.                   */

