adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* THR1 @Bits 8..15 : Diff threshold 1 */
  #define RADIO_DBCPEAKDETTHR_THR1_Pos (8UL)         /*!< Position of THR1 field.                                              */
  #define RADIO_DBCPEAKDETTHR_THR1_Msk (0xFFUL << RADIO_DBCPEAKDETTHR_THR1_Pos) /*!< Bit mask of THR1 field.                   */

/* THR2 @Bits 16..23 : Diff threshold 2 */
  #define RADIO_DBCPEAKDETTHR_THR2_Pos (16UL)        /*!< Position of THR2 field.                                              */
  #define RADIO_DBCPEAKDETTHR_THR2_Msk (0xFFUL << RADIO_DBCPEAKDETTHR_THR2_Pos) /*!< Bit mask of THR2 field.                   */

/* THR3 @Bits 24..31 : Diff threshold 3 */
  #define RADIO_DBCPEAKDETTHR_THR3_Pos (24UL)        /*!< Position of THR3 field.                                              */
  #define RADIO_DBCPEAKDETTHR_THR3_Msk (0xFFUL << RADIO_DBCPEAKDETTHR_THR3_Pos) /*!< Bit mask of THR3 field.                   */


/* RADIO_BITSLICERSTAT: Payload status */
  #define RADIO_BITSLICERSTAT_ResetValue (0x00000000UL) /*!< Reset value of BITSLICERSTAT register.                            */

/* SUMMIN @Bits 0..11 : Number of received zeros */
  #define RADIO_BITSLICERSTAT_SUMMIN_Pos (0UL)       /*!< Position of SUMMIN field.                                            */
  #define RADIO_BITSLICERSTAT_SUMMIN_Msk (0xFFFUL << RADIO_BITSLICERSTAT_SUMMIN_Pos) /*!< Bit mask of SUMMIN field.            */

/* SUMMAX @Bits 16..27 : Number of received ones */
  #define RADIO_BITSLICERSTAT_SUMMAX_Pos (16UL)      /*!< Position of SUMMAX field.                                            */
  #define RADIO_BITSLICERSTAT_SUMMAX_Msk (0xFFFUL << RADIO_BITSLICERSTAT_SUMMAX_Pos) /*!< Bit mask of SUMMAX field.            */


/* RADIO_BBCTRL: Miscellaneous mode bits */
  #define RADIO_BBCTRL_ResetValue (0x00001114UL)     /*!< Reset value of BBCTRL register.                                      */

/* BLELONGRANGE @Bit 0 : Enable long range mode (enabling both 15.4 and long range is not legal) */
  #define RADIO_BBCTRL_BLELONGRANGE_Pos (0UL)        /*!< Position of BLELONGRANGE field.                                      */
  #define RADIO_BBCTRL_BLELONGRANGE_Msk (0x1UL << RADIO_BBCTRL_BLELONGRANGE_Pos) /*!< Bit mask of BLELONGRANGE field.          */
  #define RADIO_BBCTRL_BLELONGRANGE_Min (0x0UL)      /*!< Min enumerator value of BLELONGRANGE field.                          */
  #define RADIO_BBCTRL_BLELONGRANGE_Max (0x1UL)      /*!< Max enumerator value of BLELONGRANGE field.                          */
  #define RADIO_BBCTRL_BLELONGRANGE_Disabled (0x0UL) /*!< BLELONGRANGE_NO                                                      */
  #define RADIO_BBCTRL_BLELONGRANGE_Enabled (0x1UL)  /*!< BLELONGRANGE_YES                                                     */

/* IEEE802154 @Bit 1 : Enable 15.4 mode (enabling both 15.4 and long range is not legal) */
  #define RADIO_BBCTRL_IEEE802154_Pos (1UL)          /*!< Position of IEEE802154 field.                                        */
  #define RADIO_BBCTRL_IEEE802154_Msk (0x1UL << RADIO_BBCTRL_IEEE802154_Pos) /*!< Bit mask of IEEE802154 field.                */
  #define RADIO_BBCTRL_IEEE802154_Min (0x0UL)        /*!< Min enumerator value of IEEE802154 field.                            */
  #define RADIO_BBCTRL_IEEE802154_Max (0x1UL)        /*!< Max enumerator value of IEEE802154 field.                            */
  #define RADIO_BBCTRL_IEEE802154_Disabled (0x0UL)   /*!< IEEE802154_NO                                                        */
  #define RADIO_BBCTRL_IEEE802154_Enabled (0x1UL)    /*!< IEEE802154_YES                                                       */

/* HYPERMODE @Bit 2 : Enable Hyper demodulator */
  #define RADIO_BBCTRL_HYPERMODE_Pos (2UL)           /*!< Position of HYPERMODE field.                                         */
  #define RADIO_BBCTRL_HYPERMODE_Msk (0x1UL << RADIO_BBCTRL_HYPERMODE_Pos) /*!< Bit mask of HYPERMODE field.                   */
  #define RADIO_BBCTRL_HYPERMODE_Min (0x0UL)         /*!< Min enumerator value of HYPERMODE field.                             */
  #define RADIO_BBCTRL_HYPERMODE_Max (0x1UL)         /*!< Max enumerator value of HYPERMODE field.                             */
  #define RADIO_BBCTRL_HYPERMODE_Disabled (0x0UL)    /*!< HYPERMODE_NO                                                         */
  #define RADIO_BBCTRL_HYPERMODE_Enabled (0x1UL)     /*!< HYPERMODE_YES                                                        */

/* DEMODFILTMODE @Bits 4..6 : Decimation mode in PantherDemodFilt */
  #define RADIO_BBCTRL_DEMODFILTMODE_Pos (4UL)       /*!< Position of DEMODFILTMODE field.                                     */
  #define RADIO_BBCTRL_DEMODFILTMODE_Msk (0x7UL << RADIO_BBCTRL_DEMODFILTMODE_Pos) /*!< Bit mask of DEMODFILTMODE field.       */
  #define RADIO_BBCTRL_DEMODFILTMODE_Min (0x0UL)     /*!< Min enumerator value of DEMODFILTMODE field.                         */
  #define RADIO_BBCTRL_DEMODFILTMODE_Max (0x3UL)     /*!< Max enumerator value of DEMODFILTMODE field.                         */
  #define RADIO_BBCTRL_DEMODFILTMODE_2M (0x0UL)      /*!< Decimation mode 2M                                                   */
  #define RADIO_BBCTRL_DEMODFILTMODE_1M (0x1UL)      /*!< Decimation mode 1M                                                   */
  #define RADIO_BBCTRL_DEMODFILTMODE_250K (0x3UL)    /*!< Decimation mode 250K                                                 */

/* MODINDEX @Bits 8..10 : Modulation index for RxDBCCoeffGen and RxMFB */
  #define RADIO_BBCTRL_MODINDEX_Pos (8UL)            /*!< Position of MODINDEX field.                                          */
  #define RADIO_BBCTRL_MODINDEX_Msk (0x7UL << RADIO_BBCTRL_MODINDEX_Pos) /*!< Bit mask of MODINDEX field.                      */
  #define RADIO_BBCTRL_MODINDEX_Min (0x0UL)          /*!< Min enumerator value of MODINDEX field.                              */
  #define RADIO_BBCTRL_MODINDEX_Max (0x4UL)          /*!< Max enumerator value of MODINDEX field.                              */
  #define RADIO_BBCTRL_MODINDEX_0h25 (0x0UL)         /*!< Modulation index h=0.25                                              */
  #define RADIO_BBCTRL_MODINDEX_0h32 (0x1UL)         /*!< Modulation index h=0.32                                              */
  #define RADIO_BBCTRL_MODINDEX_0h5 (0x2UL)          /*!< Modulation index h=0.5                                               */
  #define RADIO_BBCTRL_MODINDEX_1h0 (0x3UL)          /*!< Modulation index h=1.0                                               */
  #define RADIO_BBCTRL_MODINDEX_2h0 (0x4UL)          /*!< Modulation index h=2.0                                               */

