adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SOFTBITMODE @Bits 8..9 : Method used for the softbit calulation */
  #define RADIO_MFB_SOFTBITMODE_Pos (8UL)            /*!< Position of SOFTBITMODE field.                                       */
  #define RADIO_MFB_SOFTBITMODE_Msk (0x3UL << RADIO_MFB_SOFTBITMODE_Pos) /*!< Bit mask of SOFTBITMODE field.                   */
  #define RADIO_MFB_SOFTBITMODE_Max (0x0UL)          /*!< Softbit calculation in MFB uses the maximum                          */
  #define RADIO_MFB_SOFTBITMODE_Sum (0x1UL)          /*!< Softbit calculation in MFB uses the sum                              */
  #define RADIO_MFB_SOFTBITMODE_WSum1 (0x2UL)        /*!< Softbit calculation in MFB uses the weighted sum 1                   */
  #define RADIO_MFB_SOFTBITMODE_WSum2 (0x3UL)        /*!< Softbit calculation in MFB uses the weighted sum 2                   */

/* USEMJ @Bit 10 : Use hard bit from majority vote as the output of the RxMFB. Use hard bit from soft bit generator otherwise. */
  #define RADIO_MFB_USEMJ_Pos (10UL)                 /*!< Position of USEMJ field.                                             */
  #define RADIO_MFB_USEMJ_Msk (0x1UL << RADIO_MFB_USEMJ_Pos) /*!< Bit mask of USEMJ field.                                     */

/* USEMJFB @Bit 11 : Use hard bit from majority vote as the feedback inside the RxMFB. Use hard bit from soft bit generator
                     otherwise. */

  #define RADIO_MFB_USEMJFB_Pos (11UL)               /*!< Position of USEMJFB field.                                           */
  #define RADIO_MFB_USEMJFB_Msk (0x1UL << RADIO_MFB_USEMJFB_Pos) /*!< Bit mask of USEMJFB field.                               */

/* ENABLEFEEDBACK @Bit 12 : Enable decision feedback for matched filter bank */
  #define RADIO_MFB_ENABLEFEEDBACK_Pos (12UL)        /*!< Position of ENABLEFEEDBACK field.                                    */
  #define RADIO_MFB_ENABLEFEEDBACK_Msk (0x1UL << RADIO_MFB_ENABLEFEEDBACK_Pos) /*!< Bit mask of ENABLEFEEDBACK field.          */


/* RADIO_CN: Configuration for the CNRIPPLEWARN functionality used for BLE LR. Configuration is only enabled when
              OVRENCNRIPPLEWARNCFG in OVERRIDE23 is set */

  #define RADIO_CN_ResetValue (0x00000000UL)         /*!< Reset value of CN register.                                          */

/* PEAKMINTHR @Bits 0..15 : Required peak height compared to baseline level measured just before the peak at the double
                            correlator output. If the peak height is below the threshold, it will be ignored. This feature is
                            disabled when CNPEAKMINTHR is set to 0x0000. */

  #define RADIO_CN_PEAKMINTHR_Pos (0UL)              /*!< Position of PEAKMINTHR field.                                        */
  #define RADIO_CN_PEAKMINTHR_Msk (0xFFFFUL << RADIO_CN_PEAKMINTHR_Pos) /*!< Bit mask of PEAKMINTHR field.                     */

/* ABSMAXTHR @Bits 16..31 : maximum baseline value before the peak at the double correlator output. if the baseline value is
                            above the threshold, the following peak will be ignored. this value is ignored when CNABSMAXTHR is
                            set to 0x0000. */

  #define RADIO_CN_ABSMAXTHR_Pos (16UL)              /*!< Position of ABSMAXTHR field.                                         */
  #define RADIO_CN_ABSMAXTHR_Msk (0xFFFFUL << RADIO_CN_ABSMAXTHR_Pos) /*!< Bit mask of ABSMAXTHR field.                        */


/* RADIO_PEAK: Peak detector configuration */
  #define RADIO_PEAK_ResetValue (0x00000002UL)       /*!< Reset value of PEAK register.                                        */

/* ENMAYBESIDELOBE @Bit 0 : Ignore peaks from DBC which look like sidelobes */
  #define RADIO_PEAK_ENMAYBESIDELOBE_Pos (0UL)       /*!< Position of ENMAYBESIDELOBE field.                                   */
  #define RADIO_PEAK_ENMAYBESIDELOBE_Msk (0x1UL << RADIO_PEAK_ENMAYBESIDELOBE_Pos) /*!< Bit mask of ENMAYBESIDELOBE field.     */

/* ENADUALDISTANCE @Bit 1 : Allow dual distance between peaks */
  #define RADIO_PEAK_ENADUALDISTANCE_Pos (1UL)       /*!< Position of ENADUALDISTANCE field.                                   */
  #define RADIO_PEAK_ENADUALDISTANCE_Msk (0x1UL << RADIO_PEAK_ENADUALDISTANCE_Pos) /*!< Bit mask of ENADUALDISTANCE field.     */


/* RADIO_BBCKSEL: Clock rates */
  #define RADIO_BBCKSEL_ResetValue (0x00772222UL)    /*!< Reset value of BBCKSEL register.                                     */

/* STDDEMODDIVA @Bits 0..2 : Standard demod clock divider A */
  #define RADIO_BBCKSEL_STDDEMODDIVA_Pos (0UL)       /*!< Position of STDDEMODDIVA field.                                      */
  #define RADIO_BBCKSEL_STDDEMODDIVA_Msk (0x7UL << RADIO_BBCKSEL_STDDEMODDIVA_Pos) /*!< Bit mask of STDDEMODDIVA field.        */
  #define RADIO_BBCKSEL_STDDEMODDIVA_Min (0x0UL)     /*!< Min enumerator value of STDDEMODDIVA field.                          */
  #define RADIO_BBCKSEL_STDDEMODDIVA_Max (0x7UL)     /*!< Max enumerator value of STDDEMODDIVA field.                          */
  #define RADIO_BBCKSEL_STDDEMODDIVA_32M (0x0UL)     /*!< Clock 32MHz                                                          */
  #define RADIO_BBCKSEL_STDDEMODDIVA_16M (0x1UL)     /*!< Clock 16MHz                                                          */
  #define RADIO_BBCKSEL_STDDEMODDIVA_8M (0x2UL)      /*!< Clock 8MHz                                                           */
  #define RADIO_BBCKSEL_STDDEMODDIVA_4M (0x3UL)      /*!< Clock 4MHz                                                           */
  #define RADIO_BBCKSEL_STDDEMODDIVA_2M (0x4UL)      /*!< Clock 2MHz                                                           */
  #define RADIO_BBCKSEL_STDDEMODDIVA_1M (0x5UL)      /*!< Clock 1MHz                                                           */
  #define RADIO_BBCKSEL_STDDEMODDIVA_500K (0x6UL)    /*!< Clock 500kHz                                                         */
  #define RADIO_BBCKSEL_STDDEMODDIVA_Disabled (0x7UL) /*!< Clock OFF                                                           */

/* STDDEMODDIVB @Bits 4..6 : Standard demod clock divider B */
  #define RADIO_BBCKSEL_STDDEMODDIVB_Pos (4UL)       /*!< Position of STDDEMODDIVB field.                                      */
  #define RADIO_BBCKSEL_STDDEMODDIVB_Msk (0x7UL << RADIO_BBCKSEL_STDDEMODDIVB_Pos) /*!< Bit mask of STDDEMODDIVB field.        */
  #define RADIO_BBCKSEL_STDDEMODDIVB_Min (0x0UL)     /*!< Min enumerator value of STDDEMODDIVB field.                          */
  #define RADIO_BBCKSEL_STDDEMODDIVB_Max (0x7UL)     /*!< Max enumerator value of STDDEMODDIVB field.                          */
  #define RADIO_BBCKSEL_STDDEMODDIVB_32M (0x0UL)     /*!< Clock 32MHz                                                          */
  #define RADIO_BBCKSEL_STDDEMODDIVB_16M (0x1UL)     /*!< Clock 16MHz                                                          */
  #define RADIO_BBCKSEL_STDDEMODDIVB_8M (0x2UL)      /*!< Clock 8MHz                                                           */
  #define RADIO_BBCKSEL_STDDEMODDIVB_4M (0x3UL)      /*!< Clock 4MHz                                                           */
  #define RADIO_BBCKSEL_STDDEMODDIVB_2M (0x4UL)      /*!< Clock 2MHz                                                           */
  #define RADIO_BBCKSEL_STDDEMODDIVB_1M (0x5UL)      /*!< Clock 1MHz                                                           */
  #define RADIO_BBCKSEL_STDDEMODDIVB_500K (0x6UL)    /*!< Clock 500kHz                                                         */
  #define RADIO_BBCKSEL_STDDEMODDIVB_Disabled (0x7UL) /*!< Clock OFF                                                           */

