adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ALPHA @Bits 0..7 : Override value for IIR feedback , drift estimator (hypermode) */
  #define RADIO_DRIFT1_ALPHA_Pos (0UL)               /*!< Position of ALPHA field.                                             */
  #define RADIO_DRIFT1_ALPHA_Msk (0xFFUL << RADIO_DRIFT1_ALPHA_Pos) /*!< Bit mask of ALPHA field.                              */

/* VALIDTH @Bits 8..16 : Override value for driftValidTh, drift estimator (hypermode) */
  #define RADIO_DRIFT1_VALIDTH_Pos (8UL)             /*!< Position of VALIDTH field.                                           */
  #define RADIO_DRIFT1_VALIDTH_Msk (0x1FFUL << RADIO_DRIFT1_VALIDTH_Pos) /*!< Bit mask of VALIDTH field.                       */

/* SATENABLEALWAYS @Bit 24 : Enable saturation in drift calculator for all modes */
  #define RADIO_DRIFT1_SATENABLEALWAYS_Pos (24UL)    /*!< Position of SATENABLEALWAYS field.                                   */
  #define RADIO_DRIFT1_SATENABLEALWAYS_Msk (0x1UL << RADIO_DRIFT1_SATENABLEALWAYS_Pos) /*!< Bit mask of SATENABLEALWAYS field. */


/* RADIO_DRIFT2: Drift Estimator configuration */
  #define RADIO_DRIFT2_ResetValue (0x0C8A0008UL)     /*!< Reset value of DRIFT2 register.                                      */

/* LOWTH @Bits 0..8 : Override value for driftLowTh, drift estimator (hypermode) */
  #define RADIO_DRIFT2_LOWTH_Pos (0UL)               /*!< Position of LOWTH field.                                             */
  #define RADIO_DRIFT2_LOWTH_Msk (0x1FFUL << RADIO_DRIFT2_LOWTH_Pos) /*!< Bit mask of LOWTH field.                             */

/* MAXDIST @Bits 16..19 : Override value for driftMaxDist, drift estimator (hypermode) */
  #define RADIO_DRIFT2_MAXDIST_Pos (16UL)            /*!< Position of MAXDIST field.                                           */
  #define RADIO_DRIFT2_MAXDIST_Msk (0xFUL << RADIO_DRIFT2_MAXDIST_Pos) /*!< Bit mask of MAXDIST field.                         */

/* DELAYTH @Bits 20..28 : Override value for driftDelayTh, drift estimator (hypermode) */
  #define RADIO_DRIFT2_DELAYTH_Pos (20UL)            /*!< Position of DELAYTH field.                                           */
  #define RADIO_DRIFT2_DELAYTH_Msk (0x1FFUL << RADIO_DRIFT2_DELAYTH_Pos) /*!< Bit mask of DELAYTH field.                       */


/* RADIO_DSSS: DSSS synchronizer trim values */
  #define RADIO_DSSS_ResetValue (0x00000202UL)       /*!< Reset value of DSSS register.                                        */

/* PEAKDISTTOL @Bits 0..2 : Override for dsssPeakDistanceTolerance */
  #define RADIO_DSSS_PEAKDISTTOL_Pos (0UL)           /*!< Position of PEAKDISTTOL field.                                       */
  #define RADIO_DSSS_PEAKDISTTOL_Msk (0x7UL << RADIO_DSSS_PEAKDISTTOL_Pos) /*!< Bit mask of PEAKDISTTOL field.                 */

/* MINPEAKCOUNT @Bits 8..10 : Override for dsssMinPeakCount */
  #define RADIO_DSSS_MINPEAKCOUNT_Pos (8UL)          /*!< Position of MINPEAKCOUNT field.                                      */
  #define RADIO_DSSS_MINPEAKCOUNT_Msk (0x7UL << RADIO_DSSS_MINPEAKCOUNT_Pos) /*!< Bit mask of MINPEAKCOUNT field.              */

/* MINPEAKCOUNTSTRICT @Bits 16..18 : Min number of peaks to detect before resyncing to another preamble while already working on
                                     a previous preamble in BleLrx. Also applies for Ieee 802.15.4 mode */

  #define RADIO_DSSS_MINPEAKCOUNTSTRICT_Pos (16UL)   /*!< Position of MINPEAKCOUNTSTRICT field.                                */
  #define RADIO_DSSS_MINPEAKCOUNTSTRICT_Msk (0x7UL << RADIO_DSSS_MINPEAKCOUNTSTRICT_Pos) /*!< Bit mask of MINPEAKCOUNTSTRICT
                                                                            field.*/

/* ENCFOAVE @Bit 24 : Enable CFO averaging */
  #define RADIO_DSSS_ENCFOAVE_Pos (24UL)             /*!< Position of ENCFOAVE field.                                          */
  #define RADIO_DSSS_ENCFOAVE_Msk (0x1UL << RADIO_DSSS_ENCFOAVE_Pos) /*!< Bit mask of ENCFOAVE field.                          */

/* ENSTAVE @Bit 25 : Enable strobe time averaging */
  #define RADIO_DSSS_ENSTAVE_Pos (25UL)              /*!< Position of ENSTAVE field.                                           */
  #define RADIO_DSSS_ENSTAVE_Msk (0x1UL << RADIO_DSSS_ENSTAVE_Pos) /*!< Bit mask of ENSTAVE field.                             */


/* RADIO_AUTOCORR: Autocorrelator configuration */
  #define RADIO_AUTOCORR_ResetValue (0x0007BD0FUL)   /*!< Reset value of AUTOCORR register.                                    */

/* EN @Bit 0 : Enable autocorrelator gating of peaks. */
  #define RADIO_AUTOCORR_EN_Pos (0UL)                /*!< Position of EN field.                                                */
  #define RADIO_AUTOCORR_EN_Msk (0x1UL << RADIO_AUTOCORR_EN_Pos) /*!< Bit mask of EN field.                                    */

/* ADAPEN @Bit 1 : Enable adaptive autocorrelator threshold settings based on historically observed correlator output values. */
  #define RADIO_AUTOCORR_ADAPEN_Pos (1UL)            /*!< Position of ADAPEN field.                                            */
  #define RADIO_AUTOCORR_ADAPEN_Msk (0x1UL << RADIO_AUTOCORR_ADAPEN_Pos) /*!< Bit mask of ADAPEN field.                        */

/* TH @Bits 2..6 : Default correlator threshold for deciding if valid correlator match is seen. Low setting of 0.10 is default.
                   */

  #define RADIO_AUTOCORR_TH_Pos (2UL)                /*!< Position of TH field.                                                */
  #define RADIO_AUTOCORR_TH_Msk (0x1FUL << RADIO_AUTOCORR_TH_Pos) /*!< Bit mask of TH field.                                   */

/* ADAPTH @Bits 7..11 : A ratio to update the autocorrelator ratio threshold when adaptive threshold is enabled and a strong
                        peak is found. Fraction of highest correlator match historically seen. Setting of 0.8125 is default. */

  #define RADIO_AUTOCORR_ADAPTH_Pos (7UL)            /*!< Position of ADAPTH field.                                            */
  #define RADIO_AUTOCORR_ADAPTH_Msk (0x1FUL << RADIO_AUTOCORR_ADAPTH_Pos) /*!< Bit mask of ADAPTH field.                       */

/* ADAPDE @Bits 12..16 : A ratio to decay the autocorrelator ratio threshold when using adaptive threshold and a weak peak is
                         found. */

  #define RADIO_AUTOCORR_ADAPDE_Pos (12UL)           /*!< Position of ADAPDE field.                                            */
  #define RADIO_AUTOCORR_ADAPDE_Msk (0x1FUL << RADIO_AUTOCORR_ADAPDE_Pos) /*!< Bit mask of ADAPDE field.                       */

/* ALPHA @Bits 17..20 : Gain factor for low pass filter used to smoothen autocorrelator output. Set to 0000 indicates to select
                        Max filter instead of LPF. */

  #define RADIO_AUTOCORR_ALPHA_Pos (17UL)            /*!< Position of ALPHA field.                                             */
  #define RADIO_AUTOCORR_ALPHA_Msk (0xFUL << RADIO_AUTOCORR_ALPHA_Pos) /*!< Bit mask of ALPHA field.                           */

/* OFFS @Bits 21..27 : Offset for comparing between current and historical AC magnitude */
  #define RADIO_AUTOCORR_OFFS_Pos (21UL)             /*!< Position of OFFS field.                                              */
  #define RADIO_AUTOCORR_OFFS_Msk (0x7FUL << RADIO_AUTOCORR_OFFS_Pos) /*!< Bit mask of OFFS field.                             */


/* RADIO_LRSYNC: LrSyncEngine configuration */
  #define RADIO_LRSYNC_ResetValue (0x003D1DE0UL)     /*!< Reset value of LRSYNC register.                                      */

/* MODE @Bits 0..3 : Modifying how the multiple lr125Front modules are used when synchronizing. */
  #define RADIO_LRSYNC_MODE_Pos (0UL)                /*!< Position of MODE field.                                              */
  #define RADIO_LRSYNC_MODE_Msk (0xFUL << RADIO_LRSYNC_MODE_Pos) /*!< Bit mask of MODE field.                                  */
  #define RADIO_LRSYNC_MODE_Min (0x0UL)              /*!< Min enumerator value of MODE field.                                  */
  #define RADIO_LRSYNC_MODE_Max (0x1UL)              /*!< Max enumerator value of MODE field.                                  */
  #define RADIO_LRSYNC_MODE_AllFrontends (0x0UL)     /*!< Use all the front ends                                               */
  #define RADIO_LRSYNC_MODE_OneFrontend (0x1UL)      /*!< Use only one front end                                               */

/* COUNTERLELRBLKECAC @Bits 4..9 : A counter is used to indicate the time window of e-CAC check. It counts the number of outputs
                                   from DeSpreadLELong and compares it with this configured value to see whether e-CAC result is
                                   valid. */

  #define RADIO_LRSYNC_COUNTERLELRBLKECAC_Pos (4UL)  /*!< Position of COUNTERLELRBLKECAC field.                                */
  #define RADIO_LRSYNC_COUNTERLELRBLKECAC_Msk (0x3FUL << RADIO_LRSYNC_COUNTERLELRBLKECAC_Pos) /*!< Bit mask of
                                                                            COUNTERLELRBLKECAC field.*/

/* COUNTERREDUCTION @Bits 10..13 : When a strong peak event is triggered and the average peak strength is higher than the
                                   history stored in the block, the timeout counter is reduced by the number configured in this
                                   register. The default value is 7. */

  #define RADIO_LRSYNC_COUNTERREDUCTION_Pos (10UL)   /*!< Position of COUNTERREDUCTION field.                                  */
  #define RADIO_LRSYNC_COUNTERREDUCTION_Msk (0xFUL << RADIO_LRSYNC_COUNTERREDUCTION_Pos) /*!< Bit mask of COUNTERREDUCTION
                                                                            field.*/

/* COUNTERLELRBLKTO @Bits 14..18 : A counter is used to reset the LelrBlk125 block that is active. It counts the number of
                                   outputs from DeSpreadLELong and compares it with this configured value to see whether a
                                   timeout event happens. The range is 32 to 60. Default value is 52. */

  #define RADIO_LRSYNC_COUNTERLELRBLKTO_Pos (14UL)   /*!< Position of COUNTERLELRBLKTO field.                                  */
  #define RADIO_LRSYNC_COUNTERLELRBLKTO_Msk (0x1FUL << RADIO_LRSYNC_COUNTERLELRBLKTO_Pos) /*!< Bit mask of COUNTERLELRBLKTO
                                                                            field.*/

/* POSSTARTTRACKER @Bits 19..20 : A toggle to tell when to start the trackers inside each LelrBlk125. */
  #define RADIO_LRSYNC_POSSTARTTRACKER_Pos (19UL)    /*!< Position of POSSTARTTRACKER field.                                   */
  #define RADIO_LRSYNC_POSSTARTTRACKER_Msk (0x3UL << RADIO_LRSYNC_POSSTARTTRACKER_Pos) /*!< Bit mask of POSSTARTTRACKER field. */
  #define RADIO_LRSYNC_POSSTARTTRACKER_Min (0x0UL)   /*!< Min enumerator value of POSSTARTTRACKER field.                       */
  #define RADIO_LRSYNC_POSSTARTTRACKER_Max (0x3UL)   /*!< Max enumerator value of POSSTARTTRACKER field.                       */
  #define RADIO_LRSYNC_POSSTARTTRACKER_Disabled (0x0UL) /*!< disabled for all times                                            */
  #define RADIO_LRSYNC_POSSTARTTRACKER_EnabledAfterFec1 (0x1UL) /*!< enabled after FEC1 is decoded                             */
  #define RADIO_LRSYNC_POSSTARTTRACKER_EnabledAfterFrameSync (0x2UL) /*!< enabled after frame sync is achieved                 */
  #define RADIO_LRSYNC_POSSTARTTRACKER_EnabledAfterLelrBlk125 (0x3UL) /*!< enabled after LelrBlk125 is activated               */

/* FSMODE @Bit 21 : Select between classic and MLSD based frame sync */
  #define RADIO_LRSYNC_FSMODE_Pos (21UL)             /*!< Position of FSMODE field.                                            */
  #define RADIO_LRSYNC_FSMODE_Msk (0x1UL << RADIO_LRSYNC_FSMODE_Pos) /*!< Bit mask of FSMODE field.                            */
  #define RADIO_LRSYNC_FSMODE_Min (0x0UL)            /*!< Min enumerator value of FSMODE field.                                */
  #define RADIO_LRSYNC_FSMODE_Max (0x1UL)            /*!< Max enumerator value of FSMODE field.                                */
  #define RADIO_LRSYNC_FSMODE_Classic (0x0UL)        /*!< classic mode                                                         */
  #define RADIO_LRSYNC_FSMODE_Mlsd (0x1UL)           /*!< MLSD mode                                                            */


/* RADIO_QOVERRIDE26: Override for selecting whether to use LrSyncEngine or the classic demodulator. */
  #define RADIO_QOVERRIDE26_ResetValue (0x00000001UL) /*!< Reset value of QOVERRIDE26 register.                                */

/* USELRSYNCENGINE @Bit 0 : Select whether to use LrSyncEngine or the classic demodulator. */
  #define RADIO_QOVERRIDE26_USELRSYNCENGINE_Pos (0UL) /*!< Position of USELRSYNCENGINE field.                                  */
  #define RADIO_QOVERRIDE26_USELRSYNCENGINE_Msk (0x1UL << RADIO_QOVERRIDE26_USELRSYNCENGINE_Pos) /*!< Bit mask of
                                                                            USELRSYNCENGINE field.*/
  #define RADIO_QOVERRIDE26_USELRSYNCENGINE_Min (0x0UL) /*!< Min enumerator value of USELRSYNCENGINE field.                    */
  #define RADIO_QOVERRIDE26_USELRSYNCENGINE_Max (0x1UL) /*!< Max enumerator value of USELRSYNCENGINE field.                    */
  #define RADIO_QOVERRIDE26_USELRSYNCENGINE_Classic (0x0UL) /*!< use classic demodulator                                       */
  #define RADIO_QOVERRIDE26_USELRSYNCENGINE_LrSyncEngine (0x1UL) /*!< Use LrSyncEngine demodulator                             */


/* RADIO_QOVERRIDE27: Override for selecting whether to use enhanced IEEE 802.15.4 or the classic IEEE 802.15.4 demodulator. */
  #define RADIO_QOVERRIDE27_ResetValue (0x00000001UL) /*!< Reset value of QOVERRIDE27 register.                                */

