adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* USE154SYNCENGINE @Bit 0 : Select whether to use enhanced IEEE 802.15.4 or the classic IEEE 802.15.4 demodulator. */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Pos (0UL) /*!< Position of USE154SYNCENGINE field.                                */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Msk (0x1UL << RADIO_QOVERRIDE27_USE154SYNCENGINE_Pos) /*!< Bit mask of
                                                                            USE154SYNCENGINE field.*/
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Min (0x0UL) /*!< Min enumerator value of USE154SYNCENGINE field.                  */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Max (0x1UL) /*!< Max enumerator value of USE154SYNCENGINE field.                  */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Classic (0x0UL) /*!< Use classic demodulator                                      */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Ieee154SyncEngine (0x1UL) /*!< Use IEEE 802.15.4 sync demodulator                 */

/* SFDMATCHRXSYNC154 @Bit 4 : SFD match configuration in RxSyncEngine for improved IEEE 802.15.4 */
  #define RADIO_QOVERRIDE27_SFDMATCHRXSYNC154_Pos (4UL) /*!< Position of SFDMATCHRXSYNC154 field.                              */
  #define RADIO_QOVERRIDE27_SFDMATCHRXSYNC154_Msk (0x1UL << RADIO_QOVERRIDE27_SFDMATCHRXSYNC154_Pos) /*!< Bit mask of
                                                                            SFDMATCHRXSYNC154 field.*/
  #define RADIO_QOVERRIDE27_SFDMATCHRXSYNC154_Min (0x0UL) /*!< Min enumerator value of SFDMATCHRXSYNC154 field.                */
  #define RADIO_QOVERRIDE27_SFDMATCHRXSYNC154_Max (0x1UL) /*!< Max enumerator value of SFDMATCHRXSYNC154 field.                */
  #define RADIO_QOVERRIDE27_SFDMATCHRXSYNC154_Default (0x0UL) /*!< Use SFD match from RxSyncEngine                             */
  #define RADIO_QOVERRIDE27_SFDMATCHRXSYNC154_Override (0x1UL) /*!< Use SFD match from UTxRxChain                              */


/* RADIO_RXSYNC: RxSyncEngine configuration */
  #define RADIO_RXSYNC_ResetValue (0x00006390UL)     /*!< Reset value of RXSYNC register.                                      */

/* ALPHAFREQ @Bits 0..4 : Coefficient to update frequency offset. Default value is 10000, corresponds to 1/2. */
  #define RADIO_RXSYNC_ALPHAFREQ_Pos (0UL)           /*!< Position of ALPHAFREQ field.                                         */
  #define RADIO_RXSYNC_ALPHAFREQ_Msk (0x1FUL << RADIO_RXSYNC_ALPHAFREQ_Pos) /*!< Bit mask of ALPHAFREQ field.                  */

/* BETAFREQ @Bits 5..9 : Coefficient to update frequency offset. Default value is 11100, corresponds to 7/8. */
  #define RADIO_RXSYNC_BETAFREQ_Pos (5UL)            /*!< Position of BETAFREQ field.                                          */
  #define RADIO_RXSYNC_BETAFREQ_Msk (0x1FUL << RADIO_RXSYNC_BETAFREQ_Pos) /*!< Bit mask of BETAFREQ field.                     */

/* PEAKTH @Bits 10..16 : Threshold value for peak strength. Default value is 0001100, corresponds to (0.31^2) scaled by 2^7 . */
  #define RADIO_RXSYNC_PEAKTH_Pos (10UL)             /*!< Position of PEAKTH field.                                            */
  #define RADIO_RXSYNC_PEAKTH_Msk (0x7FUL << RADIO_RXSYNC_PEAKTH_Pos) /*!< Bit mask of PEAKTH field.                           */


/* RADIO_TXCONFIG: Tx configuration */
  #define RADIO_TXCONFIG_ResetValue (0x00005878UL)   /*!< Reset value of TXCONFIG register.                                    */

/* CODEPOLY0 @Bits 0..6 : Code polynomial 0 */
  #define RADIO_TXCONFIG_CODEPOLY0_Pos (0UL)         /*!< Position of CODEPOLY0 field.                                         */
  #define RADIO_TXCONFIG_CODEPOLY0_Msk (0x7FUL << RADIO_TXCONFIG_CODEPOLY0_Pos) /*!< Bit mask of CODEPOLY0 field.              */

/* CODEPOLY1 @Bits 8..14 : Code polynomial 1 */
  #define RADIO_TXCONFIG_CODEPOLY1_Pos (8UL)         /*!< Position of CODEPOLY1 field.                                         */
  #define RADIO_TXCONFIG_CODEPOLY1_Msk (0x7FUL << RADIO_TXCONFIG_CODEPOLY1_Pos) /*!< Bit mask of CODEPOLY1 field.              */

/* LRSPREADSWAP @Bit 16 : Swap pattern mapping. Default 0, 0 is mapped to a 0011 sequence, 1 is mapped to a 1100 sequence. If
                          swap bit is set, 1 is mapped to a 0011 sequence, 0 is mapped to a 1100 sequence. */

  #define RADIO_TXCONFIG_LRSPREADSWAP_Pos (16UL)     /*!< Position of LRSPREADSWAP field.                                      */
  #define RADIO_TXCONFIG_LRSPREADSWAP_Msk (0x1UL << RADIO_TXCONFIG_LRSPREADSWAP_Pos) /*!< Bit mask of LRSPREADSWAP field.      */

/* BYPASSPRECODE @Bit 17 : Bypass MSK precoding */
  #define RADIO_TXCONFIG_BYPASSPRECODE_Pos (17UL)    /*!< Position of BYPASSPRECODE field.                                     */
  #define RADIO_TXCONFIG_BYPASSPRECODE_Msk (0x1UL << RADIO_TXCONFIG_BYPASSPRECODE_Pos) /*!< Bit mask of BYPASSPRECODE field.   */
  #define RADIO_TXCONFIG_BYPASSPRECODE_Min (0x0UL)   /*!< Min enumerator value of BYPASSPRECODE field.                         */
  #define RADIO_TXCONFIG_BYPASSPRECODE_Max (0x1UL)   /*!< Max enumerator value of BYPASSPRECODE field.                         */
  #define RADIO_TXCONFIG_BYPASSPRECODE_NotBypassed (0x0UL) /*!< Disable                                                        */
  #define RADIO_TXCONFIG_BYPASSPRECODE_Bypassed (0x1UL) /*!< Enable                                                            */

/* IQMODENABLE @Bit 18 : Enable IQ modulator */
  #define RADIO_TXCONFIG_IQMODENABLE_Pos (18UL)      /*!< Position of IQMODENABLE field.                                       */
  #define RADIO_TXCONFIG_IQMODENABLE_Msk (0x1UL << RADIO_TXCONFIG_IQMODENABLE_Pos) /*!< Bit mask of IQMODENABLE field.         */
  #define RADIO_TXCONFIG_IQMODENABLE_Min (0x0UL)     /*!< Min enumerator value of IQMODENABLE field.                           */
  #define RADIO_TXCONFIG_IQMODENABLE_Max (0x1UL)     /*!< Max enumerator value of IQMODENABLE field.                           */
  #define RADIO_TXCONFIG_IQMODENABLE_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIO_TXCONFIG_IQMODENABLE_Enabled (0x1UL) /*!< Enable                                                               */


/* RADIO_TXCTRL: Tx control */
  #define RADIO_TXCTRL_ResetValue (0x00010000UL)     /*!< Reset value of TXCTRL register.                                      */

/* BLELONGRANGE @Bit 0 : Enable Tx for BLE long range modes (Do not enable both Ieee802154_250Kbit and BLE long range) */
  #define RADIO_TXCTRL_BLELONGRANGE_Pos (0UL)        /*!< Position of BLELONGRANGE field.                                      */
  #define RADIO_TXCTRL_BLELONGRANGE_Msk (0x1UL << RADIO_TXCTRL_BLELONGRANGE_Pos) /*!< Bit mask of BLELONGRANGE field.          */
  #define RADIO_TXCTRL_BLELONGRANGE_Min (0x0UL)      /*!< Min enumerator value of BLELONGRANGE field.                          */
  #define RADIO_TXCTRL_BLELONGRANGE_Max (0x1UL)      /*!< Max enumerator value of BLELONGRANGE field.                          */
  #define RADIO_TXCTRL_BLELONGRANGE_Disabled (0x0UL) /*!< Disable Tx for BLE long range modes                                  */
  #define RADIO_TXCTRL_BLELONGRANGE_Enabled (0x1UL)  /*!< Enable Tx for BLE long range modes                                   */

/* IEEE802154 @Bit 1 : Enable Tx for Ieee802154_250Kbit mode and long range modes (Do not enable both Ieee802154_250Kbit and
                       long range) */

  #define RADIO_TXCTRL_IEEE802154_Pos (1UL)          /*!< Position of IEEE802154 field.                                        */
  #define RADIO_TXCTRL_IEEE802154_Msk (0x1UL << RADIO_TXCTRL_IEEE802154_Pos) /*!< Bit mask of IEEE802154 field.                */
  #define RADIO_TXCTRL_IEEE802154_Min (0x0UL)        /*!< Min enumerator value of IEEE802154 field.                            */
  #define RADIO_TXCTRL_IEEE802154_Max (0x1UL)        /*!< Max enumerator value of IEEE802154 field.                            */
  #define RADIO_TXCTRL_IEEE802154_Disabled (0x0UL)   /*!< Disable Tx for Ieee802154_250Kbit mode                               */
  #define RADIO_TXCTRL_IEEE802154_Enabled (0x1UL)    /*!< Enable Tx for Ieee802154_250Kbit mode                                */

/* IQMODINDEX @Bits 8..10 : IQMOD modulation index */
  #define RADIO_TXCTRL_IQMODINDEX_Pos (8UL)          /*!< Position of IQMODINDEX field.                                        */
  #define RADIO_TXCTRL_IQMODINDEX_Msk (0x7UL << RADIO_TXCTRL_IQMODINDEX_Pos) /*!< Bit mask of IQMODINDEX field.                */
  #define RADIO_TXCTRL_IQMODINDEX_Min (0x0UL)        /*!< Min enumerator value of IQMODINDEX field.                            */
  #define RADIO_TXCTRL_IQMODINDEX_Max (0x4UL)        /*!< Max enumerator value of IQMODINDEX field.                            */
  #define RADIO_TXCTRL_IQMODINDEX_ModIndex0h25 (0x0UL) /*!< Modulation index = 0.25(Future)                                    */
  #define RADIO_TXCTRL_IQMODINDEX_ModIndex0h32 (0x1UL) /*!< Modulation index = 0.32(Future)                                    */
  #define RADIO_TXCTRL_IQMODINDEX_ModIndex0h5 (0x2UL) /*!< Modulation index = 0.5(Future)                                      */
  #define RADIO_TXCTRL_IQMODINDEX_ModIndex1h0 (0x3UL) /*!< Modulation index = 1(Future)                                        */
  #define RADIO_TXCTRL_IQMODINDEX_ModIndex2h0 (0x4UL) /*!< Modulation index = 2(Future)                                        */

/* IQMODBT @Bits 16..17 : IQMOD GFSK bandwidth */
  #define RADIO_TXCTRL_IQMODBT_Pos (16UL)            /*!< Position of IQMODBT field.                                           */
  #define RADIO_TXCTRL_IQMODBT_Msk (0x3UL << RADIO_TXCTRL_IQMODBT_Pos) /*!< Bit mask of IQMODBT field.                         */
  #define RADIO_TXCTRL_IQMODBT_Min (0x0UL)           /*!< Min enumerator value of IQMODBT field.                               */
  #define RADIO_TXCTRL_IQMODBT_Max (0x3UL)           /*!< Max enumerator value of IQMODBT field.                               */
  #define RADIO_TXCTRL_IQMODBT_1BT00 (0x0UL)         /*!< BT=1.00                                                              */
  #define RADIO_TXCTRL_IQMODBT_0BT60 (0x1UL)         /*!< BT=0.60                                                              */
  #define RADIO_TXCTRL_IQMODBT_2BT00 (0x2UL)         /*!< BT=2.00                                                              */
  #define RADIO_TXCTRL_IQMODBT_0BT40 (0x3UL)         /*!< BT=0.40                                                              */

/* IQMODSYMBOL @Bits 20..22 : IQMOD additional symbol mapping not set by MODE(Future) */
  #define RADIO_TXCTRL_IQMODSYMBOL_Pos (20UL)        /*!< Position of IQMODSYMBOL field.                                       */
  #define RADIO_TXCTRL_IQMODSYMBOL_Msk (0x7UL << RADIO_TXCTRL_IQMODSYMBOL_Pos) /*!< Bit mask of IQMODSYMBOL field.             */


/* RADIO_DFEMODE: Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD) */
  #define RADIO_DFEMODE_ResetValue (0x00000000UL)    /*!< Reset value of DFEMODE register.                                     */

/* DFEOPMODE @Bits 0..1 : Direction finding operation mode */
  #define RADIO_DFEMODE_DFEOPMODE_Pos (0UL)          /*!< Position of DFEOPMODE field.                                         */
  #define RADIO_DFEMODE_DFEOPMODE_Msk (0x3UL << RADIO_DFEMODE_DFEOPMODE_Pos) /*!< Bit mask of DFEOPMODE field.                 */
  #define RADIO_DFEMODE_DFEOPMODE_Min (0x0UL)        /*!< Min enumerator value of DFEOPMODE field.                             */
  #define RADIO_DFEMODE_DFEOPMODE_Max (0x3UL)        /*!< Max enumerator value of DFEOPMODE field.                             */
  #define RADIO_DFEMODE_DFEOPMODE_Disabled (0x0UL)   /*!< Direction finding mode disabled                                      */
  #define RADIO_DFEMODE_DFEOPMODE_AoD (0x2UL)        /*!< Direction finding mode set to AoD                                    */
  #define RADIO_DFEMODE_DFEOPMODE_AoA (0x3UL)        /*!< Direction finding mode set to AoA                                    */


/* RADIO_DFESTATUS: DFE status information */
  #define RADIO_DFESTATUS_ResetValue (0x00000000UL)  /*!< Reset value of DFESTATUS register.                                   */

/* SWITCHINGSTATE @Bits 0..2 : Internal state of switching state machine */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Pos (0UL)   /*!< Position of SWITCHINGSTATE field.                                    */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Msk (0x7UL << RADIO_DFESTATUS_SWITCHINGSTATE_Pos) /*!< Bit mask of SWITCHINGSTATE
                                                                            field.*/
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Min (0x0UL) /*!< Min enumerator value of SWITCHINGSTATE field.                        */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Max (0x5UL) /*!< Max enumerator value of SWITCHINGSTATE field.                        */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Idle (0x0UL) /*!< Switching state Idle                                                */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Offset (0x1UL) /*!< Switching state Offset                                            */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Guard (0x2UL) /*!< Switching state Guard                                              */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Ref (0x3UL) /*!< Switching state Ref                                                  */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Switching (0x4UL) /*!< Switching state Switching                                      */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Ending (0x5UL) /*!< Switching state Ending                                            */

/* SAMPLINGSTATE @Bit 4 : Internal state of sampling state machine */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Pos (4UL)    /*!< Position of SAMPLINGSTATE field.                                     */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Msk (0x1UL << RADIO_DFESTATUS_SAMPLINGSTATE_Pos) /*!< Bit mask of SAMPLINGSTATE field. */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Min (0x0UL)  /*!< Min enumerator value of SAMPLINGSTATE field.                         */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Max (0x1UL)  /*!< Max enumerator value of SAMPLINGSTATE field.                         */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Idle (0x0UL) /*!< Sampling state Idle                                                  */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Sampling (0x1UL) /*!< Sampling state Sampling                                          */


