adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TSAMPLEOFFSET @Bits 16..27 : Signed value offset before starting sampling in number of 16M cycles relative to the beginning
                                of the REFERENCE state - 12 us after switching start */

  #define RADIO_DFECTRL2_TSAMPLEOFFSET_Pos (16UL)    /*!< Position of TSAMPLEOFFSET field.                                     */
  #define RADIO_DFECTRL2_TSAMPLEOFFSET_Msk (0xFFFUL << RADIO_DFECTRL2_TSAMPLEOFFSET_Pos) /*!< Bit mask of TSAMPLEOFFSET field. */


/* RADIO_DFECTRL3: Various hacker/tuning configuration for Direction finding */
  #define RADIO_DFECTRL3_ResetValue (0x28433000UL)   /*!< Reset value of DFECTRL3 register.                                    */

/* SPACINGBETWEEN @Bits 0..5 : Signed tuning value for the spacing between the last sample in the reference period and the first
                               sample in the first sample slot */

  #define RADIO_DFECTRL3_SPACINGBETWEEN_Pos (0UL)    /*!< Position of SPACINGBETWEEN field.                                    */
  #define RADIO_DFECTRL3_SPACINGBETWEEN_Msk (0x3FUL << RADIO_DFECTRL3_SPACINGBETWEEN_Pos) /*!< Bit mask of SPACINGBETWEEN
                                                                            field.*/

/* SPACINGBETWEEN2US @Bits 6..11 : Same as SPACINGBETWEEN when using CTEINLINECTRL and CTEType is 2 us slots */
  #define RADIO_DFECTRL3_SPACINGBETWEEN2US_Pos (6UL) /*!< Position of SPACINGBETWEEN2US field.                                 */
  #define RADIO_DFECTRL3_SPACINGBETWEEN2US_Msk (0x3FUL << RADIO_DFECTRL3_SPACINGBETWEEN2US_Pos) /*!< Bit mask of
                                                                            SPACINGBETWEEN2US field.*/

/* COMP4USSWITCHING @Bits 12..15 : Number of 4us periods to subtract from numberOf8us when calculating total number of antenna
                                   slots switches */

  #define RADIO_DFECTRL3_COMP4USSWITCHING_Pos (12UL) /*!< Position of COMP4USSWITCHING field.                                  */
  #define RADIO_DFECTRL3_COMP4USSWITCHING_Msk (0xFUL << RADIO_DFECTRL3_COMP4USSWITCHING_Pos) /*!< Bit mask of COMP4USSWITCHING
                                                                            field.*/

/* COMP4USSAMPLING @Bits 16..19 : Number of 4us periods to subtract from numberOf8us when calculating total number of samples to
                                  capture */

  #define RADIO_DFECTRL3_COMP4USSAMPLING_Pos (16UL)  /*!< Position of COMP4USSAMPLING field.                                   */
  #define RADIO_DFECTRL3_COMP4USSAMPLING_Msk (0xFUL << RADIO_DFECTRL3_COMP4USSAMPLING_Pos) /*!< Bit mask of COMP4USSAMPLING
                                                                            field.*/

/* TGUARDPERIOD @Bits 20..23 : Length of GUARD period in number of microseconds, normally 4 */
  #define RADIO_DFECTRL3_TGUARDPERIOD_Pos (20UL)     /*!< Position of TGUARDPERIOD field.                                      */
  #define RADIO_DFECTRL3_TGUARDPERIOD_Msk (0xFUL << RADIO_DFECTRL3_TGUARDPERIOD_Pos) /*!< Bit mask of TGUARDPERIOD field.      */

/* TREFPERIOD @Bits 24..28 : Length of REFERENCE period in number of microseconds, normally 8 */
  #define RADIO_DFECTRL3_TREFPERIOD_Pos (24UL)       /*!< Position of TREFPERIOD field.                                        */
  #define RADIO_DFECTRL3_TREFPERIOD_Msk (0x1FUL << RADIO_DFECTRL3_TREFPERIOD_Pos) /*!< Bit mask of TREFPERIOD field.           */

/* CHANGESAMPLERATE @Bit 29 : Whether to have the ability to have separate sampling rate in the REFERENCE period vs the
                              SWITCHING state */

  #define RADIO_DFECTRL3_CHANGESAMPLERATE_Pos (29UL) /*!< Position of CHANGESAMPLERATE field.                                  */
  #define RADIO_DFECTRL3_CHANGESAMPLERATE_Msk (0x1UL << RADIO_DFECTRL3_CHANGESAMPLERATE_Pos) /*!< Bit mask of CHANGESAMPLERATE
                                                                            field.*/
  #define RADIO_DFECTRL3_CHANGESAMPLERATE_Min (0x0UL) /*!< Min enumerator value of CHANGESAMPLERATE field.                     */
  #define RADIO_DFECTRL3_CHANGESAMPLERATE_Max (0x1UL) /*!< Max enumerator value of CHANGESAMPLERATE field.                     */
  #define RADIO_DFECTRL3_CHANGESAMPLERATE_Same (0x0UL) /*!< Always use sample spacing given by TSAMPLESPACINGREF               */
  #define RADIO_DFECTRL3_CHANGESAMPLERATE_Change (0x1UL) /*!< Use TSAMPLESPACINGREF in the REFERENCE period, and TSAMPLESPACING
                                                              or CTEINLINEAODRXMODExUS in the SWITCHING period*/

/* MIRRORSEQUENCE @Bit 30 : When reaching the last antenna pattern, it repeats that pattern, and then goes back down again. */
  #define RADIO_DFECTRL3_MIRRORSEQUENCE_Pos (30UL)   /*!< Position of MIRRORSEQUENCE field.                                    */
  #define RADIO_DFECTRL3_MIRRORSEQUENCE_Msk (0x1UL << RADIO_DFECTRL3_MIRRORSEQUENCE_Pos) /*!< Bit mask of MIRRORSEQUENCE field.*/
  #define RADIO_DFECTRL3_MIRRORSEQUENCE_Min (0x0UL)  /*!< Min enumerator value of MIRRORSEQUENCE field.                        */
  #define RADIO_DFECTRL3_MIRRORSEQUENCE_Max (0x1UL)  /*!< Max enumerator value of MIRRORSEQUENCE field.                        */
  #define RADIO_DFECTRL3_MIRRORSEQUENCE_Disabled (0x0UL) /*!< Do not mirror the sequence                                       */
  #define RADIO_DFECTRL3_MIRRORSEQUENCE_Enabled (0x1UL) /*!< Mirror the sequence                                               */

/* SHORTENMIRRORSEQUENCE @Bit 31 : Applies only when MIRRORSEQUENCE is set. Selects whether to repeat the end pattern (in both
                                   ends) or not */

  #define RADIO_DFECTRL3_SHORTENMIRRORSEQUENCE_Pos (31UL) /*!< Position of SHORTENMIRRORSEQUENCE field.                        */
  #define RADIO_DFECTRL3_SHORTENMIRRORSEQUENCE_Msk (0x1UL << RADIO_DFECTRL3_SHORTENMIRRORSEQUENCE_Pos) /*!< Bit mask of
                                                                            SHORTENMIRRORSEQUENCE field.*/
  #define RADIO_DFECTRL3_SHORTENMIRRORSEQUENCE_Min (0x0UL) /*!< Min enumerator value of SHORTENMIRRORSEQUENCE field.           */
  #define RADIO_DFECTRL3_SHORTENMIRRORSEQUENCE_Max (0x1UL) /*!< Max enumerator value of SHORTENMIRRORSEQUENCE field.           */
  #define RADIO_DFECTRL3_SHORTENMIRRORSEQUENCE_Disabled (0x0UL) /*!< End patterns are repeated                                 */
  #define RADIO_DFECTRL3_SHORTENMIRRORSEQUENCE_Enabled (0x1UL) /*!< End patterns are not repeated                              */


