adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* MAXTOTALSLOTS @Bits 8..18 : Maximum number of antenna slots */
  #define RADIO_DFECTRL4_MAXTOTALSLOTS_Pos (8UL)     /*!< Position of MAXTOTALSLOTS field.                                     */
  #define RADIO_DFECTRL4_MAXTOTALSLOTS_Msk (0x7FFUL << RADIO_DFECTRL4_MAXTOTALSLOTS_Pos) /*!< Bit mask of MAXTOTALSLOTS field. */

/* RETURNTOREFATEND @Bit 19 : Start position of repeated part of switching pattern sequence */
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Pos (19UL) /*!< Position of RETURNTOREFATEND field.                                  */
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Msk (0x1UL << RADIO_DFECTRL4_RETURNTOREFATEND_Pos) /*!< Bit mask of RETURNTOREFATEND
                                                                            field.*/
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Min (0x0UL) /*!< Min enumerator value of RETURNTOREFATEND field.                     */
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Max (0x1UL) /*!< Max enumerator value of RETURNTOREFATEND field.                     */
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Disabled (0x0UL) /*!< Return to SWITCHPATTERN[2] after reaching the end of the
                                                                switching pattern sequence*/
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Enabled (0x1UL) /*!< Return to SWITCHPATTERN[1] after reaching the end of the
                                                               switching pattern sequence*/

/* MAXTOTALSAMPLES @Bits 20..31 : Maximum number of samples to capture */
  #define RADIO_DFECTRL4_MAXTOTALSAMPLES_Pos (20UL)  /*!< Position of MAXTOTALSAMPLES field.                                   */
  #define RADIO_DFECTRL4_MAXTOTALSAMPLES_Msk (0xFFFUL << RADIO_DFECTRL4_MAXTOTALSAMPLES_Pos) /*!< Bit mask of MAXTOTALSAMPLES
                                                                            field.*/


/* RADIO_DFECTRL5: Various hacker/tuning configuration for Direction finding */
  #define RADIO_DFECTRL5_ResetValue (0x00010000UL)   /*!< Reset value of DFECTRL5 register.                                    */

/* SATURATIONMODE @Bits 16..17 : Set how input saturation will be present in the captured samples */
  #define RADIO_DFECTRL5_SATURATIONMODE_Pos (16UL)   /*!< Position of SATURATIONMODE field.                                    */
  #define RADIO_DFECTRL5_SATURATIONMODE_Msk (0x3UL << RADIO_DFECTRL5_SATURATIONMODE_Pos) /*!< Bit mask of SATURATIONMODE field.*/
  #define RADIO_DFECTRL5_SATURATIONMODE_Min (0x0UL)  /*!< Min enumerator value of SATURATIONMODE field.                        */
  #define RADIO_DFECTRL5_SATURATIONMODE_Max (0x2UL)  /*!< Max enumerator value of SATURATIONMODE field.                        */
  #define RADIO_DFECTRL5_SATURATIONMODE_Off (0x0UL)  /*!< No saturation is presented                                           */
  #define RADIO_DFECTRL5_SATURATIONMODE_SetMinVal (0x1UL) /*!< Saturation is marked by setting both I and Q to -32768 (or
                                                               mag/phase if SAMPLETYPE is 1)*/
  #define RADIO_DFECTRL5_SATURATIONMODE_SaturationBit (0x2UL) /*!< Bit 15 of both the I and Q values indicates saturation. I and
                                                                   Q are hence only 15 bit values*/

/* NEVERIGNORESAT @Bit 18 : Selects whether saturation (being reported from the radio front-end) should be ignored in the
                            beginning of the slot or not */

  #define RADIO_DFECTRL5_NEVERIGNORESAT_Pos (18UL)   /*!< Position of NEVERIGNORESAT field.                                    */
  #define RADIO_DFECTRL5_NEVERIGNORESAT_Msk (0x1UL << RADIO_DFECTRL5_NEVERIGNORESAT_Pos) /*!< Bit mask of NEVERIGNORESAT field.*/
  #define RADIO_DFECTRL5_NEVERIGNORESAT_Min (0x0UL)  /*!< Min enumerator value of NEVERIGNORESAT field.                        */
  #define RADIO_DFECTRL5_NEVERIGNORESAT_Max (0x1UL)  /*!< Max enumerator value of NEVERIGNORESAT field.                        */
  #define RADIO_DFECTRL5_NEVERIGNORESAT_Ignore (0x0UL) /*!< Saturation being indicated from the front-end is ignored if it
                                                            happens in the first 40 percent of the sample spacing after a sample
                                                            was saved to RAM*/
  #define RADIO_DFECTRL5_NEVERIGNORESAT_NeverIgnore (0x1UL) /*!< Saturation is always reported in RAM if detected by the
                                                                 frontend*/

/* DFEOFFSETSTDHYP @Bits 24..28 : Tuning of the timing difference between the hypermode demodulator and the standard demodulator
                                  for the DFE start event, in 62.5 ns units */

  #define RADIO_DFECTRL5_DFEOFFSETSTDHYP_Pos (24UL)  /*!< Position of DFEOFFSETSTDHYP field.                                   */
  #define RADIO_DFECTRL5_DFEOFFSETSTDHYP_Msk (0x1FUL << RADIO_DFECTRL5_DFEOFFSETSTDHYP_Pos) /*!< Bit mask of DFEOFFSETSTDHYP
                                                                            field.*/


/* RADIO_SWITCHPATTERN: GPIO patterns to be used for each antenna */
  #define RADIO_SWITCHPATTERN_ResetValue (0x00000000UL) /*!< Reset value of SWITCHPATTERN register.                            */

/* SWITCHPATTERN @Bits 0..7 : Fill array of GPIO patterns for antenna control */
  #define RADIO_SWITCHPATTERN_SWITCHPATTERN_Pos (0UL) /*!< Position of SWITCHPATTERN field.                                    */
  #define RADIO_SWITCHPATTERN_SWITCHPATTERN_Msk (0xFFUL << RADIO_SWITCHPATTERN_SWITCHPATTERN_Pos) /*!< Bit mask of SWITCHPATTERN
                                                                            field.*/


/* RADIO_CLEARPATTERN: Clear the GPIO pattern array for antenna control */
  #define RADIO_CLEARPATTERN_ResetValue (0x00000000UL) /*!< Reset value of CLEARPATTERN register.                              */

/* CLEARPATTERN @Bit 0 : Clear the GPIO pattern array for antenna control Behaves as a task register, but does not have PPI nor
                         IRQ */

  #define RADIO_CLEARPATTERN_CLEARPATTERN_Pos (0UL)  /*!< Position of CLEARPATTERN field.                                      */
  #define RADIO_CLEARPATTERN_CLEARPATTERN_Msk (0x1UL << RADIO_CLEARPATTERN_CLEARPATTERN_Pos) /*!< Bit mask of CLEARPATTERN
                                                                            field.*/


