adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TXADD2 @Bit 10 : TxAdd for device address 2 */
  #define RADIO_DACNF_TXADD2_Pos (10UL)              /*!< Position of TXADD2 field.                                            */
  #define RADIO_DACNF_TXADD2_Msk (0x1UL << RADIO_DACNF_TXADD2_Pos) /*!< Bit mask of TXADD2 field.                              */

/* TXADD3 @Bit 11 : TxAdd for device address 3 */
  #define RADIO_DACNF_TXADD3_Pos (11UL)              /*!< Position of TXADD3 field.                                            */
  #define RADIO_DACNF_TXADD3_Msk (0x1UL << RADIO_DACNF_TXADD3_Pos) /*!< Bit mask of TXADD3 field.                              */

/* TXADD4 @Bit 12 : TxAdd for device address 4 */
  #define RADIO_DACNF_TXADD4_Pos (12UL)              /*!< Position of TXADD4 field.                                            */
  #define RADIO_DACNF_TXADD4_Msk (0x1UL << RADIO_DACNF_TXADD4_Pos) /*!< Bit mask of TXADD4 field.                              */

/* TXADD5 @Bit 13 : TxAdd for device address 5 */
  #define RADIO_DACNF_TXADD5_Pos (13UL)              /*!< Position of TXADD5 field.                                            */
  #define RADIO_DACNF_TXADD5_Msk (0x1UL << RADIO_DACNF_TXADD5_Pos) /*!< Bit mask of TXADD5 field.                              */

/* TXADD6 @Bit 14 : TxAdd for device address 6 */
  #define RADIO_DACNF_TXADD6_Pos (14UL)              /*!< Position of TXADD6 field.                                            */
  #define RADIO_DACNF_TXADD6_Msk (0x1UL << RADIO_DACNF_TXADD6_Pos) /*!< Bit mask of TXADD6 field.                              */

/* TXADD7 @Bit 15 : TxAdd for device address 7 */
  #define RADIO_DACNF_TXADD7_Pos (15UL)              /*!< Position of TXADD7 field.                                            */
  #define RADIO_DACNF_TXADD7_Msk (0x1UL << RADIO_DACNF_TXADD7_Pos) /*!< Bit mask of TXADD7 field.                              */


/* RADIO_BCC: Bit counter compare */
  #define RADIO_BCC_ResetValue (0x00000000UL)        /*!< Reset value of BCC register.                                         */

/* BCC @Bits 0..31 : Bit counter compare */
  #define RADIO_BCC_BCC_Pos (0UL)                    /*!< Position of BCC field.                                               */
  #define RADIO_BCC_BCC_Msk (0xFFFFFFFFUL << RADIO_BCC_BCC_Pos) /*!< Bit mask of BCC field.                                    */


/* RADIO_AACHKOVERRIDE: Address Check Override */
  #define RADIO_AACHKOVERRIDE_ResetValue (0x02600000UL) /*!< Reset value of AACHKOVERRIDE register.                            */

/* ENDCOUNTHYPSTD @Bits 0..9 : Defines maximum number of PDU bits to compare between Hyper and Std demodulator */
  #define RADIO_AACHKOVERRIDE_ENDCOUNTHYPSTD_Pos (0UL) /*!< Position of ENDCOUNTHYPSTD field.                                  */
  #define RADIO_AACHKOVERRIDE_ENDCOUNTHYPSTD_Msk (0x3FFUL << RADIO_AACHKOVERRIDE_ENDCOUNTHYPSTD_Pos) /*!< Bit mask of
                                                                            ENDCOUNTHYPSTD field.*/

/* ENABLE @Bits 12..15 : Enable AA bit 15 check */
  #define RADIO_AACHKOVERRIDE_ENABLE_Pos (12UL)      /*!< Position of ENABLE field.                                            */
  #define RADIO_AACHKOVERRIDE_ENABLE_Msk (0xFUL << RADIO_AACHKOVERRIDE_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define RADIO_AACHKOVERRIDE_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define RADIO_AACHKOVERRIDE_ENABLE_Max (0xFUL)     /*!< Max enumerator value of ENABLE field.                                */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA16to31 (0x0UL) /*!< Enable AA16..31                                                     */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA15to31 (0x1UL) /*!< Enable AA15..31                                                     */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA14to31 (0x2UL) /*!< Enable AA14..31                                                     */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA13to31 (0x3UL) /*!< Enable AA13..31                                                     */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA12to31 (0x4UL) /*!< Enable AA12..31                                                     */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA11to31 (0x5UL) /*!< Enable AA11..31                                                     */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA10to31 (0x6UL) /*!< Enable AA10..31                                                     */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA9to31 (0x7UL) /*!< Enable AA9..31                                                       */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA8to31 (0x8UL) /*!< Enable AA8..31 (when 32-bit AA is enabled)                           */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA7to31 (0x9UL) /*!< Enable AA7..31 (when 32-bit AA is enabled)                           */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA6to31 (0xAUL) /*!< Enable AA6..31 (when 32-bit AA is enabled)                           */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA5to31 (0xBUL) /*!< Enable AA5..31 (when 32-bit AA is enabled)                           */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA4to31 (0xCUL) /*!< Enable AA4..31 (when 32-bit AA is enabled)                           */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA3to31 (0xDUL) /*!< Enable AA3..31 (when 32-bit AA is enabled)                           */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA2to31 (0xEUL) /*!< Enable AA2..31 (when 32-bit AA is enabled)                           */
  #define RADIO_AACHKOVERRIDE_ENABLE_AA1to31 (0xFUL) /*!< Enable AA1..31 (when 32-bit AA is enabled)                           */

/* DISABLE @Bit 19 : Disable std AA checker */
  #define RADIO_AACHKOVERRIDE_DISABLE_Pos (19UL)     /*!< Position of DISABLE field.                                           */
  #define RADIO_AACHKOVERRIDE_DISABLE_Msk (0x1UL << RADIO_AACHKOVERRIDE_DISABLE_Pos) /*!< Bit mask of DISABLE field.           */
  #define RADIO_AACHKOVERRIDE_DISABLE_Min (0x0UL)    /*!< Min enumerator value of DISABLE field.                               */
  #define RADIO_AACHKOVERRIDE_DISABLE_Max (0x1UL)    /*!< Max enumerator value of DISABLE field.                               */
  #define RADIO_AACHKOVERRIDE_DISABLE_Enabled (0x0UL) /*!< Enable std AA checker                                               */
  #define RADIO_AACHKOVERRIDE_DISABLE_Disabled (0x1UL) /*!< Disable std AA checker                                             */

/* ALLOWADDRMATCHEARLY @Bit 20 : Enable ignore std AA checker before shift register filled */
  #define RADIO_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Pos (20UL) /*!< Position of ALLOWADDRMATCHEARLY field.                       */
  #define RADIO_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Msk (0x1UL << RADIO_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Pos) /*!< Bit mask of
                                                                            ALLOWADDRMATCHEARLY field.*/
  #define RADIO_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Min (0x0UL) /*!< Min enumerator value of ALLOWADDRMATCHEARLY field.          */
  #define RADIO_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Max (0x1UL) /*!< Max enumerator value of ALLOWADDRMATCHEARLY field.          */
  #define RADIO_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Enabled (0x0UL) /*!< Enable                                                  */
  #define RADIO_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Disabled (0x1UL) /*!< Disable                                                */

/* PERFECTADDRWINDOW @Bit 21 : Enable timing accurate address match window in demodulator */
  #define RADIO_AACHKOVERRIDE_PERFECTADDRWINDOW_Pos (21UL) /*!< Position of PERFECTADDRWINDOW field.                           */
  #define RADIO_AACHKOVERRIDE_PERFECTADDRWINDOW_Msk (0x1UL << RADIO_AACHKOVERRIDE_PERFECTADDRWINDOW_Pos) /*!< Bit mask of
                                                                            PERFECTADDRWINDOW field.*/
  #define RADIO_AACHKOVERRIDE_PERFECTADDRWINDOW_Min (0x0UL) /*!< Min enumerator value of PERFECTADDRWINDOW field.              */
  #define RADIO_AACHKOVERRIDE_PERFECTADDRWINDOW_Max (0x1UL) /*!< Max enumerator value of PERFECTADDRWINDOW field.              */
  #define RADIO_AACHKOVERRIDE_PERFECTADDRWINDOW_Disabled (0x0UL) /*!< The address window has some margin                       */
  #define RADIO_AACHKOVERRIDE_PERFECTADDRWINDOW_Enabled (0x1UL) /*!< The address window spans only one bit                     */

/* SFDMATCHENABLE @Bit 22 : Enable every 4 bits SFD match for IEEE 802.15.4 */
  #define RADIO_AACHKOVERRIDE_SFDMATCHENABLE_Pos (22UL) /*!< Position of SFDMATCHENABLE field.                                 */
  #define RADIO_AACHKOVERRIDE_SFDMATCHENABLE_Msk (0x1UL << RADIO_AACHKOVERRIDE_SFDMATCHENABLE_Pos) /*!< Bit mask of
                                                                            SFDMATCHENABLE field.*/
  #define RADIO_AACHKOVERRIDE_SFDMATCHENABLE_Min (0x0UL) /*!< Min enumerator value of SFDMATCHENABLE field.                    */
  #define RADIO_AACHKOVERRIDE_SFDMATCHENABLE_Max (0x1UL) /*!< Max enumerator value of SFDMATCHENABLE field.                    */
  #define RADIO_AACHKOVERRIDE_SFDMATCHENABLE_Disabled (0x0UL) /*!< Disable                                                     */
  #define RADIO_AACHKOVERRIDE_SFDMATCHENABLE_Enabled (0x1UL) /*!< Enable                                                       */

/* SYMSBEFORESFD @Bits 24..26 : Number of preamble symbols before SFD to match, by default 2 symbols. */
  #define RADIO_AACHKOVERRIDE_SYMSBEFORESFD_Pos (24UL) /*!< Position of SYMSBEFORESFD field.                                   */
  #define RADIO_AACHKOVERRIDE_SYMSBEFORESFD_Msk (0x7UL << RADIO_AACHKOVERRIDE_SYMSBEFORESFD_Pos) /*!< Bit mask of SYMSBEFORESFD
                                                                            field.*/


