adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RESET @Bit 0 : Event Reset DMA-A */
  #define RADIOACC_EVENTS_DMAA_RESET_RESET_Pos (0UL) /*!< Position of RESET field.                                             */
  #define RADIOACC_EVENTS_DMAA_RESET_RESET_Msk (0x1UL << RADIOACC_EVENTS_DMAA_RESET_RESET_Pos) /*!< Bit mask of RESET field.   */
  #define RADIOACC_EVENTS_DMAA_RESET_RESET_Min (0x0UL) /*!< Min enumerator value of RESET field.                               */
  #define RADIOACC_EVENTS_DMAA_RESET_RESET_Max (0x1UL) /*!< Max enumerator value of RESET field.                               */
  #define RADIOACC_EVENTS_DMAA_RESET_RESET_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define RADIOACC_EVENTS_DMAA_RESET_RESET_Generated (0x1UL) /*!< Event generated                                              */



/* =============================================== Struct RADIOACC_EVENTS_DMAB =============================================== */
/**
  * @brief EVENTS_DMAB [RADIOACC_EVENTS_DMAB] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  LISTDONE;                          /*!< (@ 0x00000000) Event List Done DMA-B                                 */
  __IOM uint32_t  LISTPARTDONE;                      /*!< (@ 0x00000004) Event List Part Done DMA-B                            */
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000008) Event List Select Job Done DMA-B                      */
  __IOM uint32_t  DATADONE;                          /*!< (@ 0x0000000C) Event Data Done DMA-B                                 */
  __IOM uint32_t  JOBDONE;                           /*!< (@ 0x00000010) Event Job Done DMA-B                                  */
  __IOM uint32_t  ERROR;                             /*!< (@ 0x00000014) Event Error DMA-B                                     */
  __IOM uint32_t  STOP;                              /*!< (@ 0x00000018) Event Stop DMA-B                                      */
  __IOM uint32_t  RESET;                             /*!< (@ 0x0000001C) Event Reset DMA-B                                     */
} NRF_RADIOACC_EVENTS_DMAB_Type;                     /*!< Size = 32 (0x020)                                                    */

/* RADIOACC_EVENTS_DMAB_LISTDONE: Event List Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_LISTDONE_ResetValue (0x00000000UL) /*!< Reset value of LISTDONE register.                       */

/* LISTDONE @Bit 0 : Event List Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_LISTDONE_LISTDONE_Pos (0UL) /*!< Position of LISTDONE field.                                    */
  #define RADIOACC_EVENTS_DMAB_LISTDONE_LISTDONE_Msk (0x1UL << RADIOACC_EVENTS_DMAB_LISTDONE_LISTDONE_Pos) /*!< Bit mask of
                                                                            LISTDONE field.*/
  #define RADIOACC_EVENTS_DMAB_LISTDONE_LISTDONE_Min (0x0UL) /*!< Min enumerator value of LISTDONE field.                      */
  #define RADIOACC_EVENTS_DMAB_LISTDONE_LISTDONE_Max (0x1UL) /*!< Max enumerator value of LISTDONE field.                      */
  #define RADIOACC_EVENTS_DMAB_LISTDONE_LISTDONE_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define RADIOACC_EVENTS_DMAB_LISTDONE_LISTDONE_Generated (0x1UL) /*!< Event generated                                        */


/* RADIOACC_EVENTS_DMAB_LISTPARTDONE: Event List Part Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_LISTPARTDONE_ResetValue (0x00000000UL) /*!< Reset value of LISTPARTDONE register.               */

/* LISTPARTDONE @Bit 0 : Event List Part Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_LISTPARTDONE_LISTPARTDONE_Pos (0UL) /*!< Position of LISTPARTDONE field.                        */
  #define RADIOACC_EVENTS_DMAB_LISTPARTDONE_LISTPARTDONE_Msk (0x1UL << RADIOACC_EVENTS_DMAB_LISTPARTDONE_LISTPARTDONE_Pos) /*!<
                                                                            Bit mask of LISTPARTDONE field.*/
  #define RADIOACC_EVENTS_DMAB_LISTPARTDONE_LISTPARTDONE_Min (0x0UL) /*!< Min enumerator value of LISTPARTDONE field.          */
  #define RADIOACC_EVENTS_DMAB_LISTPARTDONE_LISTPARTDONE_Max (0x1UL) /*!< Max enumerator value of LISTPARTDONE field.          */
  #define RADIOACC_EVENTS_DMAB_LISTPARTDONE_LISTPARTDONE_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define RADIOACC_EVENTS_DMAB_LISTPARTDONE_LISTPARTDONE_Generated (0x1UL) /*!< Event generated                                */


/* RADIOACC_EVENTS_DMAB_SELECTJOBDONE: Event List Select Job Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.             */

/* SELECTJOBDONE @Bit 0 : Event List Select Job Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_SELECTJOBDONE_SELECTJOBDONE_Pos (0UL) /*!< Position of SELECTJOBDONE field.                     */
  #define RADIOACC_EVENTS_DMAB_SELECTJOBDONE_SELECTJOBDONE_Msk (0x1UL << RADIOACC_EVENTS_DMAB_SELECTJOBDONE_SELECTJOBDONE_Pos)
                                                                            /*!< Bit mask of SELECTJOBDONE field.*/
  #define RADIOACC_EVENTS_DMAB_SELECTJOBDONE_SELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SELECTJOBDONE field.       */
  #define RADIOACC_EVENTS_DMAB_SELECTJOBDONE_SELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SELECTJOBDONE field.       */
  #define RADIOACC_EVENTS_DMAB_SELECTJOBDONE_SELECTJOBDONE_NotGenerated (0x0UL) /*!< Event not generated                       */
  #define RADIOACC_EVENTS_DMAB_SELECTJOBDONE_SELECTJOBDONE_Generated (0x1UL) /*!< Event generated                              */


/* RADIOACC_EVENTS_DMAB_DATADONE: Event Data Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_DATADONE_ResetValue (0x00000000UL) /*!< Reset value of DATADONE register.                       */

/* DATADONE @Bit 0 : Event Data Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_DATADONE_DATADONE_Pos (0UL) /*!< Position of DATADONE field.                                    */
  #define RADIOACC_EVENTS_DMAB_DATADONE_DATADONE_Msk (0x1UL << RADIOACC_EVENTS_DMAB_DATADONE_DATADONE_Pos) /*!< Bit mask of
                                                                            DATADONE field.*/
  #define RADIOACC_EVENTS_DMAB_DATADONE_DATADONE_Min (0x0UL) /*!< Min enumerator value of DATADONE field.                      */
  #define RADIOACC_EVENTS_DMAB_DATADONE_DATADONE_Max (0x1UL) /*!< Max enumerator value of DATADONE field.                      */
  #define RADIOACC_EVENTS_DMAB_DATADONE_DATADONE_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define RADIOACC_EVENTS_DMAB_DATADONE_DATADONE_Generated (0x1UL) /*!< Event generated                                        */


/* RADIOACC_EVENTS_DMAB_JOBDONE: Event Job Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_JOBDONE_ResetValue (0x00000000UL) /*!< Reset value of JOBDONE register.                         */

/* JOBDONE @Bit 0 : Event Job Done DMA-B */
  #define RADIOACC_EVENTS_DMAB_JOBDONE_JOBDONE_Pos (0UL) /*!< Position of JOBDONE field.                                       */
  #define RADIOACC_EVENTS_DMAB_JOBDONE_JOBDONE_Msk (0x1UL << RADIOACC_EVENTS_DMAB_JOBDONE_JOBDONE_Pos) /*!< Bit mask of JOBDONE
                                                                            field.*/
  #define RADIOACC_EVENTS_DMAB_JOBDONE_JOBDONE_Min (0x0UL) /*!< Min enumerator value of JOBDONE field.                         */
  #define RADIOACC_EVENTS_DMAB_JOBDONE_JOBDONE_Max (0x1UL) /*!< Max enumerator value of JOBDONE field.                         */
  #define RADIOACC_EVENTS_DMAB_JOBDONE_JOBDONE_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define RADIOACC_EVENTS_DMAB_JOBDONE_JOBDONE_Generated (0x1UL) /*!< Event generated                                          */


/* RADIOACC_EVENTS_DMAB_ERROR: Event Error DMA-B */
  #define RADIOACC_EVENTS_DMAB_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                             */

/* ERROR @Bit 0 : Event Error DMA-B */
  #define RADIOACC_EVENTS_DMAB_ERROR_ERROR_Pos (0UL) /*!< Position of ERROR field.                                             */
  #define RADIOACC_EVENTS_DMAB_ERROR_ERROR_Msk (0x1UL << RADIOACC_EVENTS_DMAB_ERROR_ERROR_Pos) /*!< Bit mask of ERROR field.   */
  #define RADIOACC_EVENTS_DMAB_ERROR_ERROR_Min (0x0UL) /*!< Min enumerator value of ERROR field.                               */
  #define RADIOACC_EVENTS_DMAB_ERROR_ERROR_Max (0x1UL) /*!< Max enumerator value of ERROR field.                               */
  #define RADIOACC_EVENTS_DMAB_ERROR_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define RADIOACC_EVENTS_DMAB_ERROR_ERROR_Generated (0x1UL) /*!< Event generated                                              */


/* RADIOACC_EVENTS_DMAB_STOP: Event Stop DMA-B */
  #define RADIOACC_EVENTS_DMAB_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                               */

/* STOP @Bit 0 : Event Stop DMA-B */
  #define RADIOACC_EVENTS_DMAB_STOP_STOP_Pos (0UL)   /*!< Position of STOP field.                                              */
  #define RADIOACC_EVENTS_DMAB_STOP_STOP_Msk (0x1UL << RADIOACC_EVENTS_DMAB_STOP_STOP_Pos) /*!< Bit mask of STOP field.        */
  #define RADIOACC_EVENTS_DMAB_STOP_STOP_Min (0x0UL) /*!< Min enumerator value of STOP field.                                  */
  #define RADIOACC_EVENTS_DMAB_STOP_STOP_Max (0x1UL) /*!< Max enumerator value of STOP field.                                  */
  #define RADIOACC_EVENTS_DMAB_STOP_STOP_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define RADIOACC_EVENTS_DMAB_STOP_STOP_Generated (0x1UL) /*!< Event generated                                                */


/* RADIOACC_EVENTS_DMAB_RESET: Event Reset DMA-B */
  #define RADIOACC_EVENTS_DMAB_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                             */

/* RESET @Bit 0 : Event Reset DMA-B */
  #define RADIOACC_EVENTS_DMAB_RESET_RESET_Pos (0UL) /*!< Position of RESET field.                                             */
  #define RADIOACC_EVENTS_DMAB_RESET_RESET_Msk (0x1UL << RADIOACC_EVENTS_DMAB_RESET_RESET_Pos) /*!< Bit mask of RESET field.   */
  #define RADIOACC_EVENTS_DMAB_RESET_RESET_Min (0x0UL) /*!< Min enumerator value of RESET field.                               */
  #define RADIOACC_EVENTS_DMAB_RESET_RESET_Max (0x1UL) /*!< Max enumerator value of RESET field.                               */
  #define RADIOACC_EVENTS_DMAB_RESET_RESET_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define RADIOACC_EVENTS_DMAB_RESET_RESET_Generated (0x1UL) /*!< Event generated                                              */



/* ============================================== Struct RADIOACC_PUBLISH_DMAA =============================================== */
/**
  * @brief PUBLISH_DMAA [RADIOACC_PUBLISH_DMAA] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  LISTDONE;                          /*!< (@ 0x00000000) Publish configuration for event DMAA.LISTDONE         */
  __IOM uint32_t  LISTPARTDONE;                      /*!< (@ 0x00000004) Publish configuration for event DMAA.LISTPARTDONE     */
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000008) Publish configuration for event DMAA.SELECTJOBDONE    */
  __IOM uint32_t  DATADONE;                          /*!< (@ 0x0000000C) Publish configuration for event DMAA.DATADONE         */
  __IOM uint32_t  JOBDONE;                           /*!< (@ 0x00000010) Publish configuration for event DMAA.JOBDONE          */
  __IOM uint32_t  ERROR;                             /*!< (@ 0x00000014) Publish configuration for event DMAA.ERROR            */
  __IOM uint32_t  STOP;                              /*!< (@ 0x00000018) Publish configuration for event DMAA.STOP             */
  __IOM uint32_t  RESET;                             /*!< (@ 0x0000001C) Publish configuration for event DMAA.RESET            */
} NRF_RADIOACC_PUBLISH_DMAA_Type;                    /*!< Size = 32 (0x020)                                                    */

