adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIOACC_PUBLISH_DMAA_JOBDONE: Publish configuration for event DMAA.JOBDONE */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_ResetValue (0x00000000UL) /*!< Reset value of JOBDONE register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAA.JOBDONE will publish to */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAA_JOBDONE_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                      */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAA_JOBDONE_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                            */
  #define RADIOACC_PUBLISH_DMAA_JOBDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                              */


/* RADIOACC_PUBLISH_DMAA_ERROR: Publish configuration for event DMAA.ERROR */
  #define RADIOACC_PUBLISH_DMAA_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAA.ERROR will publish to */
  #define RADIOACC_PUBLISH_DMAA_ERROR_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIOACC_PUBLISH_DMAA_ERROR_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAA_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIOACC_PUBLISH_DMAA_ERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define RADIOACC_PUBLISH_DMAA_ERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAA_ERROR_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIOACC_PUBLISH_DMAA_ERROR_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAA_ERROR_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIOACC_PUBLISH_DMAA_ERROR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAA_ERROR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAA_ERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIOACC_PUBLISH_DMAA_ERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* RADIOACC_PUBLISH_DMAA_STOP: Publish configuration for event DMAA.STOP */
  #define RADIOACC_PUBLISH_DMAA_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAA.STOP will publish to */
  #define RADIOACC_PUBLISH_DMAA_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIOACC_PUBLISH_DMAA_STOP_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAA_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIOACC_PUBLISH_DMAA_STOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define RADIOACC_PUBLISH_DMAA_STOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAA_STOP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIOACC_PUBLISH_DMAA_STOP_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAA_STOP_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIOACC_PUBLISH_DMAA_STOP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAA_STOP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAA_STOP_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define RADIOACC_PUBLISH_DMAA_STOP_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* RADIOACC_PUBLISH_DMAA_RESET: Publish configuration for event DMAA.RESET */
  #define RADIOACC_PUBLISH_DMAA_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAA.RESET will publish to */
  #define RADIOACC_PUBLISH_DMAA_RESET_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIOACC_PUBLISH_DMAA_RESET_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAA_RESET_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIOACC_PUBLISH_DMAA_RESET_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define RADIOACC_PUBLISH_DMAA_RESET_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAA_RESET_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIOACC_PUBLISH_DMAA_RESET_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAA_RESET_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIOACC_PUBLISH_DMAA_RESET_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAA_RESET_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAA_RESET_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIOACC_PUBLISH_DMAA_RESET_EN_Enabled (0x1UL) /*!< Enable publishing                                                */



/* ============================================== Struct RADIOACC_PUBLISH_DMAB =============================================== */
/**
  * @brief PUBLISH_DMAB [RADIOACC_PUBLISH_DMAB] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  LISTDONE;                          /*!< (@ 0x00000000) Publish configuration for event DMAB.LISTDONE         */
  __IOM uint32_t  LISTPARTDONE;                      /*!< (@ 0x00000004) Publish configuration for event DMAB.LISTPARTDONE     */
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000008) Publish configuration for event DMAB.SELECTJOBDONE    */
  __IOM uint32_t  DATADONE;                          /*!< (@ 0x0000000C) Publish configuration for event DMAB.DATADONE         */
  __IOM uint32_t  JOBDONE;                           /*!< (@ 0x00000010) Publish configuration for event DMAB.JOBDONE          */
  __IOM uint32_t  ERROR;                             /*!< (@ 0x00000014) Publish configuration for event DMAB.ERROR            */
  __IOM uint32_t  STOP;                              /*!< (@ 0x00000018) Publish configuration for event DMAB.STOP             */
  __IOM uint32_t  RESET;                             /*!< (@ 0x0000001C) Publish configuration for event DMAB.RESET            */
} NRF_RADIOACC_PUBLISH_DMAB_Type;                    /*!< Size = 32 (0x020)                                                    */

/* RADIOACC_PUBLISH_DMAB_LISTDONE: Publish configuration for event DMAB.LISTDONE */
  #define RADIOACC_PUBLISH_DMAB_LISTDONE_ResetValue (0x00000000UL) /*!< Reset value of LISTDONE register.                      */

