adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RADIOACC_CTRLWORD_CTX: The register address points to Control Word FIFO in the PAR block. It contains bit fields required for
                           cycle accurate processing. */

  #define RADIOACC_CTRLWORD_CTX_ResetValue (0x00000000UL) /*!< Reset value of CTX register.                                    */

/* BUFFENABLEB0 @Bit 0 : Enable Bit for CR0 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB0_Pos (0UL) /*!< Position of BUFFENABLEB0 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB0_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB0_Pos) /*!< Bit mask of BUFFENABLEB0
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB0_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB0 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB0_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB0 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB0_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB0_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEB1 @Bit 1 : Enable Bit for CR1 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB1_Pos (1UL) /*!< Position of BUFFENABLEB1 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB1_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB1_Pos) /*!< Bit mask of BUFFENABLEB1
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB1_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB1 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB1_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB1 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB1_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB1_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEB2 @Bit 2 : Enable Bit for CR2 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB2_Pos (2UL) /*!< Position of BUFFENABLEB2 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB2_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB2_Pos) /*!< Bit mask of BUFFENABLEB2
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB2_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB2 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB2_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB2 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB2_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB2_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEB3 @Bit 3 : Enable Bit for CR3 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB3_Pos (3UL) /*!< Position of BUFFENABLEB3 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB3_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB3_Pos) /*!< Bit mask of BUFFENABLEB3
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB3_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB3 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB3_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB3 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB3_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB3_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEB4 @Bit 4 : Enable Bit for CR4 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB4_Pos (4UL) /*!< Position of BUFFENABLEB4 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB4_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB4_Pos) /*!< Bit mask of BUFFENABLEB4
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB4_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB4 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB4_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB4 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB4_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB4_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEB5 @Bit 5 : Enable Bit for CR5 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB5_Pos (5UL) /*!< Position of BUFFENABLEB5 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB5_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB5_Pos) /*!< Bit mask of BUFFENABLEB5
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB5_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB5 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB5_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB5 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB5_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB5_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEB6 @Bit 6 : Enable Bit for CR6 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Pos (6UL) /*!< Position of BUFFENABLEB6 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Pos) /*!< Bit mask of BUFFENABLEB6
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB6 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB6 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEB7 @Bit 7 : Enable Bit for CR7 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Pos (7UL) /*!< Position of BUFFENABLEB7 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Pos) /*!< Bit mask of BUFFENABLEB7
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB7 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB7 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA0 @Bit 8 : Enable Bit for CR0 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Pos (8UL) /*!< Position of BUFFENABLEA0 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Pos) /*!< Bit mask of BUFFENABLEA0
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA0 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA0 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA1 @Bit 9 : Enable Bit for CR1 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Pos (9UL) /*!< Position of BUFFENABLEA1 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Pos) /*!< Bit mask of BUFFENABLEA1
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA1 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA1 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA2 @Bit 10 : Enable Bit for CR2 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Pos (10UL) /*!< Position of BUFFENABLEA2 field.                                   */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Pos) /*!< Bit mask of BUFFENABLEA2
                                                                            field.*/
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA2 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA2 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Enable (0x1UL) /*!< Enable                                                        */

