adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ADDRESS @Bits 0..31 : Pointer to Job List for DMA-A */
  #define RADIOACC_DMAA_LISTPTR_ADDRESS_Pos (0UL)    /*!< Position of ADDRESS field.                                           */
  #define RADIOACC_DMAA_LISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << RADIOACC_DMAA_LISTPTR_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.*/
  #define RADIOACC_DMAA_LISTPTR_ADDRESS_Min (0x00000000UL) /*!< Min value of ADDRESS field.                                    */
  #define RADIOACC_DMAA_LISTPTR_ADDRESS_Max (0xFFFFFFF4UL) /*!< Max size of ADDRESS field.                                     */


/* RADIOACC_DMAA_LISTPARTTHRESH: Threshold value for generating event EVENTS_DMMA.LISTPARTDONE when descriptor list is partially
                                  completed. Value is number of jobs. */

  #define RADIOACC_DMAA_LISTPARTTHRESH_ResetValue (0x00000000UL) /*!< Reset value of LISTPARTTHRESH register.                  */

/* LISTPARTTHRESH @Bits 0..15 : Threshold value. */
  #define RADIOACC_DMAA_LISTPARTTHRESH_LISTPARTTHRESH_Pos (0UL) /*!< Position of LISTPARTTHRESH field.                         */
  #define RADIOACC_DMAA_LISTPARTTHRESH_LISTPARTTHRESH_Msk (0xFFFFUL << RADIOACC_DMAA_LISTPARTTHRESH_LISTPARTTHRESH_Pos) /*!< Bit
                                                                            mask of LISTPARTTHRESH field.*/



/* ================================================== Struct RADIOACC_DMAB =================================================== */
/**
  * @brief DMAB [RADIOACC_DMAB] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LISTPTR;                           /*!< (@ 0x00000000) Register address to store the Data Pointer of the Job
                                                                         List for DMA-B*/
  __IOM uint32_t  LISTPARTTHRESH;                    /*!< (@ 0x00000004) Threshold value for generating event
                                                                         EVENTS_DMAB.LISTPARTDONE when descriptor list is
                                                                         partially completed. Value is number of jobs.*/
} NRF_RADIOACC_DMAB_Type;                            /*!< Size = 8 (0x008)                                                     */

/* RADIOACC_DMAB_LISTPTR: Register address to store the Data Pointer of the Job List for DMA-B */
  #define RADIOACC_DMAB_LISTPTR_ResetValue (0x00000000UL) /*!< Reset value of LISTPTR register.                                */

/* ADDRESS @Bits 0..31 : Pointer to Job List for DMA-B */
  #define RADIOACC_DMAB_LISTPTR_ADDRESS_Pos (0UL)    /*!< Position of ADDRESS field.                                           */
  #define RADIOACC_DMAB_LISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << RADIOACC_DMAB_LISTPTR_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.*/
  #define RADIOACC_DMAB_LISTPTR_ADDRESS_Min (0x00000000UL) /*!< Min value of ADDRESS field.                                    */
  #define RADIOACC_DMAB_LISTPTR_ADDRESS_Max (0xFFFFFFF4UL) /*!< Max size of ADDRESS field.                                     */


/* RADIOACC_DMAB_LISTPARTTHRESH: Threshold value for generating event EVENTS_DMAB.LISTPARTDONE when descriptor list is partially
                                  completed. Value is number of jobs. */

  #define RADIOACC_DMAB_LISTPARTTHRESH_ResetValue (0x00000000UL) /*!< Reset value of LISTPARTTHRESH register.                  */

/* LISTPARTTHRESH @Bits 0..15 : Threshold value. */
  #define RADIOACC_DMAB_LISTPARTTHRESH_LISTPARTTHRESH_Pos (0UL) /*!< Position of LISTPARTTHRESH field.                         */
  #define RADIOACC_DMAB_LISTPARTTHRESH_LISTPARTTHRESH_Msk (0xFFFFUL << RADIOACC_DMAB_LISTPARTTHRESH_LISTPARTTHRESH_Pos) /*!< Bit
                                                                            mask of LISTPARTTHRESH field.*/


/* ===================================================== Struct RADIOACC ===================================================== */
/**
  * @brief RADIOACC peripheral
  */
  typedef struct {                                   /*!< RADIOACC Structure                                                   */
    __OM NRF_RADIOACC_TASKS_DMAA_Type TASKS_DMAA;    /*!< (@ 0x00000000) Peripheral tasks.                                     */
    __OM NRF_RADIOACC_TASKS_DMAB_Type TASKS_DMAB;    /*!< (@ 0x0000000C) Peripheral tasks.                                     */
    __OM uint32_t TASKS_COMPUTESTART;                /*!< (@ 0x00000018) Start Computation for ReConfAccHW Core                */
    __OM uint32_t TASKS_CONTROLEN;                   /*!< (@ 0x0000001C) Start ReConfAccHW Control Unit                        */
    __OM uint32_t TASKS_ALLTASKSSTOP;                /*!< (@ 0x00000020) Stop All Running Tasks                                */
    __IM uint32_t RESERVED[23];
    __IOM NRF_RADIOACC_SUBSCRIBE_DMAA_Type SUBSCRIBE_DMAA; /*!< (@ 0x00000080) Subscribe configuration for tasks               */
    __IOM NRF_RADIOACC_SUBSCRIBE_DMAB_Type SUBSCRIBE_DMAB; /*!< (@ 0x0000008C) Subscribe configuration for tasks               */
    __IOM uint32_t SUBSCRIBE_COMPUTESTART;           /*!< (@ 0x00000098) Subscribe configuration for task COMPUTESTART         */
    __IOM uint32_t SUBSCRIBE_CONTROLEN;              /*!< (@ 0x0000009C) Subscribe configuration for task CONTROLEN            */
    __IOM uint32_t SUBSCRIBE_ALLTASKSSTOP;           /*!< (@ 0x000000A0) Subscribe configuration for task ALLTASKSSTOP         */
    __IM uint32_t RESERVED1[23];
    __IOM NRF_RADIOACC_EVENTS_DMAA_Type EVENTS_DMAA; /*!< (@ 0x00000100) Peripheral events.                                    */
    __IOM NRF_RADIOACC_EVENTS_DMAB_Type EVENTS_DMAB; /*!< (@ 0x00000120) Peripheral events.                                    */
    __IOM uint32_t EVENTS_COMPUTEEND;                /*!< (@ 0x00000140) Event Compute End                                     */
    __IOM uint32_t EVENTS_CTXFIFOEMPTY;              /*!< (@ 0x00000144) Event Context Fifo Empty                              */
    __IOM uint32_t EVENTS_ALLTASKSSTOP;              /*!< (@ 0x00000148) Event All Running Tasks Stop                          */
    __IM uint32_t RESERVED2[13];
    __IOM NRF_RADIOACC_PUBLISH_DMAA_Type PUBLISH_DMAA; /*!< (@ 0x00000180) Publish configuration for events                    */
    __IOM NRF_RADIOACC_PUBLISH_DMAB_Type PUBLISH_DMAB; /*!< (@ 0x000001A0) Publish configuration for events                    */
    __IOM uint32_t PUBLISH_COMPUTEEND;               /*!< (@ 0x000001C0) Publish configuration for event COMPUTEEND            */
    __IOM uint32_t PUBLISH_CTXFIFOEMPTY;             /*!< (@ 0x000001C4) Publish configuration for event CTXFIFOEMPTY          */
    __IOM uint32_t PUBLISH_ALLTASKSSTOP;             /*!< (@ 0x000001C8) Publish configuration for event ALLTASKSSTOP          */
    __IM uint32_t RESERVED3[77];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[61];
    __IOM uint32_t SWRST;                            /*!< (@ 0x00000400) Software-based Reset                                  */
    __IOM uint32_t AUTO;                             /*!< (@ 0x00000404) Mode of Computation                                   */
    __IOM NRF_RADIOACC_CTRLWORD_Type CTRLWORD;       /*!< (@ 0x00000408) (unspecified)                                         */
    __IM uint32_t RESERVED5[124];
    __IOM NRF_RADIOACC_DMAA_Type DMAA;               /*!< (@ 0x00000604) (unspecified)                                         */
    __IM uint32_t RESERVED6[6];
    __IOM NRF_RADIOACC_DMAB_Type DMAB;               /*!< (@ 0x00000624) (unspecified)                                         */
  } NRF_RADIOACC_Type;                               /*!< Size = 1580 (0x62C)                                                  */

/* RADIOACC_TASKS_COMPUTESTART: Start Computation for ReConfAccHW Core */
  #define RADIOACC_TASKS_COMPUTESTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_COMPUTESTART register.               */

/* TASKS_COMPUTESTART @Bit 0 : Start Computation for ReConfAccHW Core */
  #define RADIOACC_TASKS_COMPUTESTART_TASKS_COMPUTESTART_Pos (0UL) /*!< Position of TASKS_COMPUTESTART field.                  */
  #define RADIOACC_TASKS_COMPUTESTART_TASKS_COMPUTESTART_Msk (0x1UL << RADIOACC_TASKS_COMPUTESTART_TASKS_COMPUTESTART_Pos) /*!<
                                                                            Bit mask of TASKS_COMPUTESTART field.*/
  #define RADIOACC_TASKS_COMPUTESTART_TASKS_COMPUTESTART_Min (0x1UL) /*!< Min enumerator value of TASKS_COMPUTESTART field.    */
  #define RADIOACC_TASKS_COMPUTESTART_TASKS_COMPUTESTART_Max (0x1UL) /*!< Max enumerator value of TASKS_COMPUTESTART field.    */
  #define RADIOACC_TASKS_COMPUTESTART_TASKS_COMPUTESTART_Trigger (0x1UL) /*!< Trigger task                                     */


/* RADIOACC_TASKS_CONTROLEN: Start ReConfAccHW Control Unit */
  #define RADIOACC_TASKS_CONTROLEN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CONTROLEN register.                     */

/* TASKS_CONTROLEN @Bit 0 : Start ReConfAccHW Control Unit */
  #define RADIOACC_TASKS_CONTROLEN_TASKS_CONTROLEN_Pos (0UL) /*!< Position of TASKS_CONTROLEN field.                           */
  #define RADIOACC_TASKS_CONTROLEN_TASKS_CONTROLEN_Msk (0x1UL << RADIOACC_TASKS_CONTROLEN_TASKS_CONTROLEN_Pos) /*!< Bit mask of
                                                                            TASKS_CONTROLEN field.*/
  #define RADIOACC_TASKS_CONTROLEN_TASKS_CONTROLEN_Min (0x1UL) /*!< Min enumerator value of TASKS_CONTROLEN field.             */
  #define RADIOACC_TASKS_CONTROLEN_TASKS_CONTROLEN_Max (0x1UL) /*!< Max enumerator value of TASKS_CONTROLEN field.             */
  #define RADIOACC_TASKS_CONTROLEN_TASKS_CONTROLEN_Trigger (0x1UL) /*!< Trigger task                                           */


/* RADIOACC_TASKS_ALLTASKSSTOP: Stop All Running Tasks */
  #define RADIOACC_TASKS_ALLTASKSSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ALLTASKSSTOP register.               */

