adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_ALLTASKSSTOP @Bit 0 : Stop All Running Tasks */
  #define RADIOACC_TASKS_ALLTASKSSTOP_TASKS_ALLTASKSSTOP_Pos (0UL) /*!< Position of TASKS_ALLTASKSSTOP field.                  */
  #define RADIOACC_TASKS_ALLTASKSSTOP_TASKS_ALLTASKSSTOP_Msk (0x1UL << RADIOACC_TASKS_ALLTASKSSTOP_TASKS_ALLTASKSSTOP_Pos) /*!<
                                                                            Bit mask of TASKS_ALLTASKSSTOP field.*/
  #define RADIOACC_TASKS_ALLTASKSSTOP_TASKS_ALLTASKSSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_ALLTASKSSTOP field.    */
  #define RADIOACC_TASKS_ALLTASKSSTOP_TASKS_ALLTASKSSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_ALLTASKSSTOP field.    */
  #define RADIOACC_TASKS_ALLTASKSSTOP_TASKS_ALLTASKSSTOP_Trigger (0x1UL) /*!< Trigger task                                     */


/* RADIOACC_SUBSCRIBE_COMPUTESTART: Subscribe configuration for task COMPUTESTART */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_COMPUTESTART register.       */

/* CHIDX @Bits 0..7 : DPPI channel that task COMPUTESTART will subscribe to */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                        */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_COMPUTESTART_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                    */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                     */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_COMPUTESTART_EN_Pos) /*!< Bit mask of EN field.  */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_EN_Disabled (0x0UL) /*!< Disable subscription                                        */
  #define RADIOACC_SUBSCRIBE_COMPUTESTART_EN_Enabled (0x1UL) /*!< Enable subscription                                          */


/* RADIOACC_SUBSCRIBE_CONTROLEN: Subscribe configuration for task CONTROLEN */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CONTROLEN register.             */

/* CHIDX @Bits 0..7 : DPPI channel that task CONTROLEN will subscribe to */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_CONTROLEN_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define RADIOACC_SUBSCRIBE_CONTROLEN_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                       */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_CONTROLEN_EN_Pos) /*!< Bit mask of EN field.        */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_EN_Disabled (0x0UL) /*!< Disable subscription                                           */
  #define RADIOACC_SUBSCRIBE_CONTROLEN_EN_Enabled (0x1UL) /*!< Enable subscription                                             */


/* RADIOACC_SUBSCRIBE_ALLTASKSSTOP: Subscribe configuration for task ALLTASKSSTOP */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ALLTASKSSTOP register.       */

/* CHIDX @Bits 0..7 : DPPI channel that task ALLTASKSSTOP will subscribe to */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                        */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_ALLTASKSSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                    */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                     */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_ALLTASKSSTOP_EN_Pos) /*!< Bit mask of EN field.  */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                        */
  #define RADIOACC_SUBSCRIBE_ALLTASKSSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                          */


/* RADIOACC_EVENTS_COMPUTEEND: Event Compute End */
  #define RADIOACC_EVENTS_COMPUTEEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_COMPUTEEND register.                 */

/* EVENTS_COMPUTEEND @Bit 0 : Event Compute End */
  #define RADIOACC_EVENTS_COMPUTEEND_EVENTS_COMPUTEEND_Pos (0UL) /*!< Position of EVENTS_COMPUTEEND field.                     */
  #define RADIOACC_EVENTS_COMPUTEEND_EVENTS_COMPUTEEND_Msk (0x1UL << RADIOACC_EVENTS_COMPUTEEND_EVENTS_COMPUTEEND_Pos) /*!< Bit
                                                                            mask of EVENTS_COMPUTEEND field.*/
  #define RADIOACC_EVENTS_COMPUTEEND_EVENTS_COMPUTEEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_COMPUTEEND field.       */
  #define RADIOACC_EVENTS_COMPUTEEND_EVENTS_COMPUTEEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_COMPUTEEND field.       */
  #define RADIOACC_EVENTS_COMPUTEEND_EVENTS_COMPUTEEND_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define RADIOACC_EVENTS_COMPUTEEND_EVENTS_COMPUTEEND_Generated (0x1UL) /*!< Event generated                                  */


