adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DMAALISTPARTDONE @Bit 1 : Enable or disable interrupt for event DMAALISTPARTDONE */
  #define RADIOACC_INTEN_DMAALISTPARTDONE_Pos (1UL)  /*!< Position of DMAALISTPARTDONE field.                                  */
  #define RADIOACC_INTEN_DMAALISTPARTDONE_Msk (0x1UL << RADIOACC_INTEN_DMAALISTPARTDONE_Pos) /*!< Bit mask of DMAALISTPARTDONE
                                                                            field.*/
  #define RADIOACC_INTEN_DMAALISTPARTDONE_Min (0x0UL) /*!< Min enumerator value of DMAALISTPARTDONE field.                     */
  #define RADIOACC_INTEN_DMAALISTPARTDONE_Max (0x1UL) /*!< Max enumerator value of DMAALISTPARTDONE field.                     */
  #define RADIOACC_INTEN_DMAALISTPARTDONE_Disabled (0x0UL) /*!< Disable                                                        */
  #define RADIOACC_INTEN_DMAALISTPARTDONE_Enabled (0x1UL) /*!< Enable                                                          */

/* DMAASELECTJOBDONE @Bit 2 : Enable or disable interrupt for event DMAASELECTJOBDONE */
  #define RADIOACC_INTEN_DMAASELECTJOBDONE_Pos (2UL) /*!< Position of DMAASELECTJOBDONE field.                                 */
  #define RADIOACC_INTEN_DMAASELECTJOBDONE_Msk (0x1UL << RADIOACC_INTEN_DMAASELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            DMAASELECTJOBDONE field.*/
  #define RADIOACC_INTEN_DMAASELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of DMAASELECTJOBDONE field.                   */
  #define RADIOACC_INTEN_DMAASELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of DMAASELECTJOBDONE field.                   */
  #define RADIOACC_INTEN_DMAASELECTJOBDONE_Disabled (0x0UL) /*!< Disable                                                       */
  #define RADIOACC_INTEN_DMAASELECTJOBDONE_Enabled (0x1UL) /*!< Enable                                                         */

/* DMAADATADONE @Bit 3 : Enable or disable interrupt for event DMAADATADONE */
  #define RADIOACC_INTEN_DMAADATADONE_Pos (3UL)      /*!< Position of DMAADATADONE field.                                      */
  #define RADIOACC_INTEN_DMAADATADONE_Msk (0x1UL << RADIOACC_INTEN_DMAADATADONE_Pos) /*!< Bit mask of DMAADATADONE field.      */
  #define RADIOACC_INTEN_DMAADATADONE_Min (0x0UL)    /*!< Min enumerator value of DMAADATADONE field.                          */
  #define RADIOACC_INTEN_DMAADATADONE_Max (0x1UL)    /*!< Max enumerator value of DMAADATADONE field.                          */
  #define RADIOACC_INTEN_DMAADATADONE_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIOACC_INTEN_DMAADATADONE_Enabled (0x1UL) /*!< Enable                                                              */

/* DMAAJOBDONE @Bit 4 : Enable or disable interrupt for event DMAAJOBDONE */
  #define RADIOACC_INTEN_DMAAJOBDONE_Pos (4UL)       /*!< Position of DMAAJOBDONE field.                                       */
  #define RADIOACC_INTEN_DMAAJOBDONE_Msk (0x1UL << RADIOACC_INTEN_DMAAJOBDONE_Pos) /*!< Bit mask of DMAAJOBDONE field.         */
  #define RADIOACC_INTEN_DMAAJOBDONE_Min (0x0UL)     /*!< Min enumerator value of DMAAJOBDONE field.                           */
  #define RADIOACC_INTEN_DMAAJOBDONE_Max (0x1UL)     /*!< Max enumerator value of DMAAJOBDONE field.                           */
  #define RADIOACC_INTEN_DMAAJOBDONE_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIOACC_INTEN_DMAAJOBDONE_Enabled (0x1UL) /*!< Enable                                                               */

/* DMAAERROR @Bit 5 : Enable or disable interrupt for event DMAAERROR */
  #define RADIOACC_INTEN_DMAAERROR_Pos (5UL)         /*!< Position of DMAAERROR field.                                         */
  #define RADIOACC_INTEN_DMAAERROR_Msk (0x1UL << RADIOACC_INTEN_DMAAERROR_Pos) /*!< Bit mask of DMAAERROR field.               */
  #define RADIOACC_INTEN_DMAAERROR_Min (0x0UL)       /*!< Min enumerator value of DMAAERROR field.                             */
  #define RADIOACC_INTEN_DMAAERROR_Max (0x1UL)       /*!< Max enumerator value of DMAAERROR field.                             */
  #define RADIOACC_INTEN_DMAAERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIOACC_INTEN_DMAAERROR_Enabled (0x1UL)   /*!< Enable                                                               */

/* DMAASTOP @Bit 6 : Enable or disable interrupt for event DMAASTOP */
  #define RADIOACC_INTEN_DMAASTOP_Pos (6UL)          /*!< Position of DMAASTOP field.                                          */
  #define RADIOACC_INTEN_DMAASTOP_Msk (0x1UL << RADIOACC_INTEN_DMAASTOP_Pos) /*!< Bit mask of DMAASTOP field.                  */
  #define RADIOACC_INTEN_DMAASTOP_Min (0x0UL)        /*!< Min enumerator value of DMAASTOP field.                              */
  #define RADIOACC_INTEN_DMAASTOP_Max (0x1UL)        /*!< Max enumerator value of DMAASTOP field.                              */
  #define RADIOACC_INTEN_DMAASTOP_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIOACC_INTEN_DMAASTOP_Enabled (0x1UL)    /*!< Enable                                                               */

/* DMAARESET @Bit 7 : Enable or disable interrupt for event DMAARESET */
  #define RADIOACC_INTEN_DMAARESET_Pos (7UL)         /*!< Position of DMAARESET field.                                         */
  #define RADIOACC_INTEN_DMAARESET_Msk (0x1UL << RADIOACC_INTEN_DMAARESET_Pos) /*!< Bit mask of DMAARESET field.               */
  #define RADIOACC_INTEN_DMAARESET_Min (0x0UL)       /*!< Min enumerator value of DMAARESET field.                             */
  #define RADIOACC_INTEN_DMAARESET_Max (0x1UL)       /*!< Max enumerator value of DMAARESET field.                             */
  #define RADIOACC_INTEN_DMAARESET_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIOACC_INTEN_DMAARESET_Enabled (0x1UL)   /*!< Enable                                                               */

