adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DMABLISTDONE @Bit 8 : Enable or disable interrupt for event DMABLISTDONE */
  #define RADIOACC_INTEN_DMABLISTDONE_Pos (8UL)      /*!< Position of DMABLISTDONE field.                                      */
  #define RADIOACC_INTEN_DMABLISTDONE_Msk (0x1UL << RADIOACC_INTEN_DMABLISTDONE_Pos) /*!< Bit mask of DMABLISTDONE field.      */
  #define RADIOACC_INTEN_DMABLISTDONE_Min (0x0UL)    /*!< Min enumerator value of DMABLISTDONE field.                          */
  #define RADIOACC_INTEN_DMABLISTDONE_Max (0x1UL)    /*!< Max enumerator value of DMABLISTDONE field.                          */
  #define RADIOACC_INTEN_DMABLISTDONE_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIOACC_INTEN_DMABLISTDONE_Enabled (0x1UL) /*!< Enable                                                              */

/* DMABLISTPARTDONE @Bit 9 : Enable or disable interrupt for event DMABLISTPARTDONE */
  #define RADIOACC_INTEN_DMABLISTPARTDONE_Pos (9UL)  /*!< Position of DMABLISTPARTDONE field.                                  */
  #define RADIOACC_INTEN_DMABLISTPARTDONE_Msk (0x1UL << RADIOACC_INTEN_DMABLISTPARTDONE_Pos) /*!< Bit mask of DMABLISTPARTDONE
                                                                            field.*/
  #define RADIOACC_INTEN_DMABLISTPARTDONE_Min (0x0UL) /*!< Min enumerator value of DMABLISTPARTDONE field.                     */
  #define RADIOACC_INTEN_DMABLISTPARTDONE_Max (0x1UL) /*!< Max enumerator value of DMABLISTPARTDONE field.                     */
  #define RADIOACC_INTEN_DMABLISTPARTDONE_Disabled (0x0UL) /*!< Disable                                                        */
  #define RADIOACC_INTEN_DMABLISTPARTDONE_Enabled (0x1UL) /*!< Enable                                                          */

/* DMABSELECTJOBDONE @Bit 10 : Enable or disable interrupt for event DMABSELECTJOBDONE */
  #define RADIOACC_INTEN_DMABSELECTJOBDONE_Pos (10UL) /*!< Position of DMABSELECTJOBDONE field.                                */
  #define RADIOACC_INTEN_DMABSELECTJOBDONE_Msk (0x1UL << RADIOACC_INTEN_DMABSELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            DMABSELECTJOBDONE field.*/
  #define RADIOACC_INTEN_DMABSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of DMABSELECTJOBDONE field.                   */
  #define RADIOACC_INTEN_DMABSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of DMABSELECTJOBDONE field.                   */
  #define RADIOACC_INTEN_DMABSELECTJOBDONE_Disabled (0x0UL) /*!< Disable                                                       */
  #define RADIOACC_INTEN_DMABSELECTJOBDONE_Enabled (0x1UL) /*!< Enable                                                         */

/* DMABDATADONE @Bit 11 : Enable or disable interrupt for event DMABDATADONE */
  #define RADIOACC_INTEN_DMABDATADONE_Pos (11UL)     /*!< Position of DMABDATADONE field.                                      */
  #define RADIOACC_INTEN_DMABDATADONE_Msk (0x1UL << RADIOACC_INTEN_DMABDATADONE_Pos) /*!< Bit mask of DMABDATADONE field.      */
  #define RADIOACC_INTEN_DMABDATADONE_Min (0x0UL)    /*!< Min enumerator value of DMABDATADONE field.                          */
  #define RADIOACC_INTEN_DMABDATADONE_Max (0x1UL)    /*!< Max enumerator value of DMABDATADONE field.                          */
  #define RADIOACC_INTEN_DMABDATADONE_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIOACC_INTEN_DMABDATADONE_Enabled (0x1UL) /*!< Enable                                                              */

/* DMABJOBDONE @Bit 12 : Enable or disable interrupt for event DMABJOBDONE */
  #define RADIOACC_INTEN_DMABJOBDONE_Pos (12UL)      /*!< Position of DMABJOBDONE field.                                       */
  #define RADIOACC_INTEN_DMABJOBDONE_Msk (0x1UL << RADIOACC_INTEN_DMABJOBDONE_Pos) /*!< Bit mask of DMABJOBDONE field.         */
  #define RADIOACC_INTEN_DMABJOBDONE_Min (0x0UL)     /*!< Min enumerator value of DMABJOBDONE field.                           */
  #define RADIOACC_INTEN_DMABJOBDONE_Max (0x1UL)     /*!< Max enumerator value of DMABJOBDONE field.                           */
  #define RADIOACC_INTEN_DMABJOBDONE_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIOACC_INTEN_DMABJOBDONE_Enabled (0x1UL) /*!< Enable                                                               */

/* DMABERROR @Bit 13 : Enable or disable interrupt for event DMABERROR */
  #define RADIOACC_INTEN_DMABERROR_Pos (13UL)        /*!< Position of DMABERROR field.                                         */
  #define RADIOACC_INTEN_DMABERROR_Msk (0x1UL << RADIOACC_INTEN_DMABERROR_Pos) /*!< Bit mask of DMABERROR field.               */
  #define RADIOACC_INTEN_DMABERROR_Min (0x0UL)       /*!< Min enumerator value of DMABERROR field.                             */
  #define RADIOACC_INTEN_DMABERROR_Max (0x1UL)       /*!< Max enumerator value of DMABERROR field.                             */
  #define RADIOACC_INTEN_DMABERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIOACC_INTEN_DMABERROR_Enabled (0x1UL)   /*!< Enable                                                               */

/* DMABSTOP @Bit 14 : Enable or disable interrupt for event DMABSTOP */
  #define RADIOACC_INTEN_DMABSTOP_Pos (14UL)         /*!< Position of DMABSTOP field.                                          */
  #define RADIOACC_INTEN_DMABSTOP_Msk (0x1UL << RADIOACC_INTEN_DMABSTOP_Pos) /*!< Bit mask of DMABSTOP field.                  */
  #define RADIOACC_INTEN_DMABSTOP_Min (0x0UL)        /*!< Min enumerator value of DMABSTOP field.                              */
  #define RADIOACC_INTEN_DMABSTOP_Max (0x1UL)        /*!< Max enumerator value of DMABSTOP field.                              */
  #define RADIOACC_INTEN_DMABSTOP_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIOACC_INTEN_DMABSTOP_Enabled (0x1UL)    /*!< Enable                                                               */

/* DMABRESET @Bit 15 : Enable or disable interrupt for event DMABRESET */
  #define RADIOACC_INTEN_DMABRESET_Pos (15UL)        /*!< Position of DMABRESET field.                                         */
  #define RADIOACC_INTEN_DMABRESET_Msk (0x1UL << RADIOACC_INTEN_DMABRESET_Pos) /*!< Bit mask of DMABRESET field.               */
  #define RADIOACC_INTEN_DMABRESET_Min (0x0UL)       /*!< Min enumerator value of DMABRESET field.                             */
  #define RADIOACC_INTEN_DMABRESET_Max (0x1UL)       /*!< Max enumerator value of DMABRESET field.                             */
  #define RADIOACC_INTEN_DMABRESET_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIOACC_INTEN_DMABRESET_Enabled (0x1UL)   /*!< Enable                                                               */

/* COMPUTEEND @Bit 16 : Enable or disable interrupt for event COMPUTEEND */
  #define RADIOACC_INTEN_COMPUTEEND_Pos (16UL)       /*!< Position of COMPUTEEND field.                                        */
  #define RADIOACC_INTEN_COMPUTEEND_Msk (0x1UL << RADIOACC_INTEN_COMPUTEEND_Pos) /*!< Bit mask of COMPUTEEND field.            */
  #define RADIOACC_INTEN_COMPUTEEND_Min (0x0UL)      /*!< Min enumerator value of COMPUTEEND field.                            */
  #define RADIOACC_INTEN_COMPUTEEND_Max (0x1UL)      /*!< Max enumerator value of COMPUTEEND field.                            */
  #define RADIOACC_INTEN_COMPUTEEND_Disabled (0x0UL) /*!< Disable                                                              */
  #define RADIOACC_INTEN_COMPUTEEND_Enabled (0x1UL)  /*!< Enable                                                               */

/* CTXFIFOEMPTY @Bit 17 : Enable or disable interrupt for event CTXFIFOEMPTY */
  #define RADIOACC_INTEN_CTXFIFOEMPTY_Pos (17UL)     /*!< Position of CTXFIFOEMPTY field.                                      */
  #define RADIOACC_INTEN_CTXFIFOEMPTY_Msk (0x1UL << RADIOACC_INTEN_CTXFIFOEMPTY_Pos) /*!< Bit mask of CTXFIFOEMPTY field.      */
  #define RADIOACC_INTEN_CTXFIFOEMPTY_Min (0x0UL)    /*!< Min enumerator value of CTXFIFOEMPTY field.                          */
  #define RADIOACC_INTEN_CTXFIFOEMPTY_Max (0x1UL)    /*!< Max enumerator value of CTXFIFOEMPTY field.                          */
  #define RADIOACC_INTEN_CTXFIFOEMPTY_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIOACC_INTEN_CTXFIFOEMPTY_Enabled (0x1UL) /*!< Enable                                                              */

/* ALLTASKSSTOP @Bit 18 : Enable or disable interrupt for event ALLTASKSSTOP */
  #define RADIOACC_INTEN_ALLTASKSSTOP_Pos (18UL)     /*!< Position of ALLTASKSSTOP field.                                      */
  #define RADIOACC_INTEN_ALLTASKSSTOP_Msk (0x1UL << RADIOACC_INTEN_ALLTASKSSTOP_Pos) /*!< Bit mask of ALLTASKSSTOP field.      */
  #define RADIOACC_INTEN_ALLTASKSSTOP_Min (0x0UL)    /*!< Min enumerator value of ALLTASKSSTOP field.                          */
  #define RADIOACC_INTEN_ALLTASKSSTOP_Max (0x1UL)    /*!< Max enumerator value of ALLTASKSSTOP field.                          */
  #define RADIOACC_INTEN_ALLTASKSSTOP_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIOACC_INTEN_ALLTASKSSTOP_Enabled (0x1UL) /*!< Enable                                                              */


/* RADIOACC_INTENSET: Enable interrupt */
  #define RADIOACC_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                   */

/* DMAALISTDONE @Bit 0 : Write '1' to enable interrupt for event DMAALISTDONE */
  #define RADIOACC_INTENSET_DMAALISTDONE_Pos (0UL)   /*!< Position of DMAALISTDONE field.                                      */
  #define RADIOACC_INTENSET_DMAALISTDONE_Msk (0x1UL << RADIOACC_INTENSET_DMAALISTDONE_Pos) /*!< Bit mask of DMAALISTDONE field.*/
  #define RADIOACC_INTENSET_DMAALISTDONE_Min (0x0UL) /*!< Min enumerator value of DMAALISTDONE field.                          */
  #define RADIOACC_INTENSET_DMAALISTDONE_Max (0x1UL) /*!< Max enumerator value of DMAALISTDONE field.                          */
  #define RADIOACC_INTENSET_DMAALISTDONE_Set (0x1UL) /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMAALISTDONE_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENSET_DMAALISTDONE_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMAALISTPARTDONE @Bit 1 : Write '1' to enable interrupt for event DMAALISTPARTDONE */
  #define RADIOACC_INTENSET_DMAALISTPARTDONE_Pos (1UL) /*!< Position of DMAALISTPARTDONE field.                                */
  #define RADIOACC_INTENSET_DMAALISTPARTDONE_Msk (0x1UL << RADIOACC_INTENSET_DMAALISTPARTDONE_Pos) /*!< Bit mask of
                                                                            DMAALISTPARTDONE field.*/
  #define RADIOACC_INTENSET_DMAALISTPARTDONE_Min (0x0UL) /*!< Min enumerator value of DMAALISTPARTDONE field.                  */
  #define RADIOACC_INTENSET_DMAALISTPARTDONE_Max (0x1UL) /*!< Max enumerator value of DMAALISTPARTDONE field.                  */
  #define RADIOACC_INTENSET_DMAALISTPARTDONE_Set (0x1UL) /*!< Enable                                                           */
  #define RADIOACC_INTENSET_DMAALISTPARTDONE_Disabled (0x0UL) /*!< Read: Disabled                                              */
  #define RADIOACC_INTENSET_DMAALISTPARTDONE_Enabled (0x1UL) /*!< Read: Enabled                                                */

