adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DMAASELECTJOBDONE @Bit 2 : Write '1' to enable interrupt for event DMAASELECTJOBDONE */
  #define RADIOACC_INTENSET_DMAASELECTJOBDONE_Pos (2UL) /*!< Position of DMAASELECTJOBDONE field.                              */
  #define RADIOACC_INTENSET_DMAASELECTJOBDONE_Msk (0x1UL << RADIOACC_INTENSET_DMAASELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            DMAASELECTJOBDONE field.*/
  #define RADIOACC_INTENSET_DMAASELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of DMAASELECTJOBDONE field.                */
  #define RADIOACC_INTENSET_DMAASELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of DMAASELECTJOBDONE field.                */
  #define RADIOACC_INTENSET_DMAASELECTJOBDONE_Set (0x1UL) /*!< Enable                                                          */
  #define RADIOACC_INTENSET_DMAASELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                             */
  #define RADIOACC_INTENSET_DMAASELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                               */

/* DMAADATADONE @Bit 3 : Write '1' to enable interrupt for event DMAADATADONE */
  #define RADIOACC_INTENSET_DMAADATADONE_Pos (3UL)   /*!< Position of DMAADATADONE field.                                      */
  #define RADIOACC_INTENSET_DMAADATADONE_Msk (0x1UL << RADIOACC_INTENSET_DMAADATADONE_Pos) /*!< Bit mask of DMAADATADONE field.*/
  #define RADIOACC_INTENSET_DMAADATADONE_Min (0x0UL) /*!< Min enumerator value of DMAADATADONE field.                          */
  #define RADIOACC_INTENSET_DMAADATADONE_Max (0x1UL) /*!< Max enumerator value of DMAADATADONE field.                          */
  #define RADIOACC_INTENSET_DMAADATADONE_Set (0x1UL) /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMAADATADONE_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENSET_DMAADATADONE_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMAAJOBDONE @Bit 4 : Write '1' to enable interrupt for event DMAAJOBDONE */
  #define RADIOACC_INTENSET_DMAAJOBDONE_Pos (4UL)    /*!< Position of DMAAJOBDONE field.                                       */
  #define RADIOACC_INTENSET_DMAAJOBDONE_Msk (0x1UL << RADIOACC_INTENSET_DMAAJOBDONE_Pos) /*!< Bit mask of DMAAJOBDONE field.   */
  #define RADIOACC_INTENSET_DMAAJOBDONE_Min (0x0UL)  /*!< Min enumerator value of DMAAJOBDONE field.                           */
  #define RADIOACC_INTENSET_DMAAJOBDONE_Max (0x1UL)  /*!< Max enumerator value of DMAAJOBDONE field.                           */
  #define RADIOACC_INTENSET_DMAAJOBDONE_Set (0x1UL)  /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMAAJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIOACC_INTENSET_DMAAJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* DMAAERROR @Bit 5 : Write '1' to enable interrupt for event DMAAERROR */
  #define RADIOACC_INTENSET_DMAAERROR_Pos (5UL)      /*!< Position of DMAAERROR field.                                         */
  #define RADIOACC_INTENSET_DMAAERROR_Msk (0x1UL << RADIOACC_INTENSET_DMAAERROR_Pos) /*!< Bit mask of DMAAERROR field.         */
  #define RADIOACC_INTENSET_DMAAERROR_Min (0x0UL)    /*!< Min enumerator value of DMAAERROR field.                             */
  #define RADIOACC_INTENSET_DMAAERROR_Max (0x1UL)    /*!< Max enumerator value of DMAAERROR field.                             */
  #define RADIOACC_INTENSET_DMAAERROR_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMAAERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIOACC_INTENSET_DMAAERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMAASTOP @Bit 6 : Write '1' to enable interrupt for event DMAASTOP */
  #define RADIOACC_INTENSET_DMAASTOP_Pos (6UL)       /*!< Position of DMAASTOP field.                                          */
  #define RADIOACC_INTENSET_DMAASTOP_Msk (0x1UL << RADIOACC_INTENSET_DMAASTOP_Pos) /*!< Bit mask of DMAASTOP field.            */
  #define RADIOACC_INTENSET_DMAASTOP_Min (0x0UL)     /*!< Min enumerator value of DMAASTOP field.                              */
  #define RADIOACC_INTENSET_DMAASTOP_Max (0x1UL)     /*!< Max enumerator value of DMAASTOP field.                              */
  #define RADIOACC_INTENSET_DMAASTOP_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMAASTOP_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIOACC_INTENSET_DMAASTOP_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMAARESET @Bit 7 : Write '1' to enable interrupt for event DMAARESET */
  #define RADIOACC_INTENSET_DMAARESET_Pos (7UL)      /*!< Position of DMAARESET field.                                         */
  #define RADIOACC_INTENSET_DMAARESET_Msk (0x1UL << RADIOACC_INTENSET_DMAARESET_Pos) /*!< Bit mask of DMAARESET field.         */
  #define RADIOACC_INTENSET_DMAARESET_Min (0x0UL)    /*!< Min enumerator value of DMAARESET field.                             */
  #define RADIOACC_INTENSET_DMAARESET_Max (0x1UL)    /*!< Max enumerator value of DMAARESET field.                             */
  #define RADIOACC_INTENSET_DMAARESET_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMAARESET_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIOACC_INTENSET_DMAARESET_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMABLISTDONE @Bit 8 : Write '1' to enable interrupt for event DMABLISTDONE */
  #define RADIOACC_INTENSET_DMABLISTDONE_Pos (8UL)   /*!< Position of DMABLISTDONE field.                                      */
  #define RADIOACC_INTENSET_DMABLISTDONE_Msk (0x1UL << RADIOACC_INTENSET_DMABLISTDONE_Pos) /*!< Bit mask of DMABLISTDONE field.*/
  #define RADIOACC_INTENSET_DMABLISTDONE_Min (0x0UL) /*!< Min enumerator value of DMABLISTDONE field.                          */
  #define RADIOACC_INTENSET_DMABLISTDONE_Max (0x1UL) /*!< Max enumerator value of DMABLISTDONE field.                          */
  #define RADIOACC_INTENSET_DMABLISTDONE_Set (0x1UL) /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMABLISTDONE_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENSET_DMABLISTDONE_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMABLISTPARTDONE @Bit 9 : Write '1' to enable interrupt for event DMABLISTPARTDONE */
  #define RADIOACC_INTENSET_DMABLISTPARTDONE_Pos (9UL) /*!< Position of DMABLISTPARTDONE field.                                */
  #define RADIOACC_INTENSET_DMABLISTPARTDONE_Msk (0x1UL << RADIOACC_INTENSET_DMABLISTPARTDONE_Pos) /*!< Bit mask of
                                                                            DMABLISTPARTDONE field.*/
  #define RADIOACC_INTENSET_DMABLISTPARTDONE_Min (0x0UL) /*!< Min enumerator value of DMABLISTPARTDONE field.                  */
  #define RADIOACC_INTENSET_DMABLISTPARTDONE_Max (0x1UL) /*!< Max enumerator value of DMABLISTPARTDONE field.                  */
  #define RADIOACC_INTENSET_DMABLISTPARTDONE_Set (0x1UL) /*!< Enable                                                           */
  #define RADIOACC_INTENSET_DMABLISTPARTDONE_Disabled (0x0UL) /*!< Read: Disabled                                              */
  #define RADIOACC_INTENSET_DMABLISTPARTDONE_Enabled (0x1UL) /*!< Read: Enabled                                                */

/* DMABSELECTJOBDONE @Bit 10 : Write '1' to enable interrupt for event DMABSELECTJOBDONE */
  #define RADIOACC_INTENSET_DMABSELECTJOBDONE_Pos (10UL) /*!< Position of DMABSELECTJOBDONE field.                             */
  #define RADIOACC_INTENSET_DMABSELECTJOBDONE_Msk (0x1UL << RADIOACC_INTENSET_DMABSELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            DMABSELECTJOBDONE field.*/
  #define RADIOACC_INTENSET_DMABSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of DMABSELECTJOBDONE field.                */
  #define RADIOACC_INTENSET_DMABSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of DMABSELECTJOBDONE field.                */
  #define RADIOACC_INTENSET_DMABSELECTJOBDONE_Set (0x1UL) /*!< Enable                                                          */
  #define RADIOACC_INTENSET_DMABSELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                             */
  #define RADIOACC_INTENSET_DMABSELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                               */

/* DMABDATADONE @Bit 11 : Write '1' to enable interrupt for event DMABDATADONE */
  #define RADIOACC_INTENSET_DMABDATADONE_Pos (11UL)  /*!< Position of DMABDATADONE field.                                      */
  #define RADIOACC_INTENSET_DMABDATADONE_Msk (0x1UL << RADIOACC_INTENSET_DMABDATADONE_Pos) /*!< Bit mask of DMABDATADONE field.*/
  #define RADIOACC_INTENSET_DMABDATADONE_Min (0x0UL) /*!< Min enumerator value of DMABDATADONE field.                          */
  #define RADIOACC_INTENSET_DMABDATADONE_Max (0x1UL) /*!< Max enumerator value of DMABDATADONE field.                          */
  #define RADIOACC_INTENSET_DMABDATADONE_Set (0x1UL) /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMABDATADONE_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENSET_DMABDATADONE_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMABJOBDONE @Bit 12 : Write '1' to enable interrupt for event DMABJOBDONE */
  #define RADIOACC_INTENSET_DMABJOBDONE_Pos (12UL)   /*!< Position of DMABJOBDONE field.                                       */
  #define RADIOACC_INTENSET_DMABJOBDONE_Msk (0x1UL << RADIOACC_INTENSET_DMABJOBDONE_Pos) /*!< Bit mask of DMABJOBDONE field.   */
  #define RADIOACC_INTENSET_DMABJOBDONE_Min (0x0UL)  /*!< Min enumerator value of DMABJOBDONE field.                           */
  #define RADIOACC_INTENSET_DMABJOBDONE_Max (0x1UL)  /*!< Max enumerator value of DMABJOBDONE field.                           */
  #define RADIOACC_INTENSET_DMABJOBDONE_Set (0x1UL)  /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMABJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIOACC_INTENSET_DMABJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* DMABERROR @Bit 13 : Write '1' to enable interrupt for event DMABERROR */
  #define RADIOACC_INTENSET_DMABERROR_Pos (13UL)     /*!< Position of DMABERROR field.                                         */
  #define RADIOACC_INTENSET_DMABERROR_Msk (0x1UL << RADIOACC_INTENSET_DMABERROR_Pos) /*!< Bit mask of DMABERROR field.         */
  #define RADIOACC_INTENSET_DMABERROR_Min (0x0UL)    /*!< Min enumerator value of DMABERROR field.                             */
  #define RADIOACC_INTENSET_DMABERROR_Max (0x1UL)    /*!< Max enumerator value of DMABERROR field.                             */
  #define RADIOACC_INTENSET_DMABERROR_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMABERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIOACC_INTENSET_DMABERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMABSTOP @Bit 14 : Write '1' to enable interrupt for event DMABSTOP */
  #define RADIOACC_INTENSET_DMABSTOP_Pos (14UL)      /*!< Position of DMABSTOP field.                                          */
  #define RADIOACC_INTENSET_DMABSTOP_Msk (0x1UL << RADIOACC_INTENSET_DMABSTOP_Pos) /*!< Bit mask of DMABSTOP field.            */
  #define RADIOACC_INTENSET_DMABSTOP_Min (0x0UL)     /*!< Min enumerator value of DMABSTOP field.                              */
  #define RADIOACC_INTENSET_DMABSTOP_Max (0x1UL)     /*!< Max enumerator value of DMABSTOP field.                              */
  #define RADIOACC_INTENSET_DMABSTOP_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMABSTOP_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIOACC_INTENSET_DMABSTOP_Enabled (0x1UL) /*!< Read: Enabled                                                        */

