adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DMABRESET @Bit 15 : Write '1' to enable interrupt for event DMABRESET */
  #define RADIOACC_INTENSET_DMABRESET_Pos (15UL)     /*!< Position of DMABRESET field.                                         */
  #define RADIOACC_INTENSET_DMABRESET_Msk (0x1UL << RADIOACC_INTENSET_DMABRESET_Pos) /*!< Bit mask of DMABRESET field.         */
  #define RADIOACC_INTENSET_DMABRESET_Min (0x0UL)    /*!< Min enumerator value of DMABRESET field.                             */
  #define RADIOACC_INTENSET_DMABRESET_Max (0x1UL)    /*!< Max enumerator value of DMABRESET field.                             */
  #define RADIOACC_INTENSET_DMABRESET_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIOACC_INTENSET_DMABRESET_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIOACC_INTENSET_DMABRESET_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* COMPUTEEND @Bit 16 : Write '1' to enable interrupt for event COMPUTEEND */
  #define RADIOACC_INTENSET_COMPUTEEND_Pos (16UL)    /*!< Position of COMPUTEEND field.                                        */
  #define RADIOACC_INTENSET_COMPUTEEND_Msk (0x1UL << RADIOACC_INTENSET_COMPUTEEND_Pos) /*!< Bit mask of COMPUTEEND field.      */
  #define RADIOACC_INTENSET_COMPUTEEND_Min (0x0UL)   /*!< Min enumerator value of COMPUTEEND field.                            */
  #define RADIOACC_INTENSET_COMPUTEEND_Max (0x1UL)   /*!< Max enumerator value of COMPUTEEND field.                            */
  #define RADIOACC_INTENSET_COMPUTEEND_Set (0x1UL)   /*!< Enable                                                               */
  #define RADIOACC_INTENSET_COMPUTEEND_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define RADIOACC_INTENSET_COMPUTEEND_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* CTXFIFOEMPTY @Bit 17 : Write '1' to enable interrupt for event CTXFIFOEMPTY */
  #define RADIOACC_INTENSET_CTXFIFOEMPTY_Pos (17UL)  /*!< Position of CTXFIFOEMPTY field.                                      */
  #define RADIOACC_INTENSET_CTXFIFOEMPTY_Msk (0x1UL << RADIOACC_INTENSET_CTXFIFOEMPTY_Pos) /*!< Bit mask of CTXFIFOEMPTY field.*/
  #define RADIOACC_INTENSET_CTXFIFOEMPTY_Min (0x0UL) /*!< Min enumerator value of CTXFIFOEMPTY field.                          */
  #define RADIOACC_INTENSET_CTXFIFOEMPTY_Max (0x1UL) /*!< Max enumerator value of CTXFIFOEMPTY field.                          */
  #define RADIOACC_INTENSET_CTXFIFOEMPTY_Set (0x1UL) /*!< Enable                                                               */
  #define RADIOACC_INTENSET_CTXFIFOEMPTY_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENSET_CTXFIFOEMPTY_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* ALLTASKSSTOP @Bit 18 : Write '1' to enable interrupt for event ALLTASKSSTOP */
  #define RADIOACC_INTENSET_ALLTASKSSTOP_Pos (18UL)  /*!< Position of ALLTASKSSTOP field.                                      */
  #define RADIOACC_INTENSET_ALLTASKSSTOP_Msk (0x1UL << RADIOACC_INTENSET_ALLTASKSSTOP_Pos) /*!< Bit mask of ALLTASKSSTOP field.*/
  #define RADIOACC_INTENSET_ALLTASKSSTOP_Min (0x0UL) /*!< Min enumerator value of ALLTASKSSTOP field.                          */
  #define RADIOACC_INTENSET_ALLTASKSSTOP_Max (0x1UL) /*!< Max enumerator value of ALLTASKSSTOP field.                          */
  #define RADIOACC_INTENSET_ALLTASKSSTOP_Set (0x1UL) /*!< Enable                                                               */
  #define RADIOACC_INTENSET_ALLTASKSSTOP_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENSET_ALLTASKSSTOP_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* RADIOACC_INTENCLR: Disable interrupt */
  #define RADIOACC_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                   */

/* DMAALISTDONE @Bit 0 : Write '1' to disable interrupt for event DMAALISTDONE */
  #define RADIOACC_INTENCLR_DMAALISTDONE_Pos (0UL)   /*!< Position of DMAALISTDONE field.                                      */
  #define RADIOACC_INTENCLR_DMAALISTDONE_Msk (0x1UL << RADIOACC_INTENCLR_DMAALISTDONE_Pos) /*!< Bit mask of DMAALISTDONE field.*/
  #define RADIOACC_INTENCLR_DMAALISTDONE_Min (0x0UL) /*!< Min enumerator value of DMAALISTDONE field.                          */
  #define RADIOACC_INTENCLR_DMAALISTDONE_Max (0x1UL) /*!< Max enumerator value of DMAALISTDONE field.                          */
  #define RADIOACC_INTENCLR_DMAALISTDONE_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIOACC_INTENCLR_DMAALISTDONE_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENCLR_DMAALISTDONE_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMAALISTPARTDONE @Bit 1 : Write '1' to disable interrupt for event DMAALISTPARTDONE */
  #define RADIOACC_INTENCLR_DMAALISTPARTDONE_Pos (1UL) /*!< Position of DMAALISTPARTDONE field.                                */
  #define RADIOACC_INTENCLR_DMAALISTPARTDONE_Msk (0x1UL << RADIOACC_INTENCLR_DMAALISTPARTDONE_Pos) /*!< Bit mask of
                                                                            DMAALISTPARTDONE field.*/
  #define RADIOACC_INTENCLR_DMAALISTPARTDONE_Min (0x0UL) /*!< Min enumerator value of DMAALISTPARTDONE field.                  */
  #define RADIOACC_INTENCLR_DMAALISTPARTDONE_Max (0x1UL) /*!< Max enumerator value of DMAALISTPARTDONE field.                  */
  #define RADIOACC_INTENCLR_DMAALISTPARTDONE_Clear (0x1UL) /*!< Disable                                                        */
  #define RADIOACC_INTENCLR_DMAALISTPARTDONE_Disabled (0x0UL) /*!< Read: Disabled                                              */
  #define RADIOACC_INTENCLR_DMAALISTPARTDONE_Enabled (0x1UL) /*!< Read: Enabled                                                */

/* DMAASELECTJOBDONE @Bit 2 : Write '1' to disable interrupt for event DMAASELECTJOBDONE */
  #define RADIOACC_INTENCLR_DMAASELECTJOBDONE_Pos (2UL) /*!< Position of DMAASELECTJOBDONE field.                              */
  #define RADIOACC_INTENCLR_DMAASELECTJOBDONE_Msk (0x1UL << RADIOACC_INTENCLR_DMAASELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            DMAASELECTJOBDONE field.*/
  #define RADIOACC_INTENCLR_DMAASELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of DMAASELECTJOBDONE field.                */
  #define RADIOACC_INTENCLR_DMAASELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of DMAASELECTJOBDONE field.                */
  #define RADIOACC_INTENCLR_DMAASELECTJOBDONE_Clear (0x1UL) /*!< Disable                                                       */
  #define RADIOACC_INTENCLR_DMAASELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                             */
  #define RADIOACC_INTENCLR_DMAASELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                               */

/* DMAADATADONE @Bit 3 : Write '1' to disable interrupt for event DMAADATADONE */
  #define RADIOACC_INTENCLR_DMAADATADONE_Pos (3UL)   /*!< Position of DMAADATADONE field.                                      */
  #define RADIOACC_INTENCLR_DMAADATADONE_Msk (0x1UL << RADIOACC_INTENCLR_DMAADATADONE_Pos) /*!< Bit mask of DMAADATADONE field.*/
  #define RADIOACC_INTENCLR_DMAADATADONE_Min (0x0UL) /*!< Min enumerator value of DMAADATADONE field.                          */
  #define RADIOACC_INTENCLR_DMAADATADONE_Max (0x1UL) /*!< Max enumerator value of DMAADATADONE field.                          */
  #define RADIOACC_INTENCLR_DMAADATADONE_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIOACC_INTENCLR_DMAADATADONE_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENCLR_DMAADATADONE_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMAAJOBDONE @Bit 4 : Write '1' to disable interrupt for event DMAAJOBDONE */
  #define RADIOACC_INTENCLR_DMAAJOBDONE_Pos (4UL)    /*!< Position of DMAAJOBDONE field.                                       */
  #define RADIOACC_INTENCLR_DMAAJOBDONE_Msk (0x1UL << RADIOACC_INTENCLR_DMAAJOBDONE_Pos) /*!< Bit mask of DMAAJOBDONE field.   */
  #define RADIOACC_INTENCLR_DMAAJOBDONE_Min (0x0UL)  /*!< Min enumerator value of DMAAJOBDONE field.                           */
  #define RADIOACC_INTENCLR_DMAAJOBDONE_Max (0x1UL)  /*!< Max enumerator value of DMAAJOBDONE field.                           */
  #define RADIOACC_INTENCLR_DMAAJOBDONE_Clear (0x1UL) /*!< Disable                                                             */
  #define RADIOACC_INTENCLR_DMAAJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIOACC_INTENCLR_DMAAJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                     */

