adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RAMC_EVENTS_ERRORNONFIX: ECC detected non-fixable (multiple bits) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORNONFIX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORNONFIX register.                   */

/* EVENTS_ERRORNONFIX @Bit 0 : ECC detected non-fixable (multiple bits) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Pos (0UL) /*!< Position of EVENTS_ERRORNONFIX field.                      */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Msk (0x1UL << RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Pos) /*!< Bit mask
                                                                            of EVENTS_ERRORNONFIX field.*/
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORNONFIX field.        */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORNONFIX field.        */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Generated (0x1UL) /*!< Event generated                                    */


/* RAMC_FIXADDR: Address of the last fixable error detected by the ECC. */
  #define RAMC_FIXADDR_ResetValue (0x00000000UL)     /*!< Reset value of FIXADDR register.                                     */

/* ADDR @Bits 0..31 : Address of the last fixable error. */
  #define RAMC_FIXADDR_ADDR_Pos (0UL)                /*!< Position of ADDR field.                                              */
  #define RAMC_FIXADDR_ADDR_Msk (0xFFFFFFFFUL << RAMC_FIXADDR_ADDR_Pos) /*!< Bit mask of ADDR field.                           */


/* RAMC_NONFIXADDR: Address of the last non-fixable error detected by the ECC. */
  #define RAMC_NONFIXADDR_ResetValue (0x00000000UL)  /*!< Reset value of NONFIXADDR register.                                  */

/* ADDR @Bits 0..31 : Address of the last fixable error. */
  #define RAMC_NONFIXADDR_ADDR_Pos (0UL)             /*!< Position of ADDR field.                                              */
  #define RAMC_NONFIXADDR_ADDR_Msk (0xFFFFFFFFUL << RAMC_NONFIXADDR_ADDR_Pos) /*!< Bit mask of ADDR field.                     */


/* RAMC_WAITSTATES: Waitstates for read operations. */
  #define RAMC_WAITSTATES_ResetValue (0x00000000UL)  /*!< Reset value of WAITSTATES register.                                  */

/* WAITSTATES @Bit 0 : Number of waitstates for a read from the RAM. */
  #define RAMC_WAITSTATES_WAITSTATES_Pos (0UL)       /*!< Position of WAITSTATES field.                                        */
  #define RAMC_WAITSTATES_WAITSTATES_Msk (0x1UL << RAMC_WAITSTATES_WAITSTATES_Pos) /*!< Bit mask of WAITSTATES field.          */
  #define RAMC_WAITSTATES_WAITSTATES_Min (0x0UL)     /*!< Min value of WAITSTATES field.                                       */
  #define RAMC_WAITSTATES_WAITSTATES_Max (0x1UL)     /*!< Max size of WAITSTATES field.                                        */


/* RAMC_SECBASE: Base address for secure access area. */
  #define RAMC_SECBASE_ResetValue (0x00000000UL)     /*!< Reset value of SECBASE register.                                     */

/* ADDR @Bits 0..31 : Base address */
  #define RAMC_SECBASE_ADDR_Pos (0UL)                /*!< Position of ADDR field.                                              */
  #define RAMC_SECBASE_ADDR_Msk (0xFFFFFFFFUL << RAMC_SECBASE_ADDR_Pos) /*!< Bit mask of ADDR field.                           */


/* RAMC_SECENABLE: Enable secure access restrictions. */
  #define RAMC_SECENABLE_ResetValue (0x00000000UL)   /*!< Reset value of SECENABLE register.                                   */

/* ENABLE @Bit 0 : Enable secure access restrictions */
  #define RAMC_SECENABLE_ENABLE_Pos (0UL)            /*!< Position of ENABLE field.                                            */
  #define RAMC_SECENABLE_ENABLE_Msk (0x1UL << RAMC_SECENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                        */
  #define RAMC_SECENABLE_ENABLE_Min (0x0UL)          /*!< Min enumerator value of ENABLE field.                                */
  #define RAMC_SECENABLE_ENABLE_Max (0x1UL)          /*!< Max enumerator value of ENABLE field.                                */
  #define RAMC_SECENABLE_ENABLE_Disable (0x0UL)      /*!< Secure access restrictions disabled                                  */
  #define RAMC_SECENABLE_ENABLE_Enable (0x1UL)       /*!< Secure access restrictions enabled                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         RESETHUB                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct RESETHUB_RESETREAS ================================================ */
/**
  * @brief RESETREAS [RESETHUB_RESETREAS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  GLOBAL;                            /*!< (@ 0x00000000) Global reset reason.                                  */
  __IOM uint32_t  DOMAIN[4];                         /*!< (@ 0x00000004) Reset reason for the domain[n], where n is domain id. */
} NRF_RESETHUB_RESETREAS_Type;                       /*!< Size = 20 (0x014)                                                    */

/* RESETHUB_RESETREAS_GLOBAL: Global reset reason. */
  #define RESETHUB_RESETREAS_GLOBAL_ResetValue (0x00000000UL) /*!< Reset value of GLOBAL register.                             */

/* RESETPORONLY @Bit 0 : Reset from power on reset (reset reason POR or BOR). */
  #define RESETHUB_RESETREAS_GLOBAL_RESETPORONLY_Pos (0UL) /*!< Position of RESETPORONLY field.                                */
  #define RESETHUB_RESETREAS_GLOBAL_RESETPORONLY_Msk (0x1UL << RESETHUB_RESETREAS_GLOBAL_RESETPORONLY_Pos) /*!< Bit mask of
                                                                            RESETPORONLY field.*/
  #define RESETHUB_RESETREAS_GLOBAL_RESETPORONLY_Min (0x0UL) /*!< Min enumerator value of RESETPORONLY field.                  */
  #define RESETHUB_RESETREAS_GLOBAL_RESETPORONLY_Max (0x1UL) /*!< Max enumerator value of RESETPORONLY field.                  */
  #define RESETHUB_RESETREAS_GLOBAL_RESETPORONLY_NotDetected (0x0UL) /*!< Not detected                                         */
  #define RESETHUB_RESETREAS_GLOBAL_RESETPORONLY_Detected (0x1UL) /*!< Detected                                                */

