adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LPCOMP @Bit 17 : Reset due to wakeup from System OFF mode when wakeup is triggered by LPCOMP (Low Power Comparator). */
  #define RESETHUB_RESETREAS_GLOBAL_LPCOMP_Pos (17UL) /*!< Position of LPCOMP field.                                           */
  #define RESETHUB_RESETREAS_GLOBAL_LPCOMP_Msk (0x1UL << RESETHUB_RESETREAS_GLOBAL_LPCOMP_Pos) /*!< Bit mask of LPCOMP field.  */
  #define RESETHUB_RESETREAS_GLOBAL_LPCOMP_Min (0x0UL) /*!< Min enumerator value of LPCOMP field.                              */
  #define RESETHUB_RESETREAS_GLOBAL_LPCOMP_Max (0x1UL) /*!< Max enumerator value of LPCOMP field.                              */
  #define RESETHUB_RESETREAS_GLOBAL_LPCOMP_NotDetected (0x0UL) /*!< Not detected                                               */
  #define RESETHUB_RESETREAS_GLOBAL_LPCOMP_Detected (0x1UL) /*!< Detected                                                      */

/* DIF @Bit 18 : Reset due to wakeup from System OFF mode when wakeup is triggered by entering the debug interface mode. */
  #define RESETHUB_RESETREAS_GLOBAL_DIF_Pos (18UL)   /*!< Position of DIF field.                                               */
  #define RESETHUB_RESETREAS_GLOBAL_DIF_Msk (0x1UL << RESETHUB_RESETREAS_GLOBAL_DIF_Pos) /*!< Bit mask of DIF field.           */
  #define RESETHUB_RESETREAS_GLOBAL_DIF_Min (0x0UL)  /*!< Min enumerator value of DIF field.                                   */
  #define RESETHUB_RESETREAS_GLOBAL_DIF_Max (0x1UL)  /*!< Max enumerator value of DIF field.                                   */
  #define RESETHUB_RESETREAS_GLOBAL_DIF_NotDetected (0x0UL) /*!< Not detected                                                  */
  #define RESETHUB_RESETREAS_GLOBAL_DIF_Detected (0x1UL) /*!< Detected                                                         */

/* GRTC @Bit 19 : Reset due to wakeup from System OFF mode when wakeup is triggered by GRTC interrupt. */
  #define RESETHUB_RESETREAS_GLOBAL_GRTC_Pos (19UL)  /*!< Position of GRTC field.                                              */
  #define RESETHUB_RESETREAS_GLOBAL_GRTC_Msk (0x1UL << RESETHUB_RESETREAS_GLOBAL_GRTC_Pos) /*!< Bit mask of GRTC field.        */
  #define RESETHUB_RESETREAS_GLOBAL_GRTC_Min (0x0UL) /*!< Min enumerator value of GRTC field.                                  */
  #define RESETHUB_RESETREAS_GLOBAL_GRTC_Max (0x1UL) /*!< Max enumerator value of GRTC field.                                  */
  #define RESETHUB_RESETREAS_GLOBAL_GRTC_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETHUB_RESETREAS_GLOBAL_GRTC_Detected (0x1UL) /*!< Detected                                                        */

/* NFC @Bit 20 : Reset due to wakeup from System OFF mode when wakeup is triggered by NFC field detection in sense mode. */
  #define RESETHUB_RESETREAS_GLOBAL_NFC_Pos (20UL)   /*!< Position of NFC field.                                               */
  #define RESETHUB_RESETREAS_GLOBAL_NFC_Msk (0x1UL << RESETHUB_RESETREAS_GLOBAL_NFC_Pos) /*!< Bit mask of NFC field.           */
  #define RESETHUB_RESETREAS_GLOBAL_NFC_Min (0x0UL)  /*!< Min enumerator value of NFC field.                                   */
  #define RESETHUB_RESETREAS_GLOBAL_NFC_Max (0x1UL)  /*!< Max enumerator value of NFC field.                                   */
  #define RESETHUB_RESETREAS_GLOBAL_NFC_NotDetected (0x0UL) /*!< Not detected                                                  */
  #define RESETHUB_RESETREAS_GLOBAL_NFC_Detected (0x1UL) /*!< Detected                                                         */

/* VUSB @Bit 21 : Reset after wakeup from System OFF mode due to VBUS rising into valid range. */
  #define RESETHUB_RESETREAS_GLOBAL_VUSB_Pos (21UL)  /*!< Position of VUSB field.                                              */
  #define RESETHUB_RESETREAS_GLOBAL_VUSB_Msk (0x1UL << RESETHUB_RESETREAS_GLOBAL_VUSB_Pos) /*!< Bit mask of VUSB field.        */
  #define RESETHUB_RESETREAS_GLOBAL_VUSB_Min (0x0UL) /*!< Min enumerator value of VUSB field.                                  */
  #define RESETHUB_RESETREAS_GLOBAL_VUSB_Max (0x1UL) /*!< Max enumerator value of VUSB field.                                  */
  #define RESETHUB_RESETREAS_GLOBAL_VUSB_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETHUB_RESETREAS_GLOBAL_VUSB_Detected (0x1UL) /*!< Detected                                                        */


/* RESETHUB_RESETREAS_DOMAIN: Reset reason for the domain[n], where n is domain id. */
  #define RESETHUB_RESETREAS_DOMAIN_MaxCount (4UL)   /*!< Max size of DOMAIN[4] array.                                         */
  #define RESETHUB_RESETREAS_DOMAIN_MaxIndex (3UL)   /*!< Max index of DOMAIN[4] array.                                        */
  #define RESETHUB_RESETREAS_DOMAIN_MinIndex (0UL)   /*!< Min index of DOMAIN[4] array.                                        */
  #define RESETHUB_RESETREAS_DOMAIN_ResetValue (0x00000000UL) /*!< Reset value of DOMAIN[4] register.                          */

/* DOG @Bit 0 : Reset from the local watchdog timer detected */
  #define RESETHUB_RESETREAS_DOMAIN_DOG_Pos (0UL)    /*!< Position of DOG field.                                               */
  #define RESETHUB_RESETREAS_DOMAIN_DOG_Msk (0x1UL << RESETHUB_RESETREAS_DOMAIN_DOG_Pos) /*!< Bit mask of DOG field.           */
  #define RESETHUB_RESETREAS_DOMAIN_DOG_Min (0x0UL)  /*!< Min enumerator value of DOG field.                                   */
  #define RESETHUB_RESETREAS_DOMAIN_DOG_Max (0x1UL)  /*!< Max enumerator value of DOG field.                                   */
  #define RESETHUB_RESETREAS_DOMAIN_DOG_NotDetected (0x0UL) /*!< Not detected                                                  */
  #define RESETHUB_RESETREAS_DOMAIN_DOG_Detected (0x1UL) /*!< Detected                                                         */

/* DOGNS @Bit 1 : Reset from the local non-secure watchdog timer detected */
  #define RESETHUB_RESETREAS_DOMAIN_DOGNS_Pos (1UL)  /*!< Position of DOGNS field.                                             */
  #define RESETHUB_RESETREAS_DOMAIN_DOGNS_Msk (0x1UL << RESETHUB_RESETREAS_DOMAIN_DOGNS_Pos) /*!< Bit mask of DOGNS field.     */
  #define RESETHUB_RESETREAS_DOMAIN_DOGNS_Min (0x0UL) /*!< Min enumerator value of DOGNS field.                                */
  #define RESETHUB_RESETREAS_DOMAIN_DOGNS_Max (0x1UL) /*!< Max enumerator value of DOGNS field.                                */
  #define RESETHUB_RESETREAS_DOMAIN_DOGNS_NotDetected (0x0UL) /*!< Not detected                                                */
  #define RESETHUB_RESETREAS_DOMAIN_DOGNS_Detected (0x1UL) /*!< Detected                                                       */

/* SREQ @Bit 2 : Reset from the local soft reset request detected. */
  #define RESETHUB_RESETREAS_DOMAIN_SREQ_Pos (2UL)   /*!< Position of SREQ field.                                              */
  #define RESETHUB_RESETREAS_DOMAIN_SREQ_Msk (0x1UL << RESETHUB_RESETREAS_DOMAIN_SREQ_Pos) /*!< Bit mask of SREQ field.        */
  #define RESETHUB_RESETREAS_DOMAIN_SREQ_Min (0x0UL) /*!< Min enumerator value of SREQ field.                                  */
  #define RESETHUB_RESETREAS_DOMAIN_SREQ_Max (0x1UL) /*!< Max enumerator value of SREQ field.                                  */
  #define RESETHUB_RESETREAS_DOMAIN_SREQ_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETHUB_RESETREAS_DOMAIN_SREQ_Detected (0x1UL) /*!< Detected                                                        */

