adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DOMAINRESET1 @Bit 1 : Enable or disable interrupt for event DOMAINRESET[1] */
  #define RESETHUB_INTEN_DOMAINRESET1_Pos (1UL)      /*!< Position of DOMAINRESET1 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET1_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET1_Pos) /*!< Bit mask of DOMAINRESET1 field.      */
  #define RESETHUB_INTEN_DOMAINRESET1_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET1_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET1_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET1_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET2 @Bit 2 : Enable or disable interrupt for event DOMAINRESET[2] */
  #define RESETHUB_INTEN_DOMAINRESET2_Pos (2UL)      /*!< Position of DOMAINRESET2 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET2_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET2_Pos) /*!< Bit mask of DOMAINRESET2 field.      */
  #define RESETHUB_INTEN_DOMAINRESET2_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET2_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET2_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET2_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET3 @Bit 3 : Enable or disable interrupt for event DOMAINRESET[3] */
  #define RESETHUB_INTEN_DOMAINRESET3_Pos (3UL)      /*!< Position of DOMAINRESET3 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET3_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET3_Pos) /*!< Bit mask of DOMAINRESET3 field.      */
  #define RESETHUB_INTEN_DOMAINRESET3_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET3_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET3_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET3_Enabled (0x1UL) /*!< Enable                                                              */


/* RESETHUB_INTENSET: Enable interrupt */
  #define RESETHUB_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                   */

/* DOMAINRESET0 @Bit 0 : Write '1' to enable interrupt for event DOMAINRESET[0] */
  #define RESETHUB_INTENSET_DOMAINRESET0_Pos (0UL)   /*!< Position of DOMAINRESET0 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET0_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET0_Pos) /*!< Bit mask of DOMAINRESET0 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET0_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET0_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET0_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET1 @Bit 1 : Write '1' to enable interrupt for event DOMAINRESET[1] */
  #define RESETHUB_INTENSET_DOMAINRESET1_Pos (1UL)   /*!< Position of DOMAINRESET1 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET1_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET1_Pos) /*!< Bit mask of DOMAINRESET1 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET1_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET1_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET1_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET2 @Bit 2 : Write '1' to enable interrupt for event DOMAINRESET[2] */
  #define RESETHUB_INTENSET_DOMAINRESET2_Pos (2UL)   /*!< Position of DOMAINRESET2 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET2_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET2_Pos) /*!< Bit mask of DOMAINRESET2 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET2_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET2_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET2_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET3 @Bit 3 : Write '1' to enable interrupt for event DOMAINRESET[3] */
  #define RESETHUB_INTENSET_DOMAINRESET3_Pos (3UL)   /*!< Position of DOMAINRESET3 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET3_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET3_Pos) /*!< Bit mask of DOMAINRESET3 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET3_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET3_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET3_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET3_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* RESETHUB_INTENCLR: Disable interrupt */
  #define RESETHUB_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                   */

/* DOMAINRESET0 @Bit 0 : Write '1' to disable interrupt for event DOMAINRESET[0] */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Pos (0UL)   /*!< Position of DOMAINRESET0 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET0_Pos) /*!< Bit mask of DOMAINRESET0 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET0_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET1 @Bit 1 : Write '1' to disable interrupt for event DOMAINRESET[1] */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Pos (1UL)   /*!< Position of DOMAINRESET1 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET1_Pos) /*!< Bit mask of DOMAINRESET1 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET1_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET2 @Bit 2 : Write '1' to disable interrupt for event DOMAINRESET[2] */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Pos (2UL)   /*!< Position of DOMAINRESET2 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET2_Pos) /*!< Bit mask of DOMAINRESET2 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET2_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET3 @Bit 3 : Write '1' to disable interrupt for event DOMAINRESET[3] */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Pos (3UL)   /*!< Position of DOMAINRESET3 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET3_Pos) /*!< Bit mask of DOMAINRESET3 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET3_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* RESETHUB_INTPEND: Pending interrupts */
  #define RESETHUB_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                     */

/* DOMAINRESET0 @Bit 0 : Read pending status of interrupt for event DOMAINRESET[0] */
  #define RESETHUB_INTPEND_DOMAINRESET0_Pos (0UL)    /*!< Position of DOMAINRESET0 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET0_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET0_Pos) /*!< Bit mask of DOMAINRESET0 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET0_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET0_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET0_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET0_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET1 @Bit 1 : Read pending status of interrupt for event DOMAINRESET[1] */
  #define RESETHUB_INTPEND_DOMAINRESET1_Pos (1UL)    /*!< Position of DOMAINRESET1 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET1_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET1_Pos) /*!< Bit mask of DOMAINRESET1 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET1_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET1_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET1_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET1_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET2 @Bit 2 : Read pending status of interrupt for event DOMAINRESET[2] */
  #define RESETHUB_INTPEND_DOMAINRESET2_Pos (2UL)    /*!< Position of DOMAINRESET2 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET2_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET2_Pos) /*!< Bit mask of DOMAINRESET2 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET2_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET2_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET2_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET2_Pending (0x1UL) /*!< Read: Pending                                                     */

