adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DOMAINRESET3 @Bit 3 : Read pending status of interrupt for event DOMAINRESET[3] */
  #define RESETHUB_INTPEND_DOMAINRESET3_Pos (3UL)    /*!< Position of DOMAINRESET3 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET3_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET3_Pos) /*!< Bit mask of DOMAINRESET3 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET3_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET3_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET3_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET3_Pending (0x1UL) /*!< Read: Pending                                                     */


/* RESETHUB_RESETMASK: Mask the reset request for a domain by itself. */
  #define RESETHUB_RESETMASK_ResetValue (0x0000000CUL) /*!< Reset value of RESETMASK register.                                 */

/* DOMAIN0 @Bit 0 : Mask the reset request for the domain[0], where [0] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN0_Pos (0UL)       /*!< Position of DOMAIN0 field.                                           */
  #define RESETHUB_RESETMASK_DOMAIN0_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN0_Pos) /*!< Bit mask of DOMAIN0 field.             */
  #define RESETHUB_RESETMASK_DOMAIN0_Min (0x0UL)     /*!< Min enumerator value of DOMAIN0 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN0_Max (0x1UL)     /*!< Max enumerator value of DOMAIN0 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN0_Mask (0x0UL)    /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN0_Unmask (0x1UL)  /*!< Unmask the reset request.                                            */

/* DOMAIN1 @Bit 1 : Mask the reset request for the domain[1], where [1] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN1_Pos (1UL)       /*!< Position of DOMAIN1 field.                                           */
  #define RESETHUB_RESETMASK_DOMAIN1_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN1_Pos) /*!< Bit mask of DOMAIN1 field.             */
  #define RESETHUB_RESETMASK_DOMAIN1_Min (0x0UL)     /*!< Min enumerator value of DOMAIN1 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN1_Max (0x1UL)     /*!< Max enumerator value of DOMAIN1 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN1_Mask (0x0UL)    /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN1_Unmask (0x1UL)  /*!< Unmask the reset request.                                            */

/* DOMAIN2 @Bit 2 : Mask the reset request for the domain[2], where [2] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN2_Pos (2UL)       /*!< Position of DOMAIN2 field.                                           */
  #define RESETHUB_RESETMASK_DOMAIN2_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN2_Pos) /*!< Bit mask of DOMAIN2 field.             */
  #define RESETHUB_RESETMASK_DOMAIN2_Min (0x0UL)     /*!< Min enumerator value of DOMAIN2 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN2_Max (0x1UL)     /*!< Max enumerator value of DOMAIN2 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN2_Mask (0x0UL)    /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN2_Unmask (0x1UL)  /*!< Unmask the reset request.                                            */

/* DOMAIN3 @Bit 3 : Mask the reset request for the domain[3], where [3] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN3_Pos (3UL)       /*!< Position of DOMAIN3 field.                                           */
  #define RESETHUB_RESETMASK_DOMAIN3_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN3_Pos) /*!< Bit mask of DOMAIN3 field.             */
  #define RESETHUB_RESETMASK_DOMAIN3_Min (0x0UL)     /*!< Min enumerator value of DOMAIN3 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN3_Max (0x1UL)     /*!< Max enumerator value of DOMAIN3 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN3_Mask (0x0UL)    /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN3_Unmask (0x1UL)  /*!< Unmask the reset request.                                            */


/* RESETHUB_GPREGRET: General purpose retention register. */
  #define RESETHUB_GPREGRET_ResetValue (0x00000000UL) /*!< Reset value of GPREGRET register.                                   */

/* GPREGRET @Bits 0..7 : General purpose retention register. */
  #define RESETHUB_GPREGRET_GPREGRET_Pos (0UL)       /*!< Position of GPREGRET field.                                          */
  #define RESETHUB_GPREGRET_GPREGRET_Msk (0xFFUL << RESETHUB_GPREGRET_GPREGRET_Pos) /*!< Bit mask of GPREGRET field.           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         RESETINFO                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct RESETINFO_RESETREAS ================================================ */
/**
  * @brief RESETREAS [RESETINFO_RESETREAS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  GLOBAL;                            /*!< (@ 0x00000000) Global reset reason.                                  */
  __IOM uint32_t  LOCAL;                             /*!< (@ 0x00000004) Local reset reason.                                   */
} NRF_RESETINFO_RESETREAS_Type;                      /*!< Size = 8 (0x008)                                                     */

/* RESETINFO_RESETREAS_GLOBAL: Global reset reason. */
  #define RESETINFO_RESETREAS_GLOBAL_ResetValue (0x00000000UL) /*!< Reset value of GLOBAL register.                            */

/* RESETPORONLY @Bit 0 : Reset from power on reset (reset reason POR or BOR). */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Pos (0UL) /*!< Position of RESETPORONLY field.                               */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Pos) /*!< Bit mask of
                                                                            RESETPORONLY field.*/
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Min (0x0UL) /*!< Min enumerator value of RESETPORONLY field.                 */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Max (0x1UL) /*!< Max enumerator value of RESETPORONLY field.                 */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_NotDetected (0x0UL) /*!< Not detected                                        */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Detected (0x1UL) /*!< Detected                                               */

