adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RESETPIN @Bit 1 : Reset from pin reset detected. */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Pos (1UL) /*!< Position of RESETPIN field.                                       */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPIN_Pos) /*!< Bit mask of RESETPIN
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Min (0x0UL) /*!< Min enumerator value of RESETPIN field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Max (0x1UL) /*!< Max enumerator value of RESETPIN field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_NotDetected (0x0UL) /*!< Not detected                                            */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Detected (0x1UL) /*!< Detected                                                   */

/* DOG @Bit 2 : Reset from the SysCtrl watchdog timer detected. */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Pos (2UL)   /*!< Position of DOG field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_DOG_Pos) /*!< Bit mask of DOG field.         */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Min (0x0UL) /*!< Min enumerator value of DOG field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Max (0x1UL) /*!< Max enumerator value of DOG field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Detected (0x1UL) /*!< Detected                                                        */

/* CTRLAP @Bit 3 : Reset from CTRL-AP detected. */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Pos (3UL) /*!< Position of CTRLAP field.                                           */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_CTRLAP_Pos) /*!< Bit mask of CTRLAP field.*/
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Min (0x0UL) /*!< Min enumerator value of CTRLAP field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Max (0x1UL) /*!< Max enumerator value of CTRLAP field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_NotDetected (0x0UL) /*!< Not detected                                              */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Detected (0x1UL) /*!< Detected                                                     */

/* SECSREQ @Bit 4 : Reset due to secure domain system reset request. */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Pos (4UL) /*!< Position of SECSREQ field.                                         */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECSREQ_Pos) /*!< Bit mask of SECSREQ
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Min (0x0UL) /*!< Min enumerator value of SECSREQ field.                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Max (0x1UL) /*!< Max enumerator value of SECSREQ field.                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_NotDetected (0x0UL) /*!< Not detected                                             */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Detected (0x1UL) /*!< Detected                                                    */

/* SECWDT0 @Bit 5 : Reset due to the first instance of watchdog timer in secure domain detected. */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Pos (5UL) /*!< Position of SECWDT0 field.                                         */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECWDT0_Pos) /*!< Bit mask of SECWDT0
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Min (0x0UL) /*!< Min enumerator value of SECWDT0 field.                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Max (0x1UL) /*!< Max enumerator value of SECWDT0 field.                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_NotDetected (0x0UL) /*!< Not detected                                             */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Detected (0x1UL) /*!< Detected                                                    */

/* SECWDT1 @Bit 6 : Reset due to the second instance of watchdog timer in secure domain detected. */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Pos (6UL) /*!< Position of SECWDT1 field.                                         */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECWDT1_Pos) /*!< Bit mask of SECWDT1
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Min (0x0UL) /*!< Min enumerator value of SECWDT1 field.                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Max (0x1UL) /*!< Max enumerator value of SECWDT1 field.                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_NotDetected (0x0UL) /*!< Not detected                                             */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Detected (0x1UL) /*!< Detected                                                    */

/* SECLOCKUP @Bit 7 : Reset due to secure domain lockup. */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Pos (7UL) /*!< Position of SECLOCKUP field.                                     */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Pos) /*!< Bit mask of
                                                                            SECLOCKUP field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Min (0x0UL) /*!< Min enumerator value of SECLOCKUP field.                       */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Max (0x1UL) /*!< Max enumerator value of SECLOCKUP field.                       */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_NotDetected (0x0UL) /*!< Not detected                                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Detected (0x1UL) /*!< Detected                                                  */

/* SECTAMPER @Bit 8 : Reset due to secure domain tamper detected */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Pos (8UL) /*!< Position of SECTAMPER field.                                     */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Pos) /*!< Bit mask of
                                                                            SECTAMPER field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Min (0x0UL) /*!< Min enumerator value of SECTAMPER field.                       */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Max (0x1UL) /*!< Max enumerator value of SECTAMPER field.                       */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_NotDetected (0x0UL) /*!< Not detected                                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Detected (0x1UL) /*!< Detected                                                  */

/* RESETPOR @Bit 9 : Reset from power on reset (reset reason other than POR or BOR). */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Pos (9UL) /*!< Position of RESETPOR field.                                       */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPOR_Pos) /*!< Bit mask of RESETPOR
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Min (0x0UL) /*!< Min enumerator value of RESETPOR field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Max (0x1UL) /*!< Max enumerator value of RESETPOR field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_NotDetected (0x0UL) /*!< Not detected                                            */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Detected (0x1UL) /*!< Detected                                                   */

/* OFF @Bit 16 : Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO. */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Pos (16UL)  /*!< Position of OFF field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_OFF_Pos) /*!< Bit mask of OFF field.         */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Min (0x0UL) /*!< Min enumerator value of OFF field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Max (0x1UL) /*!< Max enumerator value of OFF field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Detected (0x1UL) /*!< Detected                                                        */

