adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCKUP @Bit 3 : Reset from local CPU lockup detected */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Pos (3UL) /*!< Position of LOCKUP field.                                            */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_LOCKUP_Pos) /*!< Bit mask of LOCKUP field.  */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Min (0x0UL) /*!< Min enumerator value of LOCKUP field.                              */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Max (0x1UL) /*!< Max enumerator value of LOCKUP field.                              */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_NotDetected (0x0UL) /*!< Not detected                                               */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Detected (0x1UL) /*!< Detected                                                      */

/* UNRETAINEDWAKE @Bit 4 : Reset due to wake from unretained state. */
  #define RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Pos (4UL) /*!< Position of UNRETAINEDWAKE field.                            */
  #define RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Pos) /*!< Bit mask of
                                                                            UNRETAINEDWAKE field.*/



/* ================================================= Struct RESETINFO_ERROR ================================================== */
/**
  * @brief ERROR [RESETINFO_ERROR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000000) Reset error status.                                   */
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000004) Reset error address.                                  */
} NRF_RESETINFO_ERROR_Type;                          /*!< Size = 8 (0x008)                                                     */

/* RESETINFO_ERROR_STATUS: Reset error status. */
  #define RESETINFO_ERROR_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                */

/* ERRORSTATUS @Bits 0..3 : Error status */
  #define RESETINFO_ERROR_STATUS_ERRORSTATUS_Pos (0UL) /*!< Position of ERRORSTATUS field.                                     */
  #define RESETINFO_ERROR_STATUS_ERRORSTATUS_Msk (0xFUL << RESETINFO_ERROR_STATUS_ERRORSTATUS_Pos) /*!< Bit mask of ERRORSTATUS
                                                                            field.*/


/* RESETINFO_ERROR_ADDRESS: Reset error address. */
  #define RESETINFO_ERROR_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                              */

/* ERRORADDRESS @Bits 0..31 : Error address */
  #define RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Pos (0UL) /*!< Position of ERRORADDRESS field.                                  */
  #define RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Msk (0xFFFFFFFFUL << RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Pos) /*!< Bit mask of
                                                                            ERRORADDRESS field.*/


/* ==================================================== Struct RESETINFO ===================================================== */
/**
  * @brief RESETINFO
  */
  typedef struct {                                   /*!< RESETINFO Structure                                                  */
    __IM uint32_t RESERVED[296];
    __IOM NRF_RESETINFO_RESETREAS_Type RESETREAS;    /*!< (@ 0x000004A0) (unspecified)                                         */
    __IOM NRF_RESETINFO_ERROR_Type ERROR;            /*!< (@ 0x000004A8) (unspecified)                                         */
    __IM uint32_t RESERVED1[4];
    __IOM uint32_t RESTOREVALID;                     /*!< (@ 0x000004C0) Valid restore image is present in RAM.                */
    __IOM uint32_t MASKLOCKUP;                       /*!< (@ 0x000004C4) Mask CPU lockup signal.                               */
  } NRF_RESETINFO_Type;                              /*!< Size = 1224 (0x4C8)                                                  */

/* RESETINFO_RESTOREVALID: Valid restore image is present in RAM. */
  #define RESETINFO_RESTOREVALID_ResetValue (0x00000000UL) /*!< Reset value of RESTOREVALID register.                          */

/* RESTOREVALID @Bit 0 : Valid restore image is present in RAM. */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Pos (0UL) /*!< Position of RESTOREVALID field.                                   */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Msk (0x1UL << RESETINFO_RESTOREVALID_RESTOREVALID_Pos) /*!< Bit mask of
                                                                            RESTOREVALID field.*/
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Min (0x0UL) /*!< Min enumerator value of RESTOREVALID field.                     */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Max (0x1UL) /*!< Max enumerator value of RESTOREVALID field.                     */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_NotPreset (0x0UL) /*!< Not present                                               */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Present (0x1UL) /*!< Present                                                     */


/* RESETINFO_MASKLOCKUP: Mask CPU lockup signal. */
  #define RESETINFO_MASKLOCKUP_ResetValue (0x00000000UL) /*!< Reset value of MASKLOCKUP register.                              */

/* MASK @Bit 0 : Mask lockup signal */
  #define RESETINFO_MASKLOCKUP_MASK_Pos (0UL)        /*!< Position of MASK field.                                              */
  #define RESETINFO_MASKLOCKUP_MASK_Msk (0x1UL << RESETINFO_MASKLOCKUP_MASK_Pos) /*!< Bit mask of MASK field.                  */
  #define RESETINFO_MASKLOCKUP_MASK_Min (0x0UL)      /*!< Min enumerator value of MASK field.                                  */
  #define RESETINFO_MASKLOCKUP_MASK_Max (0x1UL)      /*!< Max enumerator value of MASK field.                                  */
  #define RESETINFO_MASKLOCKUP_MASK_NotMask (0x0UL)  /*!< Do not mask lockup signal                                            */
  #define RESETINFO_MASKLOCKUP_MASK_Mask (0x1UL)     /*!< Mask lockup signal                                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct RICR_LCS ===================================================== */
/**
  * @brief LCS [RICR_LCS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SIGNATURE[4];                      /*!< (@ 0x00000000) Signature to determine the re-entrant device life-cycle
                                                                         state (LCS).*/
} NRF_RICR_LCS_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* RICR_LCS_SIGNATURE: Signature to determine the re-entrant device life-cycle state (LCS). */
  #define RICR_LCS_SIGNATURE_MaxCount (4UL)          /*!< Max size of SIGNATURE[4] array.                                      */
  #define RICR_LCS_SIGNATURE_MaxIndex (3UL)          /*!< Max index of SIGNATURE[4] array.                                     */
  #define RICR_LCS_SIGNATURE_MinIndex (0UL)          /*!< Min index of SIGNATURE[4] array.                                     */
  #define RICR_LCS_SIGNATURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SIGNATURE[4] register.                              */

/* VALUE @Bits 0..31 : Uninitialized when freshly out of factory, esle PUF-derived LCS signature. */
  #define RICR_LCS_SIGNATURE_VALUE_Pos (0UL)         /*!< Position of VALUE field.                                             */
  #define RICR_LCS_SIGNATURE_VALUE_Msk (0xFFFFFFFFUL << RICR_LCS_SIGNATURE_VALUE_Pos) /*!< Bit mask of VALUE field.            */
  #define RICR_LCS_SIGNATURE_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.                                */
  #define RICR_LCS_SIGNATURE_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.                                */
  #define RICR_LCS_SIGNATURE_VALUE_UNINITIALIZED (0xFFFFFFFFUL) /*!< Value of LCS registers when the device is freshly
                                                                     manufactured (LCS state FFF), and the MRAM and the info
                                                                     pages including RICR are uninitialized.*/



