adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ============================================= Struct RICR_UROT_SMWD_SM_TBS_FW ============================================= */
/**
  * @brief FW [RICR_UROT_SMWD_SM_TBS_FW] FW verified by the secure domain ROM code.
  */
typedef struct {
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000000) The firmware size (in bytes). Shall not exceed the max
                                                                         defined limits for USLOT in case of UROT firmware.Shall
                                                                         not exceed the max defined limits for USLOT in case of
                                                                         UROT firmware.*/
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000004) Address of the firmware verified by the secure domain
                                                                         ROM code.*/
  __IOM uint32_t  DIGEST[16];                        /*!< (@ 0x00000008) SHA2-512 digest of the firmware.                      */
  __IOM uint32_t  VERSION[4];                        /*!< (@ 0x00000048) 128-bit revision of the firmware; can be left
                                                                         Unprogrammed.*/
  __IOM uint32_t  TIMESTAMP;                         /*!< (@ 0x00000058) Unsigned 32-bit integer timestamp of the firmware in
                                                                         Unix time used to prevent downgrade of firmware on
                                                                         firmware update.*/
  __IOM uint32_t  PARTNO;                            /*!< (@ 0x0000005C) Part-number for which the firmware is built. Must match
                                                                         the part number in OICR region.*/
} NRF_RICR_UROT_SMWD_SM_TBS_FW_Type;                 /*!< Size = 96 (0x060)                                                    */

/* RICR_UROT_SMWD_SM_TBS_FW_SIZE: The firmware size (in bytes). Shall not exceed the max defined limits for USLOT in case of
                                   UROT firmware.Shall not exceed the max defined limits for USLOT in case of UROT firmware. */


/* SIZE @Bits 0..31 : Firmware size */
  #define RICR_UROT_SMWD_SM_TBS_FW_SIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                                            */
  #define RICR_UROT_SMWD_SM_TBS_FW_SIZE_SIZE_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_FW_SIZE_SIZE_Pos) /*!< Bit mask of SIZE
                                                                            field.*/
  #define RICR_UROT_SMWD_SM_TBS_FW_SIZE_SIZE_Min (0x00000080UL) /*!< Min value of SIZE field.                                  */
  #define RICR_UROT_SMWD_SM_TBS_FW_SIZE_SIZE_Max (0x000FD000UL) /*!< Max size of SIZE field.                                   */
  #define RICR_UROT_SMWD_SM_TBS_FW_SIZE_SIZE_Unprogrammed (0xFFFFFFFFUL) /*!< The FW is not programmed.                        */


/* RICR_UROT_SMWD_SM_TBS_FW_ADDR: Address of the firmware verified by the secure domain ROM code. */

/* ADDR @Bits 0..31 : Firmware address */
  #define RICR_UROT_SMWD_SM_TBS_FW_ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                            */
  #define RICR_UROT_SMWD_SM_TBS_FW_ADDR_ADDR_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_FW_ADDR_ADDR_Pos) /*!< Bit mask of ADDR
                                                                            field.*/
  #define RICR_UROT_SMWD_SM_TBS_FW_ADDR_ADDR_Min (0x0E003000UL) /*!< Min value of ADDR field.                                  */
  #define RICR_UROT_SMWD_SM_TBS_FW_ADDR_ADDR_Max (0x0E100000UL) /*!< Max size of ADDR field.                                   */
  #define RICR_UROT_SMWD_SM_TBS_FW_ADDR_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The FW is not programmed.                        */


/* RICR_UROT_SMWD_SM_TBS_FW_DIGEST: SHA2-512 digest of the firmware. */
  #define RICR_UROT_SMWD_SM_TBS_FW_DIGEST_MaxCount (16UL) /*!< Max size of DIGEST[16] array.                                   */
  #define RICR_UROT_SMWD_SM_TBS_FW_DIGEST_MaxIndex (15UL) /*!< Max index of DIGEST[16] array.                                  */
  #define RICR_UROT_SMWD_SM_TBS_FW_DIGEST_MinIndex (0UL) /*!< Min index of DIGEST[16] array.                                   */

/* VALUE @Bits 0..31 : SHA2-512 Digest value */
  #define RICR_UROT_SMWD_SM_TBS_FW_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                        */
  #define RICR_UROT_SMWD_SM_TBS_FW_DIGEST_VALUE_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_FW_DIGEST_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/
  #define RICR_UROT_SMWD_SM_TBS_FW_DIGEST_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.                   */
  #define RICR_UROT_SMWD_SM_TBS_FW_DIGEST_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.                   */
  #define RICR_UROT_SMWD_SM_TBS_FW_DIGEST_VALUE_Unprogrammed (0xFFFFFFFFUL) /*!< The FW digest, and hence the FW is not
                                                                            programmed.*/


/* RICR_UROT_SMWD_SM_TBS_FW_VERSION: 128-bit revision of the firmware; can be left Unprogrammed. */
  #define RICR_UROT_SMWD_SM_TBS_FW_VERSION_MaxCount (4UL) /*!< Max size of VERSION[4] array.                                   */
  #define RICR_UROT_SMWD_SM_TBS_FW_VERSION_MaxIndex (3UL) /*!< Max index of VERSION[4] array.                                  */
  #define RICR_UROT_SMWD_SM_TBS_FW_VERSION_MinIndex (0UL) /*!< Min index of VERSION[4] array.                                  */

/* VALUE @Bit 0 : nth word of the version. */
  #define RICR_UROT_SMWD_SM_TBS_FW_VERSION_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define RICR_UROT_SMWD_SM_TBS_FW_VERSION_VALUE_Msk (0x1UL << RICR_UROT_SMWD_SM_TBS_FW_VERSION_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* RICR_UROT_SMWD_SM_TBS_FW_TIMESTAMP: Unsigned 32-bit integer timestamp of the firmware in Unix time used to prevent downgrade
                                        of firmware on firmware update. */


