adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VALUE @Bits 0..31 : Unsigned unix-time timestamp of the firmware */
  #define RICR_UROT_SMWD_SM_TBS_FW_TIMESTAMP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define RICR_UROT_SMWD_SM_TBS_FW_TIMESTAMP_VALUE_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_FW_TIMESTAMP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/
  #define RICR_UROT_SMWD_SM_TBS_FW_TIMESTAMP_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.                */
  #define RICR_UROT_SMWD_SM_TBS_FW_TIMESTAMP_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.                */
  #define RICR_UROT_SMWD_SM_TBS_FW_TIMESTAMP_VALUE_Unprogrammed (0xFFFFFFFFUL) /*!< The FW timestamp is not programmed.        */


/* RICR_UROT_SMWD_SM_TBS_FW_PARTNO: Part-number for which the firmware is built. Must match the part number in OICR region. */

/* VALUE @Bits 0..31 : Part number of the device for which the firmware is built. */
  #define RICR_UROT_SMWD_SM_TBS_FW_PARTNO_VALUE_Pos (0UL) /*!< Position of VALUE field.                                        */
  #define RICR_UROT_SMWD_SM_TBS_FW_PARTNO_VALUE_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_FW_PARTNO_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/
  #define RICR_UROT_SMWD_SM_TBS_FW_PARTNO_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.                   */
  #define RICR_UROT_SMWD_SM_TBS_FW_PARTNO_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.                   */
  #define RICR_UROT_SMWD_SM_TBS_FW_PARTNO_VALUE_Unprogrammed (0xFFFFFFFFUL) /*!< The part number is not programmed.            */



/* =========================================== Struct RICR_UROT_SMWD_SM_TBS_POLICY =========================================== */
/**
  * @brief POLICY [RICR_UROT_SMWD_SM_TBS_POLICY] Set various policies on related to the firmware verification and update.
  */
typedef struct {
  __IOM uint32_t  UPDATE;                            /*!< (@ 0x00000000) Enable or Disable firmware update.                    */
  __IOM uint32_t  REVOKE;                            /*!< (@ 0x00000004) Configure key revocation policy.                      */
  __IOM uint32_t  DGPREV;                            /*!< (@ 0x00000008) Configure the downgrade prevention policy.            */
  __IOM uint32_t  RFU[5];                            /*!< (@ 0x0000000C) These registers are included when generating signature
                                                                         of the TBS content of SM.*/
} NRF_RICR_UROT_SMWD_SM_TBS_POLICY_Type;             /*!< Size = 32 (0x020)                                                    */

/* RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE: Enable or Disable firmware update. */

/* ENABLE @Bits 0..31 : Possible values for this register. */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                  */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE_ENABLE_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE_ENABLE_Pos) /*!<
                                                                            Bit mask of ENABLE field.*/
  #define RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE_ENABLE_Min (0x47D13CA5UL) /*!< Min enumerator value of ENABLE field.             */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE_ENABLE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ENABLE field.             */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE_ENABLE_Unprogrammed (0xFFFFFFFFUL) /*!< The policy is not programmed, hence any
                                                                            existing policy on update is left unchanged.*/
  #define RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE_ENABLE_Enabled (0xC3965A5AUL) /*!< Enable firmware update.                       */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_UPDATE_ENABLE_Disabled (0x47D13CA5UL) /*!< Disable firmware update.                     */


/* RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE: Configure key revocation policy. */

/* ENABLE @Bits 0..31 : Possible values for this register */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                  */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE_ENABLE_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE_ENABLE_Pos) /*!<
                                                                            Bit mask of ENABLE field.*/
  #define RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE_ENABLE_Min (0x47D13CA5UL) /*!< Min enumerator value of ENABLE field.             */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE_ENABLE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ENABLE field.             */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE_ENABLE_Unprogrammed (0xFFFFFFFFUL) /*!< The policy is not programmed, hence any
                                                                            existing policy on auto-revocation is left
                                                                            unchanged.*/
  #define RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE_ENABLE_Enabled (0xC3965A5AUL) /*!< Enable auto-revocation of keys.               */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_REVOKE_ENABLE_Disabled (0x47D13CA5UL) /*!< Disable auto-revocation of keys used to verify
                                                                            firmware.*/


/* RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV: Configure the downgrade prevention policy. */

/* ENABLE @Bits 0..31 : Possible values for this register */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                  */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV_ENABLE_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV_ENABLE_Pos) /*!<
                                                                            Bit mask of ENABLE field.*/
  #define RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV_ENABLE_Min (0x47D13CA5UL) /*!< Min enumerator value of ENABLE field.             */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV_ENABLE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ENABLE field.             */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV_ENABLE_Unprogrammed (0xFFFFFFFFUL) /*!< The policy is not programmed, hence any
                                                                            existing policy on downgrade prevention is
                                                                            unaltered.*/
  #define RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV_ENABLE_Enabled (0xC3965A5AUL) /*!< Enable downgrade protection on firmware update.
                                                                            If Enabled, the SM.TBS.FW.TIMESTAMP register cannot
                                                                            be left Unprogrammed.*/
  #define RICR_UROT_SMWD_SM_TBS_POLICY_DGPREV_ENABLE_Disabled (0x47D13CA5UL) /*!< Disable downgrade protection on firmware
                                                                            updates. If Disabled, the SM.TBS.FW.TIMESTAMP
                                                                            register shall be left Unprogrammed.*/


/* RICR_UROT_SMWD_SM_TBS_POLICY_RFU: These registers are included when generating signature of the TBS content of SM. */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_RFU_MaxCount (5UL) /*!< Max size of RFU[5] array.                                       */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_RFU_MaxIndex (4UL) /*!< Max index of RFU[5] array.                                      */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_RFU_MinIndex (0UL) /*!< Min index of RFU[5] array.                                      */

/* RFU @Bits 0..31 : (unspecified) */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_RFU_RFU_Pos (0UL) /*!< Position of RFU field.                                           */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_RFU_RFU_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_TBS_POLICY_RFU_RFU_Pos) /*!< Bit mask of
                                                                            RFU field.*/
  #define RICR_UROT_SMWD_SM_TBS_POLICY_RFU_RFU_Min (0xFFFFFFFFUL) /*!< Min enumerator value of RFU field.                      */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_RFU_RFU_Max (0xFFFFFFFFUL) /*!< Max enumerator value of RFU field.                      */
  #define RICR_UROT_SMWD_SM_TBS_POLICY_RFU_RFU_Unprogrammed (0xFFFFFFFFUL) /*!< The register is not programmed.                */



