adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RICR_UROT_SMWD_SM_SIGNATURE_ADDR: Address of the signature on the firmware manifest. */

/* ADDR @Bits 0..31 : Signature address. */
  #define RICR_UROT_SMWD_SM_SIGNATURE_ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                         */
  #define RICR_UROT_SMWD_SM_SIGNATURE_ADDR_ADDR_Msk (0xFFFFFFFFUL << RICR_UROT_SMWD_SM_SIGNATURE_ADDR_ADDR_Pos) /*!< Bit mask of
                                                                            ADDR field.*/
  #define RICR_UROT_SMWD_SM_SIGNATURE_ADDR_ADDR_Min (0x0E003000UL) /*!< Min value of ADDR field.                               */
  #define RICR_UROT_SMWD_SM_SIGNATURE_ADDR_ADDR_Max (0x0E100000UL) /*!< Max size of ADDR field.                                */
  #define RICR_UROT_SMWD_SM_SIGNATURE_ADDR_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.              */



/* ================================================ Struct RICR_UROT_SMWD_SM ================================================= */
/**
  * @brief SM [RICR_UROT_SMWD_SM] Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.
  */
typedef struct {
  __IOM NRF_RICR_UROT_SMWD_SM_TBS_Type TBS;          /*!< (@ 0x00000000) Manifest describing the secure domain firmware. The
                                                                         secure domain ROM code verifies the signature on the
                                                                         digest of this register.*/
  __IM  uint32_t  RESERVED[3];
  __IOM NRF_RICR_UROT_SMWD_SM_SIGNATURE_Type SIGNATURE; /*!< (@ 0x000000F4) Signature on the manifest defined in TBS           */
} NRF_RICR_UROT_SMWD_SM_Type;                        /*!< Size = 256 (0x100)                                                   */


/* ================================================== Struct RICR_UROT_SMWD ================================================== */
/**
  * @brief SMWD [RICR_UROT_SMWD] Signed Manifest verified by the secure domain ROM Code to establish the primary RoT with digest.
  */
typedef struct {
  __IOM NRF_RICR_UROT_SMWD_SM_Type SM;               /*!< (@ 0x00000000) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/
  __IOM uint32_t  DIGEST[16];                        /*!< (@ 0x00000100) SHA-512 Digest of the signed manifest used for
                                                                         intregrity check of the signed-manifest. Utilized in
                                                                         scenarios involving warm-boot and firmware update.*/
} NRF_RICR_UROT_SMWD_Type;                           /*!< Size = 320 (0x140)                                                   */


/* ================================================= Struct RICR_UROT_OWNER ================================================== */
/**
  * @brief OWNER [RICR_UROT_OWNER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  UROT;                              /*!< (@ 0x00000000) Indicates the owner of UROT firmware.                 */
  __IOM uint32_t  RECOVERY;                          /*!< (@ 0x00000004) Indicates the owner of Recovery firmware.             */
} NRF_RICR_UROT_OWNER_Type;                          /*!< Size = 8 (0x008)                                                     */

/* RICR_UROT_OWNER_UROT: Indicates the owner of UROT firmware. */

/* OWNER @Bits 0..31 : Indicates whether UROT owner is uninitialized, Nordic or User. */
  #define RICR_UROT_OWNER_UROT_OWNER_Pos (0UL)       /*!< Position of OWNER field.                                             */
  #define RICR_UROT_OWNER_UROT_OWNER_Msk (0xFFFFFFFFUL << RICR_UROT_OWNER_UROT_OWNER_Pos) /*!< Bit mask of OWNER field.        */
  #define RICR_UROT_OWNER_UROT_OWNER_Min (0x67CA0593UL) /*!< Min enumerator value of OWNER field.                              */
  #define RICR_UROT_OWNER_UROT_OWNER_Max (0xFFFFFFFFUL) /*!< Max enumerator value of OWNER field.                              */
  #define RICR_UROT_OWNER_UROT_OWNER_Uninitialized (0xFFFFFFFFUL) /*!< Owner is not initialized yet.                           */
  #define RICR_UROT_OWNER_UROT_OWNER_Nordic (0xFD3D8E75UL) /*!< Owner is Nordic.                                               */
  #define RICR_UROT_OWNER_UROT_OWNER_User (0x67CA0593UL) /*!< Owner is customer(User).                                         */


/* RICR_UROT_OWNER_RECOVERY: Indicates the owner of Recovery firmware. */

/* OWNER @Bits 0..31 : Indicates whether Recovery owner is uninitialized, Nordic or User. */
  #define RICR_UROT_OWNER_RECOVERY_OWNER_Pos (0UL)   /*!< Position of OWNER field.                                             */
  #define RICR_UROT_OWNER_RECOVERY_OWNER_Msk (0xFFFFFFFFUL << RICR_UROT_OWNER_RECOVERY_OWNER_Pos) /*!< Bit mask of OWNER field.*/
  #define RICR_UROT_OWNER_RECOVERY_OWNER_Min (0x67CA0593UL) /*!< Min enumerator value of OWNER field.                          */
  #define RICR_UROT_OWNER_RECOVERY_OWNER_Max (0xFFFFFFFFUL) /*!< Max enumerator value of OWNER field.                          */
  #define RICR_UROT_OWNER_RECOVERY_OWNER_Uninitialized (0xFFFFFFFFUL) /*!< Owner is not initialized yet.                       */
  #define RICR_UROT_OWNER_RECOVERY_OWNER_Nordic (0xFD3D8E75UL) /*!< Owner is Nordic.                                           */
  #define RICR_UROT_OWNER_RECOVERY_OWNER_User (0x67CA0593UL) /*!< Owner is customer(User).                                     */



/* ====================================== Struct RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY ======================================= */
/**
  * @brief PUBKEY [RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY] Raw public key used to verify the signed manifest.
  */
typedef struct {
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000000) The size of the raw public key(in bytes).             */
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000004) Address of the raw public key.                        */
} NRF_RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_Type;    /*!< Size = 8 (0x008)                                                     */

/* RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_SIZE: The size of the raw public key(in bytes). */

