adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SIZE @Bits 0..31 : Key size */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_SIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                               */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_SIZE_SIZE_Msk (0xFFFFFFFFUL << RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_SIZE_SIZE_Pos)
                                                                            /*!< Bit mask of SIZE field.*/
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_SIZE_SIZE_Min (0x20UL) /*!< Min enumerator value of SIZE field.                */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_SIZE_SIZE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of SIZE field.          */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_SIZE_SIZE_Unprogrammed (0xFFFFFFFFUL) /*!< The key is not programmed.          */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_SIZE_SIZE_SizeEd25519 (0x00000020UL) /*!< The size of the raw Ed25519 public
                                                                            key. Currently this is the only size supported by
                                                                            the secure domain ROM code.*/


/* RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_ADDR: Address of the raw public key. */

/* ADDR @Bits 0..31 : Public key address. */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                               */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_ADDR_ADDR_Msk (0xFFFFFFFFUL << RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_ADDR_ADDR_Pos)
                                                                            /*!< Bit mask of ADDR field.*/
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_ADDR_ADDR_Min (0x0E003000UL) /*!< Min value of ADDR field.                     */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_ADDR_ADDR_Max (0x0E100000UL) /*!< Max size of ADDR field.                      */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY_ADDR_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The key is not programmed.          */



/* =================================== Struct RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT ==================================== */
/**
  * @brief USLOT [RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT] Start adddress and max size of UROT slot (USLOT), Shall remain
            the same for firmware updates once programmed or unless transitioned back to LCS Empty.

  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start address of the UROT firmware. Shall not overlap
                                                                         with the recovery slot (RSLOT).*/
  __IOM uint32_t  MAX;                               /*!< (@ 0x00000004) Maximum size of the UROT firmware in bytes.           */
} NRF_RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_Type; /*!< Size = 8 (0x008)                                                  */

/* RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_START: Start address of the UROT firmware. Shall not overlap with the recovery
                                                       slot (RSLOT). */


/* ADDR @Bits 0..31 : (unspecified) */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_START_ADDR_Pos (0UL) /*!< Position of ADDR field.                        */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_START_ADDR_Msk (0xFFFFFFFFUL << RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_START_ADDR_Pos)
                                                                            /*!< Bit mask of ADDR field.*/
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_START_ADDR_Min (0x0E003000UL) /*!< Min value of ADDR field.              */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_START_ADDR_Max (0x0E100000UL) /*!< Max size of ADDR field.               */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_START_ADDR_Undefined (0xFFFFFFFFUL) /*!< The slot is not defined.        */


/* RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_MAX: Maximum size of the UROT firmware in bytes. */

/* SIZE @Bits 0..31 : (unspecified) */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Pos (0UL) /*!< Position of SIZE field.                          */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Msk (0xFFFFFFFFUL << RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Pos)
                                                                            /*!< Bit mask of SIZE field.*/
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Min (0x00000080UL) /*!< Min value of SIZE field.                */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Max (0x000FD000UL) /*!< Max size of SIZE field.                 */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Undefined (0xFFFFFFFFUL) /*!< The slot is not defined.          */



/* =================================== Struct RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT ==================================== */
/**
  * @brief RSLOT [RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT] Start adddress and max size of recovery slot (RSLOT), Shall
            remain the same for firmware updates once programmed or unless transitioned back to LCS Empty.

  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start address of the recovery firmware. Shall not
                                                                         overlap with the UROT slot(USLOT).*/
  __IOM uint32_t  MAX;                               /*!< (@ 0x00000004) Maximum size of the recovery image in bytes.          */
} NRF_RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_Type; /*!< Size = 8 (0x008)                                                  */

/* RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_START: Start address of the recovery firmware. Shall not overlap with the UROT
                                                       slot(USLOT). */


/* ADDR @Bits 0..31 : (unspecified) */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_START_ADDR_Pos (0UL) /*!< Position of ADDR field.                        */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_START_ADDR_Msk (0xFFFFFFFFUL << RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_START_ADDR_Pos)
                                                                            /*!< Bit mask of ADDR field.*/
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_START_ADDR_Min (0x0E003000UL) /*!< Min value of ADDR field.              */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_START_ADDR_Max (0x0E100000UL) /*!< Max size of ADDR field.               */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_START_ADDR_Undefined (0xFFFFFFFFUL) /*!< The slot is not defined.        */


/* RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_MAX: Maximum size of the recovery image in bytes. */

/* SIZE @Bits 0..31 : (unspecified) */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Pos (0UL) /*!< Position of SIZE field.                          */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Msk (0xFFFFFFFFUL << RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Pos)
                                                                            /*!< Bit mask of SIZE field.*/
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Min (0x00000080UL) /*!< Min value of SIZE field.                */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Max (0x000FD000UL) /*!< Max size of SIZE field.                 */
  #define RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Undefined (0xFFFFFFFFUL) /*!< The slot is not defined.          */



/* ====================================== Struct RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT ======================================= */
/**
  * @brief LAYOUT [RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT] The MRAM layout of UROT firmware and the recovery image.
  */
typedef struct {
  __IOM NRF_RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT_Type USLOT; /*!< (@ 0x00000000) Start adddress and max size of UROT slot
                                                                            (USLOT), Shall remain the same for firmware updates
                                                                            once programmed or unless transitioned back to LCS
                                                                            Empty.*/
  __IOM NRF_RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT_Type RSLOT; /*!< (@ 0x00000008) Start adddress and max size of recovery
                                                                            slot (RSLOT), Shall remain the same for firmware
                                                                            updates once programmed or unless transitioned back
                                                                            to LCS Empty.*/
} NRF_RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_Type;    /*!< Size = 16 (0x010)                                                    */


