adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VALUE @Bits 0..31 : SHA2-512 Digest value */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_CIPHERDIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_CIPHERDIGEST_VALUE_Msk (0xFFFFFFFFUL << RICR_UROT_UPWD_UPDATE_SM_TBS_CIPHERDIGEST_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_CIPHERDIGEST_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.         */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_CIPHERDIGEST_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.         */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_CIPHERDIGEST_VALUE_Unprogrammed (0xFFFFFFFFUL) /*!< Encrypted firmware digest,
                                                                            unprogrammed if the FW is not programmed.*/


/* RICR_UROT_UPWD_UPDATE_SM_TBS_RFU: These registers are included when generating signature of the TBS content of SM */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_MaxCount (4UL) /*!< Max size of RFU[4] array.                                       */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_MaxIndex (3UL) /*!< Max index of RFU[4] array.                                      */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_MinIndex (0UL) /*!< Min index of RFU[4] array.                                      */

/* RFU @Bits 0..31 : (unspecified) */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_RFU_Pos (0UL) /*!< Position of RFU field.                                           */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_RFU_Msk (0xFFFFFFFFUL << RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_RFU_Pos) /*!< Bit mask of
                                                                            RFU field.*/
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_RFU_Min (0xFFFFFFFFUL) /*!< Min enumerator value of RFU field.                      */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_RFU_Max (0xFFFFFFFFUL) /*!< Max enumerator value of RFU field.                      */
  #define RICR_UROT_UPWD_UPDATE_SM_TBS_RFU_RFU_Unprogrammed (0xFFFFFFFFUL) /*!< The register is not programmed.                */



/* ======================================== Struct RICR_UROT_UPWD_UPDATE_SM_SIGNATURE ======================================== */
/**
  * @brief SIGNATURE [RICR_UROT_UPWD_UPDATE_SM_SIGNATURE] Signature on the manifest defined in TBS
  */
typedef struct {
  __IOM uint32_t  ALG;                               /*!< (@ 0x00000000) The signature algorithm identifier as defined in
                                                                         RFC8152.*/
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Size of the raw signature in bytes.                   */
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000008) Address of the signature on the firmware manifest.    */
} NRF_RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_Type;       /*!< Size = 12 (0x00C)                                                    */

/* RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ALG: The signature algorithm identifier as defined in RFC8152. */

/* ID @Bits 0..31 : Algorithm identifier */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ALG_ID_Pos (0UL) /*!< Position of ID field.                                       */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ALG_ID_Msk (0xFFFFFFFFUL << RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ALG_ID_Pos) /*!< Bit
                                                                            mask of ID field.*/
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ALG_ID_Min (0x5UL) /*!< Min enumerator value of ID field.                         */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ALG_ID_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ID field.                  */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ALG_ID_Unprogrammed (0xFFFFFFFFUL) /*!< The signature algorithm identifier is not
                                                                            programmed.*/
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ALG_ID_AlgIdEd25519 (0x00000005UL) /*!< ARM ADAC-defined identifier for Ed25519.
                                                                            The use of ARM ADAC-defined identifier ensures
                                                                            consistent user interface on CTRL-AP and SICR. Only
                                                                            Ed25519 curve is supported.*/


/* RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE: Size of the raw signature in bytes. */

/* SIZE @Bits 0..31 : Signature size */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                                  */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE_SIZE_Msk (0xFFFFFFFFUL << RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE_SIZE_Pos)
                                                                            /*!< Bit mask of SIZE field.*/
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE_SIZE_Min (0x40UL) /*!< Min enumerator value of SIZE field.                   */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE_SIZE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of SIZE field.             */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE_SIZE_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.       */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE_SIZE_SizeEd25519 (0x00000040UL) /*!< Size of Ed25519 signature bytestring.   */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_SIZE_SIZE_MaxSize (0x00000040UL) /*!< Currently, the secure domain ROM code
                                                                            supports only Ed25519 (and only Ed25519 curve)
                                                                            signature scheme, and hence the MaxSize is the same
                                                                            as the Ed25519 signature size.*/


/* RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ADDR: Address of the signature on the firmware manifest. */

/* ADDR @Bits 0..31 : Signature address. */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                  */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ADDR_ADDR_Msk (0xFFFFFFFFUL << RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ADDR_ADDR_Pos)
                                                                            /*!< Bit mask of ADDR field.*/
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ADDR_ADDR_Min (0x0E003000UL) /*!< Min value of ADDR field.                        */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ADDR_ADDR_Max (0x0E100000UL) /*!< Max size of ADDR field.                         */
  #define RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_ADDR_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.       */



/* ============================================= Struct RICR_UROT_UPWD_UPDATE_SM ============================================= */
/**
  * @brief SM [RICR_UROT_UPWD_UPDATE_SM] Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.
  */
typedef struct {
  __IOM NRF_RICR_UROT_UPWD_UPDATE_SM_TBS_Type TBS;   /*!< (@ 0x00000000) Manifest describing the secure domain firmware. The
                                                                         secure domain ROM code verifies the signature on the
                                                                         digest of this register.*/
  __IM  uint32_t  RESERVED[3];
  __IOM NRF_RICR_UROT_UPWD_UPDATE_SM_SIGNATURE_Type SIGNATURE; /*!< (@ 0x000000F4) Signature on the manifest defined in TBS    */
} NRF_RICR_UROT_UPWD_UPDATE_SM_Type;                 /*!< Size = 256 (0x100)                                                   */


/* ============================================== Struct RICR_UROT_UPWD_UPDATE =============================================== */
/**
  * @brief UPDATE [RICR_UROT_UPWD_UPDATE] Description of FW Updates, if any. In case, SICR.UROT.TBS.POLICY.UPDATE is set to
            Disabled, these registers are ignored by the secure domain ROM code.

  */
typedef struct {
  __IOM uint32_t  OPERATION;                         /*!< (@ 0x00000000) Command from the secure domain firmware to the secure
                                                                         domain ROM code.*/
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) ROM code indicates the status of update to the secure
                                                                         domain firmware via this register.*/
  __IOM NRF_RICR_UROT_UPWD_UPDATE_DOWNLOAD_Type DOWNLOAD; /*!< (@ 0x00000008) Information about downloaded firmware update. The
                                                                            addresses described here are the location of the
                                                                            update and not the location they must be installed.
                                                                            The installation information is described in the
                                                                            signed manifest.*/
  __IM  uint32_t  RESERVED[2];
  __IOM NRF_RICR_UROT_UPWD_UPDATE_SM_Type SM;        /*!< (@ 0x00000020) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/
} NRF_RICR_UROT_UPWD_UPDATE_Type;                    /*!< Size = 288 (0x120)                                                   */

