adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RICR_UROT_UPWD_UPDATE_OPERATION: Command from the secure domain firmware to the secure domain ROM code. */

/* OPCODE @Bits 0..31 : Opcode to identify the command. */
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_Pos (0UL) /*!< Position of OPCODE field.                                      */
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_Msk (0xFFFFFFFFUL << RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_Pos) /*!< Bit mask
                                                                            of OPCODE field.*/
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_Min (0x80000001UL) /*!< Min enumerator value of OPCODE field.                 */
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of OPCODE field.                 */
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_Nop (0xFFFFFFFFUL) /*!< No operation pending.                                 */
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_UROTVerify (0x80000001UL) /*!< Command to only verify UROT (plain-text or
                                                                            encrypted) firmware update without applying it.*/
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_UROTActivate (0x80000002UL) /*!< Command to verify and update encrypted UROT
                                                                            firmware.*/
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_RecoveryVerify (0x80000003UL) /*!< Command to verify the recovery (plain-text
                                                                            only) firmware update without applying it.*/
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_RecoveryActivate (0x80000004UL) /*!< Command to verify and update plain-text
                                                                            Recovery firmware.*/
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_UROTPlainTextActivate (0x80000005UL) /*!< Command to verify and update
                                                                            plain-text UROT firmware.*/
  #define RICR_UROT_UPWD_UPDATE_OPERATION_OPCODE_AROTRecovery (0xA0000001UL) /*!< Instructs the ROM code to boot the recovery
                                                                            image in safe mode to download a AROT image instead
                                                                            of a UROT image.*/


/* RICR_UROT_UPWD_UPDATE_STATUS: ROM code indicates the status of update to the secure domain firmware via this register. */

/* CODE @Bits 0..31 : Status code. */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_Pos (0UL) /*!< Position of CODE field.                                             */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_Msk (0xFFFFFFFFUL << RICR_UROT_UPWD_UPDATE_STATUS_CODE_Pos) /*!< Bit mask of CODE
                                                                            field.*/
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_Min (0xF0000001UL) /*!< Min enumerator value of CODE field.                        */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of CODE field.                        */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_None (0xFFFFFFFFUL) /*!< No operation pending to indicate any status.              */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_UnknownOperation (0xF0000001UL) /*!< Unknown OPCODE in SICR.UROT.UPDATE.OPERATION. */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_InvalidManifest (0xF0000002UL) /*!< The information in the manifest is invalid.    */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_StaleFW (0xF0000003UL) /*!< The timestamp on the firmware is older than the current
                                                                        one.*/
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_VerifyFailure (0xF0000005UL) /*!< The signature did not verify.                    */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_VerifyOK (0xF0000006UL) /*!< Signature verification is successful.                 */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_UROTUpdateDisabled (0xF0000007UL) /*!< UROT firmware update is disabled via policy.*/
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_UROTActivated (0xF0000008UL) /*!< UROT firmware update verification and installation
                                                                            succeeded.*/
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_RecoveryActivated (0xF0000009UL) /*!< Recovery firmware update verification and
                                                                            installation succeeded.*/
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_RecoveryUpdateDisabled (0xF000000AUL) /*!< Recovery update is disabled via policy. */
  #define RICR_UROT_UPWD_UPDATE_STATUS_CODE_AROTRecovery (0xF1000000UL) /*!< Recovery image is booted so that the recovery image
                                                                            can download a AROT image that ROM does not verify.*/



/* ================================================== Struct RICR_UROT_UPWD ================================================== */
/**
  * @brief UPWD [RICR_UROT_UPWD] Update with digest. Digest is used to ensure SICR contents where not tampered when resuming any
            paused processing of the update.

  */
typedef struct {
  __IOM NRF_RICR_UROT_UPWD_UPDATE_Type UPDATE;       /*!< (@ 0x00000000) Description of FW Updates, if any. In case,
                                                                         SICR.UROT.TBS.POLICY.UPDATE is set to Disabled, these
                                                                         registers are ignored by the secure domain ROM code.*/
  __IOM uint32_t  DIGEST[16];                        /*!< (@ 0x00000120) SHA-512 Digest of the signed manifest used for
                                                                         integrity check of the signed-manifest.*/
  __IOM uint32_t  STATE;                             /*!< (@ 0x00000160) Internal state of any update.                         */
} NRF_RICR_UROT_UPWD_Type;                           /*!< Size = 356 (0x164)                                                   */


