adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================= Struct RICR_UROT_STATE ================================================== */
/**
  * @brief STATE [RICR_UROT_STATE] Describes the currently booted firmware (UROT or recovery) and if the update of the two
            firmwares is currently enabled or disabled.

  */
typedef struct {
  __IOM uint32_t  CURRENTFW;                         /*!< (@ 0x00000000) Indicate which of the firmware, UROT or recovery, is
                                                                         started.*/
  __IOM uint32_t  UROTFWUPDATE;                      /*!< (@ 0x00000004) Indicates if UROT firmware update is enabled or
                                                                         disabled.*/
  __IOM uint32_t  RECOVERYFWUPDATE;                  /*!< (@ 0x00000008) Indicates if recovery firmware update is enabled or
                                                                         disabled.*/
} NRF_RICR_UROT_STATE_Type;                          /*!< Size = 12 (0x00C)                                                    */

/* RICR_UROT_STATE_CURRENTFW: Indicate which of the firmware, UROT or recovery, is started. */

/* ADDR @Bits 0..31 : MRAM location of either UROT or recovery firmware based on which firmware is started at cold boot. This
                      address is updated by the ROM code and cold boot and used at warm boot to start the right firmware. */

  #define RICR_UROT_STATE_CURRENTFW_ADDR_Pos (0UL)   /*!< Position of ADDR field.                                              */
  #define RICR_UROT_STATE_CURRENTFW_ADDR_Msk (0xFFFFFFFFUL << RICR_UROT_STATE_CURRENTFW_ADDR_Pos) /*!< Bit mask of ADDR field. */
  #define RICR_UROT_STATE_CURRENTFW_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                           */
  #define RICR_UROT_STATE_CURRENTFW_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                           */
  #define RICR_UROT_STATE_CURRENTFW_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The address is not programmed.                       */


/* RICR_UROT_STATE_UROTFWUPDATE: Indicates if UROT firmware update is enabled or disabled. */

/* STATUS @Bits 0..31 : ROM writes this field based on whether a valid recovery firmware exists and reads this field to process
                        any request to update the UROT firmware. */

  #define RICR_UROT_STATE_UROTFWUPDATE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                         */
  #define RICR_UROT_STATE_UROTFWUPDATE_STATUS_Msk (0xFFFFFFFFUL << RICR_UROT_STATE_UROTFWUPDATE_STATUS_Pos) /*!< Bit mask of
                                                                            STATUS field.*/
  #define RICR_UROT_STATE_UROTFWUPDATE_STATUS_Min (0x83A91C27UL) /*!< Min enumerator value of STATUS field.                    */
  #define RICR_UROT_STATE_UROTFWUPDATE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                    */
  #define RICR_UROT_STATE_UROTFWUPDATE_STATUS_Disabled (0xFFFFFFFFUL) /*!< The update of UROT is disabled since no valid
                                                                           recovery firmware exists.*/
  #define RICR_UROT_STATE_UROTFWUPDATE_STATUS_Enabled (0x83A91C27UL) /*!< The update of UROT is enabled since valid recovery
                                                                          firmware exists.*/


/* RICR_UROT_STATE_RECOVERYFWUPDATE: Indicates if recovery firmware update is enabled or disabled. */

/* STATUS @Bits 0..31 : ROM writes this field based on whether a valid UROT firmware exists and reads this field to process any
                        request to update the recovery firmware. */

  #define RICR_UROT_STATE_RECOVERYFWUPDATE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                     */
  #define RICR_UROT_STATE_RECOVERYFWUPDATE_STATUS_Msk (0xFFFFFFFFUL << RICR_UROT_STATE_RECOVERYFWUPDATE_STATUS_Pos) /*!< Bit
                                                                            mask of STATUS field.*/
  #define RICR_UROT_STATE_RECOVERYFWUPDATE_STATUS_Min (0x83A91C27UL) /*!< Min enumerator value of STATUS field.                */
  #define RICR_UROT_STATE_RECOVERYFWUPDATE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                */
  #define RICR_UROT_STATE_RECOVERYFWUPDATE_STATUS_Disabled (0xFFFFFFFFUL) /*!< The update of recovery firmware is disabled since
                                                                            no valid UROT firmmware exists.*/
  #define RICR_UROT_STATE_RECOVERYFWUPDATE_STATUS_Enabled (0x83A91C27UL) /*!< The update of recovery firmware is enabled since
                                                                            valid UROT firmmware exists.*/



/* ==================================================== Struct RICR_UROT ===================================================== */
/**
  * @brief UROT [RICR_UROT] (unspecified)
  */
typedef struct {
  __IOM NRF_RICR_UROT_SMWD_Type SMWD;                /*!< (@ 0x00000000) Signed Manifest verified by the secure domain ROM Code
                                                                         to establish the primary RoT with digest.*/
  __IM  uint32_t  RESERVED[46];
  __IOM NRF_RICR_UROT_OWNER_Type OWNER;              /*!< (@ 0x000001F8) (unspecified)                                         */
  __IOM NRF_RICR_UROT_RECOVERY_Type RECOVERY;        /*!< (@ 0x00000200) (unspecified)                                         */
  __IOM NRF_RICR_UROT_UPWD_Type UPWD;                /*!< (@ 0x00000340) Update with digest. Digest is used to ensure SICR
                                                                         contents where not tampered when resuming any paused
                                                                         processing of the update.*/
  __IOM NRF_RICR_UROT_STATE_Type STATE;              /*!< (@ 0x000004A4) Describes the currently booted firmware (UROT or
                                                                         recovery) and if the update of the two firmwares is
                                                                         currently enabled or disabled.*/
} NRF_RICR_UROT_Type;                                /*!< Size = 1200 (0x4B0)                                                  */

/* ======================================================= Struct RICR ======================================================= */
/**
  * @brief ROM Information Configuration Registers
  */
  typedef struct {                                   /*!< RICR Structure                                                       */
    __IOM NRF_RICR_LCS_Type LCS;                     /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_RICR_UROT_Type UROT;                   /*!< (@ 0x00000010) (unspecified)                                         */
  } NRF_RICR_Type;                                   /*!< Size = 1216 (0x4C0)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           ROMC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

