adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ==================================================== Struct ROMC_POWER ==================================================== */
/**
  * @brief POWER [ROMC_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000000) ROM power control register.                           */
} NRF_ROMC_POWER_Type;                               /*!< Size = 4 (0x004)                                                     */

/* ROMC_POWER_CONTROL: ROM power control register. */
  #define ROMC_POWER_CONTROL_ResetValue (0x00000001UL) /*!< Reset value of CONTROL register.                                   */

/* MEM0 @Bit 0 : Keep the ROM block MEM[0] on or off when in System ON mode. */
  #define ROMC_POWER_CONTROL_MEM0_Pos (0UL)          /*!< Position of MEM0 field.                                              */
  #define ROMC_POWER_CONTROL_MEM0_Msk (0x1UL << ROMC_POWER_CONTROL_MEM0_Pos) /*!< Bit mask of MEM0 field.                      */
  #define ROMC_POWER_CONTROL_MEM0_Min (0x0UL)        /*!< Min enumerator value of MEM0 field.                                  */
  #define ROMC_POWER_CONTROL_MEM0_Max (0x1UL)        /*!< Max enumerator value of MEM0 field.                                  */
  #define ROMC_POWER_CONTROL_MEM0_Off (0x0UL)        /*!< Power down                                                           */
  #define ROMC_POWER_CONTROL_MEM0_On (0x1UL)         /*!< Power up                                                             */


/* ======================================================= Struct ROMC ======================================================= */
/**
  * @brief ROM Controller
  */
  typedef struct {                                   /*!< ROMC Structure                                                       */
    __IM uint32_t RESERVED[320];
    __IOM NRF_ROMC_POWER_Type POWER;                 /*!< (@ 0x00000500) (unspecified)                                         */
  } NRF_ROMC_Type;                                   /*!< Size = 1284 (0x504)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct RTC ======================================================== */
/**
  * @brief Real-time counter
  */
  typedef struct {                                   /*!< RTC Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start RTC counter                                     */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop RTC counter                                      */
    __OM uint32_t TASKS_CLEAR;                       /*!< (@ 0x00000008) Clear RTC counter                                     */
    __OM uint32_t TASKS_TRIGOVRFLW;                  /*!< (@ 0x0000000C) Set counter to 0xFFFFF0                               */
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_CAPTURE[8];                  /*!< (@ 0x00000040) Capture RTC counter to CC[n] register                 */
    __IM uint32_t RESERVED1[8];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_CLEAR;                  /*!< (@ 0x00000088) Subscribe configuration for task CLEAR                */
    __IOM uint32_t SUBSCRIBE_TRIGOVRFLW;             /*!< (@ 0x0000008C) Subscribe configuration for task TRIGOVRFLW           */
    __IM uint32_t RESERVED2[12];
    __IOM uint32_t SUBSCRIBE_CAPTURE[8];             /*!< (@ 0x000000C0) Subscribe configuration for task CAPTURE[n]           */
    __IM uint32_t RESERVED3[8];
    __IOM uint32_t EVENTS_TICK;                      /*!< (@ 0x00000100) Event on counter increment                            */
    __IOM uint32_t EVENTS_OVRFLW;                    /*!< (@ 0x00000104) Event on counter overflow                             */
    __IM uint32_t RESERVED4[14];
    __IOM uint32_t EVENTS_COMPARE[8];                /*!< (@ 0x00000140) Compare event on CC[n] match                          */
    __IM uint32_t RESERVED5[8];
    __IOM uint32_t PUBLISH_TICK;                     /*!< (@ 0x00000180) Publish configuration for event TICK                  */
    __IOM uint32_t PUBLISH_OVRFLW;                   /*!< (@ 0x00000184) Publish configuration for event OVRFLW                */
    __IM uint32_t RESERVED6[14];
    __IOM uint32_t PUBLISH_COMPARE[8];               /*!< (@ 0x000001C0) Publish configuration for event COMPARE[n]            */
    __IM uint32_t RESERVED7[8];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED8[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED9[13];
    __IOM uint32_t EVTEN;                            /*!< (@ 0x00000340) Enable or disable event routing                       */
    __IOM uint32_t EVTENSET;                         /*!< (@ 0x00000344) Enable event routing                                  */
    __IOM uint32_t EVTENCLR;                         /*!< (@ 0x00000348) Disable event routing                                 */
    __IM uint32_t RESERVED10[110];
    __IM uint32_t COUNTER;                           /*!< (@ 0x00000504) Current counter value                                 */
    __IOM uint32_t PRESCALER;                        /*!< (@ 0x00000508) 12-bit prescaler for counter frequency (32768 /
                                                                         (PRESCALER + 1)). Must be written when RTC is stopped.*/
    __IM uint32_t RESERVED11[13];
    __IOM uint32_t CC[8];                            /*!< (@ 0x00000540) Compare register n                                    */
  } NRF_RTC_Type;                                    /*!< Size = 1376 (0x560)                                                  */

/* RTC_TASKS_START: Start RTC counter */
  #define RTC_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start RTC counter */
  #define RTC_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define RTC_TASKS_START_TASKS_START_Msk (0x1UL << RTC_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define RTC_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define RTC_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define RTC_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RTC_TASKS_STOP: Stop RTC counter */
  #define RTC_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop RTC counter */
  #define RTC_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define RTC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << RTC_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define RTC_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define RTC_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define RTC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* RTC_TASKS_CLEAR: Clear RTC counter */
  #define RTC_TASKS_CLEAR_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_CLEAR register.                                 */

/* TASKS_CLEAR @Bit 0 : Clear RTC counter */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Pos (0UL)      /*!< Position of TASKS_CLEAR field.                                       */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Msk (0x1UL << RTC_TASKS_CLEAR_TASKS_CLEAR_Pos) /*!< Bit mask of TASKS_CLEAR field.       */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Min (0x1UL)    /*!< Min enumerator value of TASKS_CLEAR field.                           */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Max (0x1UL)    /*!< Max enumerator value of TASKS_CLEAR field.                           */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RTC_TASKS_TRIGOVRFLW: Set counter to 0xFFFFF0 */
  #define RTC_TASKS_TRIGOVRFLW_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGOVRFLW register.                        */

