adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* COMPARE4 @Bit 20 : Write '1' to disable interrupt for event COMPARE[4] */
  #define RTC_INTENCLR_COMPARE4_Pos (20UL)           /*!< Position of COMPARE4 field.                                          */
  #define RTC_INTENCLR_COMPARE4_Msk (0x1UL << RTC_INTENCLR_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                      */
  #define RTC_INTENCLR_COMPARE4_Min (0x0UL)          /*!< Min enumerator value of COMPARE4 field.                              */
  #define RTC_INTENCLR_COMPARE4_Max (0x1UL)          /*!< Max enumerator value of COMPARE4 field.                              */
  #define RTC_INTENCLR_COMPARE4_Clear (0x1UL)        /*!< Disable                                                              */
  #define RTC_INTENCLR_COMPARE4_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_COMPARE4_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE5 @Bit 21 : Write '1' to disable interrupt for event COMPARE[5] */
  #define RTC_INTENCLR_COMPARE5_Pos (21UL)           /*!< Position of COMPARE5 field.                                          */
  #define RTC_INTENCLR_COMPARE5_Msk (0x1UL << RTC_INTENCLR_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                      */
  #define RTC_INTENCLR_COMPARE5_Min (0x0UL)          /*!< Min enumerator value of COMPARE5 field.                              */
  #define RTC_INTENCLR_COMPARE5_Max (0x1UL)          /*!< Max enumerator value of COMPARE5 field.                              */
  #define RTC_INTENCLR_COMPARE5_Clear (0x1UL)        /*!< Disable                                                              */
  #define RTC_INTENCLR_COMPARE5_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_COMPARE5_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE6 @Bit 22 : Write '1' to disable interrupt for event COMPARE[6] */
  #define RTC_INTENCLR_COMPARE6_Pos (22UL)           /*!< Position of COMPARE6 field.                                          */
  #define RTC_INTENCLR_COMPARE6_Msk (0x1UL << RTC_INTENCLR_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                      */
  #define RTC_INTENCLR_COMPARE6_Min (0x0UL)          /*!< Min enumerator value of COMPARE6 field.                              */
  #define RTC_INTENCLR_COMPARE6_Max (0x1UL)          /*!< Max enumerator value of COMPARE6 field.                              */
  #define RTC_INTENCLR_COMPARE6_Clear (0x1UL)        /*!< Disable                                                              */
  #define RTC_INTENCLR_COMPARE6_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_COMPARE6_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE7 @Bit 23 : Write '1' to disable interrupt for event COMPARE[7] */
  #define RTC_INTENCLR_COMPARE7_Pos (23UL)           /*!< Position of COMPARE7 field.                                          */
  #define RTC_INTENCLR_COMPARE7_Msk (0x1UL << RTC_INTENCLR_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                      */
  #define RTC_INTENCLR_COMPARE7_Min (0x0UL)          /*!< Min enumerator value of COMPARE7 field.                              */
  #define RTC_INTENCLR_COMPARE7_Max (0x1UL)          /*!< Max enumerator value of COMPARE7 field.                              */
  #define RTC_INTENCLR_COMPARE7_Clear (0x1UL)        /*!< Disable                                                              */
  #define RTC_INTENCLR_COMPARE7_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_COMPARE7_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* RTC_EVTEN: Enable or disable event routing */
  #define RTC_EVTEN_ResetValue (0x00000000UL)        /*!< Reset value of EVTEN register.                                       */

/* TICK @Bit 0 : Enable or disable event routing for event TICK */
  #define RTC_EVTEN_TICK_Pos (0UL)                   /*!< Position of TICK field.                                              */
  #define RTC_EVTEN_TICK_Msk (0x1UL << RTC_EVTEN_TICK_Pos) /*!< Bit mask of TICK field.                                        */
  #define RTC_EVTEN_TICK_Min (0x0UL)                 /*!< Min enumerator value of TICK field.                                  */
  #define RTC_EVTEN_TICK_Max (0x1UL)                 /*!< Max enumerator value of TICK field.                                  */
  #define RTC_EVTEN_TICK_Disabled (0x0UL)            /*!< Disable                                                              */
  #define RTC_EVTEN_TICK_Enabled (0x1UL)             /*!< Enable                                                               */

/* OVRFLW @Bit 1 : Enable or disable event routing for event OVRFLW */
  #define RTC_EVTEN_OVRFLW_Pos (1UL)                 /*!< Position of OVRFLW field.                                            */
  #define RTC_EVTEN_OVRFLW_Msk (0x1UL << RTC_EVTEN_OVRFLW_Pos) /*!< Bit mask of OVRFLW field.                                  */
  #define RTC_EVTEN_OVRFLW_Min (0x0UL)               /*!< Min enumerator value of OVRFLW field.                                */
  #define RTC_EVTEN_OVRFLW_Max (0x1UL)               /*!< Max enumerator value of OVRFLW field.                                */
  #define RTC_EVTEN_OVRFLW_Disabled (0x0UL)          /*!< Disable                                                              */
  #define RTC_EVTEN_OVRFLW_Enabled (0x1UL)           /*!< Enable                                                               */

/* COMPARE0 @Bit 16 : Enable or disable event routing for event COMPARE[0] */
  #define RTC_EVTEN_COMPARE0_Pos (16UL)              /*!< Position of COMPARE0 field.                                          */
  #define RTC_EVTEN_COMPARE0_Msk (0x1UL << RTC_EVTEN_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                            */
  #define RTC_EVTEN_COMPARE0_Min (0x0UL)             /*!< Min enumerator value of COMPARE0 field.                              */
  #define RTC_EVTEN_COMPARE0_Max (0x1UL)             /*!< Max enumerator value of COMPARE0 field.                              */
  #define RTC_EVTEN_COMPARE0_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_EVTEN_COMPARE0_Enabled (0x1UL)         /*!< Enable                                                               */

