adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* COMPARE1 @Bit 17 : Write '1' to disable event routing for event COMPARE[1] */
  #define RTC_EVTENCLR_COMPARE1_Pos (17UL)           /*!< Position of COMPARE1 field.                                          */
  #define RTC_EVTENCLR_COMPARE1_Msk (0x1UL << RTC_EVTENCLR_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                      */
  #define RTC_EVTENCLR_COMPARE1_Min (0x0UL)          /*!< Min enumerator value of COMPARE1 field.                              */
  #define RTC_EVTENCLR_COMPARE1_Max (0x1UL)          /*!< Max enumerator value of COMPARE1 field.                              */
  #define RTC_EVTENCLR_COMPARE1_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE1_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE1_Clear (0x1UL)        /*!< Disable                                                              */

/* COMPARE2 @Bit 18 : Write '1' to disable event routing for event COMPARE[2] */
  #define RTC_EVTENCLR_COMPARE2_Pos (18UL)           /*!< Position of COMPARE2 field.                                          */
  #define RTC_EVTENCLR_COMPARE2_Msk (0x1UL << RTC_EVTENCLR_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                      */
  #define RTC_EVTENCLR_COMPARE2_Min (0x0UL)          /*!< Min enumerator value of COMPARE2 field.                              */
  #define RTC_EVTENCLR_COMPARE2_Max (0x1UL)          /*!< Max enumerator value of COMPARE2 field.                              */
  #define RTC_EVTENCLR_COMPARE2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE2_Clear (0x1UL)        /*!< Disable                                                              */

/* COMPARE3 @Bit 19 : Write '1' to disable event routing for event COMPARE[3] */
  #define RTC_EVTENCLR_COMPARE3_Pos (19UL)           /*!< Position of COMPARE3 field.                                          */
  #define RTC_EVTENCLR_COMPARE3_Msk (0x1UL << RTC_EVTENCLR_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                      */
  #define RTC_EVTENCLR_COMPARE3_Min (0x0UL)          /*!< Min enumerator value of COMPARE3 field.                              */
  #define RTC_EVTENCLR_COMPARE3_Max (0x1UL)          /*!< Max enumerator value of COMPARE3 field.                              */
  #define RTC_EVTENCLR_COMPARE3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE3_Clear (0x1UL)        /*!< Disable                                                              */

/* COMPARE4 @Bit 20 : Write '1' to disable event routing for event COMPARE[4] */
  #define RTC_EVTENCLR_COMPARE4_Pos (20UL)           /*!< Position of COMPARE4 field.                                          */
  #define RTC_EVTENCLR_COMPARE4_Msk (0x1UL << RTC_EVTENCLR_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                      */
  #define RTC_EVTENCLR_COMPARE4_Min (0x0UL)          /*!< Min enumerator value of COMPARE4 field.                              */
  #define RTC_EVTENCLR_COMPARE4_Max (0x1UL)          /*!< Max enumerator value of COMPARE4 field.                              */
  #define RTC_EVTENCLR_COMPARE4_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE4_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE4_Clear (0x1UL)        /*!< Disable                                                              */

/* COMPARE5 @Bit 21 : Write '1' to disable event routing for event COMPARE[5] */
  #define RTC_EVTENCLR_COMPARE5_Pos (21UL)           /*!< Position of COMPARE5 field.                                          */
  #define RTC_EVTENCLR_COMPARE5_Msk (0x1UL << RTC_EVTENCLR_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                      */
  #define RTC_EVTENCLR_COMPARE5_Min (0x0UL)          /*!< Min enumerator value of COMPARE5 field.                              */
  #define RTC_EVTENCLR_COMPARE5_Max (0x1UL)          /*!< Max enumerator value of COMPARE5 field.                              */
  #define RTC_EVTENCLR_COMPARE5_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE5_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE5_Clear (0x1UL)        /*!< Disable                                                              */

/* COMPARE6 @Bit 22 : Write '1' to disable event routing for event COMPARE[6] */
  #define RTC_EVTENCLR_COMPARE6_Pos (22UL)           /*!< Position of COMPARE6 field.                                          */
  #define RTC_EVTENCLR_COMPARE6_Msk (0x1UL << RTC_EVTENCLR_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                      */
  #define RTC_EVTENCLR_COMPARE6_Min (0x0UL)          /*!< Min enumerator value of COMPARE6 field.                              */
  #define RTC_EVTENCLR_COMPARE6_Max (0x1UL)          /*!< Max enumerator value of COMPARE6 field.                              */
  #define RTC_EVTENCLR_COMPARE6_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE6_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE6_Clear (0x1UL)        /*!< Disable                                                              */

/* COMPARE7 @Bit 23 : Write '1' to disable event routing for event COMPARE[7] */
  #define RTC_EVTENCLR_COMPARE7_Pos (23UL)           /*!< Position of COMPARE7 field.                                          */
  #define RTC_EVTENCLR_COMPARE7_Msk (0x1UL << RTC_EVTENCLR_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                      */
  #define RTC_EVTENCLR_COMPARE7_Min (0x0UL)          /*!< Min enumerator value of COMPARE7 field.                              */
  #define RTC_EVTENCLR_COMPARE7_Max (0x1UL)          /*!< Max enumerator value of COMPARE7 field.                              */
  #define RTC_EVTENCLR_COMPARE7_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE7_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE7_Clear (0x1UL)        /*!< Disable                                                              */


/* RTC_COUNTER: Current counter value */
  #define RTC_COUNTER_ResetValue (0x00000000UL)      /*!< Reset value of COUNTER register.                                     */

/* COUNTER @Bits 0..23 : Counter value */
  #define RTC_COUNTER_COUNTER_Pos (0UL)              /*!< Position of COUNTER field.                                           */
  #define RTC_COUNTER_COUNTER_Msk (0xFFFFFFUL << RTC_COUNTER_COUNTER_Pos) /*!< Bit mask of COUNTER field.                      */


/* RTC_PRESCALER: 12-bit prescaler for counter frequency (32768 / (PRESCALER + 1)). Must be written when RTC is stopped. */
  #define RTC_PRESCALER_ResetValue (0x00000000UL)    /*!< Reset value of PRESCALER register.                                   */

/* PRESCALER @Bits 0..11 : Prescaler value */
  #define RTC_PRESCALER_PRESCALER_Pos (0UL)          /*!< Position of PRESCALER field.                                         */
  #define RTC_PRESCALER_PRESCALER_Msk (0xFFFUL << RTC_PRESCALER_PRESCALER_Pos) /*!< Bit mask of PRESCALER field.               */


