adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HIGH @Bits 16..31 : High level limit */
  #define SAADC_CH_LIMIT_HIGH_Pos (16UL)             /*!< Position of HIGH field.                                              */
  #define SAADC_CH_LIMIT_HIGH_Msk (0xFFFFUL << SAADC_CH_LIMIT_HIGH_Pos) /*!< Bit mask of HIGH field.                           */



/* =================================================== Struct SAADC_RESULT =================================================== */
/**
  * @brief RESULT [SAADC_RESULT] RESULT EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  DMAENABLE;                         /*!< (@ 0x00000000) This register has no other function than defining the
                                                                         value on the dmaChannelPeripheralEnable output. (which
                                                                         is not connected)*/
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of buffer bytes to transfer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of buffer bytes transferred since last START,
                                                                         updated after the END or STOPPED events*/
  __IM  uint32_t  CURRENTAMOUNT;                     /*!< (@ 0x00000010) Number of buffer bytes transferred since last START,
                                                                         continuously updated*/
} NRF_SAADC_RESULT_Type;                             /*!< Size = 20 (0x014)                                                    */

/* SAADC_RESULT_DMAENABLE: This register has no other function than defining the value on the dmaChannelPeripheralEnable output.
                            (which is not connected) */

  #define SAADC_RESULT_DMAENABLE_ResetValue (0x00000000UL) /*!< Reset value of DMAENABLE register.                             */

/* ENABLE @Bit 0 : Enable DMA */
  #define SAADC_RESULT_DMAENABLE_ENABLE_Pos (0UL)    /*!< Position of ENABLE field.                                            */
  #define SAADC_RESULT_DMAENABLE_ENABLE_Msk (0x1UL << SAADC_RESULT_DMAENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.        */


/* SAADC_RESULT_PTR: Data pointer */
  #define SAADC_RESULT_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Data pointer */
  #define SAADC_RESULT_PTR_PTR_Pos (0UL)             /*!< Position of PTR field.                                               */
  #define SAADC_RESULT_PTR_PTR_Msk (0xFFFFFFFFUL << SAADC_RESULT_PTR_PTR_Pos) /*!< Bit mask of PTR field.                      */


/* SAADC_RESULT_MAXCNT: Maximum number of buffer bytes to transfer */
  #define SAADC_RESULT_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                   */

/* MAXCNT @Bits 0..14 : Maximum number of buffer bytes to transfer */
  #define SAADC_RESULT_MAXCNT_MAXCNT_Pos (0UL)       /*!< Position of MAXCNT field.                                            */
  #define SAADC_RESULT_MAXCNT_MAXCNT_Msk (0x7FFFUL << SAADC_RESULT_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.           */


/* SAADC_RESULT_AMOUNT: Number of buffer bytes transferred since last START, updated after the END or STOPPED events */
  #define SAADC_RESULT_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                   */

/* AMOUNT @Bits 0..14 : Number of buffer bytes transferred since last START, updated after the END or STOPPED events. */
  #define SAADC_RESULT_AMOUNT_AMOUNT_Pos (0UL)       /*!< Position of AMOUNT field.                                            */
  #define SAADC_RESULT_AMOUNT_AMOUNT_Msk (0x7FFFUL << SAADC_RESULT_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.           */


/* SAADC_RESULT_CURRENTAMOUNT: Number of buffer bytes transferred since last START, continuously updated */
  #define SAADC_RESULT_CURRENTAMOUNT_ResetValue (0x00000000UL) /*!< Reset value of CURRENTAMOUNT register.                     */

/* AMOUNT @Bits 0..14 : Number of buffer bytes transferred since last START, continuously updated. */
  #define SAADC_RESULT_CURRENTAMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field.                                           */
  #define SAADC_RESULT_CURRENTAMOUNT_AMOUNT_Msk (0x7FFFUL << SAADC_RESULT_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/



/* ================================================== Struct SAADC_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [SAADC_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  CALCDAC;                           /*!< (@ 0x00000004) Override the CAL_CDAC signal to the analog module     */
} NRF_SAADC_OVERRIDE_Type;                           /*!< Size = 8 (0x008)                                                     */

/* SAADC_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define SAADC_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                   */

/* VAL @Bit 0 : Override value for the signal */
  #define SAADC_OVERRIDE_PWRUP_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define SAADC_OVERRIDE_PWRUP_VAL_Msk (0x1UL << SAADC_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define SAADC_OVERRIDE_PWRUP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_OVERRIDE_PWRUP_EN_Msk (0x1UL << SAADC_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_OVERRIDE_PWRUP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_OVERRIDE_PWRUP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_OVERRIDE_PWRUP_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define SAADC_OVERRIDE_PWRUP_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


