adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SAADC_OVERRIDE_CALCDAC: Override the CAL_CDAC signal to the analog module */
  #define SAADC_OVERRIDE_CALCDAC_ResetValue (0x00000000UL) /*!< Reset value of CALCDAC register.                               */

/* VAL @Bits 0..6 : Override value for the signal */
  #define SAADC_OVERRIDE_CALCDAC_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define SAADC_OVERRIDE_CALCDAC_VAL_Msk (0x7FUL << SAADC_OVERRIDE_CALCDAC_VAL_Pos) /*!< Bit mask of VAL field.                */

/* EN @Bit 31 : Enable the override */
  #define SAADC_OVERRIDE_CALCDAC_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define SAADC_OVERRIDE_CALCDAC_EN_Msk (0x1UL << SAADC_OVERRIDE_CALCDAC_EN_Pos) /*!< Bit mask of EN field.                    */
  #define SAADC_OVERRIDE_CALCDAC_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define SAADC_OVERRIDE_CALCDAC_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define SAADC_OVERRIDE_CALCDAC_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define SAADC_OVERRIDE_CALCDAC_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */



/* ==================================================== Struct SAADC_DFT ===================================================== */
/**
  * @brief DFT [SAADC_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IOM uint32_t  ATB2CONFIG;                        /*!< (@ 0x00000008) Analog Test Bus 2 (ATB2) configuration                */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
} NRF_SAADC_DFT_Type;                                /*!< Size = 24 (0x018)                                                    */

/* SAADC_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define SAADC_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                              */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB0 */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Msk (0x7UL << SAADC_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Max (0x7UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_InMux (0x0UL)  /*!< ATB0 connected to PADC_INMUX, available on PADC_IN                   */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Vref (0x1UL)   /*!< ATB0 connected to VREF                                               */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_VrefBuff (0x2UL) /*!< ATB0 connected to VREF_BUFF                                        */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_VrefIbpsr10U (0x3UL) /*!< ATB0 connected to ATB_PADC_VREF_IBPSR_10U for current
                                                                measurement*/
  #define SAADC_DFT_ATB0CONFIG_SELMUX_VrefIbps3U (0x4UL) /*!< ATB0 connected to ATB_PADC_VREF_IBPS_3U                          */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_VrefLpfDisabled (0x5UL) /*!< ATB0 connected to VREF, internal reference with LPF
                                                                   bypassed.*/
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Spare1 (0x6UL) /*!< Spare pin                                                            */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Spare2 (0x7UL) /*!< Spare pin                                                            */

/* EN @Bit 31 : Enable the analog test bus */
  #define SAADC_DFT_ATB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_DFT_ATB0CONFIG_EN_Msk (0x1UL << SAADC_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_DFT_ATB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_DFT_ATB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_DFT_ATB0CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define SAADC_DFT_ATB0CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* SAADC_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define SAADC_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                              */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB1 */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Msk (0x7UL << SAADC_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Max (0x7UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Inmux (0x0UL)  /*!< ATB1 connected to PADC_INMUX, available on both PADC_IP and PADC_IN  */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_VrefViaAtbuf (0x1UL) /*!< ATB1 connected to VREF via ATBBUF                              */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_VrefBuffViaAtbuf (0x2UL) /*!< ATB1 connected to VREF_BUFF via ATBUF                      */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Ldo (0x3UL)    /*!< ATB1 connected to PADC_LDO resistive divider to measure 1.5V/2 via
                                                          ATBUF*/
  #define SAADC_DFT_ATB1CONFIG_SELMUX_VrefIbps3U (0x4UL) /*!< SATB1 connected to ATB_PADC_VREF_IBPS_3U                         */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Spare0 (0x5UL) /*!< (unspecified)                                                        */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Spare1 (0x6UL) /*!< Spare pin                                                            */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Spare2 (0x7UL) /*!< Spare pin                                                            */

