adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_CALIBRATEOFFSET @Bit 0 : Starts offset auto-calibration Noise shaping should be disabled */
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Pos (0UL) /*!< Position of TASKS_CALIBRATEOFFSET field.            */
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Msk (0x1UL << SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Pos)
                                                                            /*!< Bit mask of TASKS_CALIBRATEOFFSET field.*/
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Min (0x1UL) /*!< Min enumerator value of TASKS_CALIBRATEOFFSET
                                                                            field.*/
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Max (0x1UL) /*!< Max enumerator value of TASKS_CALIBRATEOFFSET
                                                                            field.*/
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Trigger (0x1UL) /*!< Trigger task                                  */


/* SAADC_TASKS_CALIBRATELINEARITY: Starts linearity auto-calibration. Resolution must be 10 bit. TESTCTRL field LIN_CAL_ENABLE
                                    must be low. Noise shaping must be disabled. */

  #define SAADC_TASKS_CALIBRATELINEARITY_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CALIBRATELINEARITY register.      */

/* TASKS_CALIBRATELINEARITY @Bit 0 : Starts linearity auto-calibration. Resolution must be 10 bit. TESTCTRL field LIN_CAL_ENABLE
                                     must be low. Noise shaping must be disabled. */

  #define SAADC_TASKS_CALIBRATELINEARITY_TASKS_CALIBRATELINEARITY_Pos (0UL) /*!< Position of TASKS_CALIBRATELINEARITY field.   */
  #define SAADC_TASKS_CALIBRATELINEARITY_TASKS_CALIBRATELINEARITY_Msk (0x1UL << SAADC_TASKS_CALIBRATELINEARITY_TASKS_CALIBRATELINEARITY_Pos)
                                                                            /*!< Bit mask of TASKS_CALIBRATELINEARITY field.*/
  #define SAADC_TASKS_CALIBRATELINEARITY_TASKS_CALIBRATELINEARITY_Min (0x1UL) /*!< Min enumerator value of
                                                                            TASKS_CALIBRATELINEARITY field.*/
  #define SAADC_TASKS_CALIBRATELINEARITY_TASKS_CALIBRATELINEARITY_Max (0x1UL) /*!< Max enumerator value of
                                                                            TASKS_CALIBRATELINEARITY field.*/
  #define SAADC_TASKS_CALIBRATELINEARITY_TASKS_CALIBRATELINEARITY_Trigger (0x1UL) /*!< Trigger task                            */


/* SAADC_TASKS_CALIBRATEGAIN: Starts gain auto-calibration */
  #define SAADC_TASKS_CALIBRATEGAIN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CALIBRATEGAIN register.                */

/* TASKS_CALIBRATEGAIN @Bit 0 : Starts gain auto-calibration */
  #define SAADC_TASKS_CALIBRATEGAIN_TASKS_CALIBRATEGAIN_Pos (0UL) /*!< Position of TASKS_CALIBRATEGAIN field.                  */
  #define SAADC_TASKS_CALIBRATEGAIN_TASKS_CALIBRATEGAIN_Msk (0x1UL << SAADC_TASKS_CALIBRATEGAIN_TASKS_CALIBRATEGAIN_Pos) /*!<
                                                                            Bit mask of TASKS_CALIBRATEGAIN field.*/
  #define SAADC_TASKS_CALIBRATEGAIN_TASKS_CALIBRATEGAIN_Min (0x1UL) /*!< Min enumerator value of TASKS_CALIBRATEGAIN field.    */
  #define SAADC_TASKS_CALIBRATEGAIN_TASKS_CALIBRATEGAIN_Max (0x1UL) /*!< Max enumerator value of TASKS_CALIBRATEGAIN field.    */
  #define SAADC_TASKS_CALIBRATEGAIN_TASKS_CALIBRATEGAIN_Trigger (0x1UL) /*!< Trigger task                                      */


/* SAADC_TASKS_STOPDMA: Stops DMA transfer sub module */
  #define SAADC_TASKS_STOPDMA_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPDMA register.                            */

/* TASKS_STOPDMA @Bit 0 : Stops DMA transfer sub module */
  #define SAADC_TASKS_STOPDMA_TASKS_STOPDMA_Pos (0UL) /*!< Position of TASKS_STOPDMA field.                                    */
  #define SAADC_TASKS_STOPDMA_TASKS_STOPDMA_Msk (0x1UL << SAADC_TASKS_STOPDMA_TASKS_STOPDMA_Pos) /*!< Bit mask of TASKS_STOPDMA
                                                                            field.*/
  #define SAADC_TASKS_STOPDMA_TASKS_STOPDMA_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPDMA field.                      */
  #define SAADC_TASKS_STOPDMA_TASKS_STOPDMA_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPDMA field.                      */
  #define SAADC_TASKS_STOPDMA_TASKS_STOPDMA_Trigger (0x1UL) /*!< Trigger task                                                  */


/* SAADC_SUBSCRIBE_START: Subscribe configuration for task START */
  #define SAADC_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define SAADC_SUBSCRIBE_START_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define SAADC_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define SAADC_SUBSCRIBE_START_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define SAADC_SUBSCRIBE_START_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_START_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define SAADC_SUBSCRIBE_START_EN_Msk (0x1UL << SAADC_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                      */
  #define SAADC_SUBSCRIBE_START_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define SAADC_SUBSCRIBE_START_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define SAADC_SUBSCRIBE_START_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define SAADC_SUBSCRIBE_START_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


