adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SAADC_SUBSCRIBE_SAMPLE: Subscribe configuration for task SAMPLE */
  #define SAADC_SUBSCRIBE_SAMPLE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SAMPLE register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task SAMPLE will subscribe to */
  #define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_SAMPLE_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Msk (0x1UL << SAADC_SUBSCRIBE_SAMPLE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* SAADC_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define SAADC_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define SAADC_SUBSCRIBE_STOP_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define SAADC_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define SAADC_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define SAADC_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_STOP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_SUBSCRIBE_STOP_EN_Msk (0x1UL << SAADC_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_SUBSCRIBE_STOP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_SUBSCRIBE_STOP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_SUBSCRIBE_STOP_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define SAADC_SUBSCRIBE_STOP_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* SAADC_SUBSCRIBE_CALIBRATEOFFSET: Subscribe configuration for task CALIBRATEOFFSET */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CALIBRATEOFFSET register.    */

/* CHIDX @Bits 0..7 : DPPI channel that task CALIBRATEOFFSET will subscribe to */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                        */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                    */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                     */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Msk (0x1UL << SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Pos) /*!< Bit mask of EN field.  */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Disabled (0x0UL) /*!< Disable subscription                                        */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Enabled (0x1UL) /*!< Enable subscription                                          */


/* SAADC_SUBSCRIBE_CALIBRATELINEARITY: Subscribe configuration for task CALIBRATELINEARITY */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CALIBRATELINEARITY
                                                                            register.*/

/* CHIDX @Bits 0..7 : DPPI channel that task CALIBRATELINEARITY will subscribe to */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                     */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_CALIBRATELINEARITY_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                 */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                  */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_EN_Pos (31UL) /*!< Position of EN field.                                          */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_EN_Msk (0x1UL << SAADC_SUBSCRIBE_CALIBRATELINEARITY_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                             */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                             */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_EN_Disabled (0x0UL) /*!< Disable subscription                                     */
  #define SAADC_SUBSCRIBE_CALIBRATELINEARITY_EN_Enabled (0x1UL) /*!< Enable subscription                                       */


/* SAADC_SUBSCRIBE_CALIBRATEGAIN: Subscribe configuration for task CALIBRATEGAIN */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CALIBRATEGAIN register.        */

/* CHIDX @Bits 0..7 : DPPI channel that task CALIBRATEGAIN will subscribe to */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_CALIBRATEGAIN_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                      */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_EN_Msk (0x1UL << SAADC_SUBSCRIBE_CALIBRATEGAIN_EN_Pos) /*!< Bit mask of EN field.      */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_EN_Disabled (0x0UL) /*!< Disable subscription                                          */
  #define SAADC_SUBSCRIBE_CALIBRATEGAIN_EN_Enabled (0x1UL) /*!< Enable subscription                                            */


/* SAADC_SUBSCRIBE_STOPDMA: Subscribe configuration for task STOPDMA */
  #define SAADC_SUBSCRIBE_STOPDMA_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOPDMA register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task STOPDMA will subscribe to */
  #define SAADC_SUBSCRIBE_STOPDMA_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define SAADC_SUBSCRIBE_STOPDMA_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_STOPDMA_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define SAADC_SUBSCRIBE_STOPDMA_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define SAADC_SUBSCRIBE_STOPDMA_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_STOPDMA_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define SAADC_SUBSCRIBE_STOPDMA_EN_Msk (0x1UL << SAADC_SUBSCRIBE_STOPDMA_EN_Pos) /*!< Bit mask of EN field.                  */
  #define SAADC_SUBSCRIBE_STOPDMA_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define SAADC_SUBSCRIBE_STOPDMA_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define SAADC_SUBSCRIBE_STOPDMA_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define SAADC_SUBSCRIBE_STOPDMA_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


