adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define SAADC_INTPEND_STARTED_Pos (0UL)            /*!< Position of STARTED field.                                           */
  #define SAADC_INTPEND_STARTED_Msk (0x1UL << SAADC_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define SAADC_INTPEND_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define SAADC_INTPEND_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define SAADC_INTPEND_STARTED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_STARTED_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* END @Bit 1 : Read pending status of interrupt for event END */
  #define SAADC_INTPEND_END_Pos (1UL)                /*!< Position of END field.                                               */
  #define SAADC_INTPEND_END_Msk (0x1UL << SAADC_INTPEND_END_Pos) /*!< Bit mask of END field.                                   */
  #define SAADC_INTPEND_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define SAADC_INTPEND_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define SAADC_INTPEND_END_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_END_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* DONE @Bit 2 : Read pending status of interrupt for event DONE */
  #define SAADC_INTPEND_DONE_Pos (2UL)               /*!< Position of DONE field.                                              */
  #define SAADC_INTPEND_DONE_Msk (0x1UL << SAADC_INTPEND_DONE_Pos) /*!< Bit mask of DONE field.                                */
  #define SAADC_INTPEND_DONE_Min (0x0UL)             /*!< Min enumerator value of DONE field.                                  */
  #define SAADC_INTPEND_DONE_Max (0x1UL)             /*!< Max enumerator value of DONE field.                                  */
  #define SAADC_INTPEND_DONE_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_DONE_Pending (0x1UL)         /*!< Read: Pending                                                        */

/* RESULTDONE @Bit 3 : Read pending status of interrupt for event RESULTDONE */
  #define SAADC_INTPEND_RESULTDONE_Pos (3UL)         /*!< Position of RESULTDONE field.                                        */
  #define SAADC_INTPEND_RESULTDONE_Msk (0x1UL << SAADC_INTPEND_RESULTDONE_Pos) /*!< Bit mask of RESULTDONE field.              */
  #define SAADC_INTPEND_RESULTDONE_Min (0x0UL)       /*!< Min enumerator value of RESULTDONE field.                            */
  #define SAADC_INTPEND_RESULTDONE_Max (0x1UL)       /*!< Max enumerator value of RESULTDONE field.                            */
  #define SAADC_INTPEND_RESULTDONE_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define SAADC_INTPEND_RESULTDONE_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* CALIBRATEDONE @Bit 4 : Read pending status of interrupt for event CALIBRATEDONE */
  #define SAADC_INTPEND_CALIBRATEDONE_Pos (4UL)      /*!< Position of CALIBRATEDONE field.                                     */
  #define SAADC_INTPEND_CALIBRATEDONE_Msk (0x1UL << SAADC_INTPEND_CALIBRATEDONE_Pos) /*!< Bit mask of CALIBRATEDONE field.     */
  #define SAADC_INTPEND_CALIBRATEDONE_Min (0x0UL)    /*!< Min enumerator value of CALIBRATEDONE field.                         */
  #define SAADC_INTPEND_CALIBRATEDONE_Max (0x1UL)    /*!< Max enumerator value of CALIBRATEDONE field.                         */
  #define SAADC_INTPEND_CALIBRATEDONE_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define SAADC_INTPEND_CALIBRATEDONE_Pending (0x1UL) /*!< Read: Pending                                                       */

/* STOPPED @Bit 5 : Read pending status of interrupt for event STOPPED */
  #define SAADC_INTPEND_STOPPED_Pos (5UL)            /*!< Position of STOPPED field.                                           */
  #define SAADC_INTPEND_STOPPED_Msk (0x1UL << SAADC_INTPEND_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define SAADC_INTPEND_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define SAADC_INTPEND_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define SAADC_INTPEND_STOPPED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_STOPPED_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* CH0LIMITH @Bit 6 : Read pending status of interrupt for event CH0LIMITH */
  #define SAADC_INTPEND_CH0LIMITH_Pos (6UL)          /*!< Position of CH0LIMITH field.                                         */
  #define SAADC_INTPEND_CH0LIMITH_Msk (0x1UL << SAADC_INTPEND_CH0LIMITH_Pos) /*!< Bit mask of CH0LIMITH field.                 */
  #define SAADC_INTPEND_CH0LIMITH_Min (0x0UL)        /*!< Min enumerator value of CH0LIMITH field.                             */
  #define SAADC_INTPEND_CH0LIMITH_Max (0x1UL)        /*!< Max enumerator value of CH0LIMITH field.                             */
  #define SAADC_INTPEND_CH0LIMITH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH0LIMITH_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH0LIMITL @Bit 7 : Read pending status of interrupt for event CH0LIMITL */
  #define SAADC_INTPEND_CH0LIMITL_Pos (7UL)          /*!< Position of CH0LIMITL field.                                         */
  #define SAADC_INTPEND_CH0LIMITL_Msk (0x1UL << SAADC_INTPEND_CH0LIMITL_Pos) /*!< Bit mask of CH0LIMITL field.                 */
  #define SAADC_INTPEND_CH0LIMITL_Min (0x0UL)        /*!< Min enumerator value of CH0LIMITL field.                             */
  #define SAADC_INTPEND_CH0LIMITL_Max (0x1UL)        /*!< Max enumerator value of CH0LIMITL field.                             */
  #define SAADC_INTPEND_CH0LIMITL_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH0LIMITL_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH1LIMITH @Bit 8 : Read pending status of interrupt for event CH1LIMITH */
  #define SAADC_INTPEND_CH1LIMITH_Pos (8UL)          /*!< Position of CH1LIMITH field.                                         */
  #define SAADC_INTPEND_CH1LIMITH_Msk (0x1UL << SAADC_INTPEND_CH1LIMITH_Pos) /*!< Bit mask of CH1LIMITH field.                 */
  #define SAADC_INTPEND_CH1LIMITH_Min (0x0UL)        /*!< Min enumerator value of CH1LIMITH field.                             */
  #define SAADC_INTPEND_CH1LIMITH_Max (0x1UL)        /*!< Max enumerator value of CH1LIMITH field.                             */
  #define SAADC_INTPEND_CH1LIMITH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH1LIMITH_Pending (0x1UL)    /*!< Read: Pending                                                        */

