adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH1LIMITL @Bit 9 : Read pending status of interrupt for event CH1LIMITL */
  #define SAADC_INTPEND_CH1LIMITL_Pos (9UL)          /*!< Position of CH1LIMITL field.                                         */
  #define SAADC_INTPEND_CH1LIMITL_Msk (0x1UL << SAADC_INTPEND_CH1LIMITL_Pos) /*!< Bit mask of CH1LIMITL field.                 */
  #define SAADC_INTPEND_CH1LIMITL_Min (0x0UL)        /*!< Min enumerator value of CH1LIMITL field.                             */
  #define SAADC_INTPEND_CH1LIMITL_Max (0x1UL)        /*!< Max enumerator value of CH1LIMITL field.                             */
  #define SAADC_INTPEND_CH1LIMITL_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH1LIMITL_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH2LIMITH @Bit 10 : Read pending status of interrupt for event CH2LIMITH */
  #define SAADC_INTPEND_CH2LIMITH_Pos (10UL)         /*!< Position of CH2LIMITH field.                                         */
  #define SAADC_INTPEND_CH2LIMITH_Msk (0x1UL << SAADC_INTPEND_CH2LIMITH_Pos) /*!< Bit mask of CH2LIMITH field.                 */
  #define SAADC_INTPEND_CH2LIMITH_Min (0x0UL)        /*!< Min enumerator value of CH2LIMITH field.                             */
  #define SAADC_INTPEND_CH2LIMITH_Max (0x1UL)        /*!< Max enumerator value of CH2LIMITH field.                             */
  #define SAADC_INTPEND_CH2LIMITH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH2LIMITH_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH2LIMITL @Bit 11 : Read pending status of interrupt for event CH2LIMITL */
  #define SAADC_INTPEND_CH2LIMITL_Pos (11UL)         /*!< Position of CH2LIMITL field.                                         */
  #define SAADC_INTPEND_CH2LIMITL_Msk (0x1UL << SAADC_INTPEND_CH2LIMITL_Pos) /*!< Bit mask of CH2LIMITL field.                 */
  #define SAADC_INTPEND_CH2LIMITL_Min (0x0UL)        /*!< Min enumerator value of CH2LIMITL field.                             */
  #define SAADC_INTPEND_CH2LIMITL_Max (0x1UL)        /*!< Max enumerator value of CH2LIMITL field.                             */
  #define SAADC_INTPEND_CH2LIMITL_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH2LIMITL_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH3LIMITH @Bit 12 : Read pending status of interrupt for event CH3LIMITH */
  #define SAADC_INTPEND_CH3LIMITH_Pos (12UL)         /*!< Position of CH3LIMITH field.                                         */
  #define SAADC_INTPEND_CH3LIMITH_Msk (0x1UL << SAADC_INTPEND_CH3LIMITH_Pos) /*!< Bit mask of CH3LIMITH field.                 */
  #define SAADC_INTPEND_CH3LIMITH_Min (0x0UL)        /*!< Min enumerator value of CH3LIMITH field.                             */
  #define SAADC_INTPEND_CH3LIMITH_Max (0x1UL)        /*!< Max enumerator value of CH3LIMITH field.                             */
  #define SAADC_INTPEND_CH3LIMITH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH3LIMITH_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH3LIMITL @Bit 13 : Read pending status of interrupt for event CH3LIMITL */
  #define SAADC_INTPEND_CH3LIMITL_Pos (13UL)         /*!< Position of CH3LIMITL field.                                         */
  #define SAADC_INTPEND_CH3LIMITL_Msk (0x1UL << SAADC_INTPEND_CH3LIMITL_Pos) /*!< Bit mask of CH3LIMITL field.                 */
  #define SAADC_INTPEND_CH3LIMITL_Min (0x0UL)        /*!< Min enumerator value of CH3LIMITL field.                             */
  #define SAADC_INTPEND_CH3LIMITL_Max (0x1UL)        /*!< Max enumerator value of CH3LIMITL field.                             */
  #define SAADC_INTPEND_CH3LIMITL_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH3LIMITL_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH4LIMITH @Bit 14 : Read pending status of interrupt for event CH4LIMITH */
  #define SAADC_INTPEND_CH4LIMITH_Pos (14UL)         /*!< Position of CH4LIMITH field.                                         */
  #define SAADC_INTPEND_CH4LIMITH_Msk (0x1UL << SAADC_INTPEND_CH4LIMITH_Pos) /*!< Bit mask of CH4LIMITH field.                 */
  #define SAADC_INTPEND_CH4LIMITH_Min (0x0UL)        /*!< Min enumerator value of CH4LIMITH field.                             */
  #define SAADC_INTPEND_CH4LIMITH_Max (0x1UL)        /*!< Max enumerator value of CH4LIMITH field.                             */
  #define SAADC_INTPEND_CH4LIMITH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH4LIMITH_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH4LIMITL @Bit 15 : Read pending status of interrupt for event CH4LIMITL */
  #define SAADC_INTPEND_CH4LIMITL_Pos (15UL)         /*!< Position of CH4LIMITL field.                                         */
  #define SAADC_INTPEND_CH4LIMITL_Msk (0x1UL << SAADC_INTPEND_CH4LIMITL_Pos) /*!< Bit mask of CH4LIMITL field.                 */
  #define SAADC_INTPEND_CH4LIMITL_Min (0x0UL)        /*!< Min enumerator value of CH4LIMITL field.                             */
  #define SAADC_INTPEND_CH4LIMITL_Max (0x1UL)        /*!< Max enumerator value of CH4LIMITL field.                             */
  #define SAADC_INTPEND_CH4LIMITL_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH4LIMITL_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH5LIMITH @Bit 16 : Read pending status of interrupt for event CH5LIMITH */
  #define SAADC_INTPEND_CH5LIMITH_Pos (16UL)         /*!< Position of CH5LIMITH field.                                         */
  #define SAADC_INTPEND_CH5LIMITH_Msk (0x1UL << SAADC_INTPEND_CH5LIMITH_Pos) /*!< Bit mask of CH5LIMITH field.                 */
  #define SAADC_INTPEND_CH5LIMITH_Min (0x0UL)        /*!< Min enumerator value of CH5LIMITH field.                             */
  #define SAADC_INTPEND_CH5LIMITH_Max (0x1UL)        /*!< Max enumerator value of CH5LIMITH field.                             */
  #define SAADC_INTPEND_CH5LIMITH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH5LIMITH_Pending (0x1UL)    /*!< Read: Pending                                                        */

