adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH5LIMITL @Bit 17 : Read pending status of interrupt for event CH5LIMITL */
  #define SAADC_INTPEND_CH5LIMITL_Pos (17UL)         /*!< Position of CH5LIMITL field.                                         */
  #define SAADC_INTPEND_CH5LIMITL_Msk (0x1UL << SAADC_INTPEND_CH5LIMITL_Pos) /*!< Bit mask of CH5LIMITL field.                 */
  #define SAADC_INTPEND_CH5LIMITL_Min (0x0UL)        /*!< Min enumerator value of CH5LIMITL field.                             */
  #define SAADC_INTPEND_CH5LIMITL_Max (0x1UL)        /*!< Max enumerator value of CH5LIMITL field.                             */
  #define SAADC_INTPEND_CH5LIMITL_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH5LIMITL_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH6LIMITH @Bit 18 : Read pending status of interrupt for event CH6LIMITH */
  #define SAADC_INTPEND_CH6LIMITH_Pos (18UL)         /*!< Position of CH6LIMITH field.                                         */
  #define SAADC_INTPEND_CH6LIMITH_Msk (0x1UL << SAADC_INTPEND_CH6LIMITH_Pos) /*!< Bit mask of CH6LIMITH field.                 */
  #define SAADC_INTPEND_CH6LIMITH_Min (0x0UL)        /*!< Min enumerator value of CH6LIMITH field.                             */
  #define SAADC_INTPEND_CH6LIMITH_Max (0x1UL)        /*!< Max enumerator value of CH6LIMITH field.                             */
  #define SAADC_INTPEND_CH6LIMITH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH6LIMITH_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH6LIMITL @Bit 19 : Read pending status of interrupt for event CH6LIMITL */
  #define SAADC_INTPEND_CH6LIMITL_Pos (19UL)         /*!< Position of CH6LIMITL field.                                         */
  #define SAADC_INTPEND_CH6LIMITL_Msk (0x1UL << SAADC_INTPEND_CH6LIMITL_Pos) /*!< Bit mask of CH6LIMITL field.                 */
  #define SAADC_INTPEND_CH6LIMITL_Min (0x0UL)        /*!< Min enumerator value of CH6LIMITL field.                             */
  #define SAADC_INTPEND_CH6LIMITL_Max (0x1UL)        /*!< Max enumerator value of CH6LIMITL field.                             */
  #define SAADC_INTPEND_CH6LIMITL_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH6LIMITL_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH7LIMITH @Bit 20 : Read pending status of interrupt for event CH7LIMITH */
  #define SAADC_INTPEND_CH7LIMITH_Pos (20UL)         /*!< Position of CH7LIMITH field.                                         */
  #define SAADC_INTPEND_CH7LIMITH_Msk (0x1UL << SAADC_INTPEND_CH7LIMITH_Pos) /*!< Bit mask of CH7LIMITH field.                 */
  #define SAADC_INTPEND_CH7LIMITH_Min (0x0UL)        /*!< Min enumerator value of CH7LIMITH field.                             */
  #define SAADC_INTPEND_CH7LIMITH_Max (0x1UL)        /*!< Max enumerator value of CH7LIMITH field.                             */
  #define SAADC_INTPEND_CH7LIMITH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH7LIMITH_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CH7LIMITL @Bit 21 : Read pending status of interrupt for event CH7LIMITL */
  #define SAADC_INTPEND_CH7LIMITL_Pos (21UL)         /*!< Position of CH7LIMITL field.                                         */
  #define SAADC_INTPEND_CH7LIMITL_Msk (0x1UL << SAADC_INTPEND_CH7LIMITL_Pos) /*!< Bit mask of CH7LIMITL field.                 */
  #define SAADC_INTPEND_CH7LIMITL_Min (0x0UL)        /*!< Min enumerator value of CH7LIMITL field.                             */
  #define SAADC_INTPEND_CH7LIMITL_Max (0x1UL)        /*!< Max enumerator value of CH7LIMITL field.                             */
  #define SAADC_INTPEND_CH7LIMITL_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_CH7LIMITL_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* AHBERROR @Bit 22 : Read pending status of interrupt for event AHBERROR */
  #define SAADC_INTPEND_AHBERROR_Pos (22UL)          /*!< Position of AHBERROR field.                                          */
  #define SAADC_INTPEND_AHBERROR_Msk (0x1UL << SAADC_INTPEND_AHBERROR_Pos) /*!< Bit mask of AHBERROR field.                    */
  #define SAADC_INTPEND_AHBERROR_Min (0x0UL)         /*!< Min enumerator value of AHBERROR field.                              */
  #define SAADC_INTPEND_AHBERROR_Max (0x1UL)         /*!< Max enumerator value of AHBERROR field.                              */
  #define SAADC_INTPEND_AHBERROR_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define SAADC_INTPEND_AHBERROR_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* SAADC_STATUS: Status */
  #define SAADC_STATUS_ResetValue (0x00000000UL)     /*!< Reset value of STATUS register.                                      */

/* STATUS @Bit 0 : Status */
  #define SAADC_STATUS_STATUS_Pos (0UL)              /*!< Position of STATUS field.                                            */
  #define SAADC_STATUS_STATUS_Msk (0x1UL << SAADC_STATUS_STATUS_Pos) /*!< Bit mask of STATUS field.                            */
  #define SAADC_STATUS_STATUS_Min (0x0UL)            /*!< Min enumerator value of STATUS field.                                */
  #define SAADC_STATUS_STATUS_Max (0x1UL)            /*!< Max enumerator value of STATUS field.                                */
  #define SAADC_STATUS_STATUS_Ready (0x0UL)          /*!< ADC is ready. No on-going conversion.                                */
  #define SAADC_STATUS_STATUS_Busy (0x1UL)           /*!< ADC is busy. Single conversion in progress.                          */


