adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SAADC_PCRMSTATUS: PCRM Status */
  #define SAADC_PCRMSTATUS_ResetValue (0x00000000UL) /*!< Reset value of PCRMSTATUS register.                                  */

/* ACK @Bit 0 : PCRM Ack Status for the PCRM clean power request */
  #define SAADC_PCRMSTATUS_ACK_Pos (0UL)             /*!< Position of ACK field.                                               */
  #define SAADC_PCRMSTATUS_ACK_Msk (0x1UL << SAADC_PCRMSTATUS_ACK_Pos) /*!< Bit mask of ACK field.                             */
  #define SAADC_PCRMSTATUS_ACK_Min (0x0UL)           /*!< Min enumerator value of ACK field.                                   */
  #define SAADC_PCRMSTATUS_ACK_Max (0x1UL)           /*!< Max enumerator value of ACK field.                                   */
  #define SAADC_PCRMSTATUS_ACK_NoAck (0x0UL)         /*!< Ack not received.                                                    */
  #define SAADC_PCRMSTATUS_ACK_Ack (0x1UL)           /*!< Ack received.                                                        */


/* SAADC_STATUSANA: Status bit for analog macro */
  #define SAADC_STATUSANA_ResetValue (0x00000000UL)  /*!< Reset value of STATUSANA register.                                   */

/* POWERED @Bit 0 : (unspecified) */
  #define SAADC_STATUSANA_POWERED_Pos (0UL)          /*!< Position of POWERED field.                                           */
  #define SAADC_STATUSANA_POWERED_Msk (0x1UL << SAADC_STATUSANA_POWERED_Pos) /*!< Bit mask of POWERED field.                   */
  #define SAADC_STATUSANA_POWERED_Min (0x0UL)        /*!< Min enumerator value of POWERED field.                               */
  #define SAADC_STATUSANA_POWERED_Max (0x1UL)        /*!< Max enumerator value of POWERED field.                               */
  #define SAADC_STATUSANA_POWERED_Powered (0x1UL)    /*!< Analog macro is fully powered on                                     */
  #define SAADC_STATUSANA_POWERED_Unpowered (0x0UL)  /*!< Analog macro is not fully powered on                                 */


/* SAADC_ENABLE: Enable or disable ADC */
  #define SAADC_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable or disable ADC */
  #define SAADC_ENABLE_ENABLE_Pos (0UL)              /*!< Position of ENABLE field.                                            */
  #define SAADC_ENABLE_ENABLE_Msk (0x1UL << SAADC_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                            */
  #define SAADC_ENABLE_ENABLE_Min (0x0UL)            /*!< Min enumerator value of ENABLE field.                                */
  #define SAADC_ENABLE_ENABLE_Max (0x1UL)            /*!< Max enumerator value of ENABLE field.                                */
  #define SAADC_ENABLE_ENABLE_Disabled (0x0UL)       /*!< Disable ADC                                                          */
  #define SAADC_ENABLE_ENABLE_Enabled (0x1UL)        /*!< Enable ADC                                                           */

/* POWERDOWNANA @Bit 8 : Power down analog between samples. See text for more info. */
  #define SAADC_ENABLE_POWERDOWNANA_Pos (8UL)        /*!< Position of POWERDOWNANA field.                                      */
  #define SAADC_ENABLE_POWERDOWNANA_Msk (0x1UL << SAADC_ENABLE_POWERDOWNANA_Pos) /*!< Bit mask of POWERDOWNANA field.          */
  #define SAADC_ENABLE_POWERDOWNANA_Min (0x0UL)      /*!< Min enumerator value of POWERDOWNANA field.                          */
  #define SAADC_ENABLE_POWERDOWNANA_Max (0x1UL)      /*!< Max enumerator value of POWERDOWNANA field.                          */
  #define SAADC_ENABLE_POWERDOWNANA_KeepOn (0x0UL)   /*!< Keep analog on between samples                                       */
  #define SAADC_ENABLE_POWERDOWNANA_PowerDown (0x1UL) /*!< Turn off analog between samples                                     */


/* SAADC_REGRESULT: Last conversion result */
  #define SAADC_REGRESULT_ResetValue (0x00000000UL)  /*!< Reset value of REGRESULT register.                                   */

/* REGRESULT @Bits 0..31 : Result of the previous ADC conversion */
  #define SAADC_REGRESULT_REGRESULT_Pos (0UL)        /*!< Position of REGRESULT field.                                         */
  #define SAADC_REGRESULT_REGRESULT_Msk (0xFFFFFFFFUL << SAADC_REGRESULT_REGRESULT_Pos) /*!< Bit mask of REGRESULT field.      */


/* SAADC_RESOLUTION: Resolution configuration */
  #define SAADC_RESOLUTION_ResetValue (0x00000001UL) /*!< Reset value of RESOLUTION register.                                  */

/* VAL @Bits 0..2 : Set the resolution */
  #define SAADC_RESOLUTION_VAL_Pos (0UL)             /*!< Position of VAL field.                                               */
  #define SAADC_RESOLUTION_VAL_Msk (0x7UL << SAADC_RESOLUTION_VAL_Pos) /*!< Bit mask of VAL field.                             */
  #define SAADC_RESOLUTION_VAL_Min (0x0UL)           /*!< Min enumerator value of VAL field.                                   */
  #define SAADC_RESOLUTION_VAL_Max (0x4UL)           /*!< Max enumerator value of VAL field.                                   */
  #define SAADC_RESOLUTION_VAL_8bit (0x0UL)          /*!< 8 bit                                                                */
  #define SAADC_RESOLUTION_VAL_10bit (0x1UL)         /*!< 10 bit                                                               */
  #define SAADC_RESOLUTION_VAL_12bit (0x2UL)         /*!< 12 bit                                                               */
  #define SAADC_RESOLUTION_VAL_14bit (0x3UL)         /*!< 14 bit                                                               */
  #define SAADC_RESOLUTION_VAL_16bit (0x4UL)         /*!< 16 bit                                                               */


/* SAADC_OVERSAMPLE: Oversampling configuration. OVERSAMPLE should not be combined with SCAN. The RESOLUTION is applied before
                      averaging, thus for high OVERSAMPLE a higher RESOLUTION should be used. */

  #define SAADC_OVERSAMPLE_ResetValue (0x00000000UL) /*!< Reset value of OVERSAMPLE register.                                  */

/* OVERSAMPLE @Bits 0..3 : Oversample control */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Pos (0UL)      /*!< Position of OVERSAMPLE field.                                        */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Msk (0xFUL << SAADC_OVERSAMPLE_OVERSAMPLE_Pos) /*!< Bit mask of OVERSAMPLE field.        */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Min (0x0UL)    /*!< Min enumerator value of OVERSAMPLE field.                            */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Max (0xCUL)    /*!< Max enumerator value of OVERSAMPLE field.                            */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Bypass (0x0UL) /*!< Bypass oversampling                                                  */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over2x (0x1UL) /*!< Oversample 2x                                                        */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over4x (0x2UL) /*!< Oversample 4x                                                        */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over8x (0x3UL) /*!< Oversample 8x                                                        */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over16x (0x4UL) /*!< Oversample 16x                                                      */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over32x (0x5UL) /*!< Oversample 32x                                                      */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over64x (0x6UL) /*!< Oversample 64x                                                      */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over128x (0x7UL) /*!< Oversample 128x                                                    */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over256x (0x8UL) /*!< Oversample 256x                                                    */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over512x (0x9UL) /*!< Oversample 512x                                                    */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over1024x (0xAUL) /*!< Oversample 1024x                                                  */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over2048x (0xBUL) /*!< Oversample 2048x                                                  */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over4096x (0xCUL) /*!< Oversample 4096x                                                  */


/* SAADC_SAMPLERATE: Controls normal or continuous sample rate */
  #define SAADC_SAMPLERATE_ResetValue (0x00000000UL) /*!< Reset value of SAMPLERATE register.                                  */

/* CC @Bits 0..10 : Capture and compare value. Sample rate is 16 MHz/CC */
  #define SAADC_SAMPLERATE_CC_Pos (0UL)              /*!< Position of CC field.                                                */
  #define SAADC_SAMPLERATE_CC_Msk (0x7FFUL << SAADC_SAMPLERATE_CC_Pos) /*!< Bit mask of CC field.                              */
  #define SAADC_SAMPLERATE_CC_Min (0x004UL)          /*!< Min value of CC field.                                               */
  #define SAADC_SAMPLERATE_CC_Max (0x7FFUL)          /*!< Max size of CC field.                                                */

/* MODE @Bit 12 : Select mode for sample rate control */
  #define SAADC_SAMPLERATE_MODE_Pos (12UL)           /*!< Position of MODE field.                                              */
  #define SAADC_SAMPLERATE_MODE_Msk (0x1UL << SAADC_SAMPLERATE_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define SAADC_SAMPLERATE_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define SAADC_SAMPLERATE_MODE_Max (0x1UL)          /*!< Max enumerator value of MODE field.                                  */
  #define SAADC_SAMPLERATE_MODE_Task (0x0UL)         /*!< Rate is controlled from SAMPLE task                                  */
  #define SAADC_SAMPLERATE_MODE_Timers (0x1UL)       /*!< Rate is controlled from local timer (use CC to control the rate)     */


/* SAADC_PCRMREQ: PCRM request for clean power */
  #define SAADC_PCRMREQ_ResetValue (0x00000000UL)    /*!< Reset value of PCRMREQ register.                                     */

