adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREFLPFDISABLE @Bit 6 : Disable the internal reference low pass filter */
  #define SAADC_CALREF_VREFLPFDISABLE_Pos (6UL)      /*!< Position of VREFLPFDISABLE field.                                    */
  #define SAADC_CALREF_VREFLPFDISABLE_Msk (0x1UL << SAADC_CALREF_VREFLPFDISABLE_Pos) /*!< Bit mask of VREFLPFDISABLE field.    */

/* IREF @Bits 8..11 : Calibration control for reference current. See design description for coding */
  #define SAADC_CALREF_IREF_Pos (8UL)                /*!< Position of IREF field.                                              */
  #define SAADC_CALREF_IREF_Msk (0xFUL << SAADC_CALREF_IREF_Pos) /*!< Bit mask of IREF field.                                  */

/* VREFTC @Bits 16..18 : Calibration code for reference temperature coefficient. See design description for coding */
  #define SAADC_CALREF_VREFTC_Pos (16UL)             /*!< Position of VREFTC field.                                            */
  #define SAADC_CALREF_VREFTC_Msk (0x7UL << SAADC_CALREF_VREFTC_Pos) /*!< Bit mask of VREFTC field.                            */

/* LDO @Bits 24..25 : Calibration code for LDO VREF. See design description for coding */
  #define SAADC_CALREF_LDO_Pos (24UL)                /*!< Position of LDO field.                                               */
  #define SAADC_CALREF_LDO_Msk (0x3UL << SAADC_CALREF_LDO_Pos) /*!< Bit mask of LDO field.                                     */


/* SAADC_NOISESHAPE: Enable noise shaping */
  #define SAADC_NOISESHAPE_ResetValue (0x00000000UL) /*!< Reset value of NOISESHAPE register.                                  */

/* NOISESHAPE @Bits 0..1 : Enable noise shaping */
  #define SAADC_NOISESHAPE_NOISESHAPE_Pos (0UL)      /*!< Position of NOISESHAPE field.                                        */
  #define SAADC_NOISESHAPE_NOISESHAPE_Msk (0x3UL << SAADC_NOISESHAPE_NOISESHAPE_Pos) /*!< Bit mask of NOISESHAPE field.        */
  #define SAADC_NOISESHAPE_NOISESHAPE_Min (0x0UL)    /*!< Min enumerator value of NOISESHAPE field.                            */
  #define SAADC_NOISESHAPE_NOISESHAPE_Max (0x3UL)    /*!< Max enumerator value of NOISESHAPE field.                            */
  #define SAADC_NOISESHAPE_NOISESHAPE_Disable (0x0UL) /*!< Disable noiseshaping. Oversampling based on accumulate and average. */
  #define SAADC_NOISESHAPE_NOISESHAPE_Audio (0x1UL)  /*!< Noiseshaping and decimating. Larger passband. Provides a 100kS/s cut
                                                          off frequency, 8x the oversampling ratio. See design description for
                                                          more information*/
  #define SAADC_NOISESHAPE_NOISESHAPE_Accuracy (0x2UL) /*!< Noiseshaping and decimating. Smaller passband. Recommended
                                                            resolution setting is 14 bits. Provides a 10kS/s cut off frequency,
                                                            32x the oversampling ratio. See design description for more
                                                            information*/
  #define SAADC_NOISESHAPE_NOISESHAPE_Stage1 (0x3UL) /*!< Result from common 1st stage filter. For debugging only              */


/* SAADC_EASYDMAMODE: Configure EasyDMA mode. */
  #define SAADC_EASYDMAMODE_ResetValue (0x00000001UL) /*!< Reset value of EASYDMAMODE register.                                */

/* LPOP @Bit 0 : Enable low-power operation, or use low-latency */
  #define SAADC_EASYDMAMODE_LPOP_Pos (0UL)           /*!< Position of LPOP field.                                              */
  #define SAADC_EASYDMAMODE_LPOP_Msk (0x1UL << SAADC_EASYDMAMODE_LPOP_Pos) /*!< Bit mask of LPOP field.                        */
  #define SAADC_EASYDMAMODE_LPOP_Min (0x0UL)         /*!< Min enumerator value of LPOP field.                                  */
  #define SAADC_EASYDMAMODE_LPOP_Max (0x1UL)         /*!< Max enumerator value of LPOP field.                                  */
  #define SAADC_EASYDMAMODE_LPOP_LowLat (0x0UL)      /*!< Low-latency operation                                                */
  #define SAADC_EASYDMAMODE_LPOP_LowPower (0x1UL)    /*!< Low-power operation                                                  */


/* SAADC_TERMINATEONAHBERROR: Enable EasyDMA termination on AHB error */
  #define SAADC_TERMINATEONAHBERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONAHBERROR register.                */

/* ENABLE @Bit 0 : Enable termination on AHB error */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                            */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Msk (0x1UL << SAADC_TERMINATEONAHBERROR_ENABLE_Pos) /*!< Bit mask of ENABLE field.  */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                              */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                              */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Disabled (0x0UL) /*!< Termination on AHB error disabled                             */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Enabled (0x1UL) /*!< Termination on AHB error enabled                               */


/* SAADC_AHBERRORADDRESS: Address of the last AHB error transaction */
  #define SAADC_AHBERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of AHBERRORADDRESS register.                        */

/* ADDRESS @Bits 0..31 : Address */
  #define SAADC_AHBERRORADDRESS_ADDRESS_Pos (0UL)    /*!< Position of ADDRESS field.                                           */
  #define SAADC_AHBERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << SAADC_AHBERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SHA3                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct SHA3 ======================================================= */
/**
  * @brief CRACEN
  */
  typedef struct {                                   /*!< SHA3 Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_CRYPTOMASTER;              /*!< (@ 0x00000100) Event indicating that interrupt triggered at
                                                                         Cryptomaster*/
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable CRACEN peripheral modules.                     */
  } NRF_SHA3_Type;                                   /*!< Size = 1028 (0x404)                                                  */

/* SHA3_EVENTS_CRYPTOMASTER: Event indicating that interrupt triggered at Cryptomaster */
  #define SHA3_EVENTS_CRYPTOMASTER_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CRYPTOMASTER register.                 */

/* EVENTS_CRYPTOMASTER @Bit 0 : Event indicating that interrupt triggered at Cryptomaster */
  #define SHA3_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Pos (0UL) /*!< Position of EVENTS_CRYPTOMASTER field.                   */
  #define SHA3_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Msk (0x1UL << SHA3_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Pos) /*!< Bit
                                                                            mask of EVENTS_CRYPTOMASTER field.*/
  #define SHA3_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Min (0x0UL) /*!< Min enumerator value of EVENTS_CRYPTOMASTER field.     */
  #define SHA3_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Max (0x1UL) /*!< Max enumerator value of EVENTS_CRYPTOMASTER field.     */
  #define SHA3_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define SHA3_EVENTS_CRYPTOMASTER_EVENTS_CRYPTOMASTER_Generated (0x1UL) /*!< Event generated                                  */


/* SHA3_INTEN: Enable or disable interrupt */
  #define SHA3_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* CRYPTOMASTER @Bit 0 : Enable or disable interrupt for event CRYPTOMASTER */
  #define SHA3_INTEN_CRYPTOMASTER_Pos (0UL)          /*!< Position of CRYPTOMASTER field.                                      */
  #define SHA3_INTEN_CRYPTOMASTER_Msk (0x1UL << SHA3_INTEN_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.              */
  #define SHA3_INTEN_CRYPTOMASTER_Min (0x0UL)        /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_INTEN_CRYPTOMASTER_Max (0x1UL)        /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_INTEN_CRYPTOMASTER_Disabled (0x0UL)   /*!< Disable                                                              */
  #define SHA3_INTEN_CRYPTOMASTER_Enabled (0x1UL)    /*!< Enable                                                               */


/* SHA3_INTENSET: Enable interrupt */
  #define SHA3_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* CRYPTOMASTER @Bit 0 : Write '1' to enable interrupt for event CRYPTOMASTER */
  #define SHA3_INTENSET_CRYPTOMASTER_Pos (0UL)       /*!< Position of CRYPTOMASTER field.                                      */
  #define SHA3_INTENSET_CRYPTOMASTER_Msk (0x1UL << SHA3_INTENSET_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.        */
  #define SHA3_INTENSET_CRYPTOMASTER_Min (0x0UL)     /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_INTENSET_CRYPTOMASTER_Max (0x1UL)     /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_INTENSET_CRYPTOMASTER_Set (0x1UL)     /*!< Enable                                                               */
  #define SHA3_INTENSET_CRYPTOMASTER_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SHA3_INTENSET_CRYPTOMASTER_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* SHA3_INTENCLR: Disable interrupt */
  #define SHA3_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

