adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CRYPTOMASTER @Bit 0 : Write '1' to disable interrupt for event CRYPTOMASTER */
  #define SHA3_INTENCLR_CRYPTOMASTER_Pos (0UL)       /*!< Position of CRYPTOMASTER field.                                      */
  #define SHA3_INTENCLR_CRYPTOMASTER_Msk (0x1UL << SHA3_INTENCLR_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.        */
  #define SHA3_INTENCLR_CRYPTOMASTER_Min (0x0UL)     /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_INTENCLR_CRYPTOMASTER_Max (0x1UL)     /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_INTENCLR_CRYPTOMASTER_Clear (0x1UL)   /*!< Disable                                                              */
  #define SHA3_INTENCLR_CRYPTOMASTER_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SHA3_INTENCLR_CRYPTOMASTER_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* SHA3_INTPEND: Pending interrupts */
  #define SHA3_INTPEND_ResetValue (0x00000000UL)     /*!< Reset value of INTPEND register.                                     */

/* CRYPTOMASTER @Bit 0 : Read pending status of interrupt for event CRYPTOMASTER */
  #define SHA3_INTPEND_CRYPTOMASTER_Pos (0UL)        /*!< Position of CRYPTOMASTER field.                                      */
  #define SHA3_INTPEND_CRYPTOMASTER_Msk (0x1UL << SHA3_INTPEND_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.          */
  #define SHA3_INTPEND_CRYPTOMASTER_Min (0x0UL)      /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_INTPEND_CRYPTOMASTER_Max (0x1UL)      /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_INTPEND_CRYPTOMASTER_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define SHA3_INTPEND_CRYPTOMASTER_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* SHA3_ENABLE: Enable CRACEN peripheral modules. */
  #define SHA3_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* CRYPTOMASTER @Bit 0 : Enable cryptomaster */
  #define SHA3_ENABLE_CRYPTOMASTER_Pos (0UL)         /*!< Position of CRYPTOMASTER field.                                      */
  #define SHA3_ENABLE_CRYPTOMASTER_Msk (0x1UL << SHA3_ENABLE_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.            */
  #define SHA3_ENABLE_CRYPTOMASTER_Min (0x0UL)       /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_ENABLE_CRYPTOMASTER_Max (0x1UL)       /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define SHA3_ENABLE_CRYPTOMASTER_Disabled (0x0UL)  /*!< Cryptomaster disabled.                                               */
  #define SHA3_ENABLE_CRYPTOMASTER_Enabled (0x1UL)   /*!< Cryptomaster enabled.                                                */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         SHA3CORE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct SHA3CORE_CRYPTMSTRDMA =============================================== */
/**
  * @brief CRYPTMSTRDMA [SHA3CORE_CRYPTMSTRDMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FETCHADDRLSB;                      /*!< (@ 0x00000000) Fetch Address Least Significant Bit                   */
  __IOM uint32_t  FETCHADDRMSB;                      /*!< (@ 0x00000004) Fetch Address Most Significant Bit                    */
  __IOM uint32_t  FETCHLEN;                          /*!< (@ 0x00000008) Fetch Length                                          */
  __IOM uint32_t  FETCHTAG;                          /*!< (@ 0x0000000C) Fetch Tag                                             */
  __IOM uint32_t  PUSHADDRLSB;                       /*!< (@ 0x00000010) Push Address Least Significant Bit                    */
  __IOM uint32_t  PUSHADDRMSB;                       /*!< (@ 0x00000014) Push Address Most Significant Bit                     */
  __IOM uint32_t  PUSHLEN;                           /*!< (@ 0x00000018) Push Length                                           */
  __IOM uint32_t  INTEN;                             /*!< (@ 0x0000001C) Interrupt Enable                                      */
  __IOM uint32_t  INTENSET;                          /*!< (@ 0x00000020) Interrupt Set                                         */
  __IOM uint32_t  INTENCLR;                          /*!< (@ 0x00000024) Interrupt Clear                                       */
  __IOM uint32_t  INTSTATRAW;                        /*!< (@ 0x00000028) Interrupt Status Raw                                  */
  __IOM uint32_t  INTSTAT;                           /*!< (@ 0x0000002C) Interrupt Status                                      */
  __IOM uint32_t  INTSTATCLR;                        /*!< (@ 0x00000030) Interrupt Status Clear                                */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000034) Configuration                                         */
  __IOM uint32_t  START;                             /*!< (@ 0x00000038) Start                                                 */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x0000003C) Status                                                */
} NRF_SHA3CORE_CRYPTMSTRDMA_Type;                    /*!< Size = 64 (0x040)                                                    */

/* SHA3CORE_CRYPTMSTRDMA_FETCHADDRLSB: Fetch Address Least Significant Bit */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHADDRLSB_ResetValue (0x00000000UL) /*!< Reset value of FETCHADDRLSB register.              */

