adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FETCHADDRLSB @Bits 0..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Pos (0UL) /*!< Position of FETCHADDRLSB field.                       */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Msk (0xFFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Pos)
                                                                            /*!< Bit mask of FETCHADDRLSB field.*/


/* SHA3CORE_CRYPTMSTRDMA_FETCHADDRMSB: Fetch Address Most Significant Bit */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHADDRMSB_ResetValue (0x00000000UL) /*!< Reset value of FETCHADDRMSB register.              */

/* FETCHADDRMSB @Bits 0..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Pos (0UL) /*!< Position of FETCHADDRMSB field.                       */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Msk (0xFFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Pos)
                                                                            /*!< Bit mask of FETCHADDRMSB field.*/


/* SHA3CORE_CRYPTMSTRDMA_FETCHLEN: Fetch Length */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_ResetValue (0x00000000UL) /*!< Reset value of FETCHLEN register.                      */

/* FETCHLEN @Bits 0..27 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Pos (0UL) /*!< Position of FETCHLEN field.                                   */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Msk (0xFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Pos) /*!< Bit mask
                                                                            of FETCHLEN field.*/

/* FETCHCSTADDR @Bit 28 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHCSTADDR_Pos (28UL) /*!< Position of FETCHCSTADDR field.                          */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHCSTADDR_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHCSTADDR_Pos) /*!< Bit
                                                                            mask of FETCHCSTADDR field.*/

/* FETCHREALIGN @Bit 29 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHREALIGN_Pos (29UL) /*!< Position of FETCHREALIGN field.                          */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHREALIGN_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHREALIGN_Pos) /*!< Bit
                                                                            mask of FETCHREALIGN field.*/

/* FETCHZPADDING @Bit 30 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHZPADDING_Pos (30UL) /*!< Position of FETCHZPADDING field.                        */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHZPADDING_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_FETCHLEN_FETCHZPADDING_Pos) /*!< Bit
                                                                            mask of FETCHZPADDING field.*/


/* SHA3CORE_CRYPTMSTRDMA_FETCHTAG: Fetch Tag */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHTAG_ResetValue (0x00000000UL) /*!< Reset value of FETCHTAG register.                      */

/* FETCHTAG @Bits 0..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHTAG_FETCHTAG_Pos (0UL) /*!< Position of FETCHTAG field.                                   */
  #define SHA3CORE_CRYPTMSTRDMA_FETCHTAG_FETCHTAG_Msk (0xFFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_FETCHTAG_FETCHTAG_Pos) /*!< Bit
                                                                            mask of FETCHTAG field.*/


/* SHA3CORE_CRYPTMSTRDMA_PUSHADDRLSB: Push Address Least Significant Bit */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHADDRLSB_ResetValue (0x00000000UL) /*!< Reset value of PUSHADDRLSB register.                */

/* PUSHADDRLSB @Bits 0..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHADDRLSB_PUSHADDRLSB_Pos (0UL) /*!< Position of PUSHADDRLSB field.                          */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHADDRLSB_PUSHADDRLSB_Msk (0xFFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_PUSHADDRLSB_PUSHADDRLSB_Pos)
                                                                            /*!< Bit mask of PUSHADDRLSB field.*/


/* SHA3CORE_CRYPTMSTRDMA_PUSHADDRMSB: Push Address Most Significant Bit */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHADDRMSB_ResetValue (0x00000000UL) /*!< Reset value of PUSHADDRMSB register.                */

/* PUSHADDRMSB @Bits 0..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHADDRMSB_PUSHADDRMSB_Pos (0UL) /*!< Position of PUSHADDRMSB field.                          */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHADDRMSB_PUSHADDRMSB_Msk (0xFFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_PUSHADDRMSB_PUSHADDRMSB_Pos)
                                                                            /*!< Bit mask of PUSHADDRMSB field.*/


/* SHA3CORE_CRYPTMSTRDMA_PUSHLEN: Push Length */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_ResetValue (0x00000000UL) /*!< Reset value of PUSHLEN register.                        */

/* PUSHLEN @Bits 0..27 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHLEN_Pos (0UL) /*!< Position of PUSHLEN field.                                      */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHLEN_Msk (0xFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHLEN_Pos) /*!< Bit mask of
                                                                            PUSHLEN field.*/

/* PUSHCSTADDR @Bit 28 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHCSTADDR_Pos (28UL) /*!< Position of PUSHCSTADDR field.                             */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHCSTADDR_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHCSTADDR_Pos) /*!< Bit mask
                                                                            of PUSHCSTADDR field.*/

/* PUSHREALIGN @Bit 29 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHREALIGN_Pos (29UL) /*!< Position of PUSHREALIGN field.                             */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHREALIGN_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHREALIGN_Pos) /*!< Bit mask
                                                                            of PUSHREALIGN field.*/

/* PUSHDISCARD @Bit 30 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHDISCARD_Pos (30UL) /*!< Position of PUSHDISCARD field.                             */
  #define SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHDISCARD_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_PUSHLEN_PUSHDISCARD_Pos) /*!< Bit mask
                                                                            of PUSHDISCARD field.*/


/* SHA3CORE_CRYPTMSTRDMA_INTEN: Interrupt Enable */
  #define SHA3CORE_CRYPTMSTRDMA_INTEN_ResetValue (0x00000000UL) /*!< Reset value of INTEN register.                            */

/* INTEN @Bits 0..5 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_INTEN_INTEN_Pos (0UL) /*!< Position of INTEN field.                                            */
  #define SHA3CORE_CRYPTMSTRDMA_INTEN_INTEN_Msk (0x3FUL << SHA3CORE_CRYPTMSTRDMA_INTEN_INTEN_Pos) /*!< Bit mask of INTEN field.*/


/* SHA3CORE_CRYPTMSTRDMA_INTENSET: Interrupt Set */
  #define SHA3CORE_CRYPTMSTRDMA_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                      */

