adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* INTENSET @Bits 0..5 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_INTENSET_INTENSET_Pos (0UL) /*!< Position of INTENSET field.                                   */
  #define SHA3CORE_CRYPTMSTRDMA_INTENSET_INTENSET_Msk (0x3FUL << SHA3CORE_CRYPTMSTRDMA_INTENSET_INTENSET_Pos) /*!< Bit mask of
                                                                            INTENSET field.*/


/* SHA3CORE_CRYPTMSTRDMA_INTENCLR: Interrupt Clear */
  #define SHA3CORE_CRYPTMSTRDMA_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                      */

/* INTENCLR @Bits 0..5 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_INTENCLR_INTENCLR_Pos (0UL) /*!< Position of INTENCLR field.                                   */
  #define SHA3CORE_CRYPTMSTRDMA_INTENCLR_INTENCLR_Msk (0x3FUL << SHA3CORE_CRYPTMSTRDMA_INTENCLR_INTENCLR_Pos) /*!< Bit mask of
                                                                            INTENCLR field.*/


/* SHA3CORE_CRYPTMSTRDMA_INTSTATRAW: Interrupt Status Raw */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTATRAW_ResetValue (0x00000000UL) /*!< Reset value of INTSTATRAW register.                  */

/* INTSTATRAW @Bits 0..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTATRAW_INTSTATRAW_Pos (0UL) /*!< Position of INTSTATRAW field.                             */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTATRAW_INTSTATRAW_Msk (0xFFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_INTSTATRAW_INTSTATRAW_Pos) /*!<
                                                                            Bit mask of INTSTATRAW field.*/


/* SHA3CORE_CRYPTMSTRDMA_INTSTAT: Interrupt Status */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTAT_ResetValue (0x00000000UL) /*!< Reset value of INTSTAT register.                        */

/* INTSTAT @Bits 0..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTAT_INTSTAT_Pos (0UL) /*!< Position of INTSTAT field.                                      */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTAT_INTSTAT_Msk (0xFFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_INTSTAT_INTSTAT_Pos) /*!< Bit mask of
                                                                            INTSTAT field.*/


/* SHA3CORE_CRYPTMSTRDMA_INTSTATCLR: Interrupt Status Clear */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTATCLR_ResetValue (0x00000000UL) /*!< Reset value of INTSTATCLR register.                  */

/* INTSTATCLR @Bits 0..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTATCLR_INTSTATCLR_Pos (0UL) /*!< Position of INTSTATCLR field.                             */
  #define SHA3CORE_CRYPTMSTRDMA_INTSTATCLR_INTSTATCLR_Msk (0xFFFFFFFFUL << SHA3CORE_CRYPTMSTRDMA_INTSTATCLR_INTSTATCLR_Pos) /*!<
                                                                            Bit mask of INTSTATCLR field.*/


/* SHA3CORE_CRYPTMSTRDMA_CONFIG: Configuration */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                          */

/* FETCHCTRLINDIRECT @Bit 0 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_FETCHCTRLINDIRECT_Pos (0UL) /*!< Position of FETCHCTRLINDIRECT field.                   */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_FETCHCTRLINDIRECT_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_CONFIG_FETCHCTRLINDIRECT_Pos) /*!<
                                                                            Bit mask of FETCHCTRLINDIRECT field.*/

/* PUSHCTRLINDIRECT @Bit 1 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_PUSHCTRLINDIRECT_Pos (1UL) /*!< Position of PUSHCTRLINDIRECT field.                     */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_PUSHCTRLINDIRECT_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_CONFIG_PUSHCTRLINDIRECT_Pos) /*!<
                                                                            Bit mask of PUSHCTRLINDIRECT field.*/

/* FETCHSTOP @Bit 2 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_FETCHSTOP_Pos (2UL) /*!< Position of FETCHSTOP field.                                   */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_FETCHSTOP_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_CONFIG_FETCHSTOP_Pos) /*!< Bit mask of
                                                                            FETCHSTOP field.*/

/* PUSHSTOP @Bit 3 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_PUSHSTOP_Pos (3UL) /*!< Position of PUSHSTOP field.                                     */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_PUSHSTOP_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_CONFIG_PUSHSTOP_Pos) /*!< Bit mask of
                                                                            PUSHSTOP field.*/

/* SOFTRST @Bit 4 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_SOFTRST_Pos (4UL) /*!< Position of SOFTRST field.                                       */
  #define SHA3CORE_CRYPTMSTRDMA_CONFIG_SOFTRST_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_CONFIG_SOFTRST_Pos) /*!< Bit mask of SOFTRST
                                                                            field.*/


/* SHA3CORE_CRYPTMSTRDMA_START: Start */
  #define SHA3CORE_CRYPTMSTRDMA_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                            */

/* STARTFETCH @Bit 0 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_START_STARTFETCH_Pos (0UL) /*!< Position of STARTFETCH field.                                  */
  #define SHA3CORE_CRYPTMSTRDMA_START_STARTFETCH_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_START_STARTFETCH_Pos) /*!< Bit mask of
                                                                            STARTFETCH field.*/

/* STARTPUSH @Bit 1 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_START_STARTPUSH_Pos (1UL) /*!< Position of STARTPUSH field.                                    */
  #define SHA3CORE_CRYPTMSTRDMA_START_STARTPUSH_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_START_STARTPUSH_Pos) /*!< Bit mask of
                                                                            STARTPUSH field.*/


/* SHA3CORE_CRYPTMSTRDMA_STATUS: Status */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                          */

/* FETCHBUSY @Bit 0 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_FETCHBUSY_Pos (0UL) /*!< Position of FETCHBUSY field.                                   */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_FETCHBUSY_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_STATUS_FETCHBUSY_Pos) /*!< Bit mask of
                                                                            FETCHBUSY field.*/

