adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PUSHBUSY @Bit 1 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHBUSY_Pos (1UL) /*!< Position of PUSHBUSY field.                                     */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHBUSY_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHBUSY_Pos) /*!< Bit mask of
                                                                            PUSHBUSY field.*/

/* FETCHNOTEMPTY @Bit 4 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_FETCHNOTEMPTY_Pos (4UL) /*!< Position of FETCHNOTEMPTY field.                           */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_FETCHNOTEMPTY_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_STATUS_FETCHNOTEMPTY_Pos) /*!< Bit mask
                                                                            of FETCHNOTEMPTY field.*/

/* PUSHWAITINGFIFO @Bit 5 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHWAITINGFIFO_Pos (5UL) /*!< Position of PUSHWAITINGFIFO field.                       */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHWAITINGFIFO_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHWAITINGFIFO_Pos) /*!< Bit
                                                                            mask of PUSHWAITINGFIFO field.*/

/* SOFTRSTBUSY @Bit 6 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_SOFTRSTBUSY_Pos (6UL) /*!< Position of SOFTRSTBUSY field.                               */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_SOFTRSTBUSY_Msk (0x1UL << SHA3CORE_CRYPTMSTRDMA_STATUS_SOFTRSTBUSY_Pos) /*!< Bit mask of
                                                                            SOFTRSTBUSY field.*/

/* PUSHNBDATA @Bits 16..31 : (unspecified) */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHNBDATA_Pos (16UL) /*!< Position of PUSHNBDATA field.                                */
  #define SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHNBDATA_Msk (0xFFFFUL << SHA3CORE_CRYPTMSTRDMA_STATUS_PUSHNBDATA_Pos) /*!< Bit mask of
                                                                            PUSHNBDATA field.*/



/* =============================================== Struct SHA3CORE_CRYPTMSTRHW =============================================== */
/**
  * @brief CRYPTMSTRHW [SHA3CORE_CRYPTMSTRHW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INCLIPSHWCFG;                      /*!< (@ 0x00000000) Incuded IPs Hardware configuration                    */
  __IOM uint32_t  BA411EAESHWCFG1;                   /*!< (@ 0x00000004) Generic g_AesModesPoss value.                         */
  __IOM uint32_t  BA411EAESHWCFG2;                   /*!< (@ 0x00000008) Generic g_CtrSize value.                              */
  __IOM uint32_t  BA413HASHHWCFG;                    /*!< (@ 0x0000000C) Generic g_Hash value                                  */
  __IOM uint32_t  BA418SHA3HWCFG;                    /*!< (@ 0x00000010) Generic g_Sha3CtxtEn value.                           */
  __IOM uint32_t  BA419SM4HWCFG;                     /*!< (@ 0x00000014) Generic g_SM4ModesPoss value.                         */
  __IOM uint32_t  BA424ARIAHWCFG;                    /*!< (@ 0x00000018) Generic g_aria_modePoss value.                        */
} NRF_SHA3CORE_CRYPTMSTRHW_Type;                     /*!< Size = 28 (0x01C)                                                    */

/* SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG: Incuded IPs Hardware configuration */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_ResetValue (0x00000040UL) /*!< Reset value of INCLIPSHWCFG register.               */

/* BA411AESINCLUDED @Bit 0 : Generic g_IncludeAES value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA411AESINCLUDED_Pos (0UL) /*!< Position of BA411AESINCLUDED field.                */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA411AESINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA411AESINCLUDED_Pos)
                                                                            /*!< Bit mask of BA411AESINCLUDED field.*/

/* BA415HPAESGCMINCLUDED @Bit 1 : Generic g_IncludeAESGCM value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA415HPAESGCMINCLUDED_Pos (1UL) /*!< Position of BA415HPAESGCMINCLUDED field.      */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA415HPAESGCMINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA415HPAESGCMINCLUDED_Pos)
                                                                            /*!< Bit mask of BA415HPAESGCMINCLUDED field.*/

/* BA416HPAESXTSINCLUDED @Bit 2 : Generic g_IncludeAESXTS value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA416HPAESXTSINCLUDED_Pos (2UL) /*!< Position of BA416HPAESXTSINCLUDED field.      */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA416HPAESXTSINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA416HPAESXTSINCLUDED_Pos)
                                                                            /*!< Bit mask of BA416HPAESXTSINCLUDED field.*/

/* BA412DESINCLUDED @Bit 3 : Generic g_IncludeDES value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA412DESINCLUDED_Pos (3UL) /*!< Position of BA412DESINCLUDED field.                */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA412DESINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA412DESINCLUDED_Pos)
                                                                            /*!< Bit mask of BA412DESINCLUDED field.*/

/* BA413HASHINCLUDED @Bit 4 : Generic g_IncludeHASH value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA413HASHINCLUDED_Pos (4UL) /*!< Position of BA413HASHINCLUDED field.              */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA413HASHINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA413HASHINCLUDED_Pos)
                                                                            /*!< Bit mask of BA413HASHINCLUDED field.*/

/* BA417CHACHAPOLYINCLUDED @Bit 5 : Generic g_IncludeChachaPoly value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA417CHACHAPOLYINCLUDED_Pos (5UL) /*!< Position of BA417CHACHAPOLYINCLUDED field.  */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA417CHACHAPOLYINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA417CHACHAPOLYINCLUDED_Pos)
                                                                            /*!< Bit mask of BA417CHACHAPOLYINCLUDED field.*/

/* BA418SHA3INCLUDED @Bit 6 : Generic g_IncludeSHA3 value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA418SHA3INCLUDED_Pos (6UL) /*!< Position of BA418SHA3INCLUDED field.              */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA418SHA3INCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA418SHA3INCLUDED_Pos)
                                                                            /*!< Bit mask of BA418SHA3INCLUDED field.*/

/* BA421ZUCINCLUDED @Bit 7 : Generic g_IncludeZUC value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA421ZUCINCLUDED_Pos (7UL) /*!< Position of BA421ZUCINCLUDED field.                */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA421ZUCINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA421ZUCINCLUDED_Pos)
                                                                            /*!< Bit mask of BA421ZUCINCLUDED field.*/

