adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BA419SM4INCLUDED @Bit 8 : Generic g_IncludeSM4 value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA419SM4INCLUDED_Pos (8UL) /*!< Position of BA419SM4INCLUDED field.                */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA419SM4INCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA419SM4INCLUDED_Pos)
                                                                            /*!< Bit mask of BA419SM4INCLUDED field.*/

/* BA414EPPKEINCLUDED @Bit 9 : Generic g_IncludePKE value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA414EPPKEINCLUDED_Pos (9UL) /*!< Position of BA414EPPKEINCLUDED field.            */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA414EPPKEINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA414EPPKEINCLUDED_Pos)
                                                                            /*!< Bit mask of BA414EPPKEINCLUDED field.*/

/* BA431NDRNGINCLUDED @Bit 10 : Generic g_IncludeNDRNG value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA431NDRNGINCLUDED_Pos (10UL) /*!< Position of BA431NDRNGINCLUDED field.           */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA431NDRNGINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA431NDRNGINCLUDED_Pos)
                                                                            /*!< Bit mask of BA431NDRNGINCLUDED field.*/

/* BA420HPCHACHAPOLYINCLUDED @Bit 11 : Generic g_IncludeHPChachaPoly value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA420HPCHACHAPOLYINCLUDED_Pos (11UL) /*!< Position of BA420HPCHACHAPOLYINCLUDED
                                                                            field.*/
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA420HPCHACHAPOLYINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA420HPCHACHAPOLYINCLUDED_Pos)
                                                                            /*!< Bit mask of BA420HPCHACHAPOLYINCLUDED field.*/

/* BA423SNOW3GINCLUDED @Bit 12 : Generic g_IncludeSnow3G value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA423SNOW3GINCLUDED_Pos (12UL) /*!< Position of BA423SNOW3GINCLUDED field.         */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA423SNOW3GINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA423SNOW3GINCLUDED_Pos)
                                                                            /*!< Bit mask of BA423SNOW3GINCLUDED field.*/

/* BA422KASUMIINCLUDED @Bit 13 : Generic g_IncludeKasumi value. */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422KASUMIINCLUDED_Pos (13UL) /*!< Position of BA422KASUMIINCLUDED field.         */
  #define SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422KASUMIINCLUDED_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422KASUMIINCLUDED_Pos)
                                                                            /*!< Bit mask of BA422KASUMIINCLUDED field.*/


/* SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1: Generic g_AesModesPoss value. */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_ResetValue (0x070001FFUL) /*!< Reset value of BA411EAESHWCFG1 register.         */

/* BA411EAESHWCFGMODE @Bits 0..8 : Generic g_AesModesPoss value. */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMODE_Pos (0UL) /*!< Position of BA411EAESHWCFGMODE field.         */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMODE_Msk (0x1FFUL << SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMODE_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFGMODE field.*/

/* BA411EAESHWCFGCS @Bit 16 : Generic g_CS value. */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGCS_Pos (16UL) /*!< Position of BA411EAESHWCFGCS field.            */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGCS_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGCS_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFGCS field.*/

/* BA411EAESHWCFGMASKING @Bit 17 : Generic g_UseMasking value. */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMASKING_Pos (17UL) /*!< Position of BA411EAESHWCFGMASKING field.  */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMASKING_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMASKING_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFGMASKING field.*/

/* BA411EAESHWCFGKEYSIZE @Bits 24..26 : Generic g_Keysize value. */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGKEYSIZE_Pos (24UL) /*!< Position of BA411EAESHWCFGKEYSIZE field.  */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGKEYSIZE_Msk (0x7UL << SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGKEYSIZE_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFGKEYSIZE field.*/


/* SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG2: Generic g_CtrSize value. */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG2_ResetValue (0x00000080UL) /*!< Reset value of BA411EAESHWCFG2 register.         */

/* BA411EAESHWCFG2 @Bits 0..15 : Generic g_CtrSize value. */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG2_BA411EAESHWCFG2_Pos (0UL) /*!< Position of BA411EAESHWCFG2 field.               */
  #define SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG2_BA411EAESHWCFG2_Msk (0xFFFFUL << SHA3CORE_CRYPTMSTRHW_BA411EAESHWCFG2_BA411EAESHWCFG2_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFG2 field.*/


/* SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG: Generic g_Hash value */
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_ResetValue (0x0000003FUL) /*!< Reset value of BA413HASHHWCFG register.           */

/* BA413HASHHWCFGMASK @Bits 0..6 : Generic g_HashMaskFunc value. */
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGMASK_Pos (0UL) /*!< Position of BA413HASHHWCFGMASK field.          */
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGMASK_Msk (0x7FUL << SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGMASK_Pos)
                                                                            /*!< Bit mask of BA413HASHHWCFGMASK field.*/

/* BA413HASHHWCFGPADDING @Bit 16 : Generic g_HashPadding value. */
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGPADDING_Pos (16UL) /*!< Position of BA413HASHHWCFGPADDING field.   */
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGPADDING_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGPADDING_Pos)
                                                                            /*!< Bit mask of BA413HASHHWCFGPADDING field.*/

/* BA413HASHHWCFGHMAC @Bit 17 : Generic g_HMAC_enabled value. */
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGHMAC_Pos (17UL) /*!< Position of BA413HASHHWCFGHMAC field.         */
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGHMAC_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGHMAC_Pos)
                                                                            /*!< Bit mask of BA413HASHHWCFGHMAC field.*/

/* BA413HASHHWCFGVERIFYDIGEST @Bit 18 : Generic g_HashVerifyDigest value. */
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGVERIFYDIGEST_Pos (18UL) /*!< Position of BA413HASHHWCFGVERIFYDIGEST
                                                                            field.*/
  #define SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGVERIFYDIGEST_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGVERIFYDIGEST_Pos)
                                                                            /*!< Bit mask of BA413HASHHWCFGVERIFYDIGEST field.*/


/* SHA3CORE_CRYPTMSTRHW_BA418SHA3HWCFG: Generic g_Sha3CtxtEn value. */
  #define SHA3CORE_CRYPTMSTRHW_BA418SHA3HWCFG_ResetValue (0x00000001UL) /*!< Reset value of BA418SHA3HWCFG register.           */

/* BA418SHA3HWCFG @Bit 0 : Generic g_Sha3CtxtEn value. */
  #define SHA3CORE_CRYPTMSTRHW_BA418SHA3HWCFG_BA418SHA3HWCFG_Pos (0UL) /*!< Position of BA418SHA3HWCFG field.                  */
  #define SHA3CORE_CRYPTMSTRHW_BA418SHA3HWCFG_BA418SHA3HWCFG_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_BA418SHA3HWCFG_BA418SHA3HWCFG_Pos)
                                                                            /*!< Bit mask of BA418SHA3HWCFG field.*/


/* SHA3CORE_CRYPTMSTRHW_BA419SM4HWCFG: Generic g_SM4ModesPoss value. */
  #define SHA3CORE_CRYPTMSTRHW_BA419SM4HWCFG_ResetValue (0x000001FFUL) /*!< Reset value of BA419SM4HWCFG register.             */

/* BA419SM4HWCFG @Bits 0..9 : Generic g_SM4ModesPoss value. */
  #define SHA3CORE_CRYPTMSTRHW_BA419SM4HWCFG_BA419SM4HWCFG_Pos (0UL) /*!< Position of BA419SM4HWCFG field.                     */
  #define SHA3CORE_CRYPTMSTRHW_BA419SM4HWCFG_BA419SM4HWCFG_Msk (0x3FFUL << SHA3CORE_CRYPTMSTRHW_BA419SM4HWCFG_BA419SM4HWCFG_Pos)
                                                                            /*!< Bit mask of BA419SM4HWCFG field.*/

/* USEMASKING @Bit 17 : Generic g_sm4UseMasking value. */
  #define SHA3CORE_CRYPTMSTRHW_BA419SM4HWCFG_USEMASKING_Pos (17UL) /*!< Position of USEMASKING field.                          */
  #define SHA3CORE_CRYPTMSTRHW_BA419SM4HWCFG_USEMASKING_Msk (0x1UL << SHA3CORE_CRYPTMSTRHW_BA419SM4HWCFG_USEMASKING_Pos) /*!<
                                                                            Bit mask of USEMASKING field.*/


