adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SHA3CORE_CRYPTMSTRHW_BA424ARIAHWCFG: Generic g_aria_modePoss value. */
  #define SHA3CORE_CRYPTMSTRHW_BA424ARIAHWCFG_ResetValue (0x0000017FUL) /*!< Reset value of BA424ARIAHWCFG register.           */

/* BA424ARIAHWCFG @Bits 0..8 : Generic g_aria_modePoss value. */
  #define SHA3CORE_CRYPTMSTRHW_BA424ARIAHWCFG_BA424ARIAHWCFG_Pos (0UL) /*!< Position of BA424ARIAHWCFG field.                  */
  #define SHA3CORE_CRYPTMSTRHW_BA424ARIAHWCFG_BA424ARIAHWCFG_Msk (0x1FFUL << SHA3CORE_CRYPTMSTRHW_BA424ARIAHWCFG_BA424ARIAHWCFG_Pos)
                                                                            /*!< Bit mask of BA424ARIAHWCFG field.*/


/* ===================================================== Struct SHA3CORE ===================================================== */
/**
  * @brief CRACENCORE
  */
  typedef struct {                                   /*!< SHA3CORE Structure                                                   */
    __IOM NRF_SHA3CORE_CRYPTMSTRDMA_Type CRYPTMSTRDMA; /*!< (@ 0x00000000) (unspecified)                                       */
    __IM uint32_t RESERVED[240];
    __IOM NRF_SHA3CORE_CRYPTMSTRHW_Type CRYPTMSTRHW; /*!< (@ 0x00000400) (unspecified)                                         */
  } NRF_SHA3CORE_Type;                               /*!< Size = 1052 (0x41C)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct SICR_IROT_SYSROM ================================================= */
/**
  * @brief SYSROM [SICR_IROT_SYSROM] 32-bit base revision of SysCtrl ROM and upto eight patch revisions.
  */
typedef struct {
  __IOM uint32_t  BASE;                              /*!< (@ 0x00000000) 32-bit revision of base revision of SysCtrl ROM.      */
  __IOM uint32_t  PATCH[8];                          /*!< (@ 0x00000004) 32-bit revision of utpo n patches.                    */
} NRF_SICR_IROT_SYSROM_Type;                         /*!< Size = 36 (0x024)                                                    */

/* SICR_IROT_SYSROM_BASE: 32-bit revision of base revision of SysCtrl ROM. */

/* VERSION @Bits 0..31 : Base revision. */
  #define SICR_IROT_SYSROM_BASE_VERSION_Pos (0UL)    /*!< Position of VERSION field.                                           */
  #define SICR_IROT_SYSROM_BASE_VERSION_Msk (0xFFFFFFFFUL << SICR_IROT_SYSROM_BASE_VERSION_Pos) /*!< Bit mask of VERSION field.*/


/* SICR_IROT_SYSROM_PATCH: 32-bit revision of utpo n patches. */
  #define SICR_IROT_SYSROM_PATCH_MaxCount (8UL)      /*!< Max size of PATCH[8] array.                                          */
  #define SICR_IROT_SYSROM_PATCH_MaxIndex (7UL)      /*!< Max index of PATCH[8] array.                                         */
  #define SICR_IROT_SYSROM_PATCH_MinIndex (0UL)      /*!< Min index of PATCH[8] array.                                         */

/* VERSION @Bits 0..31 : nth patch revision. */
  #define SICR_IROT_SYSROM_PATCH_VERSION_Pos (0UL)   /*!< Position of VERSION field.                                           */
  #define SICR_IROT_SYSROM_PATCH_VERSION_Msk (0xFFFFFFFFUL << SICR_IROT_SYSROM_PATCH_VERSION_Pos) /*!< Bit mask of VERSION
                                                                            field.*/
  #define SICR_IROT_SYSROM_PATCH_VERSION_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VERSION field.                        */
  #define SICR_IROT_SYSROM_PATCH_VERSION_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VERSION field.                        */
  #define SICR_IROT_SYSROM_PATCH_VERSION_UnPatched (0xFFFFFFFFUL) /*!< No patch applied.                                       */



/* ================================================= Struct SICR_IROT_SECROM ================================================= */
/**
  * @brief SECROM [SICR_IROT_SECROM] 32-bit revision of Secure Domain ROM base version and utpo sixteen patch versions.
  */
typedef struct {
  __IOM uint32_t  BASE;                              /*!< (@ 0x00000000) 32-bit revision of base revision of Secure domain ROM.*/
  __IOM uint32_t  PATCH[16];                         /*!< (@ 0x00000004) 32-bit revision of utpo n patches.                    */
} NRF_SICR_IROT_SECROM_Type;                         /*!< Size = 68 (0x044)                                                    */

/* SICR_IROT_SECROM_BASE: 32-bit revision of base revision of Secure domain ROM. */

/* VERSION @Bits 0..31 : Base revision. */
  #define SICR_IROT_SECROM_BASE_VERSION_Pos (0UL)    /*!< Position of VERSION field.                                           */
  #define SICR_IROT_SECROM_BASE_VERSION_Msk (0xFFFFFFFFUL << SICR_IROT_SECROM_BASE_VERSION_Pos) /*!< Bit mask of VERSION field.*/


/* SICR_IROT_SECROM_PATCH: 32-bit revision of utpo n patches. */
  #define SICR_IROT_SECROM_PATCH_MaxCount (16UL)     /*!< Max size of PATCH[16] array.                                         */
  #define SICR_IROT_SECROM_PATCH_MaxIndex (15UL)     /*!< Max index of PATCH[16] array.                                        */
  #define SICR_IROT_SECROM_PATCH_MinIndex (0UL)      /*!< Min index of PATCH[16] array.                                        */

/* VERSION @Bits 0..31 : nth patch revision. */
  #define SICR_IROT_SECROM_PATCH_VERSION_Pos (0UL)   /*!< Position of VERSION field.                                           */
  #define SICR_IROT_SECROM_PATCH_VERSION_Msk (0xFFFFFFFFUL << SICR_IROT_SECROM_PATCH_VERSION_Pos) /*!< Bit mask of VERSION
                                                                            field.*/
  #define SICR_IROT_SECROM_PATCH_VERSION_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VERSION field.                        */
  #define SICR_IROT_SECROM_PATCH_VERSION_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VERSION field.                        */
  #define SICR_IROT_SECROM_PATCH_VERSION_UnPatched (0xFFFFFFFFUL) /*!< No patch applied.                                       */



/* ================================================== Struct SICR_IROT_LCS1 ================================================== */
/**
  * @brief LCS1 [SICR_IROT_LCS1] LCS reported here shall be indentical to the oe in LCS2.
  */
typedef struct {
  __IOM uint32_t  LCS;                               /*!< (@ 0x00000000) The device lifecycle state as determined by the secure
                                                                         domain ROM code.*/
} NRF_SICR_IROT_LCS1_Type;                           /*!< Size = 4 (0x004)                                                     */

/* SICR_IROT_LCS1_LCS: The device lifecycle state as determined by the secure domain ROM code. */

