adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ============================================== Struct SICR_UROT_RECOVERY_SM =============================================== */
/**
  * @brief SM [SICR_UROT_RECOVERY_SM] Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.
  */
typedef struct {
  __IOM NRF_SICR_UROT_RECOVERY_SM_TBS_Type TBS;      /*!< (@ 0x00000000) Manifest describing the secure domain firmware. The
                                                                         secure domain ROM code verifies the signature on the
                                                                         digest of this register.*/
  __IM  uint32_t  RESERVED[3];
  __IOM NRF_SICR_UROT_RECOVERY_SM_SIGNATURE_Type SIGNATURE; /*!< (@ 0x000000F4) Signature on the manifest defined in TBS       */
} NRF_SICR_UROT_RECOVERY_SM_Type;                    /*!< Size = 256 (0x100)                                                   */


/* ================================================ Struct SICR_UROT_RECOVERY ================================================ */
/**
  * @brief RECOVERY [SICR_UROT_RECOVERY] Signed manifest of the recovery firmware.
  */
typedef struct {
  __IOM NRF_SICR_UROT_RECOVERY_SM_Type SM;           /*!< (@ 0x00000000) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/
} NRF_SICR_UROT_RECOVERY_Type;                       /*!< Size = 256 (0x100)                                                   */


/* ============================================ Struct SICR_UROT_UPDATE_DOWNLOAD ============================================= */
/**
  * @brief DOWNLOAD [SICR_UROT_UPDATE_DOWNLOAD] Information about downloaded firmware update. The addresses described here are
            the location of the update and not the location they must be installed. The installation information is described in
            the signed manifest.

  */
typedef struct {
  __IOM uint32_t  FW;                                /*!< (@ 0x00000000) Location for the firmware update to be installed.     */
  __IOM uint32_t  PUBKEY;                            /*!< (@ 0x00000004) Location of the public key to verify the signature on
                                                                         the firmware update.*/
  __IOM uint32_t  SIGNATURE;                         /*!< (@ 0x00000008) Location for the signature on the firmware update to be
                                                                         verified before the update is installed.*/
  __IOM uint32_t  MAX;                               /*!< (@ 0x0000000C) Max Size of the download.                             */
} NRF_SICR_UROT_UPDATE_DOWNLOAD_Type;                /*!< Size = 16 (0x010)                                                    */

/* SICR_UROT_UPDATE_DOWNLOAD_FW: Location for the firmware update to be installed. */

/* ADDR @Bits 0..31 : The MRAM Location of the firmware to be installed. This is not the same as the address in the signed
                      manifest. The signed manifest contains the target location where the firmware must be installed, not the
                      current location where it is downloaded. */

  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Pos (0UL) /*!< Position of ADDR field.                                             */
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Pos) /*!< Bit mask of ADDR
                                                                            field.*/
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                        */
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                        */
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.                  */


/* SICR_UROT_UPDATE_DOWNLOAD_PUBKEY: Location of the public key to verify the signature on the firmware update. */

/* ADDR @Bits 0..31 : MRAM Location for the signature on the firmware update. This is not the same as the address in the signed
                      manifest. The signed manifest contains the target location where the public key must be kept once the
                      update is installed, not the current location where it is downloaded. */

  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Pos (0UL) /*!< Position of ADDR field.                                         */
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Pos) /*!< Bit mask of
                                                                            ADDR field.*/
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                    */
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                    */
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.              */


/* SICR_UROT_UPDATE_DOWNLOAD_SIGNATURE: Location for the signature on the firmware update to be verified before the update is
                                         installed. */


/* ADDR @Bits 0..31 : MRAM Location for the signature on the firmware update. This is not the same as the address in the signed
                      manifest. The signed manifest contains the target location where the signature must be kept once the
                      update is installed, not the current location where it is downloaded. */

  #define SICR_UROT_UPDATE_DOWNLOAD_SIGNATURE_ADDR_Pos (0UL) /*!< Position of ADDR field.                                      */
  #define SICR_UROT_UPDATE_DOWNLOAD_SIGNATURE_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_DOWNLOAD_SIGNATURE_ADDR_Pos) /*!< Bit
                                                                            mask of ADDR field.*/
  #define SICR_UROT_UPDATE_DOWNLOAD_SIGNATURE_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                 */
  #define SICR_UROT_UPDATE_DOWNLOAD_SIGNATURE_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                 */
  #define SICR_UROT_UPDATE_DOWNLOAD_SIGNATURE_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.           */


/* SICR_UROT_UPDATE_DOWNLOAD_MAX: Max Size of the download. */

/* SIZE @Bits 0..31 : Max size of the downloaded firmware update. This define is ignored during update of UROT or the recovery
                      image since the signed manifest contains the needed sizes. This field is used to define the writable MRAM
                      region when the recovery image is started in the safe mode. */

