adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* =============================================== Struct SICR_UROT_UPDATE_SM ================================================ */
/**
  * @brief SM [SICR_UROT_UPDATE_SM] Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.
  */
typedef struct {
  __IOM NRF_SICR_UROT_UPDATE_SM_TBS_Type TBS;        /*!< (@ 0x00000000) Manifest describing the secure domain firmware. The
                                                                         secure domain ROM code verifies the signature on the
                                                                         digest of this register.*/
  __IM  uint32_t  RESERVED[3];
  __IOM NRF_SICR_UROT_UPDATE_SM_SIGNATURE_Type SIGNATURE; /*!< (@ 0x000000F4) Signature on the manifest defined in TBS         */
} NRF_SICR_UROT_UPDATE_SM_Type;                      /*!< Size = 256 (0x100)                                                   */


/* ================================================= Struct SICR_UROT_UPDATE ================================================= */
/**
  * @brief UPDATE [SICR_UROT_UPDATE] Description of FW Updates, if any. In case, SICR.UROT.TBS.POLICY.UPDATE is set to Disabled,
            these registers are ignored by the secure domain ROM code.

  */
typedef struct {
  __IOM uint32_t  OPERATION;                         /*!< (@ 0x00000000) Command from the secure domain firmware to the secure
                                                                         domain ROM code.*/
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) ROM code indicates the status of update to the secure
                                                                         domain firmware via this register.*/
  __IOM NRF_SICR_UROT_UPDATE_DOWNLOAD_Type DOWNLOAD; /*!< (@ 0x00000008) Information about downloaded firmware update. The
                                                                         addresses described here are the location of the update
                                                                         and not the location they must be installed. The
                                                                         installation information is described in the signed
                                                                         manifest.*/
  __IM  uint32_t  RESERVED[2];
  __IOM NRF_SICR_UROT_UPDATE_SM_Type SM;             /*!< (@ 0x00000020) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/
} NRF_SICR_UROT_UPDATE_Type;                         /*!< Size = 288 (0x120)                                                   */

/* SICR_UROT_UPDATE_OPERATION: Command from the secure domain firmware to the secure domain ROM code. */

/* OPCODE @Bits 0..31 : Opcode to identify the command. */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Pos (0UL) /*!< Position of OPCODE field.                                           */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_OPERATION_OPCODE_Pos) /*!< Bit mask of OPCODE
                                                                            field.*/
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Min (0x80000001UL) /*!< Min enumerator value of OPCODE field.                      */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of OPCODE field.                      */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Nop (0xFFFFFFFFUL) /*!< No operation pending.                                      */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_UROTVerify (0x80000001UL) /*!< Command to only verify UROT (plain-text or encrypted)
                                                                           firmware update without applying it.*/
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_UROTActivate (0x80000002UL) /*!< Command to verify and update encrypted UROT
                                                                            firmware.*/
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_RecoveryVerify (0x80000003UL) /*!< Command to verify the recovery (plain-text only)
                                                                            firmware update without applying it.*/
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_RecoveryActivate (0x80000004UL) /*!< Command to verify and update plain-text
                                                                            Recovery firmware.*/
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_UROTPlainTextActivate (0x80000005UL) /*!< Command to verify and update plain-text
                                                                            UROT firmware.*/
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_AROTRecovery (0xA0000001UL) /*!< Instructs the ROM code to boot the recovery image
                                                                            in safe mode to download a AROT image instead of a
                                                                            UROT image.*/


/* SICR_UROT_UPDATE_STATUS: ROM code indicates the status of update to the secure domain firmware via this register. */

/* CODE @Bits 0..31 : Status code. */
  #define SICR_UROT_UPDATE_STATUS_CODE_Pos (0UL)     /*!< Position of CODE field.                                              */
  #define SICR_UROT_UPDATE_STATUS_CODE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_STATUS_CODE_Pos) /*!< Bit mask of CODE field.     */
  #define SICR_UROT_UPDATE_STATUS_CODE_Min (0xF0000001UL) /*!< Min enumerator value of CODE field.                             */
  #define SICR_UROT_UPDATE_STATUS_CODE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of CODE field.                             */
  #define SICR_UROT_UPDATE_STATUS_CODE_None (0xFFFFFFFFUL) /*!< No operation pending to indicate any status.                   */
  #define SICR_UROT_UPDATE_STATUS_CODE_UnknownOperation (0xF0000001UL) /*!< Unknown OPCODE in SICR.UROT.UPDATE.OPERATION.      */
  #define SICR_UROT_UPDATE_STATUS_CODE_InvalidManifest (0xF0000002UL) /*!< The information in the manifest is invalid.         */
  #define SICR_UROT_UPDATE_STATUS_CODE_StaleFW (0xF0000003UL) /*!< The timestamp on the firmware is older than the current one.*/
  #define SICR_UROT_UPDATE_STATUS_CODE_VerifyFailure (0xF0000005UL) /*!< The signature did not verify.                         */
  #define SICR_UROT_UPDATE_STATUS_CODE_VerifyOK (0xF0000006UL) /*!< Signature verification is successful.                      */
  #define SICR_UROT_UPDATE_STATUS_CODE_UROTUpdateDisabled (0xF0000007UL) /*!< UROT firmware update is disabled via policy.     */
  #define SICR_UROT_UPDATE_STATUS_CODE_UROTActivated (0xF0000008UL) /*!< UROT firmware update verification and installation
                                                                         succeeded.*/
  #define SICR_UROT_UPDATE_STATUS_CODE_RecoveryActivated (0xF0000009UL) /*!< Recovery firmware update verification and
                                                                            installation succeeded.*/
  #define SICR_UROT_UPDATE_STATUS_CODE_RecoveryUpdateDisabled (0xF000000AUL) /*!< Recovery update is disabled via policy.      */
  #define SICR_UROT_UPDATE_STATUS_CODE_AROTRecovery (0xF1000000UL) /*!< Recovery image is booted so that the recovery image can
                                                                        download a AROT image that ROM does not verify.*/



/* ==================================================== Struct SICR_UROT ===================================================== */
/**
  * @brief UROT [SICR_UROT] Interface to store information related to the updateable RoT.
  */
typedef struct {
  __IOM NRF_SICR_UROT_SM_Type SM;                    /*!< (@ 0x00000000) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/
  __IOM NRF_SICR_UROT_RECOVERY_Type RECOVERY;        /*!< (@ 0x00000100) Signed manifest of the recovery firmware.             */
  __IOM NRF_SICR_UROT_UPDATE_Type UPDATE;            /*!< (@ 0x00000200) Description of FW Updates, if any. In case,
                                                                         SICR.UROT.TBS.POLICY.UPDATE is set to Disabled, these
                                                                         registers are ignored by the secure domain ROM code.*/
  __IOM uint32_t  CERTIFICATE[1024];                 /*!< (@ 0x00000320) Device X.509 certificate.                             */
} NRF_SICR_UROT_Type;                                /*!< Size = 4896 (0x1320)                                                 */

/* SICR_UROT_CERTIFICATE: Device X.509 certificate. */
  #define SICR_UROT_CERTIFICATE_MaxCount (1024UL)    /*!< Max size of CERTIFICATE[1024] array.                                 */
  #define SICR_UROT_CERTIFICATE_MaxIndex (1023UL)    /*!< Max index of CERTIFICATE[1024] array.                                */
  #define SICR_UROT_CERTIFICATE_MinIndex (0UL)       /*!< Min index of CERTIFICATE[1024] array.                                */

/* CERT @Bit 0 : Device certificate. */
  #define SICR_UROT_CERTIFICATE_CERT_Pos (0UL)       /*!< Position of CERT field.                                              */
  #define SICR_UROT_CERTIFICATE_CERT_Msk (0x1UL << SICR_UROT_CERTIFICATE_CERT_Pos) /*!< Bit mask of CERT field.                */



/* ============================================ Struct SICR_AROT_SECURE_OEMPUBKEY ============================================ */
/**
  * @brief OEMPUBKEY [SICR_AROT_SECURE_OEMPUBKEY] The public key used by the top level SUIT manifest. The public key is stored
            as additional authenticated data (AAD) in unencrypted form using an AEAD scheme realized by AES-256 GCM mode, with
            the secure domain KEK used as a secret key. The initialization vector is provided in NONCE register. Key attributes
            from ATTR register shall be used as an additional authenticated data (AAD) in AEAD. The content of PUBKEY registers
            shall be used as an additional authenticated data (AAD) in AEAD.

  */
typedef struct {
  __IOM uint32_t  NONCE;                             /*!< (@ 0x00000000) The initialization vector of the encryption algorithm
                                                                         used to protect the top level SUIT manifest public key
                                                                         generation [n].*/
  __IOM uint32_t  ATTR;                              /*!< (@ 0x00000004) The attributes of the local domain firmware master
                                                                         encryption key generation [n]. This field is used as an
                                                                         additional authenticated data (AAD) in AEAD.*/
  __IOM uint32_t  PUBKEY[16];                        /*!< (@ 0x00000008) The top level SUIT manifest public key generation [n].
                                                                         This field is used as an additional authenticated data
                                                                         (AAD) in AEAD.*/
  __IOM uint32_t  MAC[4];                            /*!< (@ 0x00000048) The authentication tag of the top level SUIT manifest
                                                                         public key generation [n].*/
  __IOM uint32_t  RFU[2];                            /*!< (@ 0x00000058) (unspecified)                                         */
} NRF_SICR_AROT_SECURE_OEMPUBKEY_Type;               /*!< Size = 96 (0x060)                                                    */
