adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define SICR_AROT_SECURE_OEMPUBKEY_MaxCount (3UL)  /*!< Size of OEMPUBKEY[3] array.                                          */
  #define SICR_AROT_SECURE_OEMPUBKEY_MaxIndex (2UL)  /*!< Max index of OEMPUBKEY[3] array.                                     */
  #define SICR_AROT_SECURE_OEMPUBKEY_MinIndex (0UL)  /*!< Min index of OEMPUBKEY[3] array.                                     */

/* SICR_AROT_SECURE_OEMPUBKEY_NONCE: The initialization vector of the encryption algorithm used to protect the top level SUIT
                                      manifest public key generation [n]. */


/* VALUE @Bits 0..31 : Value of nonce used by AEAD. */
  #define SICR_AROT_SECURE_OEMPUBKEY_NONCE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define SICR_AROT_SECURE_OEMPUBKEY_NONCE_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_SECURE_OEMPUBKEY_NONCE_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* SICR_AROT_SECURE_OEMPUBKEY_ATTR: The attributes of the local domain firmware master encryption key generation [n]. This field
                                     is used as an additional authenticated data (AAD) in AEAD. */


/* TYPE @Bits 0..15 : Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1. */
  #define SICR_AROT_SECURE_OEMPUBKEY_ATTR_TYPE_Pos (0UL) /*!< Position of TYPE field.                                          */
  #define SICR_AROT_SECURE_OEMPUBKEY_ATTR_TYPE_Msk (0xFFFFUL << SICR_AROT_SECURE_OEMPUBKEY_ATTR_TYPE_Pos) /*!< Bit mask of TYPE
                                                                            field.*/

/* LEN @Bits 16..31 : Length of the key in bits. */
  #define SICR_AROT_SECURE_OEMPUBKEY_ATTR_LEN_Pos (16UL) /*!< Position of LEN field.                                           */
  #define SICR_AROT_SECURE_OEMPUBKEY_ATTR_LEN_Msk (0xFFFFUL << SICR_AROT_SECURE_OEMPUBKEY_ATTR_LEN_Pos) /*!< Bit mask of LEN
                                                                            field.*/


/* SICR_AROT_SECURE_OEMPUBKEY_PUBKEY: The top level SUIT manifest public key generation [n]. This field is used as an additional
                                       authenticated data (AAD) in AEAD. */

  #define SICR_AROT_SECURE_OEMPUBKEY_PUBKEY_MaxCount (16UL) /*!< Max size of PUBKEY[16] array.                                 */
  #define SICR_AROT_SECURE_OEMPUBKEY_PUBKEY_MaxIndex (15UL) /*!< Max index of PUBKEY[16] array.                                */
  #define SICR_AROT_SECURE_OEMPUBKEY_PUBKEY_MinIndex (0UL) /*!< Min index of PUBKEY[16] array.                                 */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define SICR_AROT_SECURE_OEMPUBKEY_PUBKEY_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define SICR_AROT_SECURE_OEMPUBKEY_PUBKEY_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_SECURE_OEMPUBKEY_PUBKEY_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* SICR_AROT_SECURE_OEMPUBKEY_MAC: The authentication tag of the top level SUIT manifest public key generation [n]. */
  #define SICR_AROT_SECURE_OEMPUBKEY_MAC_MaxCount (4UL) /*!< Max size of MAC[4] array.                                         */
  #define SICR_AROT_SECURE_OEMPUBKEY_MAC_MaxIndex (3UL) /*!< Max index of MAC[4] array.                                        */
  #define SICR_AROT_SECURE_OEMPUBKEY_MAC_MinIndex (0UL) /*!< Min index of MAC[4] array.                                        */

/* VALUE @Bits 0..31 : The word [o] of the authentication tag. */
  #define SICR_AROT_SECURE_OEMPUBKEY_MAC_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define SICR_AROT_SECURE_OEMPUBKEY_MAC_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_SECURE_OEMPUBKEY_MAC_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* SICR_AROT_SECURE_OEMPUBKEY_RFU: (unspecified) */
  #define SICR_AROT_SECURE_OEMPUBKEY_RFU_MaxCount (2UL) /*!< Max size of RFU[2] array.                                         */
  #define SICR_AROT_SECURE_OEMPUBKEY_RFU_MaxIndex (1UL) /*!< Max index of RFU[2] array.                                        */
  #define SICR_AROT_SECURE_OEMPUBKEY_RFU_MinIndex (0UL) /*!< Min index of RFU[2] array.                                        */

/* VALUE @Bits 0..31 : RFU word [o]. */
  #define SICR_AROT_SECURE_OEMPUBKEY_RFU_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define SICR_AROT_SECURE_OEMPUBKEY_RFU_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_SECURE_OEMPUBKEY_RFU_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* ========================================= Struct SICR_AROT_SECURE_PERSONALIZATION ========================================= */
/**
  * @brief PERSONALIZATION [SICR_AROT_SECURE_PERSONALIZATION] The device unique pad used as part of a personalization string
            during IKG key generation.

  */
typedef struct {
  __IOM uint32_t  PAD[4];                            /*!< (@ 0x00000000) The device unique pad.                                */
} NRF_SICR_AROT_SECURE_PERSONALIZATION_Type;         /*!< Size = 16 (0x010)                                                    */

/* SICR_AROT_SECURE_PERSONALIZATION_PAD: The device unique pad. */
  #define SICR_AROT_SECURE_PERSONALIZATION_PAD_MaxCount (4UL) /*!< Max size of PAD[4] array.                                   */
  #define SICR_AROT_SECURE_PERSONALIZATION_PAD_MaxIndex (3UL) /*!< Max index of PAD[4] array.                                  */
  #define SICR_AROT_SECURE_PERSONALIZATION_PAD_MinIndex (0UL) /*!< Min index of PAD[4] array.                                  */

/* VALUE @Bits 0..31 : Value for word [n] in the unique pad. */
  #define SICR_AROT_SECURE_PERSONALIZATION_PAD_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define SICR_AROT_SECURE_PERSONALIZATION_PAD_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_SECURE_PERSONALIZATION_PAD_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* ======================================= Struct SICR_AROT_SECURE_DATAPROTECTION_UICR ======================================= */
/**
  * @brief UICR [SICR_AROT_SECURE_DATAPROTECTION_UICR] Authentication tag used for validation of the content of the UICRs. The
            UICRs content provides information about a domain peripherals associations and memory layout configuration. It is
            stored in an unencrypted form in a dedicated memory location. A validation shall be performed using an AEAD scheme
            realized by AES-256 GCM mode, with the domain KEK used as a secret key and UICR content used as additional
            authenticated data (AAD). The initialization vector is provided in NONCE register.

  */
typedef struct {
  __IOM uint32_t  NONCE;                             /*!< (@ 0x00000000) The initialization vector of the encryption algorithm
                                                                         used to protect the domain UICRs content.*/
  __IOM uint32_t  MAC[4];                            /*!< (@ 0x00000004) The authentication tag of the domain UICRs.           */
  __IOM uint32_t  RFU[3];                            /*!< (@ 0x00000014) (unspecified)                                         */
} NRF_SICR_AROT_SECURE_DATAPROTECTION_UICR_Type;     /*!< Size = 32 (0x020)                                                    */

/* SICR_AROT_SECURE_DATAPROTECTION_UICR_NONCE: The initialization vector of the encryption algorithm used to protect the domain
                                                UICRs content. */


/* VALUE @Bits 0..31 : Value of nonce used by AEAD. */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_NONCE_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_NONCE_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_SECURE_DATAPROTECTION_UICR_NONCE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


