adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SICR_AROT_SECURE_DATAPROTECTION_UICR_MAC: The authentication tag of the domain UICRs. */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_MAC_MaxCount (4UL) /*!< Max size of MAC[4] array.                               */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_MAC_MaxIndex (3UL) /*!< Max index of MAC[4] array.                              */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_MAC_MinIndex (0UL) /*!< Min index of MAC[4] array.                              */

/* VALUE @Bits 0..31 : The word [n] of the authentication tag. */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_MAC_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_MAC_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_SECURE_DATAPROTECTION_UICR_MAC_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* SICR_AROT_SECURE_DATAPROTECTION_UICR_RFU: (unspecified) */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_RFU_MaxCount (3UL) /*!< Max size of RFU[3] array.                               */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_RFU_MaxIndex (2UL) /*!< Max index of RFU[3] array.                              */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_RFU_MinIndex (0UL) /*!< Min index of RFU[3] array.                              */

/* VALUE @Bits 0..31 : RFU word [n]. */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_RFU_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define SICR_AROT_SECURE_DATAPROTECTION_UICR_RFU_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_SECURE_DATAPROTECTION_UICR_RFU_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ========================================= Struct SICR_AROT_SECURE_DATAPROTECTION ========================================== */
/**
  * @brief DATAPROTECTION [SICR_AROT_SECURE_DATAPROTECTION] Elements used for validation of data provisioned onto a device by
            the local domain.

  */
typedef struct {
  __IOM NRF_SICR_AROT_SECURE_DATAPROTECTION_UICR_Type UICR; /*!< (@ 0x00000000) Authentication tag used for validation of the
                                                                            content of the UICRs. The UICRs content provides
                                                                            information about a domain peripherals associations
                                                                            and memory layout configuration. It is stored in an
                                                                            unencrypted form in a dedicated memory location. A
                                                                            validation shall be performed using an AEAD scheme
                                                                            realized by AES-256 GCM mode, with the domain KEK
                                                                            used as a secret key and UICR content used as
                                                                            additional authenticated data (AAD). The
                                                                            initialization vector is provided in NONCE
                                                                            register.*/
} NRF_SICR_AROT_SECURE_DATAPROTECTION_Type;          /*!< Size = 32 (0x020)                                                    */


/* ================================================= Struct SICR_AROT_SECURE ================================================= */
/**
  * @brief SECURE [SICR_AROT_SECURE] (unspecified)
  */
typedef struct {
  __IOM NRF_SICR_AROT_SECURE_OEMPUBKEY_Type OEMPUBKEY[3]; /*!< (@ 0x00000000) The public key used by the top level SUIT
                                                                            manifest. The public key is stored as additional
                                                                            authenticated data (AAD) in unencrypted form using
                                                                            an AEAD scheme realized by AES-256 GCM mode, with
                                                                            the secure domain KEK used as a secret key. The
                                                                            initialization vector is provided in NONCE register.
                                                                            Key attributes from ATTR register shall be used as
                                                                            an additional authenticated data (AAD) in AEAD. The
                                                                            content of PUBKEY registers shall be used as an
                                                                            additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_SECURE_PERSONALIZATION_Type PERSONALIZATION; /*!< (@ 0x00000120) The device unique pad used as part of a
                                                                            personalization string during IKG key generation.*/
  __IOM NRF_SICR_AROT_SECURE_DATAPROTECTION_Type DATAPROTECTION; /*!< (@ 0x00000130) Elements used for validation of data
                                                                            provisioned onto a device by the local domain.*/
  __IM  uint32_t  RESERVED[172];
} NRF_SICR_AROT_SECURE_Type;                         /*!< Size = 1024 (0x400)                                                  */


/* =========================================== Struct SICR_AROT_APPLICATION_FWENC ============================================ */
/**
  * @brief FWENC [SICR_AROT_APPLICATION_FWENC] Local domain firmware master encryption key. The key is stored in an encrypted
            then authenticated form using an AEAD scheme realized by AES-256 GCM mode, with the local domain KEK used as a
            secret key. The initialization vector is provided in NONCE register. Key attributes from ATTR register shall be used
            as an additional authenticated data (AAD) in AEAD.

  */
typedef struct {
  __IOM uint32_t  NONCE;                             /*!< (@ 0x00000000) The initialization vector of the encryption algorithm
                                                                         used to protect the local domain firmware master
                                                                         encryption key generation [n].*/
  __IOM uint32_t  ATTR;                              /*!< (@ 0x00000004) The attributes of the local domain firmware master
                                                                         encryption key generation [n]. This field is used as an
                                                                         additional authenticated data (AAD) in AEAD.*/
  __IOM uint32_t  CIPHERTEXT[8];                     /*!< (@ 0x00000008) The encrypted local domain firmware master encryption
                                                                         key generation [n].*/
  __IOM uint32_t  MAC[4];                            /*!< (@ 0x00000028) The authentication tag of the local domain firmware
                                                                         master encryption key generation [n].*/
  __IOM uint32_t  RFU[2];                            /*!< (@ 0x00000038) (unspecified)                                         */
} NRF_SICR_AROT_APPLICATION_FWENC_Type;              /*!< Size = 64 (0x040)                                                    */
  #define SICR_AROT_APPLICATION_FWENC_MaxCount (2UL) /*!< Size of FWENC[2] array.                                              */
  #define SICR_AROT_APPLICATION_FWENC_MaxIndex (1UL) /*!< Max index of FWENC[2] array.                                         */
  #define SICR_AROT_APPLICATION_FWENC_MinIndex (0UL) /*!< Min index of FWENC[2] array.                                         */

/* SICR_AROT_APPLICATION_FWENC_NONCE: The initialization vector of the encryption algorithm used to protect the local domain
                                       firmware master encryption key generation [n]. */


/* VALUE @Bits 0..31 : Value of nonce used by AEAD. */
  #define SICR_AROT_APPLICATION_FWENC_NONCE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define SICR_AROT_APPLICATION_FWENC_NONCE_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_APPLICATION_FWENC_NONCE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* SICR_AROT_APPLICATION_FWENC_ATTR: The attributes of the local domain firmware master encryption key generation [n]. This
                                      field is used as an additional authenticated data (AAD) in AEAD. */


/* TYPE @Bits 0..15 : Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1. */
  #define SICR_AROT_APPLICATION_FWENC_ATTR_TYPE_Pos (0UL) /*!< Position of TYPE field.                                         */
  #define SICR_AROT_APPLICATION_FWENC_ATTR_TYPE_Msk (0xFFFFUL << SICR_AROT_APPLICATION_FWENC_ATTR_TYPE_Pos) /*!< Bit mask of
                                                                            TYPE field.*/

/* LEN @Bits 16..31 : Length of the key in bits. */
  #define SICR_AROT_APPLICATION_FWENC_ATTR_LEN_Pos (16UL) /*!< Position of LEN field.                                          */
  #define SICR_AROT_APPLICATION_FWENC_ATTR_LEN_Msk (0xFFFFUL << SICR_AROT_APPLICATION_FWENC_ATTR_LEN_Pos) /*!< Bit mask of LEN
                                                                            field.*/


/* SICR_AROT_APPLICATION_FWENC_CIPHERTEXT: The encrypted local domain firmware master encryption key generation [n]. */
  #define SICR_AROT_APPLICATION_FWENC_CIPHERTEXT_MaxCount (8UL) /*!< Max size of CIPHERTEXT[8] array.                          */
  #define SICR_AROT_APPLICATION_FWENC_CIPHERTEXT_MaxIndex (7UL) /*!< Max index of CIPHERTEXT[8] array.                         */
  #define SICR_AROT_APPLICATION_FWENC_CIPHERTEXT_MinIndex (0UL) /*!< Min index of CIPHERTEXT[8] array.                         */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define SICR_AROT_APPLICATION_FWENC_CIPHERTEXT_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define SICR_AROT_APPLICATION_FWENC_CIPHERTEXT_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_APPLICATION_FWENC_CIPHERTEXT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


