adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VALUE @Bits 0..31 : RFU word [o]. */
  #define SICR_AROT_RADIO_FWENC_RFU_VALUE_Pos (0UL)  /*!< Position of VALUE field.                                             */
  #define SICR_AROT_RADIO_FWENC_RFU_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_RADIO_FWENC_RFU_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/



/* =========================================== Struct SICR_AROT_RADIO_AUTHDEBUGKEY =========================================== */
/**
  * @brief AUTHDEBUGKEY [SICR_AROT_RADIO_AUTHDEBUGKEY] Local domain authenticated debug access public key. The public key is
            stored as additional authenticated data (AAD) in unencrypted form using an AEAD scheme realized by AES-256 GCM mode,
            with the local domain KEK used as a secret key. The initialization vector is provided in NONCE register. Key
            attributes from ATTR register shall be used as an additional authenticated data (AAD) in AEAD. The content of PUBKEY
            registers shall be used as an additional authenticated data (AAD) in AEAD.

  */
typedef struct {
  __IOM uint32_t  NONCE;                             /*!< (@ 0x00000000) The initialization vector of the encryption algorithm
                                                                         used to protect the local domain authenticated debug
                                                                         access public key generation [n].*/
  __IOM uint32_t  ATTR;                              /*!< (@ 0x00000004) The attributes of the local domain firmware master
                                                                         encryption key generation [n]. This field is used as an
                                                                         additional authenticated data (AAD) in AEAD.*/
  __IOM uint32_t  PUBKEY[16];                        /*!< (@ 0x00000008) The local domain authenticated debug access public key
                                                                         generation [n].*/
  __IOM uint32_t  MAC[4];                            /*!< (@ 0x00000048) The authentication tag of the local domain
                                                                         authenticated debug access public key generation [n].*/
  __IOM uint32_t  RFU[2];                            /*!< (@ 0x00000058) (unspecified)                                         */
} NRF_SICR_AROT_RADIO_AUTHDEBUGKEY_Type;             /*!< Size = 96 (0x060)                                                    */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_MaxCount (3UL) /*!< Size of AUTHDEBUGKEY[3] array.                                      */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_MaxIndex (2UL) /*!< Max index of AUTHDEBUGKEY[3] array.                                 */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_MinIndex (0UL) /*!< Min index of AUTHDEBUGKEY[3] array.                                 */

/* SICR_AROT_RADIO_AUTHDEBUGKEY_NONCE: The initialization vector of the encryption algorithm used to protect the local domain
                                        authenticated debug access public key generation [n]. */


/* VALUE @Bits 0..31 : Value of nonce used by AEAD. */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_NONCE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_NONCE_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_RADIO_AUTHDEBUGKEY_NONCE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* SICR_AROT_RADIO_AUTHDEBUGKEY_ATTR: The attributes of the local domain firmware master encryption key generation [n]. This
                                       field is used as an additional authenticated data (AAD) in AEAD. */


/* TYPE @Bits 0..15 : Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1. */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_ATTR_TYPE_Pos (0UL) /*!< Position of TYPE field.                                        */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_ATTR_TYPE_Msk (0xFFFFUL << SICR_AROT_RADIO_AUTHDEBUGKEY_ATTR_TYPE_Pos) /*!< Bit mask of
                                                                            TYPE field.*/

/* LEN @Bits 16..31 : Length of the key in bits. */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_ATTR_LEN_Pos (16UL) /*!< Position of LEN field.                                         */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_ATTR_LEN_Msk (0xFFFFUL << SICR_AROT_RADIO_AUTHDEBUGKEY_ATTR_LEN_Pos) /*!< Bit mask of LEN
                                                                            field.*/


/* SICR_AROT_RADIO_AUTHDEBUGKEY_PUBKEY: The local domain authenticated debug access public key generation [n]. */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_PUBKEY_MaxCount (16UL) /*!< Max size of PUBKEY[16] array.                               */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_PUBKEY_MaxIndex (15UL) /*!< Max index of PUBKEY[16] array.                              */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_PUBKEY_MinIndex (0UL) /*!< Min index of PUBKEY[16] array.                               */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_PUBKEY_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_PUBKEY_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_RADIO_AUTHDEBUGKEY_PUBKEY_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* SICR_AROT_RADIO_AUTHDEBUGKEY_MAC: The authentication tag of the local domain authenticated debug access public key generation
                                      [n]. */

  #define SICR_AROT_RADIO_AUTHDEBUGKEY_MAC_MaxCount (4UL) /*!< Max size of MAC[4] array.                                       */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_MAC_MaxIndex (3UL) /*!< Max index of MAC[4] array.                                      */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_MAC_MinIndex (0UL) /*!< Min index of MAC[4] array.                                      */

/* VALUE @Bits 0..31 : The word [o] of the authentication tag. */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_MAC_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_MAC_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_RADIO_AUTHDEBUGKEY_MAC_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* SICR_AROT_RADIO_AUTHDEBUGKEY_RFU: (unspecified) */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_RFU_MaxCount (2UL) /*!< Max size of RFU[2] array.                                       */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_RFU_MaxIndex (1UL) /*!< Max index of RFU[2] array.                                      */
  #define SICR_AROT_RADIO_AUTHDEBUGKEY_RFU_MinIndex (0UL) /*!< Min index of RFU[2] array.                                      */

