adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ================================================= Struct SICR_AROT_RADIO ================================================== */
/**
  * @brief RADIO [SICR_AROT_RADIO] (unspecified)
  */
typedef struct {
  __IOM NRF_SICR_AROT_RADIO_FWENC_Type FWENC[2];     /*!< (@ 0x00000000) Local domain firmware master encryption key. The key is
                                                                         stored in an encrypted then authenticated form using an
                                                                         AEAD scheme realized by AES-256 GCM mode, with the
                                                                         local domain KEK used as a secret key. The
                                                                         initialization vector is provided in NONCE register.
                                                                         Key attributes from ATTR register shall be used as an
                                                                         additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_RADIO_AUTHDEBUGKEY_Type AUTHDEBUGKEY[3]; /*!< (@ 0x00000080) Local domain authenticated debug access
                                                                            public key. The public key is stored as additional
                                                                            authenticated data (AAD) in unencrypted form using
                                                                            an AEAD scheme realized by AES-256 GCM mode, with
                                                                            the local domain KEK used as a secret key. The
                                                                            initialization vector is provided in NONCE register.
                                                                            Key attributes from ATTR register shall be used as
                                                                            an additional authenticated data (AAD) in AEAD. The
                                                                            content of PUBKEY registers shall be used as an
                                                                            additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_RADIO_SUITPUBKEY_Type SUITPUBKEY[3]; /*!< (@ 0x000001A0) Public key used by the local domain SUIT
                                                                            manifest. The public key is stored as additional
                                                                            authenticated data (AAD) in unencrypted form using
                                                                            an AEAD scheme realized by AES-256 GCM mode, with
                                                                            the local domain KEK used as a secret key. The
                                                                            initialization vector is provided in NONCE register.
                                                                            Key attributes from ATTR register shall be used as
                                                                            an additional authenticated data (AAD) in AEAD. The
                                                                            content of PUBKEY registers shall be used as an
                                                                            additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_RADIO_DATAPROTECTION_Type DATAPROTECTION; /*!< (@ 0x000002C0) Elements used for validation of data
                                                                            provisioned onto a device by the local domain.*/
  __IOM NRF_SICR_AROT_RADIO_DOMAINSTATE_Type DOMAINSTATE; /*!< (@ 0x000002E0) Registers holding the information regarding the
                                                                            local domain state.*/
  __IM  uint32_t  RESERVED[68];
} NRF_SICR_AROT_RADIO_Type;                          /*!< Size = 1024 (0x400)                                                  */


/* =========================================== Struct SICR_AROT_CELLULARCORE_FWENC =========================================== */
/**
  * @brief FWENC [SICR_AROT_CELLULARCORE_FWENC] Local domain firmware master encryption key. The key is stored in an encrypted
            then authenticated form using an AEAD scheme realized by AES-256 GCM mode, with the local domain KEK used as a
            secret key. The initialization vector is provided in NONCE register. Key attributes from ATTR register shall be used
            as an additional authenticated data (AAD) in AEAD.

  */
typedef struct {
  __IOM uint32_t  NONCE;                             /*!< (@ 0x00000000) The initialization vector of the encryption algorithm
                                                                         used to protect the local domain firmware master
                                                                         encryption key generation [n].*/
  __IOM uint32_t  ATTR;                              /*!< (@ 0x00000004) The attributes of the local domain firmware master
                                                                         encryption key generation [n]. This field is used as an
                                                                         additional authenticated data (AAD) in AEAD.*/
  __IOM uint32_t  CIPHERTEXT[8];                     /*!< (@ 0x00000008) The encrypted local domain firmware master encryption
                                                                         key generation [n].*/
  __IOM uint32_t  MAC[4];                            /*!< (@ 0x00000028) The authentication tag of the local domain firmware
                                                                         master encryption key generation [n].*/
  __IOM uint32_t  RFU[2];                            /*!< (@ 0x00000038) (unspecified)                                         */
} NRF_SICR_AROT_CELLULARCORE_FWENC_Type;             /*!< Size = 64 (0x040)                                                    */
  #define SICR_AROT_CELLULARCORE_FWENC_MaxCount (2UL) /*!< Size of FWENC[2] array.                                             */
  #define SICR_AROT_CELLULARCORE_FWENC_MaxIndex (1UL) /*!< Max index of FWENC[2] array.                                        */
  #define SICR_AROT_CELLULARCORE_FWENC_MinIndex (0UL) /*!< Min index of FWENC[2] array.                                        */

/* SICR_AROT_CELLULARCORE_FWENC_NONCE: The initialization vector of the encryption algorithm used to protect the local domain
                                        firmware master encryption key generation [n]. */


/* VALUE @Bits 0..31 : Value of nonce used by AEAD. */
  #define SICR_AROT_CELLULARCORE_FWENC_NONCE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define SICR_AROT_CELLULARCORE_FWENC_NONCE_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_CELLULARCORE_FWENC_NONCE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


