adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS: The local domain lifecycle state as determined by the URoT. */

/* STATE @Bits 0..31 : The local domain lifecycle state. */
  #define SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS_STATE_Pos (0UL) /*!< Position of STATE field.                                 */
  #define SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS_STATE_Msk (0xFFFFFFFFUL << SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS_STATE_Pos)
                                                                            /*!< Bit mask of STATE field.*/
  #define SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS_STATE_Min (0x3590FCC5UL) /*!< Min enumerator value of STATE field.            */
  #define SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS_STATE_Max (0xF6852179UL) /*!< Max enumerator value of STATE field.            */
  #define SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS_STATE_AssemblyAndTest (0x3590FCC5UL) /*!< The local domain assets are installed
                                                                            in this state. This includes the optional local
                                                                            domain ARoT (its secure program).*/
  #define SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS_STATE_ARoTProvisioning (0xF6852179UL) /*!< The optional local domain ARoT is
                                                                            provisioned in this state.*/
  #define SICR_AROT_CELLULARCORE_DOMAINSTATE_LCS_STATE_Secured (0x9F6B5F01UL) /*!< The local domain assets are provisioned and
                                                                            secured.*/



/* ============================================== Struct SICR_AROT_CELLULARCORE ============================================== */
/**
  * @brief CELLULARCORE [SICR_AROT_CELLULARCORE] (unspecified)
  */
typedef struct {
  __IOM NRF_SICR_AROT_CELLULARCORE_FWENC_Type FWENC[2]; /*!< (@ 0x00000000) Local domain firmware master encryption key. The key
                                                                            is stored in an encrypted then authenticated form
                                                                            using an AEAD scheme realized by AES-256 GCM mode,
                                                                            with the local domain KEK used as a secret key. The
                                                                            initialization vector is provided in NONCE register.
                                                                            Key attributes from ATTR register shall be used as
                                                                            an additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_CELLULARCORE_AUTHDEBUGKEY_Type AUTHDEBUGKEY[3]; /*!< (@ 0x00000080) Local domain authenticated debug
                                                                            access public key. The public key is stored as
                                                                            additional authenticated data (AAD) in unencrypted
                                                                            form using an AEAD scheme realized by AES-256 GCM
                                                                            mode, with the local domain KEK used as a secret
                                                                            key. The initialization vector is provided in NONCE
                                                                            register. Key attributes from ATTR register shall be
                                                                            used as an additional authenticated data (AAD) in
                                                                            AEAD. The content of PUBKEY registers shall be used
                                                                            as an additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_CELLULARCORE_SUITPUBKEY_Type SUITPUBKEY[3]; /*!< (@ 0x000001A0) Public key used by the local domain SUIT
                                                                            manifest. The public key is stored as additional
                                                                            authenticated data (AAD) in unencrypted form using
                                                                            an AEAD scheme realized by AES-256 GCM mode, with
                                                                            the local domain KEK used as a secret key. The
                                                                            initialization vector is provided in NONCE register.
                                                                            Key attributes from ATTR register shall be used as
                                                                            an additional authenticated data (AAD) in AEAD. The
                                                                            content of PUBKEY registers shall be used as an
                                                                            additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_CELLULARCORE_DATAPROTECTION_Type DATAPROTECTION; /*!< (@ 0x000002C0) Elements used for validation of data
                                                                            provisioned onto a device by the local domain.*/
  __IOM NRF_SICR_AROT_CELLULARCORE_DOMAINSTATE_Type DOMAINSTATE; /*!< (@ 0x000002E0) Registers holding the information regarding
                                                                            the local domain state.*/
  __IM  uint32_t  RESERVED[68];
} NRF_SICR_AROT_CELLULARCORE_Type;                   /*!< Size = 1024 (0x400)                                                  */


/* ============================================= Struct SICR_AROT_WIFICORE_FWENC ============================================= */
/**
  * @brief FWENC [SICR_AROT_WIFICORE_FWENC] Local domain firmware master encryption key. The key is stored in an encrypted then
            authenticated form using an AEAD scheme realized by AES-256 GCM mode, with the local domain KEK used as a secret
            key. The initialization vector is provided in NONCE register. Key attributes from ATTR register shall be used as an
            additional authenticated data (AAD) in AEAD.

  */
typedef struct {
  __IOM uint32_t  NONCE;                             /*!< (@ 0x00000000) The initialization vector of the encryption algorithm
                                                                         used to protect the local domain firmware master
                                                                         encryption key generation [n].*/
  __IOM uint32_t  ATTR;                              /*!< (@ 0x00000004) The attributes of the local domain firmware master
                                                                         encryption key generation [n]. This field is used as an
                                                                         additional authenticated data (AAD) in AEAD.*/
  __IOM uint32_t  CIPHERTEXT[8];                     /*!< (@ 0x00000008) The encrypted local domain firmware master encryption
                                                                         key generation [n].*/
  __IOM uint32_t  MAC[4];                            /*!< (@ 0x00000028) The authentication tag of the local domain firmware
                                                                         master encryption key generation [n].*/
  __IOM uint32_t  RFU[2];                            /*!< (@ 0x00000038) (unspecified)                                         */
} NRF_SICR_AROT_WIFICORE_FWENC_Type;                 /*!< Size = 64 (0x040)                                                    */
  #define SICR_AROT_WIFICORE_FWENC_MaxCount (2UL)    /*!< Size of FWENC[2] array.                                              */
  #define SICR_AROT_WIFICORE_FWENC_MaxIndex (1UL)    /*!< Max index of FWENC[2] array.                                         */
  #define SICR_AROT_WIFICORE_FWENC_MinIndex (0UL)    /*!< Min index of FWENC[2] array.                                         */

/* SICR_AROT_WIFICORE_FWENC_NONCE: The initialization vector of the encryption algorithm used to protect the local domain
                                    firmware master encryption key generation [n]. */


/* VALUE @Bits 0..31 : Value of nonce used by AEAD. */
  #define SICR_AROT_WIFICORE_FWENC_NONCE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define SICR_AROT_WIFICORE_FWENC_NONCE_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_WIFICORE_FWENC_NONCE_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* SICR_AROT_WIFICORE_FWENC_ATTR: The attributes of the local domain firmware master encryption key generation [n]. This field
                                   is used as an additional authenticated data (AAD) in AEAD. */


/* TYPE @Bits 0..15 : Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1. */
  #define SICR_AROT_WIFICORE_FWENC_ATTR_TYPE_Pos (0UL) /*!< Position of TYPE field.                                            */
  #define SICR_AROT_WIFICORE_FWENC_ATTR_TYPE_Msk (0xFFFFUL << SICR_AROT_WIFICORE_FWENC_ATTR_TYPE_Pos) /*!< Bit mask of TYPE
                                                                            field.*/

/* LEN @Bits 16..31 : Length of the key in bits. */
  #define SICR_AROT_WIFICORE_FWENC_ATTR_LEN_Pos (16UL) /*!< Position of LEN field.                                             */
  #define SICR_AROT_WIFICORE_FWENC_ATTR_LEN_Msk (0xFFFFUL << SICR_AROT_WIFICORE_FWENC_ATTR_LEN_Pos) /*!< Bit mask of LEN field.*/


/* SICR_AROT_WIFICORE_FWENC_CIPHERTEXT: The encrypted local domain firmware master encryption key generation [n]. */
  #define SICR_AROT_WIFICORE_FWENC_CIPHERTEXT_MaxCount (8UL) /*!< Max size of CIPHERTEXT[8] array.                             */
  #define SICR_AROT_WIFICORE_FWENC_CIPHERTEXT_MaxIndex (7UL) /*!< Max index of CIPHERTEXT[8] array.                            */
  #define SICR_AROT_WIFICORE_FWENC_CIPHERTEXT_MinIndex (0UL) /*!< Min index of CIPHERTEXT[8] array.                            */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define SICR_AROT_WIFICORE_FWENC_CIPHERTEXT_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define SICR_AROT_WIFICORE_FWENC_CIPHERTEXT_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_WIFICORE_FWENC_CIPHERTEXT_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


