adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VALUE @Bits 0..31 : RFU word [o]. */
  #define SICR_AROT_WIFICORE_SUITPUBKEY_RFU_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define SICR_AROT_WIFICORE_SUITPUBKEY_RFU_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_WIFICORE_SUITPUBKEY_RFU_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ====================================== Struct SICR_AROT_WIFICORE_DATAPROTECTION_UICR ====================================== */
/**
  * @brief UICR [SICR_AROT_WIFICORE_DATAPROTECTION_UICR] Authentication tag used for validation of the content of the UICRs. The
            UICRs content provides information about a domain peripherals associations and memory layout configuration. It is
            stored in an unencrypted form in a dedicated memory location. A validation shall be performed using an AEAD scheme
            realized by AES-256 GCM mode, with the domain KEK used as a secret key and UICR content used as additional
            authenticated data (AAD). The initialization vector is provided in NONCE register.

  */
typedef struct {
  __IOM uint32_t  NONCE;                             /*!< (@ 0x00000000) The initialization vector of the encryption algorithm
                                                                         used to protect the domain UICRs content.*/
  __IOM uint32_t  MAC[4];                            /*!< (@ 0x00000004) The authentication tag of the domain UICRs.           */
  __IOM uint32_t  RFU[3];                            /*!< (@ 0x00000014) (unspecified)                                         */
} NRF_SICR_AROT_WIFICORE_DATAPROTECTION_UICR_Type;   /*!< Size = 32 (0x020)                                                    */

/* SICR_AROT_WIFICORE_DATAPROTECTION_UICR_NONCE: The initialization vector of the encryption algorithm used to protect the
                                                  domain UICRs content. */


/* VALUE @Bits 0..31 : Value of nonce used by AEAD. */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_NONCE_VALUE_Pos (0UL) /*!< Position of VALUE field.                           */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_NONCE_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_WIFICORE_DATAPROTECTION_UICR_NONCE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* SICR_AROT_WIFICORE_DATAPROTECTION_UICR_MAC: The authentication tag of the domain UICRs. */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_MAC_MaxCount (4UL) /*!< Max size of MAC[4] array.                             */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_MAC_MaxIndex (3UL) /*!< Max index of MAC[4] array.                            */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_MAC_MinIndex (0UL) /*!< Min index of MAC[4] array.                            */

/* VALUE @Bits 0..31 : The word [n] of the authentication tag. */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_MAC_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_MAC_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_WIFICORE_DATAPROTECTION_UICR_MAC_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* SICR_AROT_WIFICORE_DATAPROTECTION_UICR_RFU: (unspecified) */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_RFU_MaxCount (3UL) /*!< Max size of RFU[3] array.                             */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_RFU_MaxIndex (2UL) /*!< Max index of RFU[3] array.                            */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_RFU_MinIndex (0UL) /*!< Min index of RFU[3] array.                            */

/* VALUE @Bits 0..31 : RFU word [n]. */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_RFU_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define SICR_AROT_WIFICORE_DATAPROTECTION_UICR_RFU_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_WIFICORE_DATAPROTECTION_UICR_RFU_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ======================================== Struct SICR_AROT_WIFICORE_DATAPROTECTION ========================================= */
/**
  * @brief DATAPROTECTION [SICR_AROT_WIFICORE_DATAPROTECTION] Elements used for validation of data provisioned onto a device by
            the local domain.

  */
typedef struct {
  __IOM NRF_SICR_AROT_WIFICORE_DATAPROTECTION_UICR_Type UICR; /*!< (@ 0x00000000) Authentication tag used for validation of the
                                                                            content of the UICRs. The UICRs content provides
                                                                            information about a domain peripherals associations
                                                                            and memory layout configuration. It is stored in an
                                                                            unencrypted form in a dedicated memory location. A
                                                                            validation shall be performed using an AEAD scheme
                                                                            realized by AES-256 GCM mode, with the domain KEK
                                                                            used as a secret key and UICR content used as
                                                                            additional authenticated data (AAD). The
                                                                            initialization vector is provided in NONCE
                                                                            register.*/
} NRF_SICR_AROT_WIFICORE_DATAPROTECTION_Type;        /*!< Size = 32 (0x020)                                                    */


/* ========================================== Struct SICR_AROT_WIFICORE_DOMAINSTATE ========================================== */
/**
  * @brief DOMAINSTATE [SICR_AROT_WIFICORE_DOMAINSTATE] Registers holding the information regarding the local domain state.
  */
typedef struct {
  __IOM uint32_t  RFU[3];                            /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM uint32_t  LCS;                               /*!< (@ 0x0000000C) The local domain lifecycle state as determined by the
                                                                         URoT.*/
} NRF_SICR_AROT_WIFICORE_DOMAINSTATE_Type;           /*!< Size = 16 (0x010)                                                    */

