adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SICR_AROT_WIFICORE_DOMAINSTATE_RFU: (unspecified) */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_RFU_MaxCount (3UL) /*!< Max size of RFU[3] array.                                     */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_RFU_MaxIndex (2UL) /*!< Max index of RFU[3] array.                                    */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_RFU_MinIndex (0UL) /*!< Min index of RFU[3] array.                                    */

/* VALUE @Bits 0..31 : RFU word [n]. */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_RFU_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_RFU_VALUE_Msk (0xFFFFFFFFUL << SICR_AROT_WIFICORE_DOMAINSTATE_RFU_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* SICR_AROT_WIFICORE_DOMAINSTATE_LCS: The local domain lifecycle state as determined by the URoT. */

/* STATE @Bits 0..31 : The local domain lifecycle state. */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_LCS_STATE_Pos (0UL) /*!< Position of STATE field.                                     */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_LCS_STATE_Msk (0xFFFFFFFFUL << SICR_AROT_WIFICORE_DOMAINSTATE_LCS_STATE_Pos) /*!< Bit
                                                                            mask of STATE field.*/
  #define SICR_AROT_WIFICORE_DOMAINSTATE_LCS_STATE_Min (0x3590FCC5UL) /*!< Min enumerator value of STATE field.                */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_LCS_STATE_Max (0xF6852179UL) /*!< Max enumerator value of STATE field.                */
  #define SICR_AROT_WIFICORE_DOMAINSTATE_LCS_STATE_AssemblyAndTest (0x3590FCC5UL) /*!< The local domain assets are installed in
                                                                            this state. This includes the optional local domain
                                                                            ARoT (its secure program).*/
  #define SICR_AROT_WIFICORE_DOMAINSTATE_LCS_STATE_ARoTProvisioning (0xF6852179UL) /*!< The optional local domain ARoT is
                                                                            provisioned in this state.*/
  #define SICR_AROT_WIFICORE_DOMAINSTATE_LCS_STATE_Secured (0x9F6B5F01UL) /*!< The local domain assets are provisioned and
                                                                            secured.*/



/* ================================================ Struct SICR_AROT_WIFICORE ================================================ */
/**
  * @brief WIFICORE [SICR_AROT_WIFICORE] (unspecified)
  */
typedef struct {
  __IOM NRF_SICR_AROT_WIFICORE_FWENC_Type FWENC[2];  /*!< (@ 0x00000000) Local domain firmware master encryption key. The key is
                                                                         stored in an encrypted then authenticated form using an
                                                                         AEAD scheme realized by AES-256 GCM mode, with the
                                                                         local domain KEK used as a secret key. The
                                                                         initialization vector is provided in NONCE register.
                                                                         Key attributes from ATTR register shall be used as an
                                                                         additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_WIFICORE_AUTHDEBUGKEY_Type AUTHDEBUGKEY[3]; /*!< (@ 0x00000080) Local domain authenticated debug access
                                                                            public key. The public key is stored as additional
                                                                            authenticated data (AAD) in unencrypted form using
                                                                            an AEAD scheme realized by AES-256 GCM mode, with
                                                                            the local domain KEK used as a secret key. The
                                                                            initialization vector is provided in NONCE register.
                                                                            Key attributes from ATTR register shall be used as
                                                                            an additional authenticated data (AAD) in AEAD. The
                                                                            content of PUBKEY registers shall be used as an
                                                                            additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_WIFICORE_SUITPUBKEY_Type SUITPUBKEY[3]; /*!< (@ 0x000001A0) Public key used by the local domain SUIT
                                                                            manifest. The public key is stored as additional
                                                                            authenticated data (AAD) in unencrypted form using
                                                                            an AEAD scheme realized by AES-256 GCM mode, with
                                                                            the local domain KEK used as a secret key. The
                                                                            initialization vector is provided in NONCE register.
                                                                            Key attributes from ATTR register shall be used as
                                                                            an additional authenticated data (AAD) in AEAD. The
                                                                            content of PUBKEY registers shall be used as an
                                                                            additional authenticated data (AAD) in AEAD.*/
  __IOM NRF_SICR_AROT_WIFICORE_DATAPROTECTION_Type DATAPROTECTION; /*!< (@ 0x000002C0) Elements used for validation of data
                                                                            provisioned onto a device by the local domain.*/
  __IOM NRF_SICR_AROT_WIFICORE_DOMAINSTATE_Type DOMAINSTATE; /*!< (@ 0x000002E0) Registers holding the information regarding the
                                                                            local domain state.*/
  __IM  uint32_t  RESERVED[68];
} NRF_SICR_AROT_WIFICORE_Type;                       /*!< Size = 1024 (0x400)                                                  */


/* ==================================================== Struct SICR_AROT ===================================================== */
/**
  * @brief AROT [SICR_AROT] Interface used by the secure domain firmware to extend the RoT to the other local domains and store
            information on configuration of debug access ports, CTRL-AP methods, and other platfrom security related
            configurations per domain. These registers are only accessed the secure domain firmware. Any operations related to
            the local domains must be requested via the secure domain firmware API.

  */
typedef struct {
  __IOM NRF_SICR_AROT_SECURE_Type SECURE;            /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_SICR_AROT_APPLICATION_Type APPLICATION;  /*!< (@ 0x00000400) (unspecified)                                         */
  __IOM NRF_SICR_AROT_RADIO_Type RADIO;              /*!< (@ 0x00000800) (unspecified)                                         */
  __IOM NRF_SICR_AROT_CELLULARCORE_Type CELLULARCORE; /*!< (@ 0x00000C00) (unspecified)                                        */
  __IOM NRF_SICR_AROT_WIFICORE_Type WIFICORE;        /*!< (@ 0x00001000) (unspecified)                                         */
} NRF_SICR_AROT_Type;                                /*!< Size = 5120 (0x1400)                                                 */

/* ======================================================= Struct SICR ======================================================= */
/**
  * @brief Secure Information Configuration Registers
  */
  typedef struct {                                   /*!< SICR Structure                                                       */
    __IOM NRF_SICR_IROT_Type IROT;                   /*!< (@ 0x00000000) Information on immutable Root of Trust. Secure domain
                                                                         ROM writes these registers only in LCS Empty, RoT and
                                                                         DEPLOYED.*/
    __IM uint32_t RESERVED[24];
    __IOM NRF_SICR_UROT_Type UROT;                   /*!< (@ 0x000000F0) Interface to store information related to the
                                                                         updateable RoT.*/
    __IM uint32_t RESERVED1[60];
    __IOM NRF_SICR_AROT_Type AROT;                   /*!< (@ 0x00001500) Interface used by the secure domain firmware to extend
                                                                         the RoT to the other local domains and store
                                                                         information on configuration of debug access ports,
                                                                         CTRL-AP methods, and other platfrom security related
                                                                         configurations per domain. These registers are only
                                                                         accessed the secure domain firmware. Any operations
                                                                         related to the local domains must be requested via the
                                                                         secure domain firmware API.*/
  } NRF_SICR_Type;                                   /*!< Size = 10496 (0x2900)                                                */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SIMIF                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct SIMIF_TASKS_UART ================================================= */
/**
  * @brief TASKS_UART [SIMIF_TASKS_UART] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  SUSPEND;                           /*!< (@ 0x00000000) Suspend UART                                          */
  __OM  uint32_t  RESUME;                            /*!< (@ 0x00000004) Resume UART                                           */
  __IM  uint32_t  RESERVED;
  __OM  uint32_t  STOPRX;                            /*!< (@ 0x0000000C) Stop UART data reception                              */
  __IM  uint32_t  RESERVED1;
  __OM  uint32_t  STOPTX;                            /*!< (@ 0x00000014) Stop UART data transmission                           */
  __OM  uint32_t  STARTTRX;                          /*!< (@ 0x00000018) Start UART data transmission and reception            */
  __OM  uint32_t  STOPTRX;                           /*!< (@ 0x0000001C) Stop UART data transmission and reception             */
} NRF_SIMIF_TASKS_UART_Type;                         /*!< Size = 32 (0x020)                                                    */

/* SIMIF_TASKS_UART_SUSPEND: Suspend UART */
  #define SIMIF_TASKS_UART_SUSPEND_ResetValue (0x00000000UL) /*!< Reset value of SUSPEND register.                             */

/* SUSPEND @Bit 0 : Suspend UART */
  #define SIMIF_TASKS_UART_SUSPEND_SUSPEND_Pos (0UL) /*!< Position of SUSPEND field.                                           */
  #define SIMIF_TASKS_UART_SUSPEND_SUSPEND_Msk (0x1UL << SIMIF_TASKS_UART_SUSPEND_SUSPEND_Pos) /*!< Bit mask of SUSPEND field. */
  #define SIMIF_TASKS_UART_SUSPEND_SUSPEND_Min (0x1UL) /*!< Min enumerator value of SUSPEND field.                             */
  #define SIMIF_TASKS_UART_SUSPEND_SUSPEND_Max (0x1UL) /*!< Max enumerator value of SUSPEND field.                             */
  #define SIMIF_TASKS_UART_SUSPEND_SUSPEND_Trigger (0x1UL) /*!< Trigger task                                                   */


/* SIMIF_TASKS_UART_RESUME: Resume UART */
  #define SIMIF_TASKS_UART_RESUME_ResetValue (0x00000000UL) /*!< Reset value of RESUME register.                               */

/* RESUME @Bit 0 : Resume UART */
  #define SIMIF_TASKS_UART_RESUME_RESUME_Pos (0UL)   /*!< Position of RESUME field.                                            */
  #define SIMIF_TASKS_UART_RESUME_RESUME_Msk (0x1UL << SIMIF_TASKS_UART_RESUME_RESUME_Pos) /*!< Bit mask of RESUME field.      */
  #define SIMIF_TASKS_UART_RESUME_RESUME_Min (0x1UL) /*!< Min enumerator value of RESUME field.                                */
  #define SIMIF_TASKS_UART_RESUME_RESUME_Max (0x1UL) /*!< Max enumerator value of RESUME field.                                */
  #define SIMIF_TASKS_UART_RESUME_RESUME_Trigger (0x1UL) /*!< Trigger task                                                     */


/* SIMIF_TASKS_UART_STOPRX: Stop UART data reception */
  #define SIMIF_TASKS_UART_STOPRX_ResetValue (0x00000000UL) /*!< Reset value of STOPRX register.                               */

/* STOPRX @Bit 0 : Stop UART data reception */
  #define SIMIF_TASKS_UART_STOPRX_STOPRX_Pos (0UL)   /*!< Position of STOPRX field.                                            */
  #define SIMIF_TASKS_UART_STOPRX_STOPRX_Msk (0x1UL << SIMIF_TASKS_UART_STOPRX_STOPRX_Pos) /*!< Bit mask of STOPRX field.      */
  #define SIMIF_TASKS_UART_STOPRX_STOPRX_Min (0x1UL) /*!< Min enumerator value of STOPRX field.                                */
  #define SIMIF_TASKS_UART_STOPRX_STOPRX_Max (0x1UL) /*!< Max enumerator value of STOPRX field.                                */
  #define SIMIF_TASKS_UART_STOPRX_STOPRX_Trigger (0x1UL) /*!< Trigger task                                                     */


/* SIMIF_TASKS_UART_STOPTX: Stop UART data transmission */
  #define SIMIF_TASKS_UART_STOPTX_ResetValue (0x00000000UL) /*!< Reset value of STOPTX register.                               */

