adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SIMIF_EVENTS_T1TXABORTED: T=1 card responded with S(ABORT request) */
  #define SIMIF_EVENTS_T1TXABORTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_T1TXABORTED register.                  */

/* EVENTS_T1TXABORTED @Bit 0 : T=1 card responded with S(ABORT request) */
  #define SIMIF_EVENTS_T1TXABORTED_EVENTS_T1TXABORTED_Pos (0UL) /*!< Position of EVENTS_T1TXABORTED field.                     */
  #define SIMIF_EVENTS_T1TXABORTED_EVENTS_T1TXABORTED_Msk (0x1UL << SIMIF_EVENTS_T1TXABORTED_EVENTS_T1TXABORTED_Pos) /*!< Bit
                                                                            mask of EVENTS_T1TXABORTED field.*/
  #define SIMIF_EVENTS_T1TXABORTED_EVENTS_T1TXABORTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_T1TXABORTED field.       */
  #define SIMIF_EVENTS_T1TXABORTED_EVENTS_T1TXABORTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_T1TXABORTED field.       */
  #define SIMIF_EVENTS_T1TXABORTED_EVENTS_T1TXABORTED_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define SIMIF_EVENTS_T1TXABORTED_EVENTS_T1TXABORTED_Generated (0x1UL) /*!< Event generated                                   */


/* SIMIF_EVENTS_T1NONIBLOCK: T=1 unrecognized (S or R) block (with correct LRC) stored in RX_DATA */
  #define SIMIF_EVENTS_T1NONIBLOCK_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_T1NONIBLOCK register.                  */

/* EVENTS_T1NONIBLOCK @Bit 0 : T=1 unrecognized (S or R) block (with correct LRC) stored in RX_DATA */
  #define SIMIF_EVENTS_T1NONIBLOCK_EVENTS_T1NONIBLOCK_Pos (0UL) /*!< Position of EVENTS_T1NONIBLOCK field.                     */
  #define SIMIF_EVENTS_T1NONIBLOCK_EVENTS_T1NONIBLOCK_Msk (0x1UL << SIMIF_EVENTS_T1NONIBLOCK_EVENTS_T1NONIBLOCK_Pos) /*!< Bit
                                                                            mask of EVENTS_T1NONIBLOCK field.*/
  #define SIMIF_EVENTS_T1NONIBLOCK_EVENTS_T1NONIBLOCK_Min (0x0UL) /*!< Min enumerator value of EVENTS_T1NONIBLOCK field.       */
  #define SIMIF_EVENTS_T1NONIBLOCK_EVENTS_T1NONIBLOCK_Max (0x1UL) /*!< Max enumerator value of EVENTS_T1NONIBLOCK field.       */
  #define SIMIF_EVENTS_T1NONIBLOCK_EVENTS_T1NONIBLOCK_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define SIMIF_EVENTS_T1NONIBLOCK_EVENTS_T1NONIBLOCK_Generated (0x1UL) /*!< Event generated                                   */


/* SIMIF_EVENTS_T1LENERROR: T=1 LEN = 255 */
  #define SIMIF_EVENTS_T1LENERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_T1LENERROR register.                    */

/* EVENTS_T1LENERROR @Bit 0 : T=1 LEN = 255 */
  #define SIMIF_EVENTS_T1LENERROR_EVENTS_T1LENERROR_Pos (0UL) /*!< Position of EVENTS_T1LENERROR field.                        */
  #define SIMIF_EVENTS_T1LENERROR_EVENTS_T1LENERROR_Msk (0x1UL << SIMIF_EVENTS_T1LENERROR_EVENTS_T1LENERROR_Pos) /*!< Bit mask
                                                                            of EVENTS_T1LENERROR field.*/
  #define SIMIF_EVENTS_T1LENERROR_EVENTS_T1LENERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_T1LENERROR field.          */
  #define SIMIF_EVENTS_T1LENERROR_EVENTS_T1LENERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_T1LENERROR field.          */
  #define SIMIF_EVENTS_T1LENERROR_EVENTS_T1LENERROR_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define SIMIF_EVENTS_T1LENERROR_EVENTS_T1LENERROR_Generated (0x1UL) /*!< Event generated                                     */


/* SIMIF_EVENTS_EDCERROR: T=1 EDC error */
  #define SIMIF_EVENTS_EDCERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_EDCERROR register.                        */

/* EVENTS_EDCERROR @Bit 0 : T=1 EDC error */
  #define SIMIF_EVENTS_EDCERROR_EVENTS_EDCERROR_Pos (0UL) /*!< Position of EVENTS_EDCERROR field.                              */
  #define SIMIF_EVENTS_EDCERROR_EVENTS_EDCERROR_Msk (0x1UL << SIMIF_EVENTS_EDCERROR_EVENTS_EDCERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_EDCERROR field.*/
  #define SIMIF_EVENTS_EDCERROR_EVENTS_EDCERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_EDCERROR field.                */
  #define SIMIF_EVENTS_EDCERROR_EVENTS_EDCERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_EDCERROR field.                */
  #define SIMIF_EVENTS_EDCERROR_EVENTS_EDCERROR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define SIMIF_EVENTS_EDCERROR_EVENTS_EDCERROR_Generated (0x1UL) /*!< Event generated                                         */


/* SIMIF_EVENTS_NADERROR: T=1 NAD error */
  #define SIMIF_EVENTS_NADERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_NADERROR register.                        */

/* EVENTS_NADERROR @Bit 0 : T=1 NAD error */
  #define SIMIF_EVENTS_NADERROR_EVENTS_NADERROR_Pos (0UL) /*!< Position of EVENTS_NADERROR field.                              */
  #define SIMIF_EVENTS_NADERROR_EVENTS_NADERROR_Msk (0x1UL << SIMIF_EVENTS_NADERROR_EVENTS_NADERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_NADERROR field.*/
  #define SIMIF_EVENTS_NADERROR_EVENTS_NADERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_NADERROR field.                */
  #define SIMIF_EVENTS_NADERROR_EVENTS_NADERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_NADERROR field.                */
  #define SIMIF_EVENTS_NADERROR_EVENTS_NADERROR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define SIMIF_EVENTS_NADERROR_EVENTS_NADERROR_Generated (0x1UL) /*!< Event generated                                         */


/* SIMIF_EVENTS_ERRORCOUNTMAX: number of unsuccessful rx or tx operations equals max value */
  #define SIMIF_EVENTS_ERRORCOUNTMAX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORCOUNTMAX register.              */

/* EVENTS_ERRORCOUNTMAX @Bit 0 : number of unsuccessful rx or tx operations equals max value */
  #define SIMIF_EVENTS_ERRORCOUNTMAX_EVENTS_ERRORCOUNTMAX_Pos (0UL) /*!< Position of EVENTS_ERRORCOUNTMAX field.               */
  #define SIMIF_EVENTS_ERRORCOUNTMAX_EVENTS_ERRORCOUNTMAX_Msk (0x1UL << SIMIF_EVENTS_ERRORCOUNTMAX_EVENTS_ERRORCOUNTMAX_Pos)
                                                                            /*!< Bit mask of EVENTS_ERRORCOUNTMAX field.*/
  #define SIMIF_EVENTS_ERRORCOUNTMAX_EVENTS_ERRORCOUNTMAX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORCOUNTMAX field. */
  #define SIMIF_EVENTS_ERRORCOUNTMAX_EVENTS_ERRORCOUNTMAX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORCOUNTMAX field. */
  #define SIMIF_EVENTS_ERRORCOUNTMAX_EVENTS_ERRORCOUNTMAX_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define SIMIF_EVENTS_ERRORCOUNTMAX_EVENTS_ERRORCOUNTMAX_Generated (0x1UL) /*!< Event generated                               */


/* SIMIF_EVENTS_T1RXMORE: More bit high in PCB of Rx T=1 I block */
  #define SIMIF_EVENTS_T1RXMORE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_T1RXMORE register.                        */

/* EVENTS_T1RXMORE @Bit 0 : More bit high in PCB of Rx T=1 I block */
  #define SIMIF_EVENTS_T1RXMORE_EVENTS_T1RXMORE_Pos (0UL) /*!< Position of EVENTS_T1RXMORE field.                              */
  #define SIMIF_EVENTS_T1RXMORE_EVENTS_T1RXMORE_Msk (0x1UL << SIMIF_EVENTS_T1RXMORE_EVENTS_T1RXMORE_Pos) /*!< Bit mask of
                                                                            EVENTS_T1RXMORE field.*/
  #define SIMIF_EVENTS_T1RXMORE_EVENTS_T1RXMORE_Min (0x0UL) /*!< Min enumerator value of EVENTS_T1RXMORE field.                */
  #define SIMIF_EVENTS_T1RXMORE_EVENTS_T1RXMORE_Max (0x1UL) /*!< Max enumerator value of EVENTS_T1RXMORE field.                */
  #define SIMIF_EVENTS_T1RXMORE_EVENTS_T1RXMORE_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define SIMIF_EVENTS_T1RXMORE_EVENTS_T1RXMORE_Generated (0x1UL) /*!< Event generated                                         */


