adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SIMIF_EVENTS_T1RXFRAMEEND: Len byte + 1 bytes of T1 Rx data received */
  #define SIMIF_EVENTS_T1RXFRAMEEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_T1RXFRAMEEND register.                */

/* EVENTS_T1RXFRAMEEND @Bit 0 : Len byte + 1 bytes of T1 Rx data received */
  #define SIMIF_EVENTS_T1RXFRAMEEND_EVENTS_T1RXFRAMEEND_Pos (0UL) /*!< Position of EVENTS_T1RXFRAMEEND field.                  */
  #define SIMIF_EVENTS_T1RXFRAMEEND_EVENTS_T1RXFRAMEEND_Msk (0x1UL << SIMIF_EVENTS_T1RXFRAMEEND_EVENTS_T1RXFRAMEEND_Pos) /*!<
                                                                            Bit mask of EVENTS_T1RXFRAMEEND field.*/
  #define SIMIF_EVENTS_T1RXFRAMEEND_EVENTS_T1RXFRAMEEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_T1RXFRAMEEND field.    */
  #define SIMIF_EVENTS_T1RXFRAMEEND_EVENTS_T1RXFRAMEEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_T1RXFRAMEEND field.    */
  #define SIMIF_EVENTS_T1RXFRAMEEND_EVENTS_T1RXFRAMEEND_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define SIMIF_EVENTS_T1RXFRAMEEND_EVENTS_T1RXFRAMEEND_Generated (0x1UL) /*!< Event generated                                 */


/* SIMIF_SHORTS: Shortcuts between local events and tasks */
  #define SIMIF_SHORTS_ResetValue (0x00000000UL)     /*!< Reset value of SHORTS register.                                      */

/* DMA_TXDONE_DMASTARTRX @Bit 0 : Shortcut between event DMA.TXDONE and task DMASTARTRX */
  #define SIMIF_SHORTS_DMA_TXDONE_DMASTARTRX_Pos (0UL) /*!< Position of DMA_TXDONE_DMASTARTRX field.                           */
  #define SIMIF_SHORTS_DMA_TXDONE_DMASTARTRX_Msk (0x1UL << SIMIF_SHORTS_DMA_TXDONE_DMASTARTRX_Pos) /*!< Bit mask of
                                                                            DMA_TXDONE_DMASTARTRX field.*/
  #define SIMIF_SHORTS_DMA_TXDONE_DMASTARTRX_Min (0x0UL) /*!< Min enumerator value of DMA_TXDONE_DMASTARTRX field.             */
  #define SIMIF_SHORTS_DMA_TXDONE_DMASTARTRX_Max (0x1UL) /*!< Max enumerator value of DMA_TXDONE_DMASTARTRX field.             */
  #define SIMIF_SHORTS_DMA_TXDONE_DMASTARTRX_Disabled (0x0UL) /*!< Disable shortcut                                            */
  #define SIMIF_SHORTS_DMA_TXDONE_DMASTARTRX_Enabled (0x1UL) /*!< Enable shortcut                                              */

/* DMA_TXDONE_UARTRX @Bit 1 : Shortcut between event DMA.TXDONE and task UARTRX */
  #define SIMIF_SHORTS_DMA_TXDONE_UARTRX_Pos (1UL)   /*!< Position of DMA_TXDONE_UARTRX field.                                 */
  #define SIMIF_SHORTS_DMA_TXDONE_UARTRX_Msk (0x1UL << SIMIF_SHORTS_DMA_TXDONE_UARTRX_Pos) /*!< Bit mask of DMA_TXDONE_UARTRX
                                                                            field.*/
  #define SIMIF_SHORTS_DMA_TXDONE_UARTRX_Min (0x0UL) /*!< Min enumerator value of DMA_TXDONE_UARTRX field.                     */
  #define SIMIF_SHORTS_DMA_TXDONE_UARTRX_Max (0x1UL) /*!< Max enumerator value of DMA_TXDONE_UARTRX field.                     */
  #define SIMIF_SHORTS_DMA_TXDONE_UARTRX_Disabled (0x0UL) /*!< Disable shortcut                                                */
  #define SIMIF_SHORTS_DMA_TXDONE_UARTRX_Enabled (0x1UL) /*!< Enable shortcut                                                  */

/* DMA_TXDONE_PROTOCOLT0SET @Bit 2 : Shortcut between event DMA.TXDONE and task PROTOCOLT0SET */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT0SET_Pos (2UL) /*!< Position of DMA_TXDONE_PROTOCOLT0SET field.                     */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT0SET_Msk (0x1UL << SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT0SET_Pos) /*!< Bit mask of
                                                                            DMA_TXDONE_PROTOCOLT0SET field.*/
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT0SET_Min (0x0UL) /*!< Min enumerator value of DMA_TXDONE_PROTOCOLT0SET field.       */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT0SET_Max (0x1UL) /*!< Max enumerator value of DMA_TXDONE_PROTOCOLT0SET field.       */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT0SET_Disabled (0x0UL) /*!< Disable shortcut                                         */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT0SET_Enabled (0x1UL) /*!< Enable shortcut                                           */

/* DMA_TXDONE_PROTOCOLT1SET @Bit 3 : Shortcut between event DMA.TXDONE and task PROTOCOLT1SET */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT1SET_Pos (3UL) /*!< Position of DMA_TXDONE_PROTOCOLT1SET field.                     */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT1SET_Msk (0x1UL << SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT1SET_Pos) /*!< Bit mask of
                                                                            DMA_TXDONE_PROTOCOLT1SET field.*/
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT1SET_Min (0x0UL) /*!< Min enumerator value of DMA_TXDONE_PROTOCOLT1SET field.       */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT1SET_Max (0x1UL) /*!< Max enumerator value of DMA_TXDONE_PROTOCOLT1SET field.       */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT1SET_Disabled (0x0UL) /*!< Disable shortcut                                         */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLT1SET_Enabled (0x1UL) /*!< Enable shortcut                                           */

/* DMA_TXDONE_PROTOCOLNONSET @Bit 4 : Shortcut between event DMA.TXDONE and task PROTOCOLNONSET */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLNONSET_Pos (4UL) /*!< Position of DMA_TXDONE_PROTOCOLNONSET field.                   */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLNONSET_Msk (0x1UL << SIMIF_SHORTS_DMA_TXDONE_PROTOCOLNONSET_Pos) /*!< Bit mask of
                                                                            DMA_TXDONE_PROTOCOLNONSET field.*/
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLNONSET_Min (0x0UL) /*!< Min enumerator value of DMA_TXDONE_PROTOCOLNONSET field.     */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLNONSET_Max (0x1UL) /*!< Max enumerator value of DMA_TXDONE_PROTOCOLNONSET field.     */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLNONSET_Disabled (0x0UL) /*!< Disable shortcut                                        */
  #define SIMIF_SHORTS_DMA_TXDONE_PROTOCOLNONSET_Enabled (0x1UL) /*!< Enable shortcut                                          */


