adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SIMIF_INTEN: Enable or disable interrupt */
  #define SIMIF_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* DMARXSTARTED @Bit 0 : Enable or disable interrupt for event DMARXSTARTED */
  #define SIMIF_INTEN_DMARXSTARTED_Pos (0UL)         /*!< Position of DMARXSTARTED field.                                      */
  #define SIMIF_INTEN_DMARXSTARTED_Msk (0x1UL << SIMIF_INTEN_DMARXSTARTED_Pos) /*!< Bit mask of DMARXSTARTED field.            */
  #define SIMIF_INTEN_DMARXSTARTED_Min (0x0UL)       /*!< Min enumerator value of DMARXSTARTED field.                          */
  #define SIMIF_INTEN_DMARXSTARTED_Max (0x1UL)       /*!< Max enumerator value of DMARXSTARTED field.                          */
  #define SIMIF_INTEN_DMARXSTARTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define SIMIF_INTEN_DMARXSTARTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* DMARXDONE @Bit 1 : Enable or disable interrupt for event DMARXDONE */
  #define SIMIF_INTEN_DMARXDONE_Pos (1UL)            /*!< Position of DMARXDONE field.                                         */
  #define SIMIF_INTEN_DMARXDONE_Msk (0x1UL << SIMIF_INTEN_DMARXDONE_Pos) /*!< Bit mask of DMARXDONE field.                     */
  #define SIMIF_INTEN_DMARXDONE_Min (0x0UL)          /*!< Min enumerator value of DMARXDONE field.                             */
  #define SIMIF_INTEN_DMARXDONE_Max (0x1UL)          /*!< Max enumerator value of DMARXDONE field.                             */
  #define SIMIF_INTEN_DMARXDONE_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SIMIF_INTEN_DMARXDONE_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMATXSTARTED @Bit 2 : Enable or disable interrupt for event DMATXSTARTED */
  #define SIMIF_INTEN_DMATXSTARTED_Pos (2UL)         /*!< Position of DMATXSTARTED field.                                      */
  #define SIMIF_INTEN_DMATXSTARTED_Msk (0x1UL << SIMIF_INTEN_DMATXSTARTED_Pos) /*!< Bit mask of DMATXSTARTED field.            */
  #define SIMIF_INTEN_DMATXSTARTED_Min (0x0UL)       /*!< Min enumerator value of DMATXSTARTED field.                          */
  #define SIMIF_INTEN_DMATXSTARTED_Max (0x1UL)       /*!< Max enumerator value of DMATXSTARTED field.                          */
  #define SIMIF_INTEN_DMATXSTARTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define SIMIF_INTEN_DMATXSTARTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* DMATXDONE @Bit 3 : Enable or disable interrupt for event DMATXDONE */
  #define SIMIF_INTEN_DMATXDONE_Pos (3UL)            /*!< Position of DMATXDONE field.                                         */
  #define SIMIF_INTEN_DMATXDONE_Msk (0x1UL << SIMIF_INTEN_DMATXDONE_Pos) /*!< Bit mask of DMATXDONE field.                     */
  #define SIMIF_INTEN_DMATXDONE_Min (0x0UL)          /*!< Min enumerator value of DMATXDONE field.                             */
  #define SIMIF_INTEN_DMATXDONE_Max (0x1UL)          /*!< Max enumerator value of DMATXDONE field.                             */
  #define SIMIF_INTEN_DMATXDONE_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SIMIF_INTEN_DMATXDONE_Enabled (0x1UL)      /*!< Enable                                                               */

/* INVALIDCONVENTION @Bit 4 : Enable or disable interrupt for event INVALIDCONVENTION */
  #define SIMIF_INTEN_INVALIDCONVENTION_Pos (4UL)    /*!< Position of INVALIDCONVENTION field.                                 */
  #define SIMIF_INTEN_INVALIDCONVENTION_Msk (0x1UL << SIMIF_INTEN_INVALIDCONVENTION_Pos) /*!< Bit mask of INVALIDCONVENTION
                                                                            field.*/
  #define SIMIF_INTEN_INVALIDCONVENTION_Min (0x0UL)  /*!< Min enumerator value of INVALIDCONVENTION field.                     */
  #define SIMIF_INTEN_INVALIDCONVENTION_Max (0x1UL)  /*!< Max enumerator value of INVALIDCONVENTION field.                     */
  #define SIMIF_INTEN_INVALIDCONVENTION_Disabled (0x0UL) /*!< Disable                                                          */
  #define SIMIF_INTEN_INVALIDCONVENTION_Enabled (0x1UL) /*!< Enable                                                            */

/* PARITYERROR @Bit 5 : Enable or disable interrupt for event PARITYERROR */
  #define SIMIF_INTEN_PARITYERROR_Pos (5UL)          /*!< Position of PARITYERROR field.                                       */
  #define SIMIF_INTEN_PARITYERROR_Msk (0x1UL << SIMIF_INTEN_PARITYERROR_Pos) /*!< Bit mask of PARITYERROR field.               */
  #define SIMIF_INTEN_PARITYERROR_Min (0x0UL)        /*!< Min enumerator value of PARITYERROR field.                           */
  #define SIMIF_INTEN_PARITYERROR_Max (0x1UL)        /*!< Max enumerator value of PARITYERROR field.                           */
  #define SIMIF_INTEN_PARITYERROR_Disabled (0x0UL)   /*!< Disable                                                              */
  #define SIMIF_INTEN_PARITYERROR_Enabled (0x1UL)    /*!< Enable                                                               */

/* ATRTIMEOUT @Bit 6 : Enable or disable interrupt for event ATRTIMEOUT */
  #define SIMIF_INTEN_ATRTIMEOUT_Pos (6UL)           /*!< Position of ATRTIMEOUT field.                                        */
  #define SIMIF_INTEN_ATRTIMEOUT_Msk (0x1UL << SIMIF_INTEN_ATRTIMEOUT_Pos) /*!< Bit mask of ATRTIMEOUT field.                  */
  #define SIMIF_INTEN_ATRTIMEOUT_Min (0x0UL)         /*!< Min enumerator value of ATRTIMEOUT field.                            */
  #define SIMIF_INTEN_ATRTIMEOUT_Max (0x1UL)         /*!< Max enumerator value of ATRTIMEOUT field.                            */
  #define SIMIF_INTEN_ATRTIMEOUT_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SIMIF_INTEN_ATRTIMEOUT_Enabled (0x1UL)     /*!< Enable                                                               */

/* CWTIMEOUT @Bit 7 : Enable or disable interrupt for event CWTIMEOUT */
  #define SIMIF_INTEN_CWTIMEOUT_Pos (7UL)            /*!< Position of CWTIMEOUT field.                                         */
  #define SIMIF_INTEN_CWTIMEOUT_Msk (0x1UL << SIMIF_INTEN_CWTIMEOUT_Pos) /*!< Bit mask of CWTIMEOUT field.                     */
  #define SIMIF_INTEN_CWTIMEOUT_Min (0x0UL)          /*!< Min enumerator value of CWTIMEOUT field.                             */
  #define SIMIF_INTEN_CWTIMEOUT_Max (0x1UL)          /*!< Max enumerator value of CWTIMEOUT field.                             */
  #define SIMIF_INTEN_CWTIMEOUT_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SIMIF_INTEN_CWTIMEOUT_Enabled (0x1UL)      /*!< Enable                                                               */

