adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BWTIMEOUT @Bit 8 : Enable or disable interrupt for event BWTIMEOUT */
  #define SIMIF_INTEN_BWTIMEOUT_Pos (8UL)            /*!< Position of BWTIMEOUT field.                                         */
  #define SIMIF_INTEN_BWTIMEOUT_Msk (0x1UL << SIMIF_INTEN_BWTIMEOUT_Pos) /*!< Bit mask of BWTIMEOUT field.                     */
  #define SIMIF_INTEN_BWTIMEOUT_Min (0x0UL)          /*!< Min enumerator value of BWTIMEOUT field.                             */
  #define SIMIF_INTEN_BWTIMEOUT_Max (0x1UL)          /*!< Max enumerator value of BWTIMEOUT field.                             */
  #define SIMIF_INTEN_BWTIMEOUT_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SIMIF_INTEN_BWTIMEOUT_Enabled (0x1UL)      /*!< Enable                                                               */

/* SW1SW2 @Bit 9 : Enable or disable interrupt for event SW1SW2 */
  #define SIMIF_INTEN_SW1SW2_Pos (9UL)               /*!< Position of SW1SW2 field.                                            */
  #define SIMIF_INTEN_SW1SW2_Msk (0x1UL << SIMIF_INTEN_SW1SW2_Pos) /*!< Bit mask of SW1SW2 field.                              */
  #define SIMIF_INTEN_SW1SW2_Min (0x0UL)             /*!< Min enumerator value of SW1SW2 field.                                */
  #define SIMIF_INTEN_SW1SW2_Max (0x1UL)             /*!< Max enumerator value of SW1SW2 field.                                */
  #define SIMIF_INTEN_SW1SW2_Disabled (0x0UL)        /*!< Disable                                                              */
  #define SIMIF_INTEN_SW1SW2_Enabled (0x1UL)         /*!< Enable                                                               */

/* RESET @Bit 10 : Enable or disable interrupt for event RESET */
  #define SIMIF_INTEN_RESET_Pos (10UL)               /*!< Position of RESET field.                                             */
  #define SIMIF_INTEN_RESET_Msk (0x1UL << SIMIF_INTEN_RESET_Pos) /*!< Bit mask of RESET field.                                 */
  #define SIMIF_INTEN_RESET_Min (0x0UL)              /*!< Min enumerator value of RESET field.                                 */
  #define SIMIF_INTEN_RESET_Max (0x1UL)              /*!< Max enumerator value of RESET field.                                 */
  #define SIMIF_INTEN_RESET_Disabled (0x0UL)         /*!< Disable                                                              */
  #define SIMIF_INTEN_RESET_Enabled (0x1UL)          /*!< Enable                                                               */

/* INS @Bit 11 : Enable or disable interrupt for event INS */
  #define SIMIF_INTEN_INS_Pos (11UL)                 /*!< Position of INS field.                                               */
  #define SIMIF_INTEN_INS_Msk (0x1UL << SIMIF_INTEN_INS_Pos) /*!< Bit mask of INS field.                                       */
  #define SIMIF_INTEN_INS_Min (0x0UL)                /*!< Min enumerator value of INS field.                                   */
  #define SIMIF_INTEN_INS_Max (0x1UL)                /*!< Max enumerator value of INS field.                                   */
  #define SIMIF_INTEN_INS_Disabled (0x0UL)           /*!< Disable                                                              */
  #define SIMIF_INTEN_INS_Enabled (0x1UL)            /*!< Enable                                                               */

/* NINS @Bit 12 : Enable or disable interrupt for event NINS */
  #define SIMIF_INTEN_NINS_Pos (12UL)                /*!< Position of NINS field.                                              */
  #define SIMIF_INTEN_NINS_Msk (0x1UL << SIMIF_INTEN_NINS_Pos) /*!< Bit mask of NINS field.                                    */
  #define SIMIF_INTEN_NINS_Min (0x0UL)               /*!< Min enumerator value of NINS field.                                  */
  #define SIMIF_INTEN_NINS_Max (0x1UL)               /*!< Max enumerator value of NINS field.                                  */
  #define SIMIF_INTEN_NINS_Disabled (0x0UL)          /*!< Disable                                                              */
  #define SIMIF_INTEN_NINS_Enabled (0x1UL)           /*!< Enable                                                               */

/* ERROR @Bit 13 : Enable or disable interrupt for event ERROR */
  #define SIMIF_INTEN_ERROR_Pos (13UL)               /*!< Position of ERROR field.                                             */
  #define SIMIF_INTEN_ERROR_Msk (0x1UL << SIMIF_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                 */
  #define SIMIF_INTEN_ERROR_Min (0x0UL)              /*!< Min enumerator value of ERROR field.                                 */
  #define SIMIF_INTEN_ERROR_Max (0x1UL)              /*!< Max enumerator value of ERROR field.                                 */
  #define SIMIF_INTEN_ERROR_Disabled (0x0UL)         /*!< Disable                                                              */
  #define SIMIF_INTEN_ERROR_Enabled (0x1UL)          /*!< Enable                                                               */

/* READYTX @Bit 14 : Enable or disable interrupt for event READYTX */
  #define SIMIF_INTEN_READYTX_Pos (14UL)             /*!< Position of READYTX field.                                           */
  #define SIMIF_INTEN_READYTX_Msk (0x1UL << SIMIF_INTEN_READYTX_Pos) /*!< Bit mask of READYTX field.                           */
  #define SIMIF_INTEN_READYTX_Min (0x0UL)            /*!< Min enumerator value of READYTX field.                               */
  #define SIMIF_INTEN_READYTX_Max (0x1UL)            /*!< Max enumerator value of READYTX field.                               */
  #define SIMIF_INTEN_READYTX_Disabled (0x0UL)       /*!< Disable                                                              */
  #define SIMIF_INTEN_READYTX_Enabled (0x1UL)        /*!< Enable                                                               */

/* RXDATAREADY @Bit 15 : Enable or disable interrupt for event RXDATAREADY */
  #define SIMIF_INTEN_RXDATAREADY_Pos (15UL)         /*!< Position of RXDATAREADY field.                                       */
  #define SIMIF_INTEN_RXDATAREADY_Msk (0x1UL << SIMIF_INTEN_RXDATAREADY_Pos) /*!< Bit mask of RXDATAREADY field.               */
  #define SIMIF_INTEN_RXDATAREADY_Min (0x0UL)        /*!< Min enumerator value of RXDATAREADY field.                           */
  #define SIMIF_INTEN_RXDATAREADY_Max (0x1UL)        /*!< Max enumerator value of RXDATAREADY field.                           */
  #define SIMIF_INTEN_RXDATAREADY_Disabled (0x0UL)   /*!< Disable                                                              */
  #define SIMIF_INTEN_RXDATAREADY_Enabled (0x1UL)    /*!< Enable                                                               */

