adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DMARXSTARTED @Bit 0 : Write '1' to enable interrupt for event DMARXSTARTED */
  #define SIMIF_INTENSET_DMARXSTARTED_Pos (0UL)      /*!< Position of DMARXSTARTED field.                                      */
  #define SIMIF_INTENSET_DMARXSTARTED_Msk (0x1UL << SIMIF_INTENSET_DMARXSTARTED_Pos) /*!< Bit mask of DMARXSTARTED field.      */
  #define SIMIF_INTENSET_DMARXSTARTED_Min (0x0UL)    /*!< Min enumerator value of DMARXSTARTED field.                          */
  #define SIMIF_INTENSET_DMARXSTARTED_Max (0x1UL)    /*!< Max enumerator value of DMARXSTARTED field.                          */
  #define SIMIF_INTENSET_DMARXSTARTED_Set (0x1UL)    /*!< Enable                                                               */
  #define SIMIF_INTENSET_DMARXSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define SIMIF_INTENSET_DMARXSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMARXDONE @Bit 1 : Write '1' to enable interrupt for event DMARXDONE */
  #define SIMIF_INTENSET_DMARXDONE_Pos (1UL)         /*!< Position of DMARXDONE field.                                         */
  #define SIMIF_INTENSET_DMARXDONE_Msk (0x1UL << SIMIF_INTENSET_DMARXDONE_Pos) /*!< Bit mask of DMARXDONE field.               */
  #define SIMIF_INTENSET_DMARXDONE_Min (0x0UL)       /*!< Min enumerator value of DMARXDONE field.                             */
  #define SIMIF_INTENSET_DMARXDONE_Max (0x1UL)       /*!< Max enumerator value of DMARXDONE field.                             */
  #define SIMIF_INTENSET_DMARXDONE_Set (0x1UL)       /*!< Enable                                                               */
  #define SIMIF_INTENSET_DMARXDONE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_DMARXDONE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMATXSTARTED @Bit 2 : Write '1' to enable interrupt for event DMATXSTARTED */
  #define SIMIF_INTENSET_DMATXSTARTED_Pos (2UL)      /*!< Position of DMATXSTARTED field.                                      */
  #define SIMIF_INTENSET_DMATXSTARTED_Msk (0x1UL << SIMIF_INTENSET_DMATXSTARTED_Pos) /*!< Bit mask of DMATXSTARTED field.      */
  #define SIMIF_INTENSET_DMATXSTARTED_Min (0x0UL)    /*!< Min enumerator value of DMATXSTARTED field.                          */
  #define SIMIF_INTENSET_DMATXSTARTED_Max (0x1UL)    /*!< Max enumerator value of DMATXSTARTED field.                          */
  #define SIMIF_INTENSET_DMATXSTARTED_Set (0x1UL)    /*!< Enable                                                               */
  #define SIMIF_INTENSET_DMATXSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define SIMIF_INTENSET_DMATXSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMATXDONE @Bit 3 : Write '1' to enable interrupt for event DMATXDONE */
  #define SIMIF_INTENSET_DMATXDONE_Pos (3UL)         /*!< Position of DMATXDONE field.                                         */
  #define SIMIF_INTENSET_DMATXDONE_Msk (0x1UL << SIMIF_INTENSET_DMATXDONE_Pos) /*!< Bit mask of DMATXDONE field.               */
  #define SIMIF_INTENSET_DMATXDONE_Min (0x0UL)       /*!< Min enumerator value of DMATXDONE field.                             */
  #define SIMIF_INTENSET_DMATXDONE_Max (0x1UL)       /*!< Max enumerator value of DMATXDONE field.                             */
  #define SIMIF_INTENSET_DMATXDONE_Set (0x1UL)       /*!< Enable                                                               */
  #define SIMIF_INTENSET_DMATXDONE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_DMATXDONE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* INVALIDCONVENTION @Bit 4 : Write '1' to enable interrupt for event INVALIDCONVENTION */
  #define SIMIF_INTENSET_INVALIDCONVENTION_Pos (4UL) /*!< Position of INVALIDCONVENTION field.                                 */
  #define SIMIF_INTENSET_INVALIDCONVENTION_Msk (0x1UL << SIMIF_INTENSET_INVALIDCONVENTION_Pos) /*!< Bit mask of
                                                                            INVALIDCONVENTION field.*/
  #define SIMIF_INTENSET_INVALIDCONVENTION_Min (0x0UL) /*!< Min enumerator value of INVALIDCONVENTION field.                   */
  #define SIMIF_INTENSET_INVALIDCONVENTION_Max (0x1UL) /*!< Max enumerator value of INVALIDCONVENTION field.                   */
  #define SIMIF_INTENSET_INVALIDCONVENTION_Set (0x1UL) /*!< Enable                                                             */
  #define SIMIF_INTENSET_INVALIDCONVENTION_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define SIMIF_INTENSET_INVALIDCONVENTION_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* PARITYERROR @Bit 5 : Write '1' to enable interrupt for event PARITYERROR */
  #define SIMIF_INTENSET_PARITYERROR_Pos (5UL)       /*!< Position of PARITYERROR field.                                       */
  #define SIMIF_INTENSET_PARITYERROR_Msk (0x1UL << SIMIF_INTENSET_PARITYERROR_Pos) /*!< Bit mask of PARITYERROR field.         */
  #define SIMIF_INTENSET_PARITYERROR_Min (0x0UL)     /*!< Min enumerator value of PARITYERROR field.                           */
  #define SIMIF_INTENSET_PARITYERROR_Max (0x1UL)     /*!< Max enumerator value of PARITYERROR field.                           */
  #define SIMIF_INTENSET_PARITYERROR_Set (0x1UL)     /*!< Enable                                                               */
  #define SIMIF_INTENSET_PARITYERROR_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENSET_PARITYERROR_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ATRTIMEOUT @Bit 6 : Write '1' to enable interrupt for event ATRTIMEOUT */
  #define SIMIF_INTENSET_ATRTIMEOUT_Pos (6UL)        /*!< Position of ATRTIMEOUT field.                                        */
  #define SIMIF_INTENSET_ATRTIMEOUT_Msk (0x1UL << SIMIF_INTENSET_ATRTIMEOUT_Pos) /*!< Bit mask of ATRTIMEOUT field.            */
  #define SIMIF_INTENSET_ATRTIMEOUT_Min (0x0UL)      /*!< Min enumerator value of ATRTIMEOUT field.                            */
  #define SIMIF_INTENSET_ATRTIMEOUT_Max (0x1UL)      /*!< Max enumerator value of ATRTIMEOUT field.                            */
  #define SIMIF_INTENSET_ATRTIMEOUT_Set (0x1UL)      /*!< Enable                                                               */
  #define SIMIF_INTENSET_ATRTIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_ATRTIMEOUT_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

