adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CWTIMEOUT @Bit 7 : Write '1' to enable interrupt for event CWTIMEOUT */
  #define SIMIF_INTENSET_CWTIMEOUT_Pos (7UL)         /*!< Position of CWTIMEOUT field.                                         */
  #define SIMIF_INTENSET_CWTIMEOUT_Msk (0x1UL << SIMIF_INTENSET_CWTIMEOUT_Pos) /*!< Bit mask of CWTIMEOUT field.               */
  #define SIMIF_INTENSET_CWTIMEOUT_Min (0x0UL)       /*!< Min enumerator value of CWTIMEOUT field.                             */
  #define SIMIF_INTENSET_CWTIMEOUT_Max (0x1UL)       /*!< Max enumerator value of CWTIMEOUT field.                             */
  #define SIMIF_INTENSET_CWTIMEOUT_Set (0x1UL)       /*!< Enable                                                               */
  #define SIMIF_INTENSET_CWTIMEOUT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_CWTIMEOUT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* BWTIMEOUT @Bit 8 : Write '1' to enable interrupt for event BWTIMEOUT */
  #define SIMIF_INTENSET_BWTIMEOUT_Pos (8UL)         /*!< Position of BWTIMEOUT field.                                         */
  #define SIMIF_INTENSET_BWTIMEOUT_Msk (0x1UL << SIMIF_INTENSET_BWTIMEOUT_Pos) /*!< Bit mask of BWTIMEOUT field.               */
  #define SIMIF_INTENSET_BWTIMEOUT_Min (0x0UL)       /*!< Min enumerator value of BWTIMEOUT field.                             */
  #define SIMIF_INTENSET_BWTIMEOUT_Max (0x1UL)       /*!< Max enumerator value of BWTIMEOUT field.                             */
  #define SIMIF_INTENSET_BWTIMEOUT_Set (0x1UL)       /*!< Enable                                                               */
  #define SIMIF_INTENSET_BWTIMEOUT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_BWTIMEOUT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SW1SW2 @Bit 9 : Write '1' to enable interrupt for event SW1SW2 */
  #define SIMIF_INTENSET_SW1SW2_Pos (9UL)            /*!< Position of SW1SW2 field.                                            */
  #define SIMIF_INTENSET_SW1SW2_Msk (0x1UL << SIMIF_INTENSET_SW1SW2_Pos) /*!< Bit mask of SW1SW2 field.                        */
  #define SIMIF_INTENSET_SW1SW2_Min (0x0UL)          /*!< Min enumerator value of SW1SW2 field.                                */
  #define SIMIF_INTENSET_SW1SW2_Max (0x1UL)          /*!< Max enumerator value of SW1SW2 field.                                */
  #define SIMIF_INTENSET_SW1SW2_Set (0x1UL)          /*!< Enable                                                               */
  #define SIMIF_INTENSET_SW1SW2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_SW1SW2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* RESET @Bit 10 : Write '1' to enable interrupt for event RESET */
  #define SIMIF_INTENSET_RESET_Pos (10UL)            /*!< Position of RESET field.                                             */
  #define SIMIF_INTENSET_RESET_Msk (0x1UL << SIMIF_INTENSET_RESET_Pos) /*!< Bit mask of RESET field.                           */
  #define SIMIF_INTENSET_RESET_Min (0x0UL)           /*!< Min enumerator value of RESET field.                                 */
  #define SIMIF_INTENSET_RESET_Max (0x1UL)           /*!< Max enumerator value of RESET field.                                 */
  #define SIMIF_INTENSET_RESET_Set (0x1UL)           /*!< Enable                                                               */
  #define SIMIF_INTENSET_RESET_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_RESET_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* INS @Bit 11 : Write '1' to enable interrupt for event INS */
  #define SIMIF_INTENSET_INS_Pos (11UL)              /*!< Position of INS field.                                               */
  #define SIMIF_INTENSET_INS_Msk (0x1UL << SIMIF_INTENSET_INS_Pos) /*!< Bit mask of INS field.                                 */
  #define SIMIF_INTENSET_INS_Min (0x0UL)             /*!< Min enumerator value of INS field.                                   */
  #define SIMIF_INTENSET_INS_Max (0x1UL)             /*!< Max enumerator value of INS field.                                   */
  #define SIMIF_INTENSET_INS_Set (0x1UL)             /*!< Enable                                                               */
  #define SIMIF_INTENSET_INS_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_INS_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* NINS @Bit 12 : Write '1' to enable interrupt for event NINS */
  #define SIMIF_INTENSET_NINS_Pos (12UL)             /*!< Position of NINS field.                                              */
  #define SIMIF_INTENSET_NINS_Msk (0x1UL << SIMIF_INTENSET_NINS_Pos) /*!< Bit mask of NINS field.                              */
  #define SIMIF_INTENSET_NINS_Min (0x0UL)            /*!< Min enumerator value of NINS field.                                  */
  #define SIMIF_INTENSET_NINS_Max (0x1UL)            /*!< Max enumerator value of NINS field.                                  */
  #define SIMIF_INTENSET_NINS_Set (0x1UL)            /*!< Enable                                                               */
  #define SIMIF_INTENSET_NINS_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_NINS_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* ERROR @Bit 13 : Write '1' to enable interrupt for event ERROR */
  #define SIMIF_INTENSET_ERROR_Pos (13UL)            /*!< Position of ERROR field.                                             */
  #define SIMIF_INTENSET_ERROR_Msk (0x1UL << SIMIF_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                           */
  #define SIMIF_INTENSET_ERROR_Min (0x0UL)           /*!< Min enumerator value of ERROR field.                                 */
  #define SIMIF_INTENSET_ERROR_Max (0x1UL)           /*!< Max enumerator value of ERROR field.                                 */
  #define SIMIF_INTENSET_ERROR_Set (0x1UL)           /*!< Enable                                                               */
  #define SIMIF_INTENSET_ERROR_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_ERROR_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYTX @Bit 14 : Write '1' to enable interrupt for event READYTX */
  #define SIMIF_INTENSET_READYTX_Pos (14UL)          /*!< Position of READYTX field.                                           */
  #define SIMIF_INTENSET_READYTX_Msk (0x1UL << SIMIF_INTENSET_READYTX_Pos) /*!< Bit mask of READYTX field.                     */
  #define SIMIF_INTENSET_READYTX_Min (0x0UL)         /*!< Min enumerator value of READYTX field.                               */
  #define SIMIF_INTENSET_READYTX_Max (0x1UL)         /*!< Max enumerator value of READYTX field.                               */
  #define SIMIF_INTENSET_READYTX_Set (0x1UL)         /*!< Enable                                                               */
  #define SIMIF_INTENSET_READYTX_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_READYTX_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* RXDATAREADY @Bit 15 : Write '1' to enable interrupt for event RXDATAREADY */
  #define SIMIF_INTENSET_RXDATAREADY_Pos (15UL)      /*!< Position of RXDATAREADY field.                                       */
  #define SIMIF_INTENSET_RXDATAREADY_Msk (0x1UL << SIMIF_INTENSET_RXDATAREADY_Pos) /*!< Bit mask of RXDATAREADY field.         */
  #define SIMIF_INTENSET_RXDATAREADY_Min (0x0UL)     /*!< Min enumerator value of RXDATAREADY field.                           */
  #define SIMIF_INTENSET_RXDATAREADY_Max (0x1UL)     /*!< Max enumerator value of RXDATAREADY field.                           */
  #define SIMIF_INTENSET_RXDATAREADY_Set (0x1UL)     /*!< Enable                                                               */
  #define SIMIF_INTENSET_RXDATAREADY_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENSET_RXDATAREADY_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* T1RXOVERRUN @Bit 16 : Write '1' to enable interrupt for event T1RXOVERRUN */
  #define SIMIF_INTENSET_T1RXOVERRUN_Pos (16UL)      /*!< Position of T1RXOVERRUN field.                                       */
  #define SIMIF_INTENSET_T1RXOVERRUN_Msk (0x1UL << SIMIF_INTENSET_T1RXOVERRUN_Pos) /*!< Bit mask of T1RXOVERRUN field.         */
  #define SIMIF_INTENSET_T1RXOVERRUN_Min (0x0UL)     /*!< Min enumerator value of T1RXOVERRUN field.                           */
  #define SIMIF_INTENSET_T1RXOVERRUN_Max (0x1UL)     /*!< Max enumerator value of T1RXOVERRUN field.                           */
  #define SIMIF_INTENSET_T1RXOVERRUN_Set (0x1UL)     /*!< Enable                                                               */
  #define SIMIF_INTENSET_T1RXOVERRUN_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENSET_T1RXOVERRUN_Enabled (0x1UL) /*!< Read: Enabled                                                        */

