adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DMATXSTARTED @Bit 2 : Read pending status of interrupt for event DMATXSTARTED */
  #define SIMIF_INTPEND_DMATXSTARTED_Pos (2UL)       /*!< Position of DMATXSTARTED field.                                      */
  #define SIMIF_INTPEND_DMATXSTARTED_Msk (0x1UL << SIMIF_INTPEND_DMATXSTARTED_Pos) /*!< Bit mask of DMATXSTARTED field.        */
  #define SIMIF_INTPEND_DMATXSTARTED_Min (0x0UL)     /*!< Min enumerator value of DMATXSTARTED field.                          */
  #define SIMIF_INTPEND_DMATXSTARTED_Max (0x1UL)     /*!< Max enumerator value of DMATXSTARTED field.                          */
  #define SIMIF_INTPEND_DMATXSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define SIMIF_INTPEND_DMATXSTARTED_Pending (0x1UL) /*!< Read: Pending                                                        */

/* DMATXDONE @Bit 3 : Read pending status of interrupt for event DMATXDONE */
  #define SIMIF_INTPEND_DMATXDONE_Pos (3UL)          /*!< Position of DMATXDONE field.                                         */
  #define SIMIF_INTPEND_DMATXDONE_Msk (0x1UL << SIMIF_INTPEND_DMATXDONE_Pos) /*!< Bit mask of DMATXDONE field.                 */
  #define SIMIF_INTPEND_DMATXDONE_Min (0x0UL)        /*!< Min enumerator value of DMATXDONE field.                             */
  #define SIMIF_INTPEND_DMATXDONE_Max (0x1UL)        /*!< Max enumerator value of DMATXDONE field.                             */
  #define SIMIF_INTPEND_DMATXDONE_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_DMATXDONE_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* INVALIDCONVENTION @Bit 4 : Read pending status of interrupt for event INVALIDCONVENTION */
  #define SIMIF_INTPEND_INVALIDCONVENTION_Pos (4UL)  /*!< Position of INVALIDCONVENTION field.                                 */
  #define SIMIF_INTPEND_INVALIDCONVENTION_Msk (0x1UL << SIMIF_INTPEND_INVALIDCONVENTION_Pos) /*!< Bit mask of INVALIDCONVENTION
                                                                            field.*/
  #define SIMIF_INTPEND_INVALIDCONVENTION_Min (0x0UL) /*!< Min enumerator value of INVALIDCONVENTION field.                    */
  #define SIMIF_INTPEND_INVALIDCONVENTION_Max (0x1UL) /*!< Max enumerator value of INVALIDCONVENTION field.                    */
  #define SIMIF_INTPEND_INVALIDCONVENTION_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define SIMIF_INTPEND_INVALIDCONVENTION_Pending (0x1UL) /*!< Read: Pending                                                   */

/* PARITYERROR @Bit 5 : Read pending status of interrupt for event PARITYERROR */
  #define SIMIF_INTPEND_PARITYERROR_Pos (5UL)        /*!< Position of PARITYERROR field.                                       */
  #define SIMIF_INTPEND_PARITYERROR_Msk (0x1UL << SIMIF_INTPEND_PARITYERROR_Pos) /*!< Bit mask of PARITYERROR field.           */
  #define SIMIF_INTPEND_PARITYERROR_Min (0x0UL)      /*!< Min enumerator value of PARITYERROR field.                           */
  #define SIMIF_INTPEND_PARITYERROR_Max (0x1UL)      /*!< Max enumerator value of PARITYERROR field.                           */
  #define SIMIF_INTPEND_PARITYERROR_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define SIMIF_INTPEND_PARITYERROR_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* ATRTIMEOUT @Bit 6 : Read pending status of interrupt for event ATRTIMEOUT */
  #define SIMIF_INTPEND_ATRTIMEOUT_Pos (6UL)         /*!< Position of ATRTIMEOUT field.                                        */
  #define SIMIF_INTPEND_ATRTIMEOUT_Msk (0x1UL << SIMIF_INTPEND_ATRTIMEOUT_Pos) /*!< Bit mask of ATRTIMEOUT field.              */
  #define SIMIF_INTPEND_ATRTIMEOUT_Min (0x0UL)       /*!< Min enumerator value of ATRTIMEOUT field.                            */
  #define SIMIF_INTPEND_ATRTIMEOUT_Max (0x1UL)       /*!< Max enumerator value of ATRTIMEOUT field.                            */
  #define SIMIF_INTPEND_ATRTIMEOUT_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define SIMIF_INTPEND_ATRTIMEOUT_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* CWTIMEOUT @Bit 7 : Read pending status of interrupt for event CWTIMEOUT */
  #define SIMIF_INTPEND_CWTIMEOUT_Pos (7UL)          /*!< Position of CWTIMEOUT field.                                         */
  #define SIMIF_INTPEND_CWTIMEOUT_Msk (0x1UL << SIMIF_INTPEND_CWTIMEOUT_Pos) /*!< Bit mask of CWTIMEOUT field.                 */
  #define SIMIF_INTPEND_CWTIMEOUT_Min (0x0UL)        /*!< Min enumerator value of CWTIMEOUT field.                             */
  #define SIMIF_INTPEND_CWTIMEOUT_Max (0x1UL)        /*!< Max enumerator value of CWTIMEOUT field.                             */
  #define SIMIF_INTPEND_CWTIMEOUT_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_CWTIMEOUT_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* BWTIMEOUT @Bit 8 : Read pending status of interrupt for event BWTIMEOUT */
  #define SIMIF_INTPEND_BWTIMEOUT_Pos (8UL)          /*!< Position of BWTIMEOUT field.                                         */
  #define SIMIF_INTPEND_BWTIMEOUT_Msk (0x1UL << SIMIF_INTPEND_BWTIMEOUT_Pos) /*!< Bit mask of BWTIMEOUT field.                 */
  #define SIMIF_INTPEND_BWTIMEOUT_Min (0x0UL)        /*!< Min enumerator value of BWTIMEOUT field.                             */
  #define SIMIF_INTPEND_BWTIMEOUT_Max (0x1UL)        /*!< Max enumerator value of BWTIMEOUT field.                             */
  #define SIMIF_INTPEND_BWTIMEOUT_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_BWTIMEOUT_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SW1SW2 @Bit 9 : Read pending status of interrupt for event SW1SW2 */
  #define SIMIF_INTPEND_SW1SW2_Pos (9UL)             /*!< Position of SW1SW2 field.                                            */
  #define SIMIF_INTPEND_SW1SW2_Msk (0x1UL << SIMIF_INTPEND_SW1SW2_Pos) /*!< Bit mask of SW1SW2 field.                          */
  #define SIMIF_INTPEND_SW1SW2_Min (0x0UL)           /*!< Min enumerator value of SW1SW2 field.                                */
  #define SIMIF_INTPEND_SW1SW2_Max (0x1UL)           /*!< Max enumerator value of SW1SW2 field.                                */
  #define SIMIF_INTPEND_SW1SW2_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_SW1SW2_Pending (0x1UL)       /*!< Read: Pending                                                        */

