adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RESET @Bit 10 : Read pending status of interrupt for event RESET */
  #define SIMIF_INTPEND_RESET_Pos (10UL)             /*!< Position of RESET field.                                             */
  #define SIMIF_INTPEND_RESET_Msk (0x1UL << SIMIF_INTPEND_RESET_Pos) /*!< Bit mask of RESET field.                             */
  #define SIMIF_INTPEND_RESET_Min (0x0UL)            /*!< Min enumerator value of RESET field.                                 */
  #define SIMIF_INTPEND_RESET_Max (0x1UL)            /*!< Max enumerator value of RESET field.                                 */
  #define SIMIF_INTPEND_RESET_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_RESET_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* INS @Bit 11 : Read pending status of interrupt for event INS */
  #define SIMIF_INTPEND_INS_Pos (11UL)               /*!< Position of INS field.                                               */
  #define SIMIF_INTPEND_INS_Msk (0x1UL << SIMIF_INTPEND_INS_Pos) /*!< Bit mask of INS field.                                   */
  #define SIMIF_INTPEND_INS_Min (0x0UL)              /*!< Min enumerator value of INS field.                                   */
  #define SIMIF_INTPEND_INS_Max (0x1UL)              /*!< Max enumerator value of INS field.                                   */
  #define SIMIF_INTPEND_INS_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_INS_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* NINS @Bit 12 : Read pending status of interrupt for event NINS */
  #define SIMIF_INTPEND_NINS_Pos (12UL)              /*!< Position of NINS field.                                              */
  #define SIMIF_INTPEND_NINS_Msk (0x1UL << SIMIF_INTPEND_NINS_Pos) /*!< Bit mask of NINS field.                                */
  #define SIMIF_INTPEND_NINS_Min (0x0UL)             /*!< Min enumerator value of NINS field.                                  */
  #define SIMIF_INTPEND_NINS_Max (0x1UL)             /*!< Max enumerator value of NINS field.                                  */
  #define SIMIF_INTPEND_NINS_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_NINS_Pending (0x1UL)         /*!< Read: Pending                                                        */

/* ERROR @Bit 13 : Read pending status of interrupt for event ERROR */
  #define SIMIF_INTPEND_ERROR_Pos (13UL)             /*!< Position of ERROR field.                                             */
  #define SIMIF_INTPEND_ERROR_Msk (0x1UL << SIMIF_INTPEND_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define SIMIF_INTPEND_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define SIMIF_INTPEND_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define SIMIF_INTPEND_ERROR_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_ERROR_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* READYTX @Bit 14 : Read pending status of interrupt for event READYTX */
  #define SIMIF_INTPEND_READYTX_Pos (14UL)           /*!< Position of READYTX field.                                           */
  #define SIMIF_INTPEND_READYTX_Msk (0x1UL << SIMIF_INTPEND_READYTX_Pos) /*!< Bit mask of READYTX field.                       */
  #define SIMIF_INTPEND_READYTX_Min (0x0UL)          /*!< Min enumerator value of READYTX field.                               */
  #define SIMIF_INTPEND_READYTX_Max (0x1UL)          /*!< Max enumerator value of READYTX field.                               */
  #define SIMIF_INTPEND_READYTX_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_READYTX_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* RXDATAREADY @Bit 15 : Read pending status of interrupt for event RXDATAREADY */
  #define SIMIF_INTPEND_RXDATAREADY_Pos (15UL)       /*!< Position of RXDATAREADY field.                                       */
  #define SIMIF_INTPEND_RXDATAREADY_Msk (0x1UL << SIMIF_INTPEND_RXDATAREADY_Pos) /*!< Bit mask of RXDATAREADY field.           */
  #define SIMIF_INTPEND_RXDATAREADY_Min (0x0UL)      /*!< Min enumerator value of RXDATAREADY field.                           */
  #define SIMIF_INTPEND_RXDATAREADY_Max (0x1UL)      /*!< Max enumerator value of RXDATAREADY field.                           */
  #define SIMIF_INTPEND_RXDATAREADY_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define SIMIF_INTPEND_RXDATAREADY_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* T1RXOVERRUN @Bit 16 : Read pending status of interrupt for event T1RXOVERRUN */
  #define SIMIF_INTPEND_T1RXOVERRUN_Pos (16UL)       /*!< Position of T1RXOVERRUN field.                                       */
  #define SIMIF_INTPEND_T1RXOVERRUN_Msk (0x1UL << SIMIF_INTPEND_T1RXOVERRUN_Pos) /*!< Bit mask of T1RXOVERRUN field.           */
  #define SIMIF_INTPEND_T1RXOVERRUN_Min (0x0UL)      /*!< Min enumerator value of T1RXOVERRUN field.                           */
  #define SIMIF_INTPEND_T1RXOVERRUN_Max (0x1UL)      /*!< Max enumerator value of T1RXOVERRUN field.                           */
  #define SIMIF_INTPEND_T1RXOVERRUN_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define SIMIF_INTPEND_T1RXOVERRUN_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* T1TXABORTED @Bit 17 : Read pending status of interrupt for event T1TXABORTED */
  #define SIMIF_INTPEND_T1TXABORTED_Pos (17UL)       /*!< Position of T1TXABORTED field.                                       */
  #define SIMIF_INTPEND_T1TXABORTED_Msk (0x1UL << SIMIF_INTPEND_T1TXABORTED_Pos) /*!< Bit mask of T1TXABORTED field.           */
  #define SIMIF_INTPEND_T1TXABORTED_Min (0x0UL)      /*!< Min enumerator value of T1TXABORTED field.                           */
  #define SIMIF_INTPEND_T1TXABORTED_Max (0x1UL)      /*!< Max enumerator value of T1TXABORTED field.                           */
  #define SIMIF_INTPEND_T1TXABORTED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define SIMIF_INTPEND_T1TXABORTED_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* T1NONIBLOCK @Bit 18 : Read pending status of interrupt for event T1NONIBLOCK */
  #define SIMIF_INTPEND_T1NONIBLOCK_Pos (18UL)       /*!< Position of T1NONIBLOCK field.                                       */
  #define SIMIF_INTPEND_T1NONIBLOCK_Msk (0x1UL << SIMIF_INTPEND_T1NONIBLOCK_Pos) /*!< Bit mask of T1NONIBLOCK field.           */
  #define SIMIF_INTPEND_T1NONIBLOCK_Min (0x0UL)      /*!< Min enumerator value of T1NONIBLOCK field.                           */
  #define SIMIF_INTPEND_T1NONIBLOCK_Max (0x1UL)      /*!< Max enumerator value of T1NONIBLOCK field.                           */
  #define SIMIF_INTPEND_T1NONIBLOCK_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define SIMIF_INTPEND_T1NONIBLOCK_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* T1LENERROR @Bit 19 : Read pending status of interrupt for event T1LENERROR */
  #define SIMIF_INTPEND_T1LENERROR_Pos (19UL)        /*!< Position of T1LENERROR field.                                        */
  #define SIMIF_INTPEND_T1LENERROR_Msk (0x1UL << SIMIF_INTPEND_T1LENERROR_Pos) /*!< Bit mask of T1LENERROR field.              */
  #define SIMIF_INTPEND_T1LENERROR_Min (0x0UL)       /*!< Min enumerator value of T1LENERROR field.                            */
  #define SIMIF_INTPEND_T1LENERROR_Max (0x1UL)       /*!< Max enumerator value of T1LENERROR field.                            */
  #define SIMIF_INTPEND_T1LENERROR_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define SIMIF_INTPEND_T1LENERROR_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* EDCERROR @Bit 20 : Read pending status of interrupt for event EDCERROR */
  #define SIMIF_INTPEND_EDCERROR_Pos (20UL)          /*!< Position of EDCERROR field.                                          */
  #define SIMIF_INTPEND_EDCERROR_Msk (0x1UL << SIMIF_INTPEND_EDCERROR_Pos) /*!< Bit mask of EDCERROR field.                    */
  #define SIMIF_INTPEND_EDCERROR_Min (0x0UL)         /*!< Min enumerator value of EDCERROR field.                              */
  #define SIMIF_INTPEND_EDCERROR_Max (0x1UL)         /*!< Max enumerator value of EDCERROR field.                              */
  #define SIMIF_INTPEND_EDCERROR_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_EDCERROR_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* NADERROR @Bit 21 : Read pending status of interrupt for event NADERROR */
  #define SIMIF_INTPEND_NADERROR_Pos (21UL)          /*!< Position of NADERROR field.                                          */
  #define SIMIF_INTPEND_NADERROR_Msk (0x1UL << SIMIF_INTPEND_NADERROR_Pos) /*!< Bit mask of NADERROR field.                    */
  #define SIMIF_INTPEND_NADERROR_Min (0x0UL)         /*!< Min enumerator value of NADERROR field.                              */
  #define SIMIF_INTPEND_NADERROR_Max (0x1UL)         /*!< Max enumerator value of NADERROR field.                              */
  #define SIMIF_INTPEND_NADERROR_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_NADERROR_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* ERRORCOUNTMAX @Bit 22 : Read pending status of interrupt for event ERRORCOUNTMAX */
  #define SIMIF_INTPEND_ERRORCOUNTMAX_Pos (22UL)     /*!< Position of ERRORCOUNTMAX field.                                     */
  #define SIMIF_INTPEND_ERRORCOUNTMAX_Msk (0x1UL << SIMIF_INTPEND_ERRORCOUNTMAX_Pos) /*!< Bit mask of ERRORCOUNTMAX field.     */
  #define SIMIF_INTPEND_ERRORCOUNTMAX_Min (0x0UL)    /*!< Min enumerator value of ERRORCOUNTMAX field.                         */
  #define SIMIF_INTPEND_ERRORCOUNTMAX_Max (0x1UL)    /*!< Max enumerator value of ERRORCOUNTMAX field.                         */
  #define SIMIF_INTPEND_ERRORCOUNTMAX_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define SIMIF_INTPEND_ERRORCOUNTMAX_Pending (0x1UL) /*!< Read: Pending                                                       */

/* T1RXMORE @Bit 23 : Read pending status of interrupt for event T1RXMORE */
  #define SIMIF_INTPEND_T1RXMORE_Pos (23UL)          /*!< Position of T1RXMORE field.                                          */
  #define SIMIF_INTPEND_T1RXMORE_Msk (0x1UL << SIMIF_INTPEND_T1RXMORE_Pos) /*!< Bit mask of T1RXMORE field.                    */
  #define SIMIF_INTPEND_T1RXMORE_Min (0x0UL)         /*!< Min enumerator value of T1RXMORE field.                              */
  #define SIMIF_INTPEND_T1RXMORE_Max (0x1UL)         /*!< Max enumerator value of T1RXMORE field.                              */
  #define SIMIF_INTPEND_T1RXMORE_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_T1RXMORE_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* T1RXFRAMEEND @Bit 24 : Read pending status of interrupt for event T1RXFRAMEEND */
  #define SIMIF_INTPEND_T1RXFRAMEEND_Pos (24UL)      /*!< Position of T1RXFRAMEEND field.                                      */
  #define SIMIF_INTPEND_T1RXFRAMEEND_Msk (0x1UL << SIMIF_INTPEND_T1RXFRAMEEND_Pos) /*!< Bit mask of T1RXFRAMEEND field.        */
  #define SIMIF_INTPEND_T1RXFRAMEEND_Min (0x0UL)     /*!< Min enumerator value of T1RXFRAMEEND field.                          */
  #define SIMIF_INTPEND_T1RXFRAMEEND_Max (0x1UL)     /*!< Max enumerator value of T1RXFRAMEEND field.                          */
  #define SIMIF_INTPEND_T1RXFRAMEEND_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define SIMIF_INTPEND_T1RXFRAMEEND_Pending (0x1UL) /*!< Read: Pending                                                        */


