adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SIMIF_SW1SW2: Sw1 and Sw2 bytes received from Sim card in T=1 mode */
  #define SIMIF_SW1SW2_ResetValue (0x00000000UL)     /*!< Reset value of SW1SW2 register.                                      */

/* SW1 @Bits 0..7 : Sw1 data byte received */
  #define SIMIF_SW1SW2_SW1_Pos (0UL)                 /*!< Position of SW1 field.                                               */
  #define SIMIF_SW1SW2_SW1_Msk (0xFFUL << SIMIF_SW1SW2_SW1_Pos) /*!< Bit mask of SW1 field.                                    */

/* SW2 @Bits 8..15 : Sw2 data byte received */
  #define SIMIF_SW1SW2_SW2_Pos (8UL)                 /*!< Position of SW2 field.                                               */
  #define SIMIF_SW1SW2_SW2_Msk (0xFFUL << SIMIF_SW1SW2_SW2_Pos) /*!< Bit mask of SW2 field.                                    */


/* SIMIF_CONVENTION: Data convention used in traffic between controller and SIM card */
  #define SIMIF_CONVENTION_ResetValue (0x00000000UL) /*!< Reset value of CONVENTION register.                                  */

/* DATACONVENTION @Bit 0 : Data convention between controller and SIM card */
  #define SIMIF_CONVENTION_DATACONVENTION_Pos (0UL)  /*!< Position of DATACONVENTION field.                                    */
  #define SIMIF_CONVENTION_DATACONVENTION_Msk (0x1UL << SIMIF_CONVENTION_DATACONVENTION_Pos) /*!< Bit mask of DATACONVENTION
                                                                            field.*/
  #define SIMIF_CONVENTION_DATACONVENTION_Min (0x0UL) /*!< Min enumerator value of DATACONVENTION field.                       */
  #define SIMIF_CONVENTION_DATACONVENTION_Max (0x1UL) /*!< Max enumerator value of DATACONVENTION field.                       */
  #define SIMIF_CONVENTION_DATACONVENTION_Direct (0x0UL) /*!< Direct convention: 1 = High, LSB first                           */
  #define SIMIF_CONVENTION_DATACONVENTION_Inverse (0x1UL) /*!< Inverse convention: 1 = Low, MSB first                          */


/* SIMIF_LRCOUT: Latest generated LRC value */
  #define SIMIF_LRCOUT_ResetValue (0x00000000UL)     /*!< Reset value of LRCOUT register.                                      */

/* LRCOUT @Bits 0..7 : Latest generated LRC value */
  #define SIMIF_LRCOUT_LRCOUT_Pos (0UL)              /*!< Position of LRCOUT field.                                            */
  #define SIMIF_LRCOUT_LRCOUT_Msk (0xFFUL << SIMIF_LRCOUT_LRCOUT_Pos) /*!< Bit mask of LRCOUT field.                           */


/* SIMIF_RXDATA: NonDMA received data */
  #define SIMIF_RXDATA_ResetValue (0x00000000UL)     /*!< Reset value of RXDATA register.                                      */

/* RXDATA @Bits 0..7 : NonDMA received data or Rx data of T=1 S block if RxBufferLength = 3 */
  #define SIMIF_RXDATA_RXDATA_Pos (0UL)              /*!< Position of RXDATA field.                                            */
  #define SIMIF_RXDATA_RXDATA_Msk (0xFFUL << SIMIF_RXDATA_RXDATA_Pos) /*!< Bit mask of RXDATA field.                           */


/* SIMIF_T0SWXCOUNT: Number of SWx bytes received after T=0 Rx DMA finished */
  #define SIMIF_T0SWXCOUNT_ResetValue (0x00000000UL) /*!< Reset value of T0SWXCOUNT register.                                  */

/* T0SWXCOUNT @Bits 0..1 : Number of SWx bytes received after T=0 Rx DMA finished */
  #define SIMIF_T0SWXCOUNT_T0SWXCOUNT_Pos (0UL)      /*!< Position of T0SWXCOUNT field.                                        */
  #define SIMIF_T0SWXCOUNT_T0SWXCOUNT_Msk (0x3UL << SIMIF_T0SWXCOUNT_T0SWXCOUNT_Pos) /*!< Bit mask of T0SWXCOUNT field.        */


/* SIMIF_CLKRATE: Divider value for setting the clock rate to the SIM card. */
  #define SIMIF_CLKRATE_ResetValue (0x00000018UL)    /*!< Reset value of CLKRATE register.                                     */

/* CLOCKRATE @Bits 0..6 : Divider for setting the clock frequency to the SIM card clock (clock = input clock / ClockRate */
  #define SIMIF_CLKRATE_CLOCKRATE_Pos (0UL)          /*!< Position of CLOCKRATE field.                                         */
  #define SIMIF_CLKRATE_CLOCKRATE_Msk (0x7FUL << SIMIF_CLKRATE_CLOCKRATE_Pos) /*!< Bit mask of CLOCKRATE field.                */


/* SIMIF_BAUDRATE: Divider value for setting the baud rate to the SIM card. */
  #define SIMIF_BAUDRATE_ResetValue (0x00000174UL)   /*!< Reset value of BAUDRATE register.                                    */

/* BAUDRATE @Bits 0..8 : Divider for setting the baud rate to the SIM card.(Baud rate = Sim card clock/BaudRate). */
  #define SIMIF_BAUDRATE_BAUDRATE_Pos (0UL)          /*!< Position of BAUDRATE field.                                          */
  #define SIMIF_BAUDRATE_BAUDRATE_Msk (0x1FFUL << SIMIF_BAUDRATE_BAUDRATE_Pos) /*!< Bit mask of BAUDRATE field.                */


/* SIMIF_CHARACTERGUARDTIME: Character Guard time */
  #define SIMIF_CHARACTERGUARDTIME_ResetValue (0x0000000CUL) /*!< Reset value of CHARACTERGUARDTIME register.                  */

/* CHARACTERGUARDTIME @Bits 0..7 : Guard time from leading edge of the character to the leading edge of the next character in
                                   ETU */

  #define SIMIF_CHARACTERGUARDTIME_CHARACTERGUARDTIME_Pos (0UL) /*!< Position of CHARACTERGUARDTIME field.                     */
  #define SIMIF_CHARACTERGUARDTIME_CHARACTERGUARDTIME_Msk (0xFFUL << SIMIF_CHARACTERGUARDTIME_CHARACTERGUARDTIME_Pos) /*!< Bit
                                                                            mask of CHARACTERGUARDTIME field.*/


/* SIMIF_CHARACTERWAITTIME: Character Wait time */
  #define SIMIF_CHARACTERWAITTIME_ResetValue (0x0000000DUL) /*!< Reset value of CHARACTERWAITTIME register.                    */

/* CHARACTERWAITTIME @Bits 0..7 : T=1 character Rx wait time in ETU */
  #define SIMIF_CHARACTERWAITTIME_CHARACTERWAITTIME_Pos (0UL) /*!< Position of CHARACTERWAITTIME field.                        */
  #define SIMIF_CHARACTERWAITTIME_CHARACTERWAITTIME_Msk (0xFFUL << SIMIF_CHARACTERWAITTIME_CHARACTERWAITTIME_Pos) /*!< Bit mask
                                                                            of CHARACTERWAITTIME field.*/


