adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SIMIF_BLOCKWAITTIME: Block Wait time */
  #define SIMIF_BLOCKWAITTIME_ResetValue (0x00002580UL) /*!< Reset value of BLOCKWAITTIME register.                            */

/* BLOCKWAITTIME @Bits 0..15 : Block wait time in ETU, default 9600 */
  #define SIMIF_BLOCKWAITTIME_BLOCKWAITTIME_Pos (0UL) /*!< Position of BLOCKWAITTIME field.                                    */
  #define SIMIF_BLOCKWAITTIME_BLOCKWAITTIME_Msk (0xFFFFUL << SIMIF_BLOCKWAITTIME_BLOCKWAITTIME_Pos) /*!< Bit mask of
                                                                            BLOCKWAITTIME field.*/


/* SIMIF_PROTOCOL: Protocol selection */
  #define SIMIF_PROTOCOL_ResetValue (0x00000000UL)   /*!< Reset value of PROTOCOL register.                                    */

/* PROTOCOL @Bits 0..1 : Protocol selection 0: T=0, 1: T=1 */
  #define SIMIF_PROTOCOL_PROTOCOL_Pos (0UL)          /*!< Position of PROTOCOL field.                                          */
  #define SIMIF_PROTOCOL_PROTOCOL_Msk (0x3UL << SIMIF_PROTOCOL_PROTOCOL_Pos) /*!< Bit mask of PROTOCOL field.                  */
  #define SIMIF_PROTOCOL_PROTOCOL_Min (0x0UL)        /*!< Min enumerator value of PROTOCOL field.                              */
  #define SIMIF_PROTOCOL_PROTOCOL_Max (0x1UL)        /*!< Max enumerator value of PROTOCOL field.                              */
  #define SIMIF_PROTOCOL_PROTOCOL_T0 (0x0UL)         /*!< T=0                                                                  */
  #define SIMIF_PROTOCOL_PROTOCOL_T1 (0x1UL)         /*!< T=1                                                                  */


/* SIMIF_LOWIMPEDANCE: Low impedance driver use */
  #define SIMIF_LOWIMPEDANCE_ResetValue (0x00000000UL) /*!< Reset value of LOWIMPEDANCE register.                              */

/* LOWIMPEDANCE @Bit 0 : Low impedance driver use */
  #define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_Pos (0UL)  /*!< Position of LOWIMPEDANCE field.                                      */
  #define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_Msk (0x1UL << SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_Pos) /*!< Bit mask of LOWIMPEDANCE
                                                                            field.*/
  #define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_Min (0x0UL) /*!< Min enumerator value of LOWIMPEDANCE field.                         */
  #define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_Max (0x1UL) /*!< Max enumerator value of LOWIMPEDANCE field.                         */
  #define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_OpenDrain (0x0UL) /*!< open drain                                                    */
  #define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_LowImpedance (0x1UL) /*!< use low impedance drivers                                  */


/* SIMIF_T1PCBCONTROL: T=1 Tx PCB bits 5:6 */
  #define SIMIF_T1PCBCONTROL_ResetValue (0x00000000UL) /*!< Reset value of T1PCBCONTROL register.                              */

/* MOREDATABIT @Bit 0 : More data (chaining) bit, PCB[5] */
  #define SIMIF_T1PCBCONTROL_MOREDATABIT_Pos (0UL)   /*!< Position of MOREDATABIT field.                                       */
  #define SIMIF_T1PCBCONTROL_MOREDATABIT_Msk (0x1UL << SIMIF_T1PCBCONTROL_MOREDATABIT_Pos) /*!< Bit mask of MOREDATABIT field. */

/* SENDSEQUENCENUMBER @Bit 1 : Send Sequence number, PCB[6] */
  #define SIMIF_T1PCBCONTROL_SENDSEQUENCENUMBER_Pos (1UL) /*!< Position of SENDSEQUENCENUMBER field.                           */
  #define SIMIF_T1PCBCONTROL_SENDSEQUENCENUMBER_Msk (0x1UL << SIMIF_T1PCBCONTROL_SENDSEQUENCENUMBER_Pos) /*!< Bit mask of
                                                                            SENDSEQUENCENUMBER field.*/

/* RECEIVEDSEQUENCENUMBER @Bit 2 : Rx Send Sequence number in T1 I Block */
  #define SIMIF_T1PCBCONTROL_RECEIVEDSEQUENCENUMBER_Pos (2UL) /*!< Position of RECEIVEDSEQUENCENUMBER field.                   */
  #define SIMIF_T1PCBCONTROL_RECEIVEDSEQUENCENUMBER_Msk (0x1UL << SIMIF_T1PCBCONTROL_RECEIVEDSEQUENCENUMBER_Pos) /*!< Bit mask
                                                                            of RECEIVEDSEQUENCENUMBER field.*/


/* SIMIF_CLOCKCONTROL: Clock Control */
  #define SIMIF_CLOCKCONTROL_ResetValue (0x00000004UL) /*!< Reset value of CLOCKCONTROL register.                              */

/* ENABLE @Bit 0 : Enable clock */
  #define SIMIF_CLOCKCONTROL_ENABLE_Pos (0UL)        /*!< Position of ENABLE field.                                            */
  #define SIMIF_CLOCKCONTROL_ENABLE_Msk (0x1UL << SIMIF_CLOCKCONTROL_ENABLE_Pos) /*!< Bit mask of ENABLE field.                */
  #define SIMIF_CLOCKCONTROL_ENABLE_Min (0x0UL)      /*!< Min enumerator value of ENABLE field.                                */
  #define SIMIF_CLOCKCONTROL_ENABLE_Max (0x1UL)      /*!< Max enumerator value of ENABLE field.                                */
  #define SIMIF_CLOCKCONTROL_ENABLE_ClockOff (0x0UL) /*!< Clock is off                                                         */
  #define SIMIF_CLOCKCONTROL_ENABLE_ClockOn (0x1UL)  /*!< Clock is on                                                          */

/* CLOCKSTOP @Bits 1..2 : Clock stop state */
  #define SIMIF_CLOCKCONTROL_CLOCKSTOP_Pos (1UL)     /*!< Position of CLOCKSTOP field.                                         */
  #define SIMIF_CLOCKCONTROL_CLOCKSTOP_Msk (0x3UL << SIMIF_CLOCKCONTROL_CLOCKSTOP_Pos) /*!< Bit mask of CLOCKSTOP field.       */
  #define SIMIF_CLOCKCONTROL_CLOCKSTOP_Min (0x0UL)   /*!< Min enumerator value of CLOCKSTOP field.                             */
  #define SIMIF_CLOCKCONTROL_CLOCKSTOP_Max (0x2UL)   /*!< Max enumerator value of CLOCKSTOP field.                             */
  #define SIMIF_CLOCKCONTROL_CLOCKSTOP_Illegal (0x0UL) /*!< Not allowed                                                        */
  #define SIMIF_CLOCKCONTROL_CLOCKSTOP_High (0x1UL)  /*!< Clock stops low                                                      */
  #define SIMIF_CLOCKCONTROL_CLOCKSTOP_Low (0x2UL)   /*!< Clock stops high                                                     */


/* SIMIF_VOLTAGE: Sim card operating voltage */
  #define SIMIF_VOLTAGE_ResetValue (0x00000001UL)    /*!< Reset value of VOLTAGE register.                                     */

/* VOLTAGE @Bits 0..1 : Sim card operating voltage */
  #define SIMIF_VOLTAGE_VOLTAGE_Pos (0UL)            /*!< Position of VOLTAGE field.                                           */
  #define SIMIF_VOLTAGE_VOLTAGE_Msk (0x3UL << SIMIF_VOLTAGE_VOLTAGE_Pos) /*!< Bit mask of VOLTAGE field.                       */
  #define SIMIF_VOLTAGE_VOLTAGE_Min (0x0UL)          /*!< Min enumerator value of VOLTAGE field.                               */
  #define SIMIF_VOLTAGE_VOLTAGE_Max (0x2UL)          /*!< Max enumerator value of VOLTAGE field.                               */
  #define SIMIF_VOLTAGE_VOLTAGE_0V (0x0UL)           /*!< Card voltage off                                                     */
  #define SIMIF_VOLTAGE_VOLTAGE_1800mV (0x1UL)       /*!< Card operating voltage 1.8V                                          */
  #define SIMIF_VOLTAGE_VOLTAGE_3000mV (0x2UL)       /*!< Card operating voltage 3V                                            */


/* SIMIF_LRCENABLE: LRC Calculation enable */
  #define SIMIF_LRCENABLE_ResetValue (0x00000000UL)  /*!< Reset value of LRCENABLE register.                                   */

/* LRCENABLE @Bit 0 : LRC Calculation enable for T=1 */
  #define SIMIF_LRCENABLE_LRCENABLE_Pos (0UL)        /*!< Position of LRCENABLE field.                                         */
  #define SIMIF_LRCENABLE_LRCENABLE_Msk (0x1UL << SIMIF_LRCENABLE_LRCENABLE_Pos) /*!< Bit mask of LRCENABLE field.             */
  #define SIMIF_LRCENABLE_LRCENABLE_Min (0x0UL)      /*!< Min enumerator value of LRCENABLE field.                             */
  #define SIMIF_LRCENABLE_LRCENABLE_Max (0x1UL)      /*!< Max enumerator value of LRCENABLE field.                             */
  #define SIMIF_LRCENABLE_LRCENABLE_Disable (0x0UL)  /*!< LRC calculation disabled                                             */
  #define SIMIF_LRCENABLE_LRCENABLE_Enable (0x1UL)   /*!< LRC calculation enabled                                              */


/* SIMIF_TXDATA: NonDMA data to be sent to the SIM card */
  #define SIMIF_TXDATA_ResetValue (0x00000000UL)     /*!< Reset value of TXDATA register.                                      */

/* TXDATA @Bits 0..7 : NonDMA data to be sent to the SIM card */
  #define SIMIF_TXDATA_TXDATA_Pos (0UL)              /*!< Position of TXDATA field.                                            */
  #define SIMIF_TXDATA_TXDATA_Msk (0xFFUL << SIMIF_TXDATA_TXDATA_Pos) /*!< Bit mask of TXDATA field.                           */


