adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ===================================================== Struct SPIM_DMA ===================================================== */
/**
  * @brief DMA [SPIM_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_SPIM_DMA_RX_Type RX;                     /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_SPIM_DMA_TX_Type TX;                     /*!< (@ 0x00000038) (unspecified)                                         */
} NRF_SPIM_DMA_Type;                                 /*!< Size = 92 (0x05C)                                                    */

/* ======================================================= Struct SPIM ======================================================= */
/**
  * @brief Serial Peripheral Interface Master with EasyDMA
  */
  typedef struct {                                   /*!< SPIM Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start SPI transaction                                 */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop SPI transaction                                  */
    __IM uint32_t RESERVED;
    __OM uint32_t TASKS_SUSPEND;                     /*!< (@ 0x0000000C) Suspend SPI transaction                               */
    __OM uint32_t TASKS_RESUME;                      /*!< (@ 0x00000010) Resume SPI transaction                                */
    __IM uint32_t RESERVED1[5];
    __OM NRF_SPIM_TASKS_DMA_Type TASKS_DMA;          /*!< (@ 0x00000028) Peripheral tasks.                                     */
    __IM uint32_t RESERVED2[12];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED3;
    __IOM uint32_t SUBSCRIBE_SUSPEND;                /*!< (@ 0x0000008C) Subscribe configuration for task SUSPEND              */
    __IOM uint32_t SUBSCRIBE_RESUME;                 /*!< (@ 0x00000090) Subscribe configuration for task RESUME               */
    __IM uint32_t RESERVED4[5];
    __IOM NRF_SPIM_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA; /*!< (@ 0x000000A8) Subscribe configuration for tasks                     */
    __IM uint32_t RESERVED5[12];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) SPI transaction has started                           */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) SPI transaction has stopped                           */
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000108) End of RXD buffer and TXD buffer reached              */
    __IM uint32_t RESERVED6[16];
    __IOM NRF_SPIM_EVENTS_DMA_Type EVENTS_DMA;       /*!< (@ 0x0000014C) Peripheral events.                                    */
    __IM uint32_t RESERVED7[3];
    __IOM uint32_t PUBLISH_STARTED;                  /*!< (@ 0x00000180) Publish configuration for event STARTED               */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000188) Publish configuration for event END                   */
    __IM uint32_t RESERVED8[16];
    __IOM NRF_SPIM_PUBLISH_DMA_Type PUBLISH_DMA;     /*!< (@ 0x000001CC) Publish configuration for events                      */
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED10[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED11[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable SPIM                                           */
    __IM uint32_t RESERVED12[5];
    __IM uint32_t RXDDATA;                           /*!< (@ 0x00000518) RXD register                                          */
    __IOM uint32_t TXDDATA;                          /*!< (@ 0x0000051C) TXD register                                          */
    __IM uint32_t RESERVED13[3];
    __IOM uint32_t PRESCALER;                        /*!< (@ 0x0000052C) The prescaler is used to set the SPI frequency.       */
    __IM uint32_t RESERVED14[9];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000554) Configuration register                                */
    __IM uint32_t RESERVED15[21];
    __IOM NRF_SPIM_IFTIMING_Type IFTIMING;           /*!< (@ 0x000005AC) (unspecified)                                         */
    __IOM uint32_t DCXCNT;                           /*!< (@ 0x000005B4) DCX configuration                                     */
    __IOM uint32_t CSNPOL;                           /*!< (@ 0x000005B8) Polarity of CSN output                                */
    __IOM uint32_t CSNCONTROL;                       /*!< (@ 0x000005BC) Selects which CSN is used, only one CSN can be active
                                                                         at one time. This register can be safely written during
                                                                         an ongoing SPI transaction.*/
    __IOM uint32_t ORC;                              /*!< (@ 0x000005C0) Byte transmitted after TXD.MAXCNT bytes have been
                                                                         transmitted in the case when RXD.MAXCNT is greater than
                                                                         TXD.MAXCNT*/
    __IM uint32_t RESERVED16[15];
    __IOM NRF_SPIM_PSEL_Type PSEL;                   /*!< (@ 0x00000600) (unspecified)                                         */
    __IM uint32_t RESERVED17[59];
    __IOM NRF_SPIM_DMA_Type DMA;                     /*!< (@ 0x00000700) (unspecified)                                         */
  } NRF_SPIM_Type;                                   /*!< Size = 1884 (0x75C)                                                  */

/* SPIM_TASKS_START: Start SPI transaction */
  #define SPIM_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start SPI transaction */
  #define SPIM_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define SPIM_TASKS_START_TASKS_START_Msk (0x1UL << SPIM_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define SPIM_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define SPIM_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define SPIM_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


/* SPIM_TASKS_STOP: Stop SPI transaction */
  #define SPIM_TASKS_STOP_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop SPI transaction */
  #define SPIM_TASKS_STOP_TASKS_STOP_Pos (0UL)       /*!< Position of TASKS_STOP field.                                        */
  #define SPIM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << SPIM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.          */
  #define SPIM_TASKS_STOP_TASKS_STOP_Min (0x1UL)     /*!< Min enumerator value of TASKS_STOP field.                            */
  #define SPIM_TASKS_STOP_TASKS_STOP_Max (0x1UL)     /*!< Max enumerator value of TASKS_STOP field.                            */
  #define SPIM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                         */


/* SPIM_TASKS_SUSPEND: Suspend SPI transaction */
  #define SPIM_TASKS_SUSPEND_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SUSPEND register.                             */

/* TASKS_SUSPEND @Bit 0 : Suspend SPI transaction */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL) /*!< Position of TASKS_SUSPEND field.                                     */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND
                                                                            field.*/
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Min (0x1UL) /*!< Min enumerator value of TASKS_SUSPEND field.                       */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Max (0x1UL) /*!< Max enumerator value of TASKS_SUSPEND field.                       */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL) /*!< Trigger task                                                   */


