adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SPIM_INTEN: Enable or disable interrupt */
  #define SPIM_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define SPIM_INTEN_STARTED_Pos (0UL)               /*!< Position of STARTED field.                                           */
  #define SPIM_INTEN_STARTED_Msk (0x1UL << SPIM_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                             */
  #define SPIM_INTEN_STARTED_Min (0x0UL)             /*!< Min enumerator value of STARTED field.                               */
  #define SPIM_INTEN_STARTED_Max (0x1UL)             /*!< Max enumerator value of STARTED field.                               */
  #define SPIM_INTEN_STARTED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define SPIM_INTEN_STARTED_Enabled (0x1UL)         /*!< Enable                                                               */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define SPIM_INTEN_STOPPED_Pos (1UL)               /*!< Position of STOPPED field.                                           */
  #define SPIM_INTEN_STOPPED_Msk (0x1UL << SPIM_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                             */
  #define SPIM_INTEN_STOPPED_Min (0x0UL)             /*!< Min enumerator value of STOPPED field.                               */
  #define SPIM_INTEN_STOPPED_Max (0x1UL)             /*!< Max enumerator value of STOPPED field.                               */
  #define SPIM_INTEN_STOPPED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define SPIM_INTEN_STOPPED_Enabled (0x1UL)         /*!< Enable                                                               */

/* END @Bit 2 : Enable or disable interrupt for event END */
  #define SPIM_INTEN_END_Pos (2UL)                   /*!< Position of END field.                                               */
  #define SPIM_INTEN_END_Msk (0x1UL << SPIM_INTEN_END_Pos) /*!< Bit mask of END field.                                         */
  #define SPIM_INTEN_END_Min (0x0UL)                 /*!< Min enumerator value of END field.                                   */
  #define SPIM_INTEN_END_Max (0x1UL)                 /*!< Max enumerator value of END field.                                   */
  #define SPIM_INTEN_END_Disabled (0x0UL)            /*!< Disable                                                              */
  #define SPIM_INTEN_END_Enabled (0x1UL)             /*!< Enable                                                               */

/* DMARXEND @Bit 19 : Enable or disable interrupt for event DMARXEND */
  #define SPIM_INTEN_DMARXEND_Pos (19UL)             /*!< Position of DMARXEND field.                                          */
  #define SPIM_INTEN_DMARXEND_Msk (0x1UL << SPIM_INTEN_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                          */
  #define SPIM_INTEN_DMARXEND_Min (0x0UL)            /*!< Min enumerator value of DMARXEND field.                              */
  #define SPIM_INTEN_DMARXEND_Max (0x1UL)            /*!< Max enumerator value of DMARXEND field.                              */
  #define SPIM_INTEN_DMARXEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define SPIM_INTEN_DMARXEND_Enabled (0x1UL)        /*!< Enable                                                               */

/* DMARXREADY @Bit 20 : Enable or disable interrupt for event DMARXREADY */
  #define SPIM_INTEN_DMARXREADY_Pos (20UL)           /*!< Position of DMARXREADY field.                                        */
  #define SPIM_INTEN_DMARXREADY_Msk (0x1UL << SPIM_INTEN_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.                    */
  #define SPIM_INTEN_DMARXREADY_Min (0x0UL)          /*!< Min enumerator value of DMARXREADY field.                            */
  #define SPIM_INTEN_DMARXREADY_Max (0x1UL)          /*!< Max enumerator value of DMARXREADY field.                            */
  #define SPIM_INTEN_DMARXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SPIM_INTEN_DMARXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMARXBUSERROR @Bit 21 : Enable or disable interrupt for event DMARXBUSERROR */
  #define SPIM_INTEN_DMARXBUSERROR_Pos (21UL)        /*!< Position of DMARXBUSERROR field.                                     */
  #define SPIM_INTEN_DMARXBUSERROR_Msk (0x1UL << SPIM_INTEN_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.           */
  #define SPIM_INTEN_DMARXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define SPIM_INTEN_DMARXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define SPIM_INTEN_DMARXBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define SPIM_INTEN_DMARXBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */

/* DMARXMATCH0 @Bit 22 : Enable or disable interrupt for event DMARXMATCH[0] */
  #define SPIM_INTEN_DMARXMATCH0_Pos (22UL)          /*!< Position of DMARXMATCH0 field.                                       */
  #define SPIM_INTEN_DMARXMATCH0_Msk (0x1UL << SPIM_INTEN_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.                 */
  #define SPIM_INTEN_DMARXMATCH0_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define SPIM_INTEN_DMARXMATCH0_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define SPIM_INTEN_DMARXMATCH0_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SPIM_INTEN_DMARXMATCH0_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMARXMATCH1 @Bit 23 : Enable or disable interrupt for event DMARXMATCH[1] */
  #define SPIM_INTEN_DMARXMATCH1_Pos (23UL)          /*!< Position of DMARXMATCH1 field.                                       */
  #define SPIM_INTEN_DMARXMATCH1_Msk (0x1UL << SPIM_INTEN_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.                 */
  #define SPIM_INTEN_DMARXMATCH1_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define SPIM_INTEN_DMARXMATCH1_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define SPIM_INTEN_DMARXMATCH1_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SPIM_INTEN_DMARXMATCH1_Enabled (0x1UL)     /*!< Enable                                                               */

