adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DMARXMATCH2 @Bit 24 : Enable or disable interrupt for event DMARXMATCH[2] */
  #define SPIM_INTEN_DMARXMATCH2_Pos (24UL)          /*!< Position of DMARXMATCH2 field.                                       */
  #define SPIM_INTEN_DMARXMATCH2_Msk (0x1UL << SPIM_INTEN_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.                 */
  #define SPIM_INTEN_DMARXMATCH2_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define SPIM_INTEN_DMARXMATCH2_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define SPIM_INTEN_DMARXMATCH2_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SPIM_INTEN_DMARXMATCH2_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMARXMATCH3 @Bit 25 : Enable or disable interrupt for event DMARXMATCH[3] */
  #define SPIM_INTEN_DMARXMATCH3_Pos (25UL)          /*!< Position of DMARXMATCH3 field.                                       */
  #define SPIM_INTEN_DMARXMATCH3_Msk (0x1UL << SPIM_INTEN_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.                 */
  #define SPIM_INTEN_DMARXMATCH3_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define SPIM_INTEN_DMARXMATCH3_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define SPIM_INTEN_DMARXMATCH3_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SPIM_INTEN_DMARXMATCH3_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMATXEND @Bit 26 : Enable or disable interrupt for event DMATXEND */
  #define SPIM_INTEN_DMATXEND_Pos (26UL)             /*!< Position of DMATXEND field.                                          */
  #define SPIM_INTEN_DMATXEND_Msk (0x1UL << SPIM_INTEN_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                          */
  #define SPIM_INTEN_DMATXEND_Min (0x0UL)            /*!< Min enumerator value of DMATXEND field.                              */
  #define SPIM_INTEN_DMATXEND_Max (0x1UL)            /*!< Max enumerator value of DMATXEND field.                              */
  #define SPIM_INTEN_DMATXEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define SPIM_INTEN_DMATXEND_Enabled (0x1UL)        /*!< Enable                                                               */

/* DMATXREADY @Bit 27 : Enable or disable interrupt for event DMATXREADY */
  #define SPIM_INTEN_DMATXREADY_Pos (27UL)           /*!< Position of DMATXREADY field.                                        */
  #define SPIM_INTEN_DMATXREADY_Msk (0x1UL << SPIM_INTEN_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.                    */
  #define SPIM_INTEN_DMATXREADY_Min (0x0UL)          /*!< Min enumerator value of DMATXREADY field.                            */
  #define SPIM_INTEN_DMATXREADY_Max (0x1UL)          /*!< Max enumerator value of DMATXREADY field.                            */
  #define SPIM_INTEN_DMATXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SPIM_INTEN_DMATXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMATXBUSERROR @Bit 28 : Enable or disable interrupt for event DMATXBUSERROR */
  #define SPIM_INTEN_DMATXBUSERROR_Pos (28UL)        /*!< Position of DMATXBUSERROR field.                                     */
  #define SPIM_INTEN_DMATXBUSERROR_Msk (0x1UL << SPIM_INTEN_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.           */
  #define SPIM_INTEN_DMATXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define SPIM_INTEN_DMATXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define SPIM_INTEN_DMATXBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define SPIM_INTEN_DMATXBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */


/* SPIM_INTENSET: Enable interrupt */
  #define SPIM_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define SPIM_INTENSET_STARTED_Pos (0UL)            /*!< Position of STARTED field.                                           */
  #define SPIM_INTENSET_STARTED_Msk (0x1UL << SPIM_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define SPIM_INTENSET_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define SPIM_INTENSET_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define SPIM_INTENSET_STARTED_Set (0x1UL)          /*!< Enable                                                               */
  #define SPIM_INTENSET_STARTED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_STARTED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define SPIM_INTENSET_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define SPIM_INTENSET_STOPPED_Msk (0x1UL << SPIM_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define SPIM_INTENSET_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define SPIM_INTENSET_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define SPIM_INTENSET_STOPPED_Set (0x1UL)          /*!< Enable                                                               */
  #define SPIM_INTENSET_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

