adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SPIS_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define SPIS_PUBLISH_STARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STARTED register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define SPIS_PUBLISH_STARTED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define SPIS_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define SPIS_PUBLISH_STARTED_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define SPIS_PUBLISH_STARTED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_STARTED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SPIS_PUBLISH_STARTED_EN_Msk (0x1UL << SPIS_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SPIS_PUBLISH_STARTED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SPIS_PUBLISH_STARTED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SPIS_PUBLISH_STARTED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define SPIS_PUBLISH_STARTED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* SPIS_PUBLISH_END: Publish configuration for event END */
  #define SPIS_PUBLISH_END_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_END register.                                 */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define SPIS_PUBLISH_END_CHIDX_Pos (0UL)           /*!< Position of CHIDX field.                                             */
  #define SPIS_PUBLISH_END_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.                      */
  #define SPIS_PUBLISH_END_CHIDX_Min (0x00UL)        /*!< Min value of CHIDX field.                                            */
  #define SPIS_PUBLISH_END_CHIDX_Max (0xFFUL)        /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_END_EN_Pos (31UL)             /*!< Position of EN field.                                                */
  #define SPIS_PUBLISH_END_EN_Msk (0x1UL << SPIS_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field.                                */
  #define SPIS_PUBLISH_END_EN_Min (0x0UL)            /*!< Min enumerator value of EN field.                                    */
  #define SPIS_PUBLISH_END_EN_Max (0x1UL)            /*!< Max enumerator value of EN field.                                    */
  #define SPIS_PUBLISH_END_EN_Disabled (0x0UL)       /*!< Disable publishing                                                   */
  #define SPIS_PUBLISH_END_EN_Enabled (0x1UL)        /*!< Enable publishing                                                    */


/* SPIS_PUBLISH_ACQUIRED: Publish configuration for event ACQUIRED */
  #define SPIS_PUBLISH_ACQUIRED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ACQUIRED register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that event ACQUIRED will publish to */
  #define SPIS_PUBLISH_ACQUIRED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define SPIS_PUBLISH_ACQUIRED_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_ACQUIRED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define SPIS_PUBLISH_ACQUIRED_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define SPIS_PUBLISH_ACQUIRED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_ACQUIRED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define SPIS_PUBLISH_ACQUIRED_EN_Msk (0x1UL << SPIS_PUBLISH_ACQUIRED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define SPIS_PUBLISH_ACQUIRED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define SPIS_PUBLISH_ACQUIRED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define SPIS_PUBLISH_ACQUIRED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define SPIS_PUBLISH_ACQUIRED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* SPIS_SHORTS: Shortcuts between local events and tasks */
  #define SPIS_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* END_ACQUIRE @Bit 2 : Shortcut between event END and task ACQUIRE */
  #define SPIS_SHORTS_END_ACQUIRE_Pos (2UL)          /*!< Position of END_ACQUIRE field.                                       */
  #define SPIS_SHORTS_END_ACQUIRE_Msk (0x1UL << SPIS_SHORTS_END_ACQUIRE_Pos) /*!< Bit mask of END_ACQUIRE field.               */
  #define SPIS_SHORTS_END_ACQUIRE_Min (0x0UL)        /*!< Min enumerator value of END_ACQUIRE field.                           */
  #define SPIS_SHORTS_END_ACQUIRE_Max (0x1UL)        /*!< Max enumerator value of END_ACQUIRE field.                           */
  #define SPIS_SHORTS_END_ACQUIRE_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define SPIS_SHORTS_END_ACQUIRE_Enabled (0x1UL)    /*!< Enable shortcut                                                      */

/* DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 @Bit 21 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] Allows
                                               daisy-chaining match events. */

  #define SPIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos (21UL) /*!< Position of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.   */
  #define SPIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Msk (0x1UL << SPIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1
                                                                            field.*/
  #define SPIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/
  #define SPIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/
  #define SPIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define SPIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 @Bit 22 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[2] Allows
                                               daisy-chaining match events. */

  #define SPIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos (22UL) /*!< Position of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.   */
  #define SPIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Msk (0x1UL << SPIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2
                                                                            field.*/
  #define SPIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/
  #define SPIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/
  #define SPIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define SPIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3 @Bit 23 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[3] Allows
                                               daisy-chaining match events. */

