adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Pos (8UL)       /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_LOCK_Pos) /*!< Bit mask of LOCK field.                */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Min (0x0UL)     /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Max (0x1UL)     /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Locked (0x1UL)  /*!< Feature permissions can not be changed until the next reset          */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_DPPIC_CHG_BLOCK_Pos (12UL)     /*!< Position of BLOCK field.                                             */
  #define SPU_FEATURE_DPPIC_CHG_BLOCK_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_BLOCK_Pos) /*!< Bit mask of BLOCK field.             */
  #define SPU_FEATURE_DPPIC_CHG_BLOCK_Min (0x0UL)    /*!< Min enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_DPPIC_CHG_BLOCK_Max (0x1UL)    /*!< Max enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_DPPIC_CHG_BLOCK_Available (0x0UL) /*!< Feature is accessible                                             */
  #define SPU_FEATURE_DPPIC_CHG_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                         */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_DPPIC_CHG_OWNERID_Pos (16UL)   /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURE_DPPIC_CHG_OWNERID_Msk (0xFUL << SPU_FEATURE_DPPIC_CHG_OWNERID_Pos) /*!< Bit mask of OWNERID field.       */
  #define SPU_FEATURE_DPPIC_CHG_OWNERID_Min (0x0UL)  /*!< Min value of OWNERID field.                                          */
  #define SPU_FEATURE_DPPIC_CHG_OWNERID_Max (0xFUL)  /*!< Max size of OWNERID field.                                           */



/* ================================================ Struct SPU_FEATURE_GPIOTE ================================================ */
/**
  * @brief GPIOTE [SPU_FEATURE_GPIOTE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[8];                             /*!< (@ 0x00000000) Configuration of features for channel o of GPIOTE[n]  */
  __IOM uint32_t  INTERRUPT[8];                      /*!< (@ 0x00000020) Configuration of features for interrupt o of GPIOTE[n]*/
} NRF_SPU_FEATURE_GPIOTE_Type;                       /*!< Size = 64 (0x040)                                                    */
  #define SPU_FEATURE_GPIOTE_MaxCount (1UL)          /*!< Size of GPIOTE[1] array.                                             */
  #define SPU_FEATURE_GPIOTE_MaxIndex (0UL)          /*!< Max index of GPIOTE[1] array.                                        */
  #define SPU_FEATURE_GPIOTE_MinIndex (0UL)          /*!< Min index of GPIOTE[1] array.                                        */

/* SPU_FEATURE_GPIOTE_CH: Configuration of features for channel o of GPIOTE[n] */
  #define SPU_FEATURE_GPIOTE_CH_MaxCount (8UL)       /*!< Max size of CH[8] array.                                             */
  #define SPU_FEATURE_GPIOTE_CH_MaxIndex (7UL)       /*!< Max index of CH[8] array.                                            */
  #define SPU_FEATURE_GPIOTE_CH_MinIndex (0UL)       /*!< Min index of CH[8] array.                                            */
  #define SPU_FEATURE_GPIOTE_CH_ResetValue (0x00000000UL) /*!< Reset value of CH[8] register.                                  */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Pos (4UL)    /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_SECATTR_Pos) /*!< Bit mask of SECATTR field.       */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Min (0x0UL)  /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Max (0x1UL)  /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                       */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                               */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Pos (8UL)       /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_LOCK_Pos) /*!< Bit mask of LOCK field.                */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Min (0x0UL)     /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Max (0x1UL)     /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Locked (0x1UL)  /*!< Feature permissions can not be changed until the next reset          */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_GPIOTE_CH_BLOCK_Pos (12UL)     /*!< Position of BLOCK field.                                             */
  #define SPU_FEATURE_GPIOTE_CH_BLOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_BLOCK_Pos) /*!< Bit mask of BLOCK field.             */
  #define SPU_FEATURE_GPIOTE_CH_BLOCK_Min (0x0UL)    /*!< Min enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_GPIOTE_CH_BLOCK_Max (0x1UL)    /*!< Max enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_GPIOTE_CH_BLOCK_Available (0x0UL) /*!< Feature is accessible                                             */
  #define SPU_FEATURE_GPIOTE_CH_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                         */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GPIOTE_CH_OWNERID_Pos (16UL)   /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURE_GPIOTE_CH_OWNERID_Msk (0xFUL << SPU_FEATURE_GPIOTE_CH_OWNERID_Pos) /*!< Bit mask of OWNERID field.       */
  #define SPU_FEATURE_GPIOTE_CH_OWNERID_Min (0x0UL)  /*!< Min value of OWNERID field.                                          */
  #define SPU_FEATURE_GPIOTE_CH_OWNERID_Max (0xFUL)  /*!< Max size of OWNERID field.                                           */


/* SPU_FEATURE_GPIOTE_INTERRUPT: Configuration of features for interrupt o of GPIOTE[n] */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MaxCount (8UL) /*!< Max size of INTERRUPT[8] array.                                     */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MaxIndex (7UL) /*!< Max index of INTERRUPT[8] array.                                    */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MinIndex (0UL) /*!< Min index of INTERRUPT[8] array.                                    */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_ResetValue (0x00000000UL) /*!< Reset value of INTERRUPT[8] register.                    */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                       */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                        */

