adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Pos (8UL)        /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_CLK_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Locked (0x1UL)   /*!< Feature permissions can not be changed until the next reset          */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_GRTC_CLK_BLOCK_Pos (12UL)      /*!< Position of BLOCK field.                                             */
  #define SPU_FEATURE_GRTC_CLK_BLOCK_Msk (0x1UL << SPU_FEATURE_GRTC_CLK_BLOCK_Pos) /*!< Bit mask of BLOCK field.               */
  #define SPU_FEATURE_GRTC_CLK_BLOCK_Min (0x0UL)     /*!< Min enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_GRTC_CLK_BLOCK_Max (0x1UL)     /*!< Max enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_GRTC_CLK_BLOCK_Available (0x0UL) /*!< Feature is accessible                                              */
  #define SPU_FEATURE_GRTC_CLK_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                          */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_CLK_OWNERID_Pos (16UL)    /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURE_GRTC_CLK_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_CLK_OWNERID_Pos) /*!< Bit mask of OWNERID field.         */
  #define SPU_FEATURE_GRTC_CLK_OWNERID_Min (0x0UL)   /*!< Min value of OWNERID field.                                          */
  #define SPU_FEATURE_GRTC_CLK_OWNERID_Max (0xFUL)   /*!< Max size of OWNERID field.                                           */


/* SPU_FEATURE_GRTC_SYSCOUNTER: Configuration of features for SYSCOUNTERL/SYSCOUNTERH of GRTC */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_ResetValue (0x00000000UL) /*!< Reset value of SYSCOUNTER register.                       */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                        */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                          */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                          */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                 */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                         */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Pos (8UL) /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Pos) /*!< Bit mask of LOCK field.    */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                            */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset     */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                           */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Pos) /*!< Bit mask of BLOCK field. */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                              */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                              */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Available (0x0UL) /*!< Feature is accessible                                       */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                   */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                       */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                     */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                      */


/* SPU_FEATURE_GRTC_INTERRUPT: Configuration of features for interrupt n of GRTC */
  #define SPU_FEATURE_GRTC_INTERRUPT_MaxCount (11UL) /*!< Max size of INTERRUPT[11] array.                                     */
  #define SPU_FEATURE_GRTC_INTERRUPT_MaxIndex (10UL) /*!< Max index of INTERRUPT[11] array.                                    */
  #define SPU_FEATURE_GRTC_INTERRUPT_MinIndex (0UL)  /*!< Min index of INTERRUPT[11] array.                                    */
  #define SPU_FEATURE_GRTC_INTERRUPT_ResetValue (0x00000000UL) /*!< Reset value of INTERRUPT[11] register.                     */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                         */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                  */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                          */

