adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos (8UL)  /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos) /*!< Bit mask of LOCK field.      */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                             */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset      */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                            */
  #define SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Pos) /*!< Bit mask of BLOCK field.   */
  #define SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                               */
  #define SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                               */
  #define SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Available (0x0UL) /*!< Feature is accessible                                        */
  #define SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                    */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                        */
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                      */
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                       */



/* ================================================ Struct SPU_FEATURE_MRAMC ================================================= */
/**
  * @brief MRAMC [SPU_FEATURE_MRAMC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  WAITSTATES;                        /*!< (@ 0x00000000) Configuration of features for WAITSTATES of MRAMC [n] */
  __IOM uint32_t  AUTODPOWERDOWN;                    /*!< (@ 0x00000004) Configuration of features for POWER.AUTODPOWERDOWN of
                                                                         MRAMC [n]*/
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) Configuration of features for READY and READYNEXT of
                                                                         MRAMC [n]*/
} NRF_SPU_FEATURE_MRAMC_Type;                        /*!< Size = 12 (0x00C)                                                    */
  #define SPU_FEATURE_MRAMC_MaxCount (2UL)           /*!< Size of MRAMC[2] array.                                              */
  #define SPU_FEATURE_MRAMC_MaxIndex (1UL)           /*!< Max index of MRAMC[2] array.                                         */
  #define SPU_FEATURE_MRAMC_MinIndex (0UL)           /*!< Min index of MRAMC[2] array.                                         */

/* SPU_FEATURE_MRAMC_WAITSTATES: Configuration of features for WAITSTATES of MRAMC [n] */
  #define SPU_FEATURE_MRAMC_WAITSTATES_ResetValue (0x00000000UL) /*!< Reset value of WAITSTATES register.                      */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                       */
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Msk (0x1UL << SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                */
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                        */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Pos (8UL) /*!< Position of LOCK field.                                             */
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Pos) /*!< Bit mask of LOCK field.  */
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                               */
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                               */
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                           */
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset    */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                          */
  #define SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Pos) /*!< Bit mask of BLOCK
                                                                            field.*/
  #define SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                             */
  #define SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                             */
  #define SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Available (0x0UL) /*!< Feature is accessible                                      */
  #define SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                  */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                      */
  #define SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Msk (0xFUL << SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                    */
  #define SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                     */


