adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SPU_FEATURE_MRAMC_AUTODPOWERDOWN: Configuration of features for POWER.AUTODPOWERDOWN of MRAMC [n] */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_ResetValue (0x00000000UL) /*!< Reset value of AUTODPOWERDOWN register.              */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                   */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Msk (0x1UL << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Pos) /*!< Bit mask of
                                                                            SECATTR field.*/
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                     */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                     */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage            */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                    */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Pos (8UL) /*!< Position of LOCK field.                                         */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Pos) /*!< Bit mask of LOCK
                                                                            field.*/
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                           */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                           */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                       */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset*/

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                      */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Pos) /*!< Bit mask of
                                                                            BLOCK field.*/
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                         */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                         */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Available (0x0UL) /*!< Feature is accessible                                  */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset              */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                  */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Msk (0xFUL << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Pos) /*!< Bit mask of
                                                                            OWNERID field.*/
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                 */


/* SPU_FEATURE_MRAMC_READY: Configuration of features for READY and READYNEXT of MRAMC [n] */
  #define SPU_FEATURE_MRAMC_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Pos (4UL)  /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Msk (0x1UL << SPU_FEATURE_MRAMC_READY_SECATTR_Pos) /*!< Bit mask of SECATTR field.   */
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                              */
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                              */
  #define SPU_FEATURE_MRAMC_READY_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                     */
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                             */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_MRAMC_READY_LOCK_Pos (8UL)     /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_MRAMC_READY_LOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_READY_LOCK_Pos) /*!< Bit mask of LOCK field.            */
  #define SPU_FEATURE_MRAMC_READY_LOCK_Min (0x0UL)   /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_MRAMC_READY_LOCK_Max (0x1UL)   /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_MRAMC_READY_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                */
  #define SPU_FEATURE_MRAMC_READY_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset         */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_MRAMC_READY_BLOCK_Pos (12UL)   /*!< Position of BLOCK field.                                             */
  #define SPU_FEATURE_MRAMC_READY_BLOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_READY_BLOCK_Pos) /*!< Bit mask of BLOCK field.         */
  #define SPU_FEATURE_MRAMC_READY_BLOCK_Min (0x0UL)  /*!< Min enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_MRAMC_READY_BLOCK_Max (0x1UL)  /*!< Max enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_MRAMC_READY_BLOCK_Available (0x0UL) /*!< Feature is accessible                                           */
  #define SPU_FEATURE_MRAMC_READY_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                       */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_MRAMC_READY_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURE_MRAMC_READY_OWNERID_Msk (0xFUL << SPU_FEATURE_MRAMC_READY_OWNERID_Pos) /*!< Bit mask of OWNERID field.   */
  #define SPU_FEATURE_MRAMC_READY_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                         */
  #define SPU_FEATURE_MRAMC_READY_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                          */



/* =========================================== Struct SPU_FEATURE_BELLS_PROCESSOR ============================================ */
/**
  * @brief PROCESSOR [SPU_FEATURE_BELLS_PROCESSOR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TASKS[16];                         /*!< (@ 0x00000000) Configuration of features for tasks pair [(o * 2) + 1:o
                                                                         * 2] of Processor ID n*/
  __IOM uint32_t  EVENTS[16];                        /*!< (@ 0x00000040) Configuration of features for events pair [(o * 2) +
                                                                         1:o * 2] of Processor ID n*/
  __IOM uint32_t  INTERRUPT[16];                     /*!< (@ 0x00000080) Configuration of features for interrupt register pair
                                                                         [(o * 2) + 1:o * 2] of Processor ID n*/
} NRF_SPU_FEATURE_BELLS_PROCESSOR_Type;              /*!< Size = 192 (0x0C0)                                                   */
  #define SPU_FEATURE_BELLS_PROCESSOR_MaxCount (8UL) /*!< Size of PROCESSOR[8] array.                                          */
  #define SPU_FEATURE_BELLS_PROCESSOR_MaxIndex (7UL) /*!< Max index of PROCESSOR[8] array.                                     */
  #define SPU_FEATURE_BELLS_PROCESSOR_MinIndex (0UL) /*!< Min index of PROCESSOR[8] array.                                     */

/* SPU_FEATURE_BELLS_PROCESSOR_TASKS: Configuration of features for tasks pair [(o * 2) + 1:o * 2] of Processor ID n */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_MaxCount (16UL) /*!< Max size of TASKS[16] array.                                  */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_MaxIndex (15UL) /*!< Max index of TASKS[16] array.                                 */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_MinIndex (0UL) /*!< Min index of TASKS[16] array.                                  */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_ResetValue (0x00000000UL) /*!< Reset value of TASKS[16] register.                  */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                  */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Pos) /*!< Bit mask
                                                                            of SECATTR field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                    */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                    */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage           */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                   */

