adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Pos (8UL) /*!< Position of LOCK field.                                    */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Pos) /*!< Bit mask
                                                                            of LOCK field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                      */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                      */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                  */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next
                                                                         reset*/

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                 */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Pos) /*!< Bit
                                                                            mask of BLOCK field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                    */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                    */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Available (0x0UL) /*!< Feature is accessible                             */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset         */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                             */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Pos) /*!<
                                                                            Bit mask of OWNERID field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                           */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                            */



/* ================================================ Struct SPU_FEATURE_BELLS ================================================= */
/**
  * @brief BELLS [SPU_FEATURE_BELLS] (unspecified)
  */
typedef struct {
  __IOM NRF_SPU_FEATURE_BELLS_PROCESSOR_Type PROCESSOR[8]; /*!< (@ 0x00000000) (unspecified)                                   */
} NRF_SPU_FEATURE_BELLS_Type;                        /*!< Size = 1536 (0x600)                                                  */


/* =================================================== Struct SPU_FEATURE ==================================================== */
/**
  * @brief FEATURE [SPU_FEATURE] (unspecified)
  */
typedef union {
  struct {
    __IOM NRF_SPU_FEATURE_IPCT_Type IPCT;            /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_SPU_FEATURE_DPPIC_Type DPPIC;          /*!< (@ 0x00000080) (unspecified)                                         */
    __IOM NRF_SPU_FEATURE_GPIOTE_Type GPIOTE[1];     /*!< (@ 0x00000100) (unspecified)                                         */
    __IM uint32_t RESERVED[48];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_SPU_FEATURE_GPIO_Type GPIO[10];      /*!< (@ 0x00000200) (unspecified)                                         */
      struct {
        __IOM NRF_SPU_FEATURE_GRTC_Type GRTC;        /*!< (@ 0x00000200) (unspecified)                                         */
      };
      struct {
        __IM uint32_t RESERVED1[256];
        __IOM NRF_SPU_FEATURE_MRAMC_Type MRAMC[2];   /*!< (@ 0x00000600) (unspecified)                                         */
      };
      __IM uint32_t RESERVED2[320];
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
  };
  __IOM NRF_SPU_FEATURE_BELLS_Type BELLS;            /*!< (@ 0x00000000) (unspecified)                                         */
  struct {
    __IOM uint32_t TDD[2];                           /*!< (@ 0x00000000) Configuration of features for functionality n of TDD  */
  };
  __IM  uint32_t  RESERVED3[448];
} NRF_SPU_FEATURE_Type;                              /*!< Size = 1792 (0x700)                                                  */

/* SPU_FEATURE_TDD: Configuration of features for functionality n of TDD */
  #define SPU_FEATURE_TDD_MaxCount (2UL)             /*!< Max size of TDD[2] array.                                            */
  #define SPU_FEATURE_TDD_MaxIndex (1UL)             /*!< Max index of TDD[2] array.                                           */
  #define SPU_FEATURE_TDD_MinIndex (0UL)             /*!< Min index of TDD[2] array.                                           */
  #define SPU_FEATURE_TDD_ResetValue (0x00000000UL)  /*!< Reset value of TDD[2] register.                                      */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_TDD_SECATTR_Pos (4UL)          /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_TDD_SECATTR_Msk (0x1UL << SPU_FEATURE_TDD_SECATTR_Pos) /*!< Bit mask of SECATTR field.                   */
  #define SPU_FEATURE_TDD_SECATTR_Min (0x0UL)        /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_TDD_SECATTR_Max (0x1UL)        /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_TDD_SECATTR_NonSecure (0x0UL)  /*!< Feature is available for non-secure usage                            */
  #define SPU_FEATURE_TDD_SECATTR_Secure (0x1UL)     /*!< Feature is reserved for secure usage                                 */

