adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_TDD_LOCK_Pos (8UL)             /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_TDD_LOCK_Msk (0x1UL << SPU_FEATURE_TDD_LOCK_Pos) /*!< Bit mask of LOCK field.                            */
  #define SPU_FEATURE_TDD_LOCK_Min (0x0UL)           /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_TDD_LOCK_Max (0x1UL)           /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_TDD_LOCK_Unlocked (0x0UL)      /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_TDD_LOCK_Locked (0x1UL)        /*!< Feature permissions can not be changed until the next reset          */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_TDD_BLOCK_Pos (12UL)           /*!< Position of BLOCK field.                                             */
  #define SPU_FEATURE_TDD_BLOCK_Msk (0x1UL << SPU_FEATURE_TDD_BLOCK_Pos) /*!< Bit mask of BLOCK field.                         */
  #define SPU_FEATURE_TDD_BLOCK_Min (0x0UL)          /*!< Min enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_TDD_BLOCK_Max (0x1UL)          /*!< Max enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_TDD_BLOCK_Available (0x0UL)    /*!< Feature is accessible                                                */
  #define SPU_FEATURE_TDD_BLOCK_Blocked (0x1UL)      /*!< Feature cannot be accessed until next reset                          */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_TDD_OWNERID_Pos (16UL)         /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURE_TDD_OWNERID_Msk (0xFUL << SPU_FEATURE_TDD_OWNERID_Pos) /*!< Bit mask of OWNERID field.                   */
  #define SPU_FEATURE_TDD_OWNERID_Min (0x0UL)        /*!< Min value of OWNERID field.                                          */
  #define SPU_FEATURE_TDD_OWNERID_Max (0xFUL)        /*!< Max size of OWNERID field.                                           */



/* ==================================================== Struct SPU_PCGCS ===================================================== */
/**
  * @brief PCGCS [SPU_PCGCS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PENALTY[1];                        /*!< (@ 0x00000000) Penalty level for power/clock pair n. When
                                                                         FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                                                         address overlaps the PENALTY0 address and register
                                                                         description for PENALTY[0] is not valid.*/
  __IM  uint32_t  RESERVED[31];
  __IOM uint32_t  FORCEOVERRIDE[1];                  /*!< (@ 0x00000080) Force override of power/clock pair n.                 */
} NRF_SPU_PCGCS_Type;                                /*!< Size = 132 (0x084)                                                   */

/* SPU_PCGCS_PENALTY: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address
                       overlaps the PENALTY0 address and register description for PENALTY[0] is not valid. */

  #define SPU_PCGCS_PENALTY_MaxCount (1UL)           /*!< Max size of PENALTY[1] array.                                        */
  #define SPU_PCGCS_PENALTY_MaxIndex (0UL)           /*!< Max index of PENALTY[1] array.                                       */
  #define SPU_PCGCS_PENALTY_MinIndex (0UL)           /*!< Min index of PENALTY[1] array.                                       */
  #define SPU_PCGCS_PENALTY_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PENALTY[1] register.                                 */

/* PENALTY @Bits 0..1 : Penalty level */
  #define SPU_PCGCS_PENALTY_PENALTY_Pos (0UL)        /*!< Position of PENALTY field.                                           */
  #define SPU_PCGCS_PENALTY_PENALTY_Msk (0x3UL << SPU_PCGCS_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.               */


/* SPU_PCGCS_FORCEOVERRIDE: Force override of power/clock pair n. */
  #define SPU_PCGCS_FORCEOVERRIDE_MaxCount (1UL)     /*!< Max size of FORCEOVERRIDE[1] array.                                  */
  #define SPU_PCGCS_FORCEOVERRIDE_MaxIndex (0UL)     /*!< Max index of FORCEOVERRIDE[1] array.                                 */
  #define SPU_PCGCS_FORCEOVERRIDE_MinIndex (0UL)     /*!< Min index of FORCEOVERRIDE[1] array.                                 */
  #define SPU_PCGCS_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[1] register.                     */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define SPU_PCGCS_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                            */
  #define SPU_PCGCS_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << SPU_PCGCS_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!< Bit mask of
                                                                            CLOCKFORCINGPRE field.*/

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define SPU_PCGCS_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                            */
  #define SPU_PCGCS_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << SPU_PCGCS_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!< Bit mask of
                                                                            DOFORCECLOCKPRE field.*/

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define SPU_PCGCS_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                            */
  #define SPU_PCGCS_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << SPU_PCGCS_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!< Bit mask of
                                                                            POWERFORCINGPRE field.*/

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define SPU_PCGCS_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                           */
  #define SPU_PCGCS_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << SPU_PCGCS_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!< Bit mask of
                                                                            DOFORCEPOWERPRE field.*/


/* ======================================================= Struct SPU ======================================================== */
/**
  * @brief System protection unit
  */
  typedef struct {                                   /*!< SPU Structure                                                        */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_PERIPHACCERR;              /*!< (@ 0x00000100) A security violation has been detected on one or
                                                                         several peripherals*/
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[61];
    __IOM NRF_SPU_PERIPHACCERR_Type PERIPHACCERR;    /*!< (@ 0x00000404) (unspecified)                                         */
    __IM uint32_t RESERVED3[61];
    __IOM NRF_SPU_PERIPH_Type PERIPH[32];            /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED4[32];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM uint32_t FEATURES[576];                  /*!< (@ 0x00000600) Configuration of split security feature [n]           */
      __IOM NRF_SPU_FEATURE_Type FEATURE;            /*!< (@ 0x00000600) (unspecified)                                         */
      __IM uint32_t RESERVED5[576];
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IOM NRF_SPU_PCGCS_Type PCGCS;                  /*!< (@ 0x00000F00) (unspecified)                                         */
  } NRF_SPU_Type;                                    /*!< Size = 3972 (0xF84)                                                  */

/* SPU_EVENTS_PERIPHACCERR: A security violation has been detected on one or several peripherals */
  #define SPU_EVENTS_PERIPHACCERR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PERIPHACCERR register.                  */

