adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TSEN @Bit 1 : Enable or disable timestamp bundling. */
  #define STM_TCSR_TSEN_Pos (1UL)                    /*!< Position of TSEN field.                                              */
  #define STM_TCSR_TSEN_Msk (0x1UL << STM_TCSR_TSEN_Pos) /*!< Bit mask of TSEN field.                                          */
  #define STM_TCSR_TSEN_Min (0x0UL)                  /*!< Min enumerator value of TSEN field.                                  */
  #define STM_TCSR_TSEN_Max (0x1UL)                  /*!< Max enumerator value of TSEN field.                                  */
  #define STM_TCSR_TSEN_Disabled (0x0UL)             /*!< Time stamps are disabled. Requests for timestamp generation are
                                                          ignored, and stimulus port writes selecting timestamping are treated
                                                          as if it were not selected.*/
  #define STM_TCSR_TSEN_Enabled (0x1UL)              /*!< Time stamps are enabled. If stimulus writes select timestamping, a
                                                          timestamp is output according to STPv2.*/

/* SYNCEN @Bit 2 : STMSYNCR is implemented so this value is Read As One. */
  #define STM_TCSR_SYNCEN_Pos (2UL)                  /*!< Position of SYNCEN field.                                            */
  #define STM_TCSR_SYNCEN_Msk (0x1UL << STM_TCSR_SYNCEN_Pos) /*!< Bit mask of SYNCEN field.                                    */
  #define STM_TCSR_SYNCEN_Min (0x0UL)                /*!< Min enumerator value of SYNCEN field.                                */
  #define STM_TCSR_SYNCEN_Max (0x1UL)                /*!< Max enumerator value of SYNCEN field.                                */
  #define STM_TCSR_SYNCEN_Disabled (0x0UL)           /*!< The STM Sync feature is disabled.                                    */
  #define STM_TCSR_SYNCEN_Enabled (0x1UL)            /*!< The STM Sync feature is enabled.                                     */

/* COMPEN @Bit 5 : Compression Enable for Stimulus Ports. */
  #define STM_TCSR_COMPEN_Pos (5UL)                  /*!< Position of COMPEN field.                                            */
  #define STM_TCSR_COMPEN_Msk (0x1UL << STM_TCSR_COMPEN_Pos) /*!< Bit mask of COMPEN field.                                    */
  #define STM_TCSR_COMPEN_Min (0x0UL)                /*!< Min enumerator value of COMPEN field.                                */
  #define STM_TCSR_COMPEN_Max (0x1UL)                /*!< Max enumerator value of COMPEN field.                                */
  #define STM_TCSR_COMPEN_Disabled (0x0UL)           /*!< Compression disabled, data transfers are transmitted at the size of
                                                          the transaction.*/
  #define STM_TCSR_COMPEN_Enabled (0x1UL)            /*!< Compression enabled, data transfers are compressed to save bandwidth.*/

/* TRACEID @Bits 16..22 : ATB Trace ID. Setting this value to all zeroes might result in Unpredictable tracing. */
  #define STM_TCSR_TRACEID_Pos (16UL)                /*!< Position of TRACEID field.                                           */
  #define STM_TCSR_TRACEID_Msk (0x7FUL << STM_TCSR_TRACEID_Pos) /*!< Bit mask of TRACEID field.                                */
  #define STM_TCSR_TRACEID_Min (0x7FUL)              /*!< Min value of TRACEID field.                                          */
  #define STM_TCSR_TRACEID_Max (0x7FUL)              /*!< Max size of TRACEID field.                                           */

/* BUSY @Bit 23 : STM is busy, for example the STM trace FIFO is not empty. */
  #define STM_TCSR_BUSY_Pos (23UL)                   /*!< Position of BUSY field.                                              */
  #define STM_TCSR_BUSY_Msk (0x1UL << STM_TCSR_BUSY_Pos) /*!< Bit mask of BUSY field.                                          */
  #define STM_TCSR_BUSY_Min (0x0UL)                  /*!< Min enumerator value of BUSY field.                                  */
  #define STM_TCSR_BUSY_Max (0x1UL)                  /*!< Max enumerator value of BUSY field.                                  */
  #define STM_TCSR_BUSY_Ready (0x0UL)                /*!< STM is not busy.                                                     */
  #define STM_TCSR_BUSY_Busy (0x1UL)                 /*!< STM is busy.                                                         */


/* STM_AUXCR: Used for implementation defined STM controls. */
  #define STM_AUXCR_ResetValue (0x00000000UL)        /*!< Reset value of AUXCR register.                                       */

/* FIFOAF @Bit 0 : FIFO Auto-flush. */
  #define STM_AUXCR_FIFOAF_Pos (0UL)                 /*!< Position of FIFOAF field.                                            */
  #define STM_AUXCR_FIFOAF_Msk (0x1UL << STM_AUXCR_FIFOAF_Pos) /*!< Bit mask of FIFOAF field.                                  */
  #define STM_AUXCR_FIFOAF_Min (0x0UL)               /*!< Min enumerator value of FIFOAF field.                                */
  #define STM_AUXCR_FIFOAF_Max (0x1UL)               /*!< Max enumerator value of FIFOAF field.                                */
  #define STM_AUXCR_FIFOAF_Disabled (0x0UL)          /*!< Auto-flush is disabled.                                              */
  #define STM_AUXCR_FIFOAF_Enabled (0x1UL)           /*!< Auto-flush is enabled. The STM automatically drains all data it has
                                                          even if the ATB interface is not fully utilized.*/

/* ASYNCPE @Bit 1 : Is ASYNC priority higher than trace? */
  #define STM_AUXCR_ASYNCPE_Pos (1UL)                /*!< Position of ASYNCPE field.                                           */
  #define STM_AUXCR_ASYNCPE_Msk (0x1UL << STM_AUXCR_ASYNCPE_Pos) /*!< Bit mask of ASYNCPE field.                               */
  #define STM_AUXCR_ASYNCPE_Min (0x0UL)              /*!< Min enumerator value of ASYNCPE field.                               */
  #define STM_AUXCR_ASYNCPE_Max (0x1UL)              /*!< Max enumerator value of ASYNCPE field.                               */
  #define STM_AUXCR_ASYNCPE_Lower (0x0UL)            /*!< ASYNC priority is always lower than trace.                           */
  #define STM_AUXCR_ASYNCPE_Escalate (0x1UL)         /*!< ASYNC priority escalates on second synchronization request.          */

/* PRIORINVDIS @Bit 2 : Controls arbitration between AXI and HW during flush. */
  #define STM_AUXCR_PRIORINVDIS_Pos (2UL)            /*!< Position of PRIORINVDIS field.                                       */
  #define STM_AUXCR_PRIORINVDIS_Msk (0x1UL << STM_AUXCR_PRIORINVDIS_Pos) /*!< Bit mask of PRIORINVDIS field.                   */
  #define STM_AUXCR_PRIORINVDIS_Min (0x0UL)          /*!< Min enumerator value of PRIORINVDIS field.                           */
  #define STM_AUXCR_PRIORINVDIS_Max (0x1UL)          /*!< Max enumerator value of PRIORINVDIS field.                           */
  #define STM_AUXCR_PRIORINVDIS_Enabled (0x0UL)      /*!< Priority inversion, when AXI flush is finished, HW gets priority until
                                                          HW flush is done.*/
  #define STM_AUXCR_PRIORINVDIS_Disabled (0x1UL)     /*!< Priority inversion disabled, AXI always has priority over HW.        */

/* CLKON @Bit 3 : Provides override control for architectural clock gate enable. */
  #define STM_AUXCR_CLKON_Pos (3UL)                  /*!< Position of CLKON field.                                             */
  #define STM_AUXCR_CLKON_Msk (0x1UL << STM_AUXCR_CLKON_Pos) /*!< Bit mask of CLKON field.                                     */
  #define STM_AUXCR_CLKON_Min (0x0UL)                /*!< Min enumerator value of CLKON field.                                 */
  #define STM_AUXCR_CLKON_Max (0x1UL)                /*!< Max enumerator value of CLKON field.                                 */
  #define STM_AUXCR_CLKON_Disabled (0x0UL)           /*!< No override, clock gate is controlled by the state of STM.           */
  #define STM_AUXCR_CLKON_Enabled (0x1UL)            /*!< Override, clock is enabled.                                          */

/* AFREADYHIGH @Bit 4 : Provides override control for the AFREADY output */
  #define STM_AUXCR_AFREADYHIGH_Pos (4UL)            /*!< Position of AFREADYHIGH field.                                       */
  #define STM_AUXCR_AFREADYHIGH_Msk (0x1UL << STM_AUXCR_AFREADYHIGH_Pos) /*!< Bit mask of AFREADYHIGH field.                   */
  #define STM_AUXCR_AFREADYHIGH_Min (0x0UL)          /*!< Min enumerator value of AFREADYHIGH field.                           */
  #define STM_AUXCR_AFREADYHIGH_Max (0x1UL)          /*!< Max enumerator value of AFREADYHIGH field.                           */
  #define STM_AUXCR_AFREADYHIGH_Disabled (0x0UL)     /*!< No override, AFREADY is controlled by the state of STM.              */
  #define STM_AUXCR_AFREADYHIGH_Enabled (0x1UL)      /*!< Override, AFREADY is driven HIGH.                                    */


/* STM_SPFEAT1R: Indicates the features of the STM. */
  #define STM_SPFEAT1R_ResetValue (0x00000000UL)     /*!< Reset value of SPFEAT1R register.                                    */

/* PROT @Bits 0..3 : Indicates the implemented STM protocol. */
  #define STM_SPFEAT1R_PROT_Pos (0UL)                /*!< Position of PROT field.                                              */
  #define STM_SPFEAT1R_PROT_Msk (0xFUL << STM_SPFEAT1R_PROT_Pos) /*!< Bit mask of PROT field.                                  */
  #define STM_SPFEAT1R_PROT_Min (0x1UL)              /*!< Min enumerator value of PROT field.                                  */
  #define STM_SPFEAT1R_PROT_Max (0x1UL)              /*!< Max enumerator value of PROT field.                                  */
  #define STM_SPFEAT1R_PROT_STPV2 (0x1UL)            /*!< STM implements the STPV2 protocol.                                   */

/* TS @Bits 4..5 : Timestamp support. */
  #define STM_SPFEAT1R_TS_Pos (4UL)                  /*!< Position of TS field.                                                */
  #define STM_SPFEAT1R_TS_Msk (0x3UL << STM_SPFEAT1R_TS_Pos) /*!< Bit mask of TS field.                                        */
  #define STM_SPFEAT1R_TS_Min (0x1UL)                /*!< Min enumerator value of TS field.                                    */
  #define STM_SPFEAT1R_TS_Max (0x1UL)                /*!< Max enumerator value of TS field.                                    */
  #define STM_SPFEAT1R_TS_Absolute (0x1UL)           /*!< Absolute timestamps implemented.                                     */

/* TSFREQ @Bit 6 : Timestamp frequency indication configuration. */
  #define STM_SPFEAT1R_TSFREQ_Pos (6UL)              /*!< Position of TSFREQ field.                                            */
  #define STM_SPFEAT1R_TSFREQ_Msk (0x1UL << STM_SPFEAT1R_TSFREQ_Pos) /*!< Bit mask of TSFREQ field.                            */
  #define STM_SPFEAT1R_TSFREQ_Min (0x0UL)            /*!< Min enumerator value of TSFREQ field.                                */
  #define STM_SPFEAT1R_TSFREQ_Max (0x1UL)            /*!< Max enumerator value of TSFREQ field.                                */
  #define STM_SPFEAT1R_TSFREQ_NotImplemented (0x0UL) /*!< STMTSFREQR is read-only.                                             */
  #define STM_SPFEAT1R_TSFREQ_Implemented (0x1UL)    /*!< STMTSFREQR is read-write.                                            */

/* FORCETS @Bit 7 : Timestamp force configuration. */
  #define STM_SPFEAT1R_FORCETS_Pos (7UL)             /*!< Position of FORCETS field.                                           */
  #define STM_SPFEAT1R_FORCETS_Msk (0x1UL << STM_SPFEAT1R_FORCETS_Pos) /*!< Bit mask of FORCETS field.                         */
  #define STM_SPFEAT1R_FORCETS_Min (0x0UL)           /*!< Min enumerator value of FORCETS field.                               */
  #define STM_SPFEAT1R_FORCETS_Max (0x1UL)           /*!< Max enumerator value of FORCETS field.                               */
  #define STM_SPFEAT1R_FORCETS_NotImplemented (0x0UL) /*!< STMTSSTIMR bit 0 is read-only.                                      */
  #define STM_SPFEAT1R_FORCETS_Implemented (0x1UL)   /*!< STMTSSTIMR bit 0 is read-write.                                      */

