adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define STM_AUTHSTATUS_NSNID_Pos (2UL)             /*!< Position of NSNID field.                                             */
  #define STM_AUTHSTATUS_NSNID_Msk (0x3UL << STM_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                           */
  #define STM_AUTHSTATUS_NSNID_Min (0x0UL)           /*!< Min enumerator value of NSNID field.                                 */
  #define STM_AUTHSTATUS_NSNID_Max (0x1UL)           /*!< Max enumerator value of NSNID field.                                 */
  #define STM_AUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                     */
  #define STM_AUTHSTATUS_NSNID_Implemented (0x1UL)   /*!< The feature is implemented.                                          */

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define STM_AUTHSTATUS_SID_Pos (4UL)               /*!< Position of SID field.                                               */
  #define STM_AUTHSTATUS_SID_Msk (0x3UL << STM_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                                 */
  #define STM_AUTHSTATUS_SID_Min (0x0UL)             /*!< Min enumerator value of SID field.                                   */
  #define STM_AUTHSTATUS_SID_Max (0x1UL)             /*!< Max enumerator value of SID field.                                   */
  #define STM_AUTHSTATUS_SID_NotImplemented (0x0UL)  /*!< The feature is not implemented.                                      */
  #define STM_AUTHSTATUS_SID_Implemented (0x1UL)     /*!< The feature is implemented.                                          */

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define STM_AUTHSTATUS_SNID_Pos (6UL)              /*!< Position of SNID field.                                              */
  #define STM_AUTHSTATUS_SNID_Msk (0x3UL << STM_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                              */
  #define STM_AUTHSTATUS_SNID_Min (0x0UL)            /*!< Min enumerator value of SNID field.                                  */
  #define STM_AUTHSTATUS_SNID_Max (0x1UL)            /*!< Max enumerator value of SNID field.                                  */
  #define STM_AUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                      */
  #define STM_AUTHSTATUS_SNID_Implemented (0x1UL)    /*!< The feature is implemented.                                          */


/* STM_DEVID: Indicates the capabilities of the STM. */
  #define STM_DEVID_ResetValue (0x00000000UL)        /*!< Reset value of DEVID register.                                       */

/* NUMSP @Bits 0..16 : This value indicates the number of stimulus ports implemented. */
  #define STM_DEVID_NUMSP_Pos (0UL)                  /*!< Position of NUMSP field.                                             */
  #define STM_DEVID_NUMSP_Msk (0x1FFFFUL << STM_DEVID_NUMSP_Pos) /*!< Bit mask of NUMSP field.                                 */
  #define STM_DEVID_NUMSP_Max (0x10000UL)            /*!< Maximum 65,536 stimulus ports can be implemented.                    */


/* STM_DEVTYPE: Controls the single-shot comparator. */
  #define STM_DEVTYPE_ResetValue (0x00000000UL)      /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define STM_DEVTYPE_MAJOR_Pos (0UL)                /*!< Position of MAJOR field.                                             */
  #define STM_DEVTYPE_MAJOR_Msk (0xFUL << STM_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_Min (0x3UL)              /*!< Min enumerator value of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_Max (0x3UL)              /*!< Max enumerator value of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_TraceSource (0x3UL)      /*!< Peripheral is a trace source.                                        */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define STM_DEVTYPE_SUB_Pos (4UL)                  /*!< Position of SUB field.                                               */
  #define STM_DEVTYPE_SUB_Msk (0xFUL << STM_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                       */
  #define STM_DEVTYPE_SUB_Min (0x6UL)                /*!< Min enumerator value of SUB field.                                   */
  #define STM_DEVTYPE_SUB_Max (0x6UL)                /*!< Max enumerator value of SUB field.                                   */
  #define STM_DEVTYPE_SUB_StimulusTrace (0x6UL)      /*!< Peripheral is a stimulus trace source.                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          STMDATA                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct STMDATA_DOMAIN ================================================== */
/**
  * @brief DOMAIN [STMDATA_DOMAIN] (unspecified)
  */
typedef struct {
  __IOM uint8_t   DATA[16777216];                    /*!< (@ 0x00000000) STM extended stimulus port data buffer area for domain
                                                                         n. NonSecure writes to this region generates trace
                                                                         packets with id n+96. Secure writes to this region
                                                                         generates trace packets with id n+32.*/
} NRF_STMDATA_DOMAIN_Type;                           /*!< Size = 16777216 (0x1000000)                                          */
  #define STMDATA_DOMAIN_MaxCount (16UL)             /*!< Size of DOMAIN[16] array.                                            */
  #define STMDATA_DOMAIN_MaxIndex (15UL)             /*!< Max index of DOMAIN[16] array.                                       */
  #define STMDATA_DOMAIN_MinIndex (0UL)              /*!< Min index of DOMAIN[16] array.                                       */

/* ===================================================== Struct STMDATA ====================================================== */
/**
  * @brief System Trace Macrocell data buffer
  */
  typedef struct {                                   /*!< STMDATA Structure                                                    */
    __IOM NRF_STMDATA_DOMAIN_Type DOMAIN[16];        /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_STMDATA_Type;                                /*!< Size = 268435456 (0x10000000)                                        */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SWEXT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct SWEXT_CONFIG =================================================== */
/**
  * @brief CONFIG [SWEXT_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SWITCH;                            /*!< (@ 0x00000000) Switch configuration                                  */
  __IOM uint32_t  PDCLAMP;                           /*!< (@ 0x00000004) Powerdown ground clamp                                */
} NRF_SWEXT_CONFIG_Type;                             /*!< Size = 8 (0x008)                                                     */

/* SWEXT_CONFIG_SWITCH: Switch configuration */
  #define SWEXT_CONFIG_SWITCH_ResetValue (0x00000000UL) /*!< Reset value of SWITCH register.                                   */

/* SOFTSTART @Bit 0 : Switch soft start */
  #define SWEXT_CONFIG_SWITCH_SOFTSTART_Pos (0UL)    /*!< Position of SOFTSTART field.                                         */
  #define SWEXT_CONFIG_SWITCH_SOFTSTART_Msk (0x1UL << SWEXT_CONFIG_SWITCH_SOFTSTART_Pos) /*!< Bit mask of SOFTSTART field.     */
  #define SWEXT_CONFIG_SWITCH_SOFTSTART_Min (0x0UL)  /*!< Min enumerator value of SOFTSTART field.                             */
  #define SWEXT_CONFIG_SWITCH_SOFTSTART_Max (0x1UL)  /*!< Max enumerator value of SOFTSTART field.                             */
  #define SWEXT_CONFIG_SWITCH_SOFTSTART_Enabled (0x0UL) /*!< Soft start enabled                                                */
  #define SWEXT_CONFIG_SWITCH_SOFTSTART_Disabled (0x1UL) /*!< Soft start disabled                                              */

