adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ILIMSOFTSTART @Bits 8..9 : Switch soft start current limiter */
  #define SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_Pos (8UL) /*!< Position of ILIMSOFTSTART field.                                    */
  #define SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_Msk (0x3UL << SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_Pos) /*!< Bit mask of ILIMSOFTSTART
                                                                            field.*/
  #define SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_Min (0x0UL) /*!< Min enumerator value of ILIMSOFTSTART field.                      */
  #define SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_Max (0x3UL) /*!< Max enumerator value of ILIMSOFTSTART field.                      */
  #define SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_IlimDefault (0x0UL) /*!< Default current limitattion                               */
  #define SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_Ilim1x5 (0x1UL) /*!< 1.5x current limitation                                       */
  #define SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_Ilim2x0 (0x2UL) /*!< 2.0x current limitation                                       */
  #define SWEXT_CONFIG_SWITCH_ILIMSOFTSTART_Ilim0x5 (0x3UL) /*!< 0.5x current limitation                                       */


/* SWEXT_CONFIG_PDCLAMP: Powerdown ground clamp */
  #define SWEXT_CONFIG_PDCLAMP_ResetValue (0x00000000UL) /*!< Reset value of PDCLAMP register.                                 */

/* CLAMPENABLE @Bit 0 : Clamp output to gnd when switch is powered down */
  #define SWEXT_CONFIG_PDCLAMP_CLAMPENABLE_Pos (0UL) /*!< Position of CLAMPENABLE field.                                       */
  #define SWEXT_CONFIG_PDCLAMP_CLAMPENABLE_Msk (0x1UL << SWEXT_CONFIG_PDCLAMP_CLAMPENABLE_Pos) /*!< Bit mask of CLAMPENABLE
                                                                            field.*/
  #define SWEXT_CONFIG_PDCLAMP_CLAMPENABLE_Min (0x0UL) /*!< Min enumerator value of CLAMPENABLE field.                         */
  #define SWEXT_CONFIG_PDCLAMP_CLAMPENABLE_Max (0x1UL) /*!< Max enumerator value of CLAMPENABLE field.                         */
  #define SWEXT_CONFIG_PDCLAMP_CLAMPENABLE_Disabled (0x0UL) /*!< Powerdown ground clamp disabled                               */
  #define SWEXT_CONFIG_PDCLAMP_CLAMPENABLE_Enabled (0x1UL) /*!< Powerdown ground clamp enabled                                 */



/* ================================================== Struct SWEXT_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [SWEXT_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x0000000C) Override the SETTLED signal from the analog module    */
} NRF_SWEXT_OVERRIDE_Type;                           /*!< Size = 16 (0x010)                                                    */

/* SWEXT_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define SWEXT_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                   */

/* VAL @Bit 0 : Override value for the signal */
  #define SWEXT_OVERRIDE_PWRUP_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define SWEXT_OVERRIDE_PWRUP_VAL_Msk (0x1UL << SWEXT_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define SWEXT_OVERRIDE_PWRUP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SWEXT_OVERRIDE_PWRUP_EN_Msk (0x1UL << SWEXT_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SWEXT_OVERRIDE_PWRUP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SWEXT_OVERRIDE_PWRUP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SWEXT_OVERRIDE_PWRUP_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define SWEXT_OVERRIDE_PWRUP_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* SWEXT_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define SWEXT_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                 */

/* VAL @Bit 0 : Override value for the signal */
  #define SWEXT_OVERRIDE_RETAIN_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define SWEXT_OVERRIDE_RETAIN_VAL_Msk (0x1UL << SWEXT_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define SWEXT_OVERRIDE_RETAIN_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define SWEXT_OVERRIDE_RETAIN_EN_Msk (0x1UL << SWEXT_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                      */
  #define SWEXT_OVERRIDE_RETAIN_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define SWEXT_OVERRIDE_RETAIN_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define SWEXT_OVERRIDE_RETAIN_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define SWEXT_OVERRIDE_RETAIN_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* SWEXT_OVERRIDE_READY: Override the READY signal from the analog module */
  #define SWEXT_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                   */

/* VAL @Bit 0 : Current value of the signal */
  #define SWEXT_OVERRIDE_READY_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define SWEXT_OVERRIDE_READY_VAL_Msk (0x1UL << SWEXT_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define SWEXT_OVERRIDE_READY_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SWEXT_OVERRIDE_READY_EN_Msk (0x1UL << SWEXT_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SWEXT_OVERRIDE_READY_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SWEXT_OVERRIDE_READY_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SWEXT_OVERRIDE_READY_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define SWEXT_OVERRIDE_READY_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* SWEXT_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define SWEXT_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                               */

/* VAL @Bit 0 : Current value of the signal */
  #define SWEXT_OVERRIDE_SETTLED_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define SWEXT_OVERRIDE_SETTLED_VAL_Msk (0x1UL << SWEXT_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define SWEXT_OVERRIDE_SETTLED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define SWEXT_OVERRIDE_SETTLED_EN_Msk (0x1UL << SWEXT_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define SWEXT_OVERRIDE_SETTLED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define SWEXT_OVERRIDE_SETTLED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define SWEXT_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define SWEXT_OVERRIDE_SETTLED_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */



/* ==================================================== Struct SWEXT_DFT ===================================================== */
/**
  * @brief DFT [SWEXT_DFT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
} NRF_SWEXT_DFT_Type;                                /*!< Size = 32 (0x020)                                                    */

/* SWEXT_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define SWEXT_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                              */

