adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SELMUX @Bit 0 : Select multiplexer for DTB0 */
  #define SWEXT_DFT_DTB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define SWEXT_DFT_DTB0CONFIG_SELMUX_Msk (0x1UL << SWEXT_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define SWEXT_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define SWEXT_DFT_DTB0CONFIG_SELMUX_Max (0x1UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define SWEXT_DFT_DTB0CONFIG_SELMUX_Spare0 (0x0UL) /*!< None selected, logic 0                                               */
  #define SWEXT_DFT_DTB0CONFIG_SELMUX_PwrupSw (0x1UL) /*!< PWRUP_SW                                                            */

/* EN @Bit 31 : Enable the digital test bus */
  #define SWEXT_DFT_DTB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SWEXT_DFT_DTB0CONFIG_EN_Msk (0x1UL << SWEXT_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SWEXT_DFT_DTB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SWEXT_DFT_DTB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SWEXT_DFT_DTB0CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define SWEXT_DFT_DTB0CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* SWEXT_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define SWEXT_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                              */

/* SELMUX @Bit 0 : Select multiplexer for DTB1 */
  #define SWEXT_DFT_DTB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define SWEXT_DFT_DTB1CONFIG_SELMUX_Msk (0x1UL << SWEXT_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define SWEXT_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define SWEXT_DFT_DTB1CONFIG_SELMUX_Max (0x1UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define SWEXT_DFT_DTB1CONFIG_SELMUX_Ready (0x0UL)  /*!< READY_P_SW                                                           */
  #define SWEXT_DFT_DTB1CONFIG_SELMUX_Settled (0x1UL) /*!< SETTLED_P_SW                                                        */

/* EN @Bit 31 : Enable the digital test bus */
  #define SWEXT_DFT_DTB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SWEXT_DFT_DTB1CONFIG_EN_Msk (0x1UL << SWEXT_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SWEXT_DFT_DTB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SWEXT_DFT_DTB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SWEXT_DFT_DTB1CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define SWEXT_DFT_DTB1CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* SWEXT_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define SWEXT_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                              */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define SWEXT_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                    */
  #define SWEXT_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << SWEXT_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/
  #define SWEXT_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                       */
  #define SWEXT_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                       */
  #define SWEXT_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                         */
  #define SWEXT_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                           */


/* ====================================================== Struct SWEXT ======================================================= */
/**
  * @brief SWEXT peripheral
  */
  typedef struct {                                   /*!< SWEXT Structure                                                      */
    __OM uint32_t TASKS_PWRUP;                       /*!< (@ 0x00000000) Power up switch                                       */
    __OM uint32_t TASKS_PWRDOWN;                     /*!< (@ 0x00000004) Power down switch                                     */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag                                          */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000400) Status of analog module output signals                */
    __IM uint32_t RESERVED3[3];
    __IOM NRF_SWEXT_CONFIG_Type CONFIG;              /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[26];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IM uint32_t RESERVED5[31];
    __IOM NRF_SWEXT_OVERRIDE_Type OVERRIDE;          /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED6[60];
    __IOM NRF_SWEXT_DFT_Type DFT;                    /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_SWEXT_Type;                                  /*!< Size = 1568 (0x620)                                                  */

/* SWEXT_TASKS_PWRUP: Power up switch */
  #define SWEXT_TASKS_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUP register.                                */

/* TASKS_PWRUP @Bit 0 : Power up switch */
  #define SWEXT_TASKS_PWRUP_TASKS_PWRUP_Pos (0UL)    /*!< Position of TASKS_PWRUP field.                                       */
  #define SWEXT_TASKS_PWRUP_TASKS_PWRUP_Msk (0x1UL << SWEXT_TASKS_PWRUP_TASKS_PWRUP_Pos) /*!< Bit mask of TASKS_PWRUP field.   */
  #define SWEXT_TASKS_PWRUP_TASKS_PWRUP_Min (0x1UL)  /*!< Min enumerator value of TASKS_PWRUP field.                           */
  #define SWEXT_TASKS_PWRUP_TASKS_PWRUP_Max (0x1UL)  /*!< Max enumerator value of TASKS_PWRUP field.                           */
  #define SWEXT_TASKS_PWRUP_TASKS_PWRUP_Trigger (0x1UL) /*!< Trigger task                                                      */


/* SWEXT_TASKS_PWRDOWN: Power down switch */
  #define SWEXT_TASKS_PWRDOWN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWN register.                            */

/* TASKS_PWRDOWN @Bit 0 : Power down switch */
  #define SWEXT_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos (0UL) /*!< Position of TASKS_PWRDOWN field.                                    */
  #define SWEXT_TASKS_PWRDOWN_TASKS_PWRDOWN_Msk (0x1UL << SWEXT_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos) /*!< Bit mask of TASKS_PWRDOWN
                                                                            field.*/
  #define SWEXT_TASKS_PWRDOWN_TASKS_PWRDOWN_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWN field.                      */
  #define SWEXT_TASKS_PWRDOWN_TASKS_PWRDOWN_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWN field.                      */
  #define SWEXT_TASKS_PWRDOWN_TASKS_PWRDOWN_Trigger (0x1UL) /*!< Trigger task                                                  */


