adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SWEXT_EVENTS_READY: Power up done */
  #define SWEXT_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                              */

/* EVENTS_READY @Bit 0 : Power up done */
  #define SWEXT_EVENTS_READY_EVENTS_READY_Pos (0UL)  /*!< Position of EVENTS_READY field.                                      */
  #define SWEXT_EVENTS_READY_EVENTS_READY_Msk (0x1UL << SWEXT_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY
                                                                            field.*/
  #define SWEXT_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                         */
  #define SWEXT_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                         */
  #define SWEXT_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define SWEXT_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                               */


/* SWEXT_EVENTS_SETTLED: Settled flag */
  #define SWEXT_EVENTS_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED register.                          */

/* EVENTS_SETTLED @Bit 0 : Settled flag */
  #define SWEXT_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                                 */
  #define SWEXT_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << SWEXT_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/
  #define SWEXT_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.                   */
  #define SWEXT_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.                   */
  #define SWEXT_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define SWEXT_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                           */


/* SWEXT_INTEN: Enable or disable interrupt */
  #define SWEXT_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define SWEXT_INTEN_READY_Pos (0UL)                /*!< Position of READY field.                                             */
  #define SWEXT_INTEN_READY_Msk (0x1UL << SWEXT_INTEN_READY_Pos) /*!< Bit mask of READY field.                                 */
  #define SWEXT_INTEN_READY_Min (0x0UL)              /*!< Min enumerator value of READY field.                                 */
  #define SWEXT_INTEN_READY_Max (0x1UL)              /*!< Max enumerator value of READY field.                                 */
  #define SWEXT_INTEN_READY_Disabled (0x0UL)         /*!< Disable                                                              */
  #define SWEXT_INTEN_READY_Enabled (0x1UL)          /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define SWEXT_INTEN_SETTLED_Pos (1UL)              /*!< Position of SETTLED field.                                           */
  #define SWEXT_INTEN_SETTLED_Msk (0x1UL << SWEXT_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                           */
  #define SWEXT_INTEN_SETTLED_Min (0x0UL)            /*!< Min enumerator value of SETTLED field.                               */
  #define SWEXT_INTEN_SETTLED_Max (0x1UL)            /*!< Max enumerator value of SETTLED field.                               */
  #define SWEXT_INTEN_SETTLED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define SWEXT_INTEN_SETTLED_Enabled (0x1UL)        /*!< Enable                                                               */


/* SWEXT_INTENSET: Enable interrupt */
  #define SWEXT_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define SWEXT_INTENSET_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define SWEXT_INTENSET_READY_Msk (0x1UL << SWEXT_INTENSET_READY_Pos) /*!< Bit mask of READY field.                           */
  #define SWEXT_INTENSET_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define SWEXT_INTENSET_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define SWEXT_INTENSET_READY_Set (0x1UL)           /*!< Enable                                                               */
  #define SWEXT_INTENSET_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define SWEXT_INTENSET_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define SWEXT_INTENSET_SETTLED_Pos (1UL)           /*!< Position of SETTLED field.                                           */
  #define SWEXT_INTENSET_SETTLED_Msk (0x1UL << SWEXT_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.                     */
  #define SWEXT_INTENSET_SETTLED_Min (0x0UL)         /*!< Min enumerator value of SETTLED field.                               */
  #define SWEXT_INTENSET_SETTLED_Max (0x1UL)         /*!< Max enumerator value of SETTLED field.                               */
  #define SWEXT_INTENSET_SETTLED_Set (0x1UL)         /*!< Enable                                                               */
  #define SWEXT_INTENSET_SETTLED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SWEXT_INTENSET_SETTLED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


