adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SWEXT_INTENCLR: Disable interrupt */
  #define SWEXT_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define SWEXT_INTENCLR_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define SWEXT_INTENCLR_READY_Msk (0x1UL << SWEXT_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                           */
  #define SWEXT_INTENCLR_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define SWEXT_INTENCLR_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define SWEXT_INTENCLR_READY_Clear (0x1UL)         /*!< Disable                                                              */
  #define SWEXT_INTENCLR_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define SWEXT_INTENCLR_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define SWEXT_INTENCLR_SETTLED_Pos (1UL)           /*!< Position of SETTLED field.                                           */
  #define SWEXT_INTENCLR_SETTLED_Msk (0x1UL << SWEXT_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.                     */
  #define SWEXT_INTENCLR_SETTLED_Min (0x0UL)         /*!< Min enumerator value of SETTLED field.                               */
  #define SWEXT_INTENCLR_SETTLED_Max (0x1UL)         /*!< Max enumerator value of SETTLED field.                               */
  #define SWEXT_INTENCLR_SETTLED_Clear (0x1UL)       /*!< Disable                                                              */
  #define SWEXT_INTENCLR_SETTLED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SWEXT_INTENCLR_SETTLED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* SWEXT_INTPEND: Pending interrupts */
  #define SWEXT_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define SWEXT_INTPEND_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define SWEXT_INTPEND_READY_Msk (0x1UL << SWEXT_INTPEND_READY_Pos) /*!< Bit mask of READY field.                             */
  #define SWEXT_INTPEND_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define SWEXT_INTPEND_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define SWEXT_INTPEND_READY_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define SWEXT_INTPEND_READY_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define SWEXT_INTPEND_SETTLED_Pos (1UL)            /*!< Position of SETTLED field.                                           */
  #define SWEXT_INTPEND_SETTLED_Msk (0x1UL << SWEXT_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.                       */
  #define SWEXT_INTPEND_SETTLED_Min (0x0UL)          /*!< Min enumerator value of SETTLED field.                               */
  #define SWEXT_INTPEND_SETTLED_Max (0x1UL)          /*!< Max enumerator value of SETTLED field.                               */
  #define SWEXT_INTPEND_SETTLED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define SWEXT_INTPEND_SETTLED_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* SWEXT_STATUSANA: Status of analog module output signals */
  #define SWEXT_STATUSANA_ResetValue (0x00000000UL)  /*!< Reset value of STATUSANA register.                                   */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define SWEXT_STATUSANA_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define SWEXT_STATUSANA_READY_Msk (0x1UL << SWEXT_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                         */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define SWEXT_STATUSANA_SETTLED_Pos (1UL)          /*!< Position of SETTLED field.                                           */
  #define SWEXT_STATUSANA_SETTLED_Msk (0x1UL << SWEXT_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.                   */


/* SWEXT_MIRROR: Enable LOCK for mirrored registers */
  #define SWEXT_MIRROR_ResetValue (0x00000001UL)     /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define SWEXT_MIRROR_LOCK_Pos (0UL)                /*!< Position of LOCK field.                                              */
  #define SWEXT_MIRROR_LOCK_Msk (0x1UL << SWEXT_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                  */
  #define SWEXT_MIRROR_LOCK_Min (0x0UL)              /*!< Min enumerator value of LOCK field.                                  */
  #define SWEXT_MIRROR_LOCK_Max (0x1UL)              /*!< Max enumerator value of LOCK field.                                  */
  #define SWEXT_MIRROR_LOCK_Disabled (0x0UL)         /*!< Lock disabled                                                        */
  #define SWEXT_MIRROR_LOCK_Enabled (0x1UL)          /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            SWI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct SWI ======================================================== */
/**
  * @brief Software interrupt
  */
  typedef struct {                                   /*!< SWI Structure                                                        */
    __IM uint32_t RESERVED;
  } NRF_SWI_Type;                                    /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TAMPC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TAMPC_ACTIVESHIELD ================================================ */
/**
  * @brief ACTIVESHIELD [TAMPC_ACTIVESHIELD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CHEN;                              /*!< (@ 0x00000000) Active shield detector channel enable register.       */
} NRF_TAMPC_ACTIVESHIELD_Type;                       /*!< Size = 4 (0x004)                                                     */

/* TAMPC_ACTIVESHIELD_CHEN: Active shield detector channel enable register. */
  #define TAMPC_ACTIVESHIELD_CHEN_ResetValue (0x00000000UL) /*!< Reset value of CHEN register.                                 */

/* CH0 @Bit 0 : Enable or disable active shield channel 0. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Pos (0UL)      /*!< Position of CH0 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH0_Pos) /*!< Bit mask of CH0 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Min (0x0UL)    /*!< Min enumerator value of CH0 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Max (0x1UL)    /*!< Max enumerator value of CH0 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH1 @Bit 1 : Enable or disable active shield channel 1. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Pos (1UL)      /*!< Position of CH1 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH1_Pos) /*!< Bit mask of CH1 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Min (0x0UL)    /*!< Min enumerator value of CH1 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Max (0x1UL)    /*!< Max enumerator value of CH1 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Enabled (0x1UL) /*!< Enable channel.                                                     */

