adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH2 @Bit 2 : Enable or disable active shield channel 2. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Pos (2UL)      /*!< Position of CH2 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH2_Pos) /*!< Bit mask of CH2 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Min (0x0UL)    /*!< Min enumerator value of CH2 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Max (0x1UL)    /*!< Max enumerator value of CH2 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH3 @Bit 3 : Enable or disable active shield channel 3. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Pos (3UL)      /*!< Position of CH3 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH3_Pos) /*!< Bit mask of CH3 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Min (0x0UL)    /*!< Min enumerator value of CH3 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Max (0x1UL)    /*!< Max enumerator value of CH3 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Enabled (0x1UL) /*!< Enable channel.                                                     */



/* =================================================== Struct TAMPC_GLITCH =================================================== */
/**
  * @brief GLITCH [TAMPC_GLITCH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIGSLOWDOMAIN;                  /*!< (@ 0x00000000) Configuration for slow domain glitch detectors.       */
  __IOM uint32_t  CONFIGFASTDOMAIN;                  /*!< (@ 0x00000004) Configuration for fast domain glitch detectors.       */
} NRF_TAMPC_GLITCH_Type;                             /*!< Size = 8 (0x008)                                                     */

/* TAMPC_GLITCH_CONFIGSLOWDOMAIN: Configuration for slow domain glitch detectors. */
  #define TAMPC_GLITCH_CONFIGSLOWDOMAIN_ResetValue (0x00000000UL) /*!< Reset value of CONFIGSLOWDOMAIN register.               */

/* EXTRADELAY @Bits 0..3 : Extra delay configuration. */
  #define TAMPC_GLITCH_CONFIGSLOWDOMAIN_EXTRADELAY_Pos (0UL) /*!< Position of EXTRADELAY field.                                */
  #define TAMPC_GLITCH_CONFIGSLOWDOMAIN_EXTRADELAY_Msk (0xFUL << TAMPC_GLITCH_CONFIGSLOWDOMAIN_EXTRADELAY_Pos) /*!< Bit mask of
                                                                            EXTRADELAY field.*/


/* TAMPC_GLITCH_CONFIGFASTDOMAIN: Configuration for fast domain glitch detectors. */
  #define TAMPC_GLITCH_CONFIGFASTDOMAIN_ResetValue (0x00000000UL) /*!< Reset value of CONFIGFASTDOMAIN register.               */

/* EXTRADELAY @Bits 0..3 : Extra delay configuration. */
  #define TAMPC_GLITCH_CONFIGFASTDOMAIN_EXTRADELAY_Pos (0UL) /*!< Position of EXTRADELAY field.                                */
  #define TAMPC_GLITCH_CONFIGFASTDOMAIN_EXTRADELAY_Msk (0xFUL << TAMPC_GLITCH_CONFIGFASTDOMAIN_EXTRADELAY_Pos) /*!< Bit mask of
                                                                            EXTRADELAY field.*/



/* ============================================ Struct TAMPC_PROTECT_DOMAIN_DBGEN ============================================ */
/**
  * @brief DBGEN [TAMPC_PROTECT_DOMAIN_DBGEN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRL;                              /*!< (@ 0x00000000) Control register for invasive (halting) debug enable
                                                                         for the local debug components within domain n.*/
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register for invasive (halting) debug enable for
                                                                         domain n.*/
} NRF_TAMPC_PROTECT_DOMAIN_DBGEN_Type;               /*!< Size = 8 (0x008)                                                     */

/* TAMPC_PROTECT_DOMAIN_DBGEN_CTRL: Control register for invasive (halting) debug enable for the local debug components within
                                     domain n. */

  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_ResetValue (0x00000010UL) /*!< Reset value of CTRL register.                         */

/* VALUE @Bit 0 : Set value of dbgen signal. */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                        */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Msk (0x1UL << TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Min (0x0UL) /*!< Min enumerator value of VALUE field.                          */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Max (0x1UL) /*!< Max enumerator value of VALUE field.                          */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Low (0x0UL) /*!< Signal is logic 0.                                            */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_High (0x1UL) /*!< Signal is logic 1.                                           */

/* LOCK @Bit 1 : Lock this register to prevent changes to the VALUE field until next reset. */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Pos (1UL) /*!< Position of LOCK field.                                          */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Msk (0x1UL << TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Pos) /*!< Bit mask of LOCK
                                                                            field.*/
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                            */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                            */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Disabled (0x0UL) /*!< Lock disabled.                                            */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Enabled (0x1UL) /*!< Lock enabled.                                              */

/* FAULTTEST @Bit 2 : Injects a fault in the protected signal. */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_FAULTTEST_Pos (2UL) /*!< Position of FAULTTEST field.                                */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_FAULTTEST_Msk (0x1UL << TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_FAULTTEST_Pos) /*!< Bit mask
                                                                            of FAULTTEST field.*/
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_FAULTTEST_Min (0x0UL) /*!< Min enumerator value of FAULTTEST field.                  */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_FAULTTEST_Max (0x1UL) /*!< Max enumerator value of FAULTTEST field.                  */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_FAULTTEST_NoOperation (0x0UL) /*!< No operation.                                     */
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_FAULTTEST_Trigger (0x1UL) /*!< Trigger fault.                                        */

