adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_START @Bit 0 : Start counter */
  #define TBM_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define TBM_TASKS_START_TASKS_START_Msk (0x1UL << TBM_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define TBM_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define TBM_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define TBM_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


/* TBM_TASKS_STOP: Stop counter, clear counter value */
  #define TBM_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop counter, clear counter value */
  #define TBM_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define TBM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TBM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define TBM_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define TBM_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define TBM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* TBM_TASKS_FLUSH: Save current counter value to COUNTSNAPSHOT */
  #define TBM_TASKS_FLUSH_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_FLUSH register.                                 */

/* TASKS_FLUSH @Bit 0 : Save current counter value to COUNTSNAPSHOT */
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Pos (0UL)      /*!< Position of TASKS_FLUSH field.                                       */
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Msk (0x1UL << TBM_TASKS_FLUSH_TASKS_FLUSH_Pos) /*!< Bit mask of TASKS_FLUSH field.       */
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Min (0x1UL)    /*!< Min enumerator value of TASKS_FLUSH field.                           */
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Max (0x1UL)    /*!< Max enumerator value of TASKS_FLUSH field.                           */
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Trigger (0x1UL) /*!< Trigger task                                                        */


/* TBM_EVENTS_HALFFULL: Counter value equals half-full */
  #define TBM_EVENTS_HALFFULL_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_HALFFULL register.                          */

/* EVENTS_HALFFULL @Bit 0 : Counter value equals half-full */
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Pos (0UL) /*!< Position of EVENTS_HALFFULL field.                                */
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Msk (0x1UL << TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Pos) /*!< Bit mask of
                                                                            EVENTS_HALFFULL field.*/
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Min (0x0UL) /*!< Min enumerator value of EVENTS_HALFFULL field.                  */
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Max (0x1UL) /*!< Max enumerator value of EVENTS_HALFFULL field.                  */
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Generated (0x1UL) /*!< Event generated                                           */


/* TBM_EVENTS_FULL: Counter value equals full */
  #define TBM_EVENTS_FULL_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_FULL register.                                 */

/* EVENTS_FULL @Bit 0 : Counter value equals full */
  #define TBM_EVENTS_FULL_EVENTS_FULL_Pos (0UL)      /*!< Position of EVENTS_FULL field.                                       */
  #define TBM_EVENTS_FULL_EVENTS_FULL_Msk (0x1UL << TBM_EVENTS_FULL_EVENTS_FULL_Pos) /*!< Bit mask of EVENTS_FULL field.       */
  #define TBM_EVENTS_FULL_EVENTS_FULL_Min (0x0UL)    /*!< Min enumerator value of EVENTS_FULL field.                           */
  #define TBM_EVENTS_FULL_EVENTS_FULL_Max (0x1UL)    /*!< Max enumerator value of EVENTS_FULL field.                           */
  #define TBM_EVENTS_FULL_EVENTS_FULL_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define TBM_EVENTS_FULL_EVENTS_FULL_Generated (0x1UL) /*!< Event generated                                                   */


/* TBM_EVENTS_FLUSH: Counter value saved to COUNTSNAPSHOT due to flush */
  #define TBM_EVENTS_FLUSH_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FLUSH register.                                */

/* EVENTS_FLUSH @Bit 0 : Counter value saved to COUNTSNAPSHOT due to flush */
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Pos (0UL)    /*!< Position of EVENTS_FLUSH field.                                      */
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Msk (0x1UL << TBM_EVENTS_FLUSH_EVENTS_FLUSH_Pos) /*!< Bit mask of EVENTS_FLUSH field.  */
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Min (0x0UL)  /*!< Min enumerator value of EVENTS_FLUSH field.                          */
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Max (0x1UL)  /*!< Max enumerator value of EVENTS_FLUSH field.                          */
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Generated (0x1UL) /*!< Event generated                                                 */


/* TBM_INTEN: Enable or disable interrupt */
  #define TBM_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* HALFFULL @Bit 0 : Enable or disable interrupt for event HALFFULL */
  #define TBM_INTEN_HALFFULL_Pos (0UL)               /*!< Position of HALFFULL field.                                          */
  #define TBM_INTEN_HALFFULL_Msk (0x1UL << TBM_INTEN_HALFFULL_Pos) /*!< Bit mask of HALFFULL field.                            */
  #define TBM_INTEN_HALFFULL_Min (0x0UL)             /*!< Min enumerator value of HALFFULL field.                              */
  #define TBM_INTEN_HALFFULL_Max (0x1UL)             /*!< Max enumerator value of HALFFULL field.                              */
  #define TBM_INTEN_HALFFULL_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TBM_INTEN_HALFFULL_Enabled (0x1UL)         /*!< Enable                                                               */

