adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* AMOUNT @Bits 0..15 : Number of bytes transferred in the current transaction. Continuously updated. Updated when data leaves
                        the internal FIFO and is transferred to the destination. */

  #define TDM_TXD_CURRENTAMOUNT_AMOUNT_Pos (0UL)     /*!< Position of AMOUNT field.                                            */
  #define TDM_TXD_CURRENTAMOUNT_AMOUNT_Msk (0xFFFFUL << TDM_TXD_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.       */
  #define TDM_TXD_CURRENTAMOUNT_AMOUNT_Min (0x0001UL) /*!< Min value of AMOUNT field.                                          */
  #define TDM_TXD_CURRENTAMOUNT_AMOUNT_Max (0xFFFFUL) /*!< Max size of AMOUNT field.                                           */


/* TDM_TXD_MODE: Configure EasyDMA mode */
  #define TDM_TXD_MODE_ResetValue (0x00000001UL)     /*!< Reset value of MODE register.                                        */

/* LPOP @Bits 0..1 : Enable low-power operation, or use low-latency */
  #define TDM_TXD_MODE_LPOP_Pos (0UL)                /*!< Position of LPOP field.                                              */
  #define TDM_TXD_MODE_LPOP_Msk (0x3UL << TDM_TXD_MODE_LPOP_Pos) /*!< Bit mask of LPOP field.                                  */
  #define TDM_TXD_MODE_LPOP_Min (0x0UL)              /*!< Min enumerator value of LPOP field.                                  */
  #define TDM_TXD_MODE_LPOP_Max (0x1UL)              /*!< Max enumerator value of LPOP field.                                  */
  #define TDM_TXD_MODE_LPOP_LowLat (0x0UL)           /*!< Low-latency operation                                                */
  #define TDM_TXD_MODE_LPOP_LowPower (0x1UL)         /*!< Low-power operation                                                  */


/* TDM_TXD_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define TDM_TXD_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.              */

/* ENABLE @Bit 0 : (unspecified) */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                          */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << TDM_TXD_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                            */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                            */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                     */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                       */


/* TDM_TXD_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define TDM_TXD_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                      */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define TDM_TXD_BUSERRORADDRESS_ADDRESS_Pos (0UL)  /*!< Position of ADDRESS field.                                           */
  #define TDM_TXD_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << TDM_TXD_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/



/* ================================================== Struct TDM_PCGCS_TDM =================================================== */
/**
  * @brief TDM [TDM_PCGCS_TDM] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t PENALTY[4];                       /*!< (@ 0x00000000) Penalty level for power/clock pair n. When
                                                                         FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                                                         address overlaps the PENALTY0 address and register
                                                                         description for PENALTY[0] is not valid.*/
    __IOM uint32_t PENALTY0;                         /*!< (@ 0x00000000) Penalty level for power/clock pair 0. The register
                                                                         description is valid only when FULL_PCP_ZERO feature is
                                                                         not supported*/
    __IM uint32_t RESERVED[4];
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED1[28];
  __IOM uint32_t  FORCEOVERRIDE[4];                  /*!< (@ 0x00000080) Force override of power/clock pair n.                 */
} NRF_TDM_PCGCS_TDM_Type;                            /*!< Size = 144 (0x090)                                                   */

/* TDM_PCGCS_TDM_PENALTY: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address
                           overlaps the PENALTY0 address and register description for PENALTY[0] is not valid. */

  #define TDM_PCGCS_TDM_PENALTY_MaxCount (4UL)       /*!< Max size of PENALTY[4] array.                                        */
  #define TDM_PCGCS_TDM_PENALTY_MaxIndex (3UL)       /*!< Max index of PENALTY[4] array.                                       */
  #define TDM_PCGCS_TDM_PENALTY_MinIndex (0UL)       /*!< Min index of PENALTY[4] array.                                       */
  #define TDM_PCGCS_TDM_PENALTY_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PENALTY[4] register.                             */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_TDM_PENALTY_PENALTY_Pos (0UL)    /*!< Position of PENALTY field.                                           */
  #define TDM_PCGCS_TDM_PENALTY_PENALTY_Msk (0x3UL << TDM_PCGCS_TDM_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.       */


/* TDM_PCGCS_TDM_PENALTY0: Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO
                            feature is not supported */

  #define TDM_PCGCS_TDM_PENALTY0_ResetValue (0x00000000UL) /*!< Reset value of PENALTY0 register.                              */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_TDM_PENALTY0_PENALTY_Pos (0UL)   /*!< Position of PENALTY field.                                           */
  #define TDM_PCGCS_TDM_PENALTY0_PENALTY_Msk (0x3UL << TDM_PCGCS_TDM_PENALTY0_PENALTY_Pos) /*!< Bit mask of PENALTY field.     */


/* TDM_PCGCS_TDM_FORCEOVERRIDE: Force override of power/clock pair n. */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_MaxCount (4UL) /*!< Max size of FORCEOVERRIDE[4] array.                                  */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_MaxIndex (3UL) /*!< Max index of FORCEOVERRIDE[4] array.                                 */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_MinIndex (0UL) /*!< Min index of FORCEOVERRIDE[4] array.                                 */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[4] register.                 */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                        */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << TDM_PCGCS_TDM_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!< Bit
                                                                            mask of CLOCKFORCINGPRE field.*/

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                        */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << TDM_PCGCS_TDM_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!< Bit
                                                                            mask of DOFORCECLOCKPRE field.*/

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                        */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << TDM_PCGCS_TDM_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!< Bit
                                                                            mask of POWERFORCINGPRE field.*/

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                       */
  #define TDM_PCGCS_TDM_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << TDM_PCGCS_TDM_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!< Bit
                                                                            mask of DOFORCEPOWERPRE field.*/



/* ================================================= Struct TDM_PCGCS_BRGMCK ================================================= */
/**
  * @brief BRGMCK [TDM_PCGCS_BRGMCK] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t PENALTY[3];                       /*!< (@ 0x00000000) Penalty level for power/clock pair n. When
                                                                         FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                                                         address overlaps the PENALTY0 address and register
                                                                         description for PENALTY[0] is not valid.*/
    __IOM uint32_t PENALTY0;                         /*!< (@ 0x00000000) Penalty level for power/clock pair 0. The register
                                                                         description is valid only when FULL_PCP_ZERO feature is
                                                                         not supported*/
    __IM uint32_t RESERVED[3];
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED1[29];
  __IOM uint32_t  FORCEOVERRIDE[3];                  /*!< (@ 0x00000080) Force override of power/clock pair n.                 */
} NRF_TDM_PCGCS_BRGMCK_Type;                         /*!< Size = 140 (0x08C)                                                   */

