adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TDM_PCGCS_BRGMCK_PENALTY: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0]
                              address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid. */

  #define TDM_PCGCS_BRGMCK_PENALTY_MaxCount (3UL)    /*!< Max size of PENALTY[3] array.                                        */
  #define TDM_PCGCS_BRGMCK_PENALTY_MaxIndex (2UL)    /*!< Max index of PENALTY[3] array.                                       */
  #define TDM_PCGCS_BRGMCK_PENALTY_MinIndex (0UL)    /*!< Min index of PENALTY[3] array.                                       */
  #define TDM_PCGCS_BRGMCK_PENALTY_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PENALTY[3] register.                          */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_BRGMCK_PENALTY_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                           */
  #define TDM_PCGCS_BRGMCK_PENALTY_PENALTY_Msk (0x3UL << TDM_PCGCS_BRGMCK_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field. */


/* TDM_PCGCS_BRGMCK_PENALTY0: Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO
                               feature is not supported */

  #define TDM_PCGCS_BRGMCK_PENALTY0_ResetValue (0x00000000UL) /*!< Reset value of PENALTY0 register.                           */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_BRGMCK_PENALTY0_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                          */
  #define TDM_PCGCS_BRGMCK_PENALTY0_PENALTY_Msk (0x3UL << TDM_PCGCS_BRGMCK_PENALTY0_PENALTY_Pos) /*!< Bit mask of PENALTY
                                                                            field.*/


/* TDM_PCGCS_BRGMCK_FORCEOVERRIDE: Force override of power/clock pair n. */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_MaxCount (3UL) /*!< Max size of FORCEOVERRIDE[3] array.                               */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_MaxIndex (2UL) /*!< Max index of FORCEOVERRIDE[3] array.                              */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_MinIndex (0UL) /*!< Min index of FORCEOVERRIDE[3] array.                              */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[3] register.              */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                     */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << TDM_PCGCS_BRGMCK_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!<
                                                                            Bit mask of CLOCKFORCINGPRE field.*/

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                     */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << TDM_PCGCS_BRGMCK_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!<
                                                                            Bit mask of DOFORCECLOCKPRE field.*/

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                     */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << TDM_PCGCS_BRGMCK_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!<
                                                                            Bit mask of POWERFORCINGPRE field.*/

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                    */
  #define TDM_PCGCS_BRGMCK_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << TDM_PCGCS_BRGMCK_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!<
                                                                            Bit mask of DOFORCEPOWERPRE field.*/



/* ================================================= Struct TDM_PCGCS_BRGSCK ================================================= */
/**
  * @brief BRGSCK [TDM_PCGCS_BRGSCK] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t PENALTY[3];                       /*!< (@ 0x00000000) Penalty level for power/clock pair n. When
                                                                         FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                                                         address overlaps the PENALTY0 address and register
                                                                         description for PENALTY[0] is not valid.*/
    __IOM uint32_t PENALTY0;                         /*!< (@ 0x00000000) Penalty level for power/clock pair 0. The register
                                                                         description is valid only when FULL_PCP_ZERO feature is
                                                                         not supported*/
    __IM uint32_t RESERVED[3];
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED1[29];
  __IOM uint32_t  FORCEOVERRIDE[3];                  /*!< (@ 0x00000080) Force override of power/clock pair n.                 */
} NRF_TDM_PCGCS_BRGSCK_Type;                         /*!< Size = 140 (0x08C)                                                   */

/* TDM_PCGCS_BRGSCK_PENALTY: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0]
                              address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid. */

  #define TDM_PCGCS_BRGSCK_PENALTY_MaxCount (3UL)    /*!< Max size of PENALTY[3] array.                                        */
  #define TDM_PCGCS_BRGSCK_PENALTY_MaxIndex (2UL)    /*!< Max index of PENALTY[3] array.                                       */
  #define TDM_PCGCS_BRGSCK_PENALTY_MinIndex (0UL)    /*!< Min index of PENALTY[3] array.                                       */
  #define TDM_PCGCS_BRGSCK_PENALTY_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PENALTY[3] register.                          */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_BRGSCK_PENALTY_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                           */
  #define TDM_PCGCS_BRGSCK_PENALTY_PENALTY_Msk (0x3UL << TDM_PCGCS_BRGSCK_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field. */


/* TDM_PCGCS_BRGSCK_PENALTY0: Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO
                               feature is not supported */

  #define TDM_PCGCS_BRGSCK_PENALTY0_ResetValue (0x00000000UL) /*!< Reset value of PENALTY0 register.                           */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_BRGSCK_PENALTY0_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                          */
  #define TDM_PCGCS_BRGSCK_PENALTY0_PENALTY_Msk (0x3UL << TDM_PCGCS_BRGSCK_PENALTY0_PENALTY_Pos) /*!< Bit mask of PENALTY
                                                                            field.*/


/* TDM_PCGCS_BRGSCK_FORCEOVERRIDE: Force override of power/clock pair n. */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_MaxCount (3UL) /*!< Max size of FORCEOVERRIDE[3] array.                               */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_MaxIndex (2UL) /*!< Max index of FORCEOVERRIDE[3] array.                              */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_MinIndex (0UL) /*!< Min index of FORCEOVERRIDE[3] array.                              */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[3] register.              */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                     */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << TDM_PCGCS_BRGSCK_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!<
                                                                            Bit mask of CLOCKFORCINGPRE field.*/

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                     */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << TDM_PCGCS_BRGSCK_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!<
                                                                            Bit mask of DOFORCECLOCKPRE field.*/

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                     */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << TDM_PCGCS_BRGSCK_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!<
                                                                            Bit mask of POWERFORCINGPRE field.*/

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                    */
  #define TDM_PCGCS_BRGSCK_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << TDM_PCGCS_BRGSCK_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!<
                                                                            Bit mask of DOFORCEPOWERPRE field.*/



/* ================================================= Struct TDM_PCGCS_DMARX ================================================== */
/**
  * @brief DMARX [TDM_PCGCS_DMARX] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t PENALTY[2];                       /*!< (@ 0x00000000) Penalty level for power/clock pair n. When
                                                                         FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                                                         address overlaps the PENALTY0 address and register
                                                                         description for PENALTY[0] is not valid.*/
    __IOM uint32_t PENALTY0;                         /*!< (@ 0x00000000) Penalty level for power/clock pair 0. The register
                                                                         description is valid only when FULL_PCP_ZERO feature is
                                                                         not supported*/
    __IM uint32_t RESERVED[2];
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED1[30];
  __IOM uint32_t  FORCEOVERRIDE[2];                  /*!< (@ 0x00000080) Force override of power/clock pair n.                 */
} NRF_TDM_PCGCS_DMARX_Type;                          /*!< Size = 136 (0x088)                                                   */

/* TDM_PCGCS_DMARX_PENALTY: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0]
                             address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid. */

  #define TDM_PCGCS_DMARX_PENALTY_MaxCount (2UL)     /*!< Max size of PENALTY[2] array.                                        */
  #define TDM_PCGCS_DMARX_PENALTY_MaxIndex (1UL)     /*!< Max index of PENALTY[2] array.                                       */
  #define TDM_PCGCS_DMARX_PENALTY_MinIndex (0UL)     /*!< Min index of PENALTY[2] array.                                       */
  #define TDM_PCGCS_DMARX_PENALTY_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PENALTY[2] register.                           */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_DMARX_PENALTY_PENALTY_Pos (0UL)  /*!< Position of PENALTY field.                                           */
  #define TDM_PCGCS_DMARX_PENALTY_PENALTY_Msk (0x3UL << TDM_PCGCS_DMARX_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.   */


/* TDM_PCGCS_DMARX_PENALTY0: Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO
                              feature is not supported */

  #define TDM_PCGCS_DMARX_PENALTY0_ResetValue (0x00000000UL) /*!< Reset value of PENALTY0 register.                            */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_DMARX_PENALTY0_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                           */
  #define TDM_PCGCS_DMARX_PENALTY0_PENALTY_Msk (0x3UL << TDM_PCGCS_DMARX_PENALTY0_PENALTY_Pos) /*!< Bit mask of PENALTY field. */


/* TDM_PCGCS_DMARX_FORCEOVERRIDE: Force override of power/clock pair n. */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_MaxCount (2UL) /*!< Max size of FORCEOVERRIDE[2] array.                                */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_MaxIndex (1UL) /*!< Max index of FORCEOVERRIDE[2] array.                               */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_MinIndex (0UL) /*!< Min index of FORCEOVERRIDE[2] array.                               */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[2] register.               */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                      */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << TDM_PCGCS_DMARX_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!<
                                                                            Bit mask of CLOCKFORCINGPRE field.*/

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                      */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << TDM_PCGCS_DMARX_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!<
                                                                            Bit mask of DOFORCECLOCKPRE field.*/

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                      */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << TDM_PCGCS_DMARX_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!<
                                                                            Bit mask of POWERFORCINGPRE field.*/

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                     */
  #define TDM_PCGCS_DMARX_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << TDM_PCGCS_DMARX_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!<
                                                                            Bit mask of DOFORCEPOWERPRE field.*/



/* ================================================= Struct TDM_PCGCS_DMATX ================================================== */
/**
  * @brief DMATX [TDM_PCGCS_DMATX] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t PENALTY[2];                       /*!< (@ 0x00000000) Penalty level for power/clock pair n. When
                                                                         FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                                                         address overlaps the PENALTY0 address and register
                                                                         description for PENALTY[0] is not valid.*/
    __IOM uint32_t PENALTY0;                         /*!< (@ 0x00000000) Penalty level for power/clock pair 0. The register
                                                                         description is valid only when FULL_PCP_ZERO feature is
                                                                         not supported*/
    __IM uint32_t RESERVED[2];
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED1[30];
  __IOM uint32_t  FORCEOVERRIDE[2];                  /*!< (@ 0x00000080) Force override of power/clock pair n.                 */
} NRF_TDM_PCGCS_DMATX_Type;                          /*!< Size = 136 (0x088)                                                   */

/* TDM_PCGCS_DMATX_PENALTY: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0]
                             address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid. */

