adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define TDM_PCGCS_DMATX_PENALTY_MaxCount (2UL)     /*!< Max size of PENALTY[2] array.                                        */
  #define TDM_PCGCS_DMATX_PENALTY_MaxIndex (1UL)     /*!< Max index of PENALTY[2] array.                                       */
  #define TDM_PCGCS_DMATX_PENALTY_MinIndex (0UL)     /*!< Min index of PENALTY[2] array.                                       */
  #define TDM_PCGCS_DMATX_PENALTY_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PENALTY[2] register.                           */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_DMATX_PENALTY_PENALTY_Pos (0UL)  /*!< Position of PENALTY field.                                           */
  #define TDM_PCGCS_DMATX_PENALTY_PENALTY_Msk (0x3UL << TDM_PCGCS_DMATX_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.   */


/* TDM_PCGCS_DMATX_PENALTY0: Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO
                              feature is not supported */

  #define TDM_PCGCS_DMATX_PENALTY0_ResetValue (0x00000000UL) /*!< Reset value of PENALTY0 register.                            */

/* PENALTY @Bits 0..1 : Penalty level */
  #define TDM_PCGCS_DMATX_PENALTY0_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                           */
  #define TDM_PCGCS_DMATX_PENALTY0_PENALTY_Msk (0x3UL << TDM_PCGCS_DMATX_PENALTY0_PENALTY_Pos) /*!< Bit mask of PENALTY field. */


/* TDM_PCGCS_DMATX_FORCEOVERRIDE: Force override of power/clock pair n. */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_MaxCount (2UL) /*!< Max size of FORCEOVERRIDE[2] array.                                */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_MaxIndex (1UL) /*!< Max index of FORCEOVERRIDE[2] array.                               */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_MinIndex (0UL) /*!< Min index of FORCEOVERRIDE[2] array.                               */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[2] register.               */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                      */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << TDM_PCGCS_DMATX_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!<
                                                                            Bit mask of CLOCKFORCINGPRE field.*/

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                      */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << TDM_PCGCS_DMATX_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!<
                                                                            Bit mask of DOFORCECLOCKPRE field.*/

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                      */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << TDM_PCGCS_DMATX_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!<
                                                                            Bit mask of POWERFORCINGPRE field.*/

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                     */
  #define TDM_PCGCS_DMATX_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << TDM_PCGCS_DMATX_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!<
                                                                            Bit mask of DOFORCEPOWERPRE field.*/



/* ==================================================== Struct TDM_PCGCS ===================================================== */
/**
  * @brief PCGCS [TDM_PCGCS] (unspecified)
  */
typedef struct {
  __IOM NRF_TDM_PCGCS_TDM_Type TDM;                  /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED[28];
  __IOM NRF_TDM_PCGCS_BRGMCK_Type BRGMCK;            /*!< (@ 0x00000100) (unspecified)                                         */
  __IM  uint32_t  RESERVED1[29];
  __IOM NRF_TDM_PCGCS_BRGSCK_Type BRGSCK;            /*!< (@ 0x00000200) (unspecified)                                         */
  __IM  uint32_t  RESERVED2[29];
  __IOM NRF_TDM_PCGCS_DMARX_Type DMARX;              /*!< (@ 0x00000300) (unspecified)                                         */
  __IM  uint32_t  RESERVED3[30];
  __IOM NRF_TDM_PCGCS_DMATX_Type DMATX;              /*!< (@ 0x00000400) (unspecified)                                         */
} NRF_TDM_PCGCS_Type;                                /*!< Size = 1160 (0x488)                                                  */

/* ======================================================= Struct TDM ======================================================== */
/**
  * @brief Time division multiplexed audio interface
  */
  typedef struct {                                   /*!< TDM Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Starts continuous TDM transfer. Also starts MCK when
                                                                         this is enabled*/
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stops TDM transfer after the completion of MAXCNT
                                                                         words. Triggering this task will cause the STOPPED
                                                                         event to be generated.*/
    __OM uint32_t TASKS_ABORT;                       /*!< (@ 0x00000008) Abort TDM transfer without completing MAXCNT words.
                                                                         Triggering this task will cause the ABORTED event to be
                                                                         generated.*/
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_ABORT;                  /*!< (@ 0x00000088) Subscribe configuration for task ABORT                */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_DMA_END_TX;                /*!< (@ 0x00000100) End of transmission Equivalent to eventDmaEndTx       */
    __IOM uint32_t EVENTS_RXPTRUPD;                  /*!< (@ 0x00000104) The RXD.PTR register has been copied to internal
                                                                         double-buffers. When TDM is started and RX is enabled,
                                                                         this event will be generated for every RXTXD.MAXCNT
                                                                         words received on the SDIN pin. Equivalent to
                                                                         eventDmaReadyRx.*/
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000108) Transfer stopped.                                     */
    __IOM uint32_t EVENTS_ABORTED;                   /*!< (@ 0x0000010C) Transfer aborted.                                     */
    __IOM uint32_t EVENTS_ERROR_TX;                  /*!< (@ 0x00000110) DMA read from memory failed. Equivalent to
                                                                         eventUnderflowTx*/
    __IOM uint32_t EVENTS_ERROR_RX;                  /*!< (@ 0x00000114) DMA write to memory failed. Equivalent to
                                                                         eventOverflowRx*/
    __IOM uint32_t EVENTS_TXPTRUPD;                  /*!< (@ 0x00000118) The TDX.PTR register has been copied to internal
                                                                         double-buffers. When TDM is started and TX is enabled,
                                                                         this event will be generated for every RXTXD.MAXCNT
                                                                         words that are sent on the SDOUT pin. Equivalent to
                                                                         eventDmaReadyTx.*/
    __IOM uint32_t EVENTS_DMA_END_RX;                /*!< (@ 0x0000011C) End of transmission Equivalent to eventDmaEndRx       */
    __IOM uint32_t EVENTS_MAXCNT;                    /*!< (@ 0x00000120) MAXCNT block event, generated on the active edge of
                                                                         FSYNC of every MAXCNT block*/
    __IOM uint32_t EVENTS_BUSERROR_RX;               /*!< (@ 0x00000124) This event is generated if an error occurs during the
                                                                         bus transfer. This event is generated on an AHB / AXI
                                                                         error response.*/
    __IOM uint32_t EVENTS_BUSERROR_TX;               /*!< (@ 0x00000128) This event is generated if an error occurs during the
                                                                         bus transfer. This event is generated on an AHB / AXI
                                                                         error response.*/
    __IM uint32_t RESERVED2[21];
    __IOM uint32_t PUBLISH_DMA_END_TX;               /*!< (@ 0x00000180) Publish configuration for event DMA_END_TX            */
    __IOM uint32_t PUBLISH_RXPTRUPD;                 /*!< (@ 0x00000184) Publish configuration for event RXPTRUPD              */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000188) Publish configuration for event STOPPED               */
    __IOM uint32_t PUBLISH_ABORTED;                  /*!< (@ 0x0000018C) Publish configuration for event ABORTED               */
    __IOM uint32_t PUBLISH_ERROR_TX;                 /*!< (@ 0x00000190) Publish configuration for event ERROR_TX              */
    __IOM uint32_t PUBLISH_ERROR_RX;                 /*!< (@ 0x00000194) Publish configuration for event ERROR_RX              */
    __IOM uint32_t PUBLISH_TXPTRUPD;                 /*!< (@ 0x00000198) Publish configuration for event TXPTRUPD              */
    __IOM uint32_t PUBLISH_DMA_END_RX;               /*!< (@ 0x0000019C) Publish configuration for event DMA_END_RX            */
    __IOM uint32_t PUBLISH_MAXCNT;                   /*!< (@ 0x000001A0) Publish configuration for event MAXCNT                */
    __IOM uint32_t PUBLISH_BUSERROR_RX;              /*!< (@ 0x000001A4) Publish configuration for event BUSERROR_RX           */
    __IOM uint32_t PUBLISH_BUSERROR_TX;              /*!< (@ 0x000001A8) Publish configuration for event BUSERROR_TX           */
    __IM uint32_t RESERVED3[85];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable TDM                                            */
    __IOM NRF_TDM_CONFIG_Type CONFIG;                /*!< (@ 0x00000504) Configuration registers.                              */
    __IM uint32_t RESERVED5[11];
    __IOM NRF_TDM_PSEL_Type PSEL;                    /*!< (@ 0x00000570) (unspecified)                                         */
    __IM uint32_t RESERVED6[95];
    __IOM NRF_TDM_RXD_Type RXD;                      /*!< (@ 0x00000700) (unspecified)                                         */
    __IM uint32_t RESERVED7[7];
    __IOM NRF_TDM_TXD_Type TXD;                      /*!< (@ 0x00000740) (unspecified)                                         */
    __IM uint32_t RESERVED8[231];
    __IOM NRF_TDM_PCGCS_Type PCGCS;                  /*!< (@ 0x00000B00) (unspecified)                                         */
  } NRF_TDM_Type;                                    /*!< Size = 3976 (0xF88)                                                  */

/* TDM_TASKS_START: Starts continuous TDM transfer. Also starts MCK when this is enabled */
  #define TDM_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

