adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TDM_PUBLISH_ERROR_RX: Publish configuration for event ERROR_RX */
  #define TDM_PUBLISH_ERROR_RX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR_RX register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR_RX will publish to */
  #define TDM_PUBLISH_ERROR_RX_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_ERROR_RX_CHIDX_Msk (0xFFUL << TDM_PUBLISH_ERROR_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TDM_PUBLISH_ERROR_RX_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_ERROR_RX_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_ERROR_RX_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_ERROR_RX_EN_Msk (0x1UL << TDM_PUBLISH_ERROR_RX_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TDM_PUBLISH_ERROR_RX_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ERROR_RX_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ERROR_RX_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_ERROR_RX_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* TDM_PUBLISH_TXPTRUPD: Publish configuration for event TXPTRUPD */
  #define TDM_PUBLISH_TXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXPTRUPD register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event TXPTRUPD will publish to */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Msk (0xFFUL << TDM_PUBLISH_TXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_TXPTRUPD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_TXPTRUPD_EN_Msk (0x1UL << TDM_PUBLISH_TXPTRUPD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TDM_PUBLISH_TXPTRUPD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_TXPTRUPD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_TXPTRUPD_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_TXPTRUPD_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* TDM_PUBLISH_DMA_END_RX: Publish configuration for event DMA_END_RX */
  #define TDM_PUBLISH_DMA_END_RX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DMA_END_RX register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event DMA_END_RX will publish to */
  #define TDM_PUBLISH_DMA_END_RX_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_DMA_END_RX_CHIDX_Msk (0xFFUL << TDM_PUBLISH_DMA_END_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TDM_PUBLISH_DMA_END_RX_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_DMA_END_RX_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_DMA_END_RX_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_DMA_END_RX_EN_Msk (0x1UL << TDM_PUBLISH_DMA_END_RX_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TDM_PUBLISH_DMA_END_RX_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_DMA_END_RX_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_DMA_END_RX_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_DMA_END_RX_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* TDM_PUBLISH_MAXCNT: Publish configuration for event MAXCNT */
  #define TDM_PUBLISH_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_MAXCNT register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event MAXCNT will publish to */
  #define TDM_PUBLISH_MAXCNT_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_MAXCNT_CHIDX_Msk (0xFFUL << TDM_PUBLISH_MAXCNT_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TDM_PUBLISH_MAXCNT_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_MAXCNT_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_MAXCNT_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_MAXCNT_EN_Msk (0x1UL << TDM_PUBLISH_MAXCNT_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TDM_PUBLISH_MAXCNT_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_MAXCNT_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_MAXCNT_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_MAXCNT_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* TDM_PUBLISH_BUSERROR_RX: Publish configuration for event BUSERROR_RX */
  #define TDM_PUBLISH_BUSERROR_RX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_BUSERROR_RX register.                  */

