adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ERROR_RX @Bit 5 : Enable or disable interrupt for event ERROR_RX */
  #define TDM_INTEN_ERROR_RX_Pos (5UL)               /*!< Position of ERROR_RX field.                                          */
  #define TDM_INTEN_ERROR_RX_Msk (0x1UL << TDM_INTEN_ERROR_RX_Pos) /*!< Bit mask of ERROR_RX field.                            */
  #define TDM_INTEN_ERROR_RX_Min (0x0UL)             /*!< Min enumerator value of ERROR_RX field.                              */
  #define TDM_INTEN_ERROR_RX_Max (0x1UL)             /*!< Max enumerator value of ERROR_RX field.                              */
  #define TDM_INTEN_ERROR_RX_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TDM_INTEN_ERROR_RX_Enabled (0x1UL)         /*!< Enable                                                               */

/* TXPTRUPD @Bit 6 : Enable or disable interrupt for event TXPTRUPD */
  #define TDM_INTEN_TXPTRUPD_Pos (6UL)               /*!< Position of TXPTRUPD field.                                          */
  #define TDM_INTEN_TXPTRUPD_Msk (0x1UL << TDM_INTEN_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                            */
  #define TDM_INTEN_TXPTRUPD_Min (0x0UL)             /*!< Min enumerator value of TXPTRUPD field.                              */
  #define TDM_INTEN_TXPTRUPD_Max (0x1UL)             /*!< Max enumerator value of TXPTRUPD field.                              */
  #define TDM_INTEN_TXPTRUPD_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TDM_INTEN_TXPTRUPD_Enabled (0x1UL)         /*!< Enable                                                               */

/* DMA_END_RX @Bit 7 : Enable or disable interrupt for event DMA_END_RX */
  #define TDM_INTEN_DMA_END_RX_Pos (7UL)             /*!< Position of DMA_END_RX field.                                        */
  #define TDM_INTEN_DMA_END_RX_Msk (0x1UL << TDM_INTEN_DMA_END_RX_Pos) /*!< Bit mask of DMA_END_RX field.                      */
  #define TDM_INTEN_DMA_END_RX_Min (0x0UL)           /*!< Min enumerator value of DMA_END_RX field.                            */
  #define TDM_INTEN_DMA_END_RX_Max (0x1UL)           /*!< Max enumerator value of DMA_END_RX field.                            */
  #define TDM_INTEN_DMA_END_RX_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TDM_INTEN_DMA_END_RX_Enabled (0x1UL)       /*!< Enable                                                               */

/* MAXCNT @Bit 8 : Enable or disable interrupt for event MAXCNT */
  #define TDM_INTEN_MAXCNT_Pos (8UL)                 /*!< Position of MAXCNT field.                                            */
  #define TDM_INTEN_MAXCNT_Msk (0x1UL << TDM_INTEN_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                                  */
  #define TDM_INTEN_MAXCNT_Min (0x0UL)               /*!< Min enumerator value of MAXCNT field.                                */
  #define TDM_INTEN_MAXCNT_Max (0x1UL)               /*!< Max enumerator value of MAXCNT field.                                */
  #define TDM_INTEN_MAXCNT_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TDM_INTEN_MAXCNT_Enabled (0x1UL)           /*!< Enable                                                               */

/* BUSERROR_RX @Bit 9 : Enable or disable interrupt for event BUSERROR_RX */
  #define TDM_INTEN_BUSERROR_RX_Pos (9UL)            /*!< Position of BUSERROR_RX field.                                       */
  #define TDM_INTEN_BUSERROR_RX_Msk (0x1UL << TDM_INTEN_BUSERROR_RX_Pos) /*!< Bit mask of BUSERROR_RX field.                   */
  #define TDM_INTEN_BUSERROR_RX_Min (0x0UL)          /*!< Min enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTEN_BUSERROR_RX_Max (0x1UL)          /*!< Max enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTEN_BUSERROR_RX_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TDM_INTEN_BUSERROR_RX_Enabled (0x1UL)      /*!< Enable                                                               */

/* BUSERROR_TX @Bit 10 : Enable or disable interrupt for event BUSERROR_TX */
  #define TDM_INTEN_BUSERROR_TX_Pos (10UL)           /*!< Position of BUSERROR_TX field.                                       */
  #define TDM_INTEN_BUSERROR_TX_Msk (0x1UL << TDM_INTEN_BUSERROR_TX_Pos) /*!< Bit mask of BUSERROR_TX field.                   */
  #define TDM_INTEN_BUSERROR_TX_Min (0x0UL)          /*!< Min enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTEN_BUSERROR_TX_Max (0x1UL)          /*!< Max enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTEN_BUSERROR_TX_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TDM_INTEN_BUSERROR_TX_Enabled (0x1UL)      /*!< Enable                                                               */


/* TDM_INTENSET: Enable interrupt */
  #define TDM_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* DMA_END_TX @Bit 0 : Write '1' to enable interrupt for event DMA_END_TX */
  #define TDM_INTENSET_DMA_END_TX_Pos (0UL)          /*!< Position of DMA_END_TX field.                                        */
  #define TDM_INTENSET_DMA_END_TX_Msk (0x1UL << TDM_INTENSET_DMA_END_TX_Pos) /*!< Bit mask of DMA_END_TX field.                */
  #define TDM_INTENSET_DMA_END_TX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_TX field.                            */
  #define TDM_INTENSET_DMA_END_TX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_TX field.                            */
  #define TDM_INTENSET_DMA_END_TX_Set (0x1UL)        /*!< Enable                                                               */
  #define TDM_INTENSET_DMA_END_TX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_DMA_END_TX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RXPTRUPD @Bit 1 : Write '1' to enable interrupt for event RXPTRUPD */
  #define TDM_INTENSET_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define TDM_INTENSET_RXPTRUPD_Msk (0x1UL << TDM_INTENSET_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define TDM_INTENSET_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENSET_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENSET_RXPTRUPD_Set (0x1UL)          /*!< Enable                                                               */
  #define TDM_INTENSET_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to enable interrupt for event STOPPED */
  #define TDM_INTENSET_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define TDM_INTENSET_STOPPED_Msk (0x1UL << TDM_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define TDM_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define TDM_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define TDM_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define TDM_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ABORTED @Bit 3 : Write '1' to enable interrupt for event ABORTED */
  #define TDM_INTENSET_ABORTED_Pos (3UL)             /*!< Position of ABORTED field.                                           */
  #define TDM_INTENSET_ABORTED_Msk (0x1UL << TDM_INTENSET_ABORTED_Pos) /*!< Bit mask of ABORTED field.                         */
  #define TDM_INTENSET_ABORTED_Min (0x0UL)           /*!< Min enumerator value of ABORTED field.                               */
  #define TDM_INTENSET_ABORTED_Max (0x1UL)           /*!< Max enumerator value of ABORTED field.                               */
  #define TDM_INTENSET_ABORTED_Set (0x1UL)           /*!< Enable                                                               */
  #define TDM_INTENSET_ABORTED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_ABORTED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR_TX @Bit 4 : Write '1' to enable interrupt for event ERROR_TX */
  #define TDM_INTENSET_ERROR_TX_Pos (4UL)            /*!< Position of ERROR_TX field.                                          */
  #define TDM_INTENSET_ERROR_TX_Msk (0x1UL << TDM_INTENSET_ERROR_TX_Pos) /*!< Bit mask of ERROR_TX field.                      */
  #define TDM_INTENSET_ERROR_TX_Min (0x0UL)          /*!< Min enumerator value of ERROR_TX field.                              */
  #define TDM_INTENSET_ERROR_TX_Max (0x1UL)          /*!< Max enumerator value of ERROR_TX field.                              */
  #define TDM_INTENSET_ERROR_TX_Set (0x1UL)          /*!< Enable                                                               */
  #define TDM_INTENSET_ERROR_TX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_ERROR_TX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

