adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ERROR_RX @Bit 5 : Write '1' to enable interrupt for event ERROR_RX */
  #define TDM_INTENSET_ERROR_RX_Pos (5UL)            /*!< Position of ERROR_RX field.                                          */
  #define TDM_INTENSET_ERROR_RX_Msk (0x1UL << TDM_INTENSET_ERROR_RX_Pos) /*!< Bit mask of ERROR_RX field.                      */
  #define TDM_INTENSET_ERROR_RX_Min (0x0UL)          /*!< Min enumerator value of ERROR_RX field.                              */
  #define TDM_INTENSET_ERROR_RX_Max (0x1UL)          /*!< Max enumerator value of ERROR_RX field.                              */
  #define TDM_INTENSET_ERROR_RX_Set (0x1UL)          /*!< Enable                                                               */
  #define TDM_INTENSET_ERROR_RX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_ERROR_RX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 6 : Write '1' to enable interrupt for event TXPTRUPD */
  #define TDM_INTENSET_TXPTRUPD_Pos (6UL)            /*!< Position of TXPTRUPD field.                                          */
  #define TDM_INTENSET_TXPTRUPD_Msk (0x1UL << TDM_INTENSET_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define TDM_INTENSET_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENSET_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENSET_TXPTRUPD_Set (0x1UL)          /*!< Enable                                                               */
  #define TDM_INTENSET_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DMA_END_RX @Bit 7 : Write '1' to enable interrupt for event DMA_END_RX */
  #define TDM_INTENSET_DMA_END_RX_Pos (7UL)          /*!< Position of DMA_END_RX field.                                        */
  #define TDM_INTENSET_DMA_END_RX_Msk (0x1UL << TDM_INTENSET_DMA_END_RX_Pos) /*!< Bit mask of DMA_END_RX field.                */
  #define TDM_INTENSET_DMA_END_RX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_RX field.                            */
  #define TDM_INTENSET_DMA_END_RX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_RX field.                            */
  #define TDM_INTENSET_DMA_END_RX_Set (0x1UL)        /*!< Enable                                                               */
  #define TDM_INTENSET_DMA_END_RX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_DMA_END_RX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* MAXCNT @Bit 8 : Write '1' to enable interrupt for event MAXCNT */
  #define TDM_INTENSET_MAXCNT_Pos (8UL)              /*!< Position of MAXCNT field.                                            */
  #define TDM_INTENSET_MAXCNT_Msk (0x1UL << TDM_INTENSET_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                            */
  #define TDM_INTENSET_MAXCNT_Min (0x0UL)            /*!< Min enumerator value of MAXCNT field.                                */
  #define TDM_INTENSET_MAXCNT_Max (0x1UL)            /*!< Max enumerator value of MAXCNT field.                                */
  #define TDM_INTENSET_MAXCNT_Set (0x1UL)            /*!< Enable                                                               */
  #define TDM_INTENSET_MAXCNT_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_MAXCNT_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* BUSERROR_RX @Bit 9 : Write '1' to enable interrupt for event BUSERROR_RX */
  #define TDM_INTENSET_BUSERROR_RX_Pos (9UL)         /*!< Position of BUSERROR_RX field.                                       */
  #define TDM_INTENSET_BUSERROR_RX_Msk (0x1UL << TDM_INTENSET_BUSERROR_RX_Pos) /*!< Bit mask of BUSERROR_RX field.             */
  #define TDM_INTENSET_BUSERROR_RX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENSET_BUSERROR_RX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENSET_BUSERROR_RX_Set (0x1UL)       /*!< Enable                                                               */
  #define TDM_INTENSET_BUSERROR_RX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_BUSERROR_RX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* BUSERROR_TX @Bit 10 : Write '1' to enable interrupt for event BUSERROR_TX */
  #define TDM_INTENSET_BUSERROR_TX_Pos (10UL)        /*!< Position of BUSERROR_TX field.                                       */
  #define TDM_INTENSET_BUSERROR_TX_Msk (0x1UL << TDM_INTENSET_BUSERROR_TX_Pos) /*!< Bit mask of BUSERROR_TX field.             */
  #define TDM_INTENSET_BUSERROR_TX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENSET_BUSERROR_TX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENSET_BUSERROR_TX_Set (0x1UL)       /*!< Enable                                                               */
  #define TDM_INTENSET_BUSERROR_TX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_BUSERROR_TX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TDM_INTENCLR: Disable interrupt */
  #define TDM_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* DMA_END_TX @Bit 0 : Write '1' to disable interrupt for event DMA_END_TX */
  #define TDM_INTENCLR_DMA_END_TX_Pos (0UL)          /*!< Position of DMA_END_TX field.                                        */
  #define TDM_INTENCLR_DMA_END_TX_Msk (0x1UL << TDM_INTENCLR_DMA_END_TX_Pos) /*!< Bit mask of DMA_END_TX field.                */
  #define TDM_INTENCLR_DMA_END_TX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_TX field.                            */
  #define TDM_INTENCLR_DMA_END_TX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_TX field.                            */
  #define TDM_INTENCLR_DMA_END_TX_Clear (0x1UL)      /*!< Disable                                                              */
  #define TDM_INTENCLR_DMA_END_TX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_DMA_END_TX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

