adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RXPTRUPD @Bit 1 : Write '1' to disable interrupt for event RXPTRUPD */
  #define TDM_INTENCLR_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define TDM_INTENCLR_RXPTRUPD_Msk (0x1UL << TDM_INTENCLR_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define TDM_INTENCLR_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENCLR_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENCLR_RXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to disable interrupt for event STOPPED */
  #define TDM_INTENCLR_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define TDM_INTENCLR_STOPPED_Msk (0x1UL << TDM_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define TDM_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define TDM_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define TDM_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define TDM_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ABORTED @Bit 3 : Write '1' to disable interrupt for event ABORTED */
  #define TDM_INTENCLR_ABORTED_Pos (3UL)             /*!< Position of ABORTED field.                                           */
  #define TDM_INTENCLR_ABORTED_Msk (0x1UL << TDM_INTENCLR_ABORTED_Pos) /*!< Bit mask of ABORTED field.                         */
  #define TDM_INTENCLR_ABORTED_Min (0x0UL)           /*!< Min enumerator value of ABORTED field.                               */
  #define TDM_INTENCLR_ABORTED_Max (0x1UL)           /*!< Max enumerator value of ABORTED field.                               */
  #define TDM_INTENCLR_ABORTED_Clear (0x1UL)         /*!< Disable                                                              */
  #define TDM_INTENCLR_ABORTED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_ABORTED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR_TX @Bit 4 : Write '1' to disable interrupt for event ERROR_TX */
  #define TDM_INTENCLR_ERROR_TX_Pos (4UL)            /*!< Position of ERROR_TX field.                                          */
  #define TDM_INTENCLR_ERROR_TX_Msk (0x1UL << TDM_INTENCLR_ERROR_TX_Pos) /*!< Bit mask of ERROR_TX field.                      */
  #define TDM_INTENCLR_ERROR_TX_Min (0x0UL)          /*!< Min enumerator value of ERROR_TX field.                              */
  #define TDM_INTENCLR_ERROR_TX_Max (0x1UL)          /*!< Max enumerator value of ERROR_TX field.                              */
  #define TDM_INTENCLR_ERROR_TX_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_ERROR_TX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_ERROR_TX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR_RX @Bit 5 : Write '1' to disable interrupt for event ERROR_RX */
  #define TDM_INTENCLR_ERROR_RX_Pos (5UL)            /*!< Position of ERROR_RX field.                                          */
  #define TDM_INTENCLR_ERROR_RX_Msk (0x1UL << TDM_INTENCLR_ERROR_RX_Pos) /*!< Bit mask of ERROR_RX field.                      */
  #define TDM_INTENCLR_ERROR_RX_Min (0x0UL)          /*!< Min enumerator value of ERROR_RX field.                              */
  #define TDM_INTENCLR_ERROR_RX_Max (0x1UL)          /*!< Max enumerator value of ERROR_RX field.                              */
  #define TDM_INTENCLR_ERROR_RX_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_ERROR_RX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_ERROR_RX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 6 : Write '1' to disable interrupt for event TXPTRUPD */
  #define TDM_INTENCLR_TXPTRUPD_Pos (6UL)            /*!< Position of TXPTRUPD field.                                          */
  #define TDM_INTENCLR_TXPTRUPD_Msk (0x1UL << TDM_INTENCLR_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define TDM_INTENCLR_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENCLR_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENCLR_TXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DMA_END_RX @Bit 7 : Write '1' to disable interrupt for event DMA_END_RX */
  #define TDM_INTENCLR_DMA_END_RX_Pos (7UL)          /*!< Position of DMA_END_RX field.                                        */
  #define TDM_INTENCLR_DMA_END_RX_Msk (0x1UL << TDM_INTENCLR_DMA_END_RX_Pos) /*!< Bit mask of DMA_END_RX field.                */
  #define TDM_INTENCLR_DMA_END_RX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_RX field.                            */
  #define TDM_INTENCLR_DMA_END_RX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_RX field.                            */
  #define TDM_INTENCLR_DMA_END_RX_Clear (0x1UL)      /*!< Disable                                                              */
  #define TDM_INTENCLR_DMA_END_RX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_DMA_END_RX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* MAXCNT @Bit 8 : Write '1' to disable interrupt for event MAXCNT */
  #define TDM_INTENCLR_MAXCNT_Pos (8UL)              /*!< Position of MAXCNT field.                                            */
  #define TDM_INTENCLR_MAXCNT_Msk (0x1UL << TDM_INTENCLR_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                            */
  #define TDM_INTENCLR_MAXCNT_Min (0x0UL)            /*!< Min enumerator value of MAXCNT field.                                */
  #define TDM_INTENCLR_MAXCNT_Max (0x1UL)            /*!< Max enumerator value of MAXCNT field.                                */
  #define TDM_INTENCLR_MAXCNT_Clear (0x1UL)          /*!< Disable                                                              */
  #define TDM_INTENCLR_MAXCNT_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_MAXCNT_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* BUSERROR_RX @Bit 9 : Write '1' to disable interrupt for event BUSERROR_RX */
  #define TDM_INTENCLR_BUSERROR_RX_Pos (9UL)         /*!< Position of BUSERROR_RX field.                                       */
  #define TDM_INTENCLR_BUSERROR_RX_Msk (0x1UL << TDM_INTENCLR_BUSERROR_RX_Pos) /*!< Bit mask of BUSERROR_RX field.             */
  #define TDM_INTENCLR_BUSERROR_RX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENCLR_BUSERROR_RX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENCLR_BUSERROR_RX_Clear (0x1UL)     /*!< Disable                                                              */
  #define TDM_INTENCLR_BUSERROR_RX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_BUSERROR_RX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* BUSERROR_TX @Bit 10 : Write '1' to disable interrupt for event BUSERROR_TX */
  #define TDM_INTENCLR_BUSERROR_TX_Pos (10UL)        /*!< Position of BUSERROR_TX field.                                       */
  #define TDM_INTENCLR_BUSERROR_TX_Msk (0x1UL << TDM_INTENCLR_BUSERROR_TX_Pos) /*!< Bit mask of BUSERROR_TX field.             */
  #define TDM_INTENCLR_BUSERROR_TX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENCLR_BUSERROR_TX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENCLR_BUSERROR_TX_Clear (0x1UL)     /*!< Disable                                                              */
  #define TDM_INTENCLR_BUSERROR_TX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_BUSERROR_TX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TDM_ENABLE: Enable TDM */
  #define TDM_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable TDM */
  #define TDM_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define TDM_ENABLE_ENABLE_Msk (0x1UL << TDM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define TDM_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define TDM_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define TDM_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TDM_ENABLE_ENABLE_Enabled (0x1UL)          /*!< Enable                                                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TEMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct TEMP_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [TEMP_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWR;                               /*!< (@ 0x00000000) ANA power up override                                 */
} NRF_TEMP_OVERRIDE_Type;                            /*!< Size = 4 (0x004)                                                     */

/* TEMP_OVERRIDE_PWR: ANA power up override */
  #define TEMP_OVERRIDE_PWR_ResetValue (0x00000000UL) /*!< Reset value of PWR register.                                        */

/* VAL @Bit 0 : Override value for the signal */
  #define TEMP_OVERRIDE_PWR_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define TEMP_OVERRIDE_PWR_VAL_Msk (0x1UL << TEMP_OVERRIDE_PWR_VAL_Pos) /*!< Bit mask of VAL field.                           */

/* EN @Bit 31 : Enable the override */
  #define TEMP_OVERRIDE_PWR_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define TEMP_OVERRIDE_PWR_EN_Msk (0x1UL << TEMP_OVERRIDE_PWR_EN_Pos) /*!< Bit mask of EN field.                              */
  #define TEMP_OVERRIDE_PWR_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define TEMP_OVERRIDE_PWR_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define TEMP_OVERRIDE_PWR_EN_Disabled (0x0UL)      /*!< Override is disabled                                                 */
  #define TEMP_OVERRIDE_PWR_EN_Enabled (0x1UL)       /*!< Override is enabled                                                  */



