adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ===================================================== Struct TEMP_DFT ===================================================== */
/**
  * @brief DFT [TEMP_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATBCONFIG;                         /*!< (@ 0x00000000) Analog Test Bus 0-1 (ATB0-1) configuration            */
} NRF_TEMP_DFT_Type;                                 /*!< Size = 4 (0x004)                                                     */

/* TEMP_DFT_ATBCONFIG: Analog Test Bus 0-1 (ATB0-1) configuration */
  #define TEMP_DFT_ATBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATBCONFIG register.                                 */

/* SELMUX @Bit 0 : Select multiplexer for ATB */
  #define TEMP_DFT_ATBCONFIG_SELMUX_Pos (0UL)        /*!< Position of SELMUX field.                                            */
  #define TEMP_DFT_ATBCONFIG_SELMUX_Msk (0x1UL << TEMP_DFT_ATBCONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.                */
  #define TEMP_DFT_ATBCONFIG_SELMUX_Min (0x0UL)      /*!< Min enumerator value of SELMUX field.                                */
  #define TEMP_DFT_ATBCONFIG_SELMUX_Max (0x1UL)      /*!< Max enumerator value of SELMUX field.                                */
  #define TEMP_DFT_ATBCONFIG_SELMUX_CONFIG0 (0x0UL)  /*!< Configuration 0 selected                                             */
  #define TEMP_DFT_ATBCONFIG_SELMUX_CONFIG1 (0x1UL)  /*!< Configuration 1 selected                                             */

/* ENABLEATB @Bit 28 : Enable the analog test bus 0-1 (ATB0-1) */
  #define TEMP_DFT_ATBCONFIG_ENABLEATB_Pos (28UL)    /*!< Position of ENABLEATB field.                                         */
  #define TEMP_DFT_ATBCONFIG_ENABLEATB_Msk (0x1UL << TEMP_DFT_ATBCONFIG_ENABLEATB_Pos) /*!< Bit mask of ENABLEATB field.       */
  #define TEMP_DFT_ATBCONFIG_ENABLEATB_Min (0x0UL)   /*!< Min enumerator value of ENABLEATB field.                             */
  #define TEMP_DFT_ATBCONFIG_ENABLEATB_Max (0x1UL)   /*!< Max enumerator value of ENABLEATB field.                             */
  #define TEMP_DFT_ATBCONFIG_ENABLEATB_Disabled (0x0UL) /*!< Analog test bus is disabled                                       */
  #define TEMP_DFT_ATBCONFIG_ENABLEATB_Enabled (0x1UL) /*!< Analog test bus is enabled                                         */


/* ======================================================= Struct TEMP ======================================================= */
/**
  * @brief Temperature Sensor
  */
  typedef struct {                                   /*!< TEMP Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start temperature measurement                         */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop temperature measurement                          */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_DATARDY;                   /*!< (@ 0x00000100) Temperature measurement complete, data ready          */
    __IM uint32_t RESERVED2[31];
    __IOM uint32_t PUBLISH_DATARDY;                  /*!< (@ 0x00000180) Publish configuration for event DATARDY               */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable temperature sensor bias current                */
    __IOM int32_t COUNTER;                           /*!< (@ 0x00000504) Prototype register containing counter values for
                                                                         timing*/
    __IM int32_t  TEMP;                              /*!< (@ 0x00000508) Temperature in degC (0.25deg steps)                   */
    __IM int32_t  TEMPRAW;                           /*!< (@ 0x0000050C) Counted oscillator pulses which is equivalent to
                                                                         temperature without calibration and linearization*/
    __IM uint32_t DATA;                              /*!< (@ 0x00000510) Data after dec and calib                              */
    __IOM uint32_t CALIB;                            /*!< (@ 0x00000514) Calibration value.                                    */
    __IOM NRF_TEMP_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000518) (unspecified)                                         */
    __IM uint32_t RESERVED5;
    __IOM uint32_t A0;                               /*!< (@ 0x00000520) Slope of 1st piece wise linear function               */
    __IOM uint32_t A1;                               /*!< (@ 0x00000524) Slope of 2nd piece wise linear function               */
    __IOM uint32_t A2;                               /*!< (@ 0x00000528) Slope of 3rd piece wise linear function               */
    __IOM uint32_t A3;                               /*!< (@ 0x0000052C) Slope of 4th piece wise linear function               */
    __IOM uint32_t A4;                               /*!< (@ 0x00000530) Slope of 5th piece wise linear function               */
    __IOM uint32_t A5;                               /*!< (@ 0x00000534) Slope of 6th piece wise linear function               */
    __IOM uint32_t A6;                               /*!< (@ 0x00000538) Slope of 7th piece wise linear function               */
    __IM uint32_t RESERVED6;
    __IOM uint32_t B0;                               /*!< (@ 0x00000540) y-intercept of 1st piece wise linear function         */
    __IOM uint32_t B1;                               /*!< (@ 0x00000544) y-intercept of 2nd piece wise linear function         */
    __IOM uint32_t B2;                               /*!< (@ 0x00000548) y-intercept of 3rd piece wise linear function         */
    __IOM uint32_t B3;                               /*!< (@ 0x0000054C) y-intercept of 4th piece wise linear function         */
    __IOM uint32_t B4;                               /*!< (@ 0x00000550) y-intercept of 5th piece wise linear function         */
    __IOM uint32_t B5;                               /*!< (@ 0x00000554) y-intercept of 6th piece wise linear function         */
    __IOM uint32_t B6;                               /*!< (@ 0x00000558) y-intercept of 7th piece wise linear function         */
    __IM uint32_t RESERVED7;
    __IOM uint32_t T0;                               /*!< (@ 0x00000560) End point of 1st piece wise linear function           */
    __IOM uint32_t T1;                               /*!< (@ 0x00000564) End point of 2nd piece wise linear function           */
    __IOM uint32_t T2;                               /*!< (@ 0x00000568) End point of 3rd piece wise linear function           */
    __IOM uint32_t T3;                               /*!< (@ 0x0000056C) End point of 4th piece wise linear function           */
    __IOM uint32_t T4;                               /*!< (@ 0x00000570) End point of 5th piece wise linear function           */
    __IOM uint32_t T5;                               /*!< (@ 0x00000574) End point of 6th piece wise linear function           */
    __IM uint32_t RESERVED8[34];
    __IOM NRF_TEMP_DFT_Type DFT;                     /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_TEMP_Type;                                   /*!< Size = 1540 (0x604)                                                  */

/* TEMP_TASKS_START: Start temperature measurement */
  #define TEMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start temperature measurement */
  #define TEMP_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define TEMP_TASKS_START_TASKS_START_Msk (0x1UL << TEMP_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define TEMP_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define TEMP_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define TEMP_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


