adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TIMER_TASKS_STOP: Stop Timer */
  #define TIMER_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop Timer */
  #define TIMER_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define TIMER_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TIMER_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define TIMER_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define TIMER_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define TIMER_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* TIMER_TASKS_COUNT: Increment Timer (Counter mode only) */
  #define TIMER_TASKS_COUNT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_COUNT register.                                */

/* TASKS_COUNT @Bit 0 : Increment Timer (Counter mode only) */
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Pos (0UL)    /*!< Position of TASKS_COUNT field.                                       */
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Msk (0x1UL << TIMER_TASKS_COUNT_TASKS_COUNT_Pos) /*!< Bit mask of TASKS_COUNT field.   */
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Min (0x1UL)  /*!< Min enumerator value of TASKS_COUNT field.                           */
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Max (0x1UL)  /*!< Max enumerator value of TASKS_COUNT field.                           */
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Trigger (0x1UL) /*!< Trigger task                                                      */


/* TIMER_TASKS_CLEAR: Clear time */
  #define TIMER_TASKS_CLEAR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CLEAR register.                                */

/* TASKS_CLEAR @Bit 0 : Clear time */
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos (0UL)    /*!< Position of TASKS_CLEAR field.                                       */
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Msk (0x1UL << TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos) /*!< Bit mask of TASKS_CLEAR field.   */
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Min (0x1UL)  /*!< Min enumerator value of TASKS_CLEAR field.                           */
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Max (0x1UL)  /*!< Max enumerator value of TASKS_CLEAR field.                           */
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Trigger (0x1UL) /*!< Trigger task                                                      */


/* TIMER_TASKS_SHUTDOWN: Shut down timer */
  #define TIMER_TASKS_SHUTDOWN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SHUTDOWN register.                          */

/* TASKS_SHUTDOWN @Bit 0 : Shut down timer */
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos (0UL) /*!< Position of TASKS_SHUTDOWN field.                                 */
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk (0x1UL << TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos) /*!< Bit mask of
                                                                            TASKS_SHUTDOWN field.*/
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Min (0x1UL) /*!< Min enumerator value of TASKS_SHUTDOWN field.                   */
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Max (0x1UL) /*!< Max enumerator value of TASKS_SHUTDOWN field.                   */
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger (0x1UL) /*!< Trigger task                                                */


/* TIMER_TASKS_CAPTURE: Capture Timer value to CC[n] register */
  #define TIMER_TASKS_CAPTURE_MaxCount (8UL)         /*!< Max size of TASKS_CAPTURE[8] array.                                  */
  #define TIMER_TASKS_CAPTURE_MaxIndex (7UL)         /*!< Max index of TASKS_CAPTURE[8] array.                                 */
  #define TIMER_TASKS_CAPTURE_MinIndex (0UL)         /*!< Min index of TASKS_CAPTURE[8] array.                                 */
  #define TIMER_TASKS_CAPTURE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CAPTURE[8] register.                         */

/* TASKS_CAPTURE @Bit 0 : Capture Timer value to CC[n] register */
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos (0UL) /*!< Position of TASKS_CAPTURE field.                                    */
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Msk (0x1UL << TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos) /*!< Bit mask of TASKS_CAPTURE
                                                                            field.*/
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Min (0x1UL) /*!< Min enumerator value of TASKS_CAPTURE field.                      */
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Max (0x1UL) /*!< Max enumerator value of TASKS_CAPTURE field.                      */
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Trigger (0x1UL) /*!< Trigger task                                                  */


/* TIMER_SUBSCRIBE_START: Subscribe configuration for task START */
  #define TIMER_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define TIMER_SUBSCRIBE_START_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define TIMER_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << TIMER_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define TIMER_SUBSCRIBE_START_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define TIMER_SUBSCRIBE_START_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TIMER_SUBSCRIBE_START_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define TIMER_SUBSCRIBE_START_EN_Msk (0x1UL << TIMER_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                      */
  #define TIMER_SUBSCRIBE_START_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define TIMER_SUBSCRIBE_START_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define TIMER_SUBSCRIBE_START_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define TIMER_SUBSCRIBE_START_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* TIMER_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define TIMER_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                          */

