adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* MULT4 @Bit 4 : Indicates whether multiplying the trigger counter by 2^(4+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Pos (4UL) /*!< Position of MULT4 field.                                             */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT4_Pos) /*!< Bit mask of MULT4 field.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Min (0x0UL) /*!< Min enumerator value of MULT4 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Max (0x1UL) /*!< Max enumerator value of MULT4 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(4+1) is supported.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(4+1) is supported.      */

/* TCOUNT8 @Bit 8 : Indicates whether an 8-bit wide counter register is implemented. */
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Pos (8UL) /*!< Position of TCOUNT8 field.                                         */
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Pos) /*!< Bit mask of TCOUNT8
                                                                            field.*/
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Min (0x0UL) /*!< Min enumerator value of TCOUNT8 field.                           */
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Max (0x1UL) /*!< Max enumerator value of TCOUNT8 field.                           */
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_NotImplemented (0x0UL) /*!< An 8-bit wide counter register is implemented.        */
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Implemented (0x1UL) /*!< An 8-bit wide counter register is implemented.           */

/* TRIGGERED @Bit 16 : A trigger has occurred and the counter has reached 0. */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Pos (16UL) /*!< Position of TRIGGERED field.                                    */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Pos) /*!< Bit mask of
                                                                            TRIGGERED field.*/
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Min (0x0UL) /*!< Min enumerator value of TRIGGERED field.                       */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Max (0x1UL) /*!< Max enumerator value of TRIGGERED field.                       */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_NotOccured (0x0UL) /*!< Trigger has not occurred.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Occured (0x1UL) /*!< Trigger has occurred.                                      */

/* TRGRUN @Bit 17 : A trigger has occurred but the counter is not at 0. */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Pos (17UL) /*!< Position of TRGRUN field.                                          */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Pos) /*!< Bit mask of TRGRUN field.*/
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Min (0x0UL) /*!< Min enumerator value of TRGRUN field.                             */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Max (0x1UL) /*!< Max enumerator value of TRGRUN field.                             */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_NotOccured (0x0UL) /*!< Either a trigger has not occurred or the counter is at 0.  */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Occured (0x1UL) /*!< A trigger has occurred but the counter is not at 0.           */


/* TPIU_TRIGGERCOUNTERVALUE: The Trigger_counter_value register enables delaying the indication of triggers to any external
                              connected trace capture or storage devices. */

  #define TPIU_TRIGGERCOUNTERVALUE_ResetValue (0x00000000UL) /*!< Reset value of TRIGGERCOUNTERVALUE register.                 */

/* TrigCount @Bits 0..7 : 8-bit counter value for the number of words to be output from the formatter before a trigger is
                          inserted. */

  #define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Pos (0UL) /*!< Position of TrigCount field.                                       */
  #define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Msk (0xFFUL << TPIU_TRIGGERCOUNTERVALUE_TrigCount_Pos) /*!< Bit mask of TrigCount
                                                                            field.*/
  #define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Min (0x00UL) /*!< Min value of TrigCount field.                                   */
  #define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Max (0xFFUL) /*!< Max size of TrigCount field.                                    */


/* TPIU_TRIGGERMULTIPLIER: The Trigger_multiplier register contains the selectors for the trigger counter multiplier. */
  #define TPIU_TRIGGERMULTIPLIER_ResetValue (0x00000000UL) /*!< Reset value of TRIGGERMULTIPLIER register.                     */

/* MULT0 @Bit 0 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Pos (0UL)     /*!< Position of MULT0 field.                                             */
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT0_Pos) /*!< Bit mask of MULT0 field.           */
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Min (0x0UL)   /*!< Min enumerator value of MULT0 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Max (0x1UL)   /*!< Max enumerator value of MULT0 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Disabled (0x0UL) /*!< Multiplier disabled.                                              */
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Enabled (0x1UL) /*!< Multiplier enabled.                                                */

/* MULT1 @Bit 1 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Pos (1UL)     /*!< Position of MULT1 field.                                             */
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT1_Pos) /*!< Bit mask of MULT1 field.           */
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Min (0x0UL)   /*!< Min enumerator value of MULT1 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Max (0x1UL)   /*!< Max enumerator value of MULT1 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Disabled (0x0UL) /*!< Multiplier disabled.                                              */
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Enabled (0x1UL) /*!< Multiplier enabled.                                                */

/* MULT2 @Bit 2 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Pos (2UL)     /*!< Position of MULT2 field.                                             */
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT2_Pos) /*!< Bit mask of MULT2 field.           */
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Min (0x0UL)   /*!< Min enumerator value of MULT2 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Max (0x1UL)   /*!< Max enumerator value of MULT2 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Disabled (0x0UL) /*!< Multiplier disabled.                                              */
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Enabled (0x1UL) /*!< Multiplier enabled.                                                */

