adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PCONTEN @Bit 17 : Indicates whether continuous mode is supported. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Pos (17UL) /*!< Position of PCONTEN field.                                   */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Pos) /*!< Bit mask of
                                                                            PCONTEN field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Min (0x0UL) /*!< Min enumerator value of PCONTEN field.                      */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Max (0x1UL) /*!< Max enumerator value of PCONTEN field.                      */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_NotSupported (0x0UL) /*!< Mode is not supported.                             */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Supported (0x1UL) /*!< Mode is supported.                                    */


/* TPIU_CURRENTTESTPATTERNMODES: Current_test_pattern_mode indicates the current test pattern or mode selected. */
  #define TPIU_CURRENTTESTPATTERNMODES_ResetValue (0x00000000UL) /*!< Reset value of CURRENTTESTPATTERNMODES register.         */

/* PATW1 @Bit 0 : Indicates whether the walking 1s pattern is supported as output over the trace port. */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Pos (0UL) /*!< Position of PATW1 field.                                           */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATW1_Pos) /*!< Bit mask of PATW1
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Min (0x0UL) /*!< Min enumerator value of PATW1 field.                             */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Max (0x1UL) /*!< Max enumerator value of PATW1 field.                             */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Disabled (0x0UL) /*!< Test pattern is disabled.                                   */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Enabled (0x1UL) /*!< Test pattern is enabled.                                     */

/* PATW0 @Bit 1 : Indicates whether the walking 0s pattern is supported as output over the trace port. */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Pos (1UL) /*!< Position of PATW0 field.                                           */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATW0_Pos) /*!< Bit mask of PATW0
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Min (0x0UL) /*!< Min enumerator value of PATW0 field.                             */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Max (0x1UL) /*!< Max enumerator value of PATW0 field.                             */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Disabled (0x0UL) /*!< Test pattern is disabled.                                   */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Enabled (0x1UL) /*!< Test pattern is enabled.                                     */

/* PATA5 @Bit 2 : Indicates whether the AA/55 pattern is supported as output over the trace port. */
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Pos (2UL) /*!< Position of PATA5 field.                                           */
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATA5_Pos) /*!< Bit mask of PATA5
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Min (0x0UL) /*!< Min enumerator value of PATA5 field.                             */
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Max (0x1UL) /*!< Max enumerator value of PATA5 field.                             */
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Disabled (0x0UL) /*!< Test pattern is disabled.                                   */
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Enabled (0x1UL) /*!< Test pattern is enabled.                                     */

/* PATF0 @Bit 3 : Indicates whether the FF/00 pattern is supported as output over the trace port. */
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Pos (3UL) /*!< Position of PATF0 field.                                           */
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATF0_Pos) /*!< Bit mask of PATF0
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Min (0x0UL) /*!< Min enumerator value of PATF0 field.                             */
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Max (0x1UL) /*!< Max enumerator value of PATF0 field.                             */
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Disabled (0x0UL) /*!< Test pattern is disabled.                                   */
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Enabled (0x1UL) /*!< Test pattern is enabled.                                     */

/* PTIMEEN @Bit 16 : Indicates whether timed mode is supported. */
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Pos (16UL) /*!< Position of PTIMEEN field.                                      */
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Pos) /*!< Bit mask of PTIMEEN
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Min (0x0UL) /*!< Min enumerator value of PTIMEEN field.                         */
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Max (0x1UL) /*!< Max enumerator value of PTIMEEN field.                         */
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Disabled (0x0UL) /*!< Mode is disabled.                                         */
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Enabled (0x1UL) /*!< Mode is enabled.                                           */

/* PCONTEN @Bit 17 : Indicates whether continuous mode is supported. */
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Pos (17UL) /*!< Position of PCONTEN field.                                      */
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Pos) /*!< Bit mask of PCONTEN
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Min (0x0UL) /*!< Min enumerator value of PCONTEN field.                         */
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Max (0x1UL) /*!< Max enumerator value of PCONTEN field.                         */
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Disabled (0x0UL) /*!< Mode is disabled.                                         */
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Enabled (0x1UL) /*!< Mode is enabled.                                           */


/* TPIU_TPRCR: The TPRCR register is an 8-bit counter start value that is decremented. A write sets the initial counter value
                and a read returns the programmed value. */

