adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TSGEN_CIDR0: Component ID0 Register */
  #define TSGEN_CIDR0_ResetValue (0x0000000DUL)      /*!< Reset value of CIDR0 register.                                       */

/* PRMBL_0 @Bits 0..7 : Contains bits[7:0] of the component identification code. */
  #define TSGEN_CIDR0_PRMBL_0_Pos (0UL)              /*!< Position of PRMBL_0 field.                                           */
  #define TSGEN_CIDR0_PRMBL_0_Msk (0xFFUL << TSGEN_CIDR0_PRMBL_0_Pos) /*!< Bit mask of PRMBL_0 field.                          */


/* TSGEN_CIDR1: Component ID1 Register */
  #define TSGEN_CIDR1_ResetValue (0x000000F0UL)      /*!< Reset value of CIDR1 register.                                       */

/* PRMBL_1 @Bits 0..3 : Contains bits[11:8] of the component identification code. */
  #define TSGEN_CIDR1_PRMBL_1_Pos (0UL)              /*!< Position of PRMBL_1 field.                                           */
  #define TSGEN_CIDR1_PRMBL_1_Msk (0xFUL << TSGEN_CIDR1_PRMBL_1_Pos) /*!< Bit mask of PRMBL_1 field.                           */

/* CLASS @Bits 4..7 : Class of the component, for example, ROM table or CoreSight component. */
  #define TSGEN_CIDR1_CLASS_Pos (4UL)                /*!< Position of CLASS field.                                             */
  #define TSGEN_CIDR1_CLASS_Msk (0xFUL << TSGEN_CIDR1_CLASS_Pos) /*!< Bit mask of CLASS field.                                 */


/* TSGEN_CIDR2: Component ID2 Register */
  #define TSGEN_CIDR2_ResetValue (0x00000005UL)      /*!< Reset value of CIDR2 register.                                       */

/* PRMBL_2 @Bits 0..7 : Contains bits[23:16] of the component identification code. */
  #define TSGEN_CIDR2_PRMBL_2_Pos (0UL)              /*!< Position of PRMBL_2 field.                                           */
  #define TSGEN_CIDR2_PRMBL_2_Msk (0xFFUL << TSGEN_CIDR2_PRMBL_2_Pos) /*!< Bit mask of PRMBL_2 field.                          */


/* TSGEN_CIDR3: Component ID3 Register */
  #define TSGEN_CIDR3_ResetValue (0x000000B1UL)      /*!< Reset value of CIDR3 register.                                       */

/* PRMBL_3 @Bits 0..7 : Contains bits[31:24] of the component identification code. */
  #define TSGEN_CIDR3_PRMBL_3_Pos (0UL)              /*!< Position of PRMBL_3 field.                                           */
  #define TSGEN_CIDR3_PRMBL_3_Msk (0xFFUL << TSGEN_CIDR3_PRMBL_3_Pos) /*!< Bit mask of PRMBL_3 field.                          */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TWIM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TWIM_TASKS_DMA_RX ================================================= */
/**
  * @brief RX [TWIM_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event. After a STOP task, the easyDMA (channel)
                                                                         will also enter its lowest required power level.*/
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000008) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000018) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/
} NRF_TWIM_TASKS_DMA_RX_Type;                        /*!< Size = 40 (0x028)                                                    */

/* TWIM_TASKS_DMA_RX_START: Starts operation using easyDMA to load the values. See peripheral description for operation using
                             easyDMA. */

  #define TWIM_TASKS_DMA_RX_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                */

/* START @Bit 0 : Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA. */
  #define TWIM_TASKS_DMA_RX_START_START_Pos (0UL)    /*!< Position of START field.                                             */
  #define TWIM_TASKS_DMA_RX_START_START_Msk (0x1UL << TWIM_TASKS_DMA_RX_START_START_Pos) /*!< Bit mask of START field.         */
  #define TWIM_TASKS_DMA_RX_START_START_Min (0x1UL)  /*!< Min enumerator value of START field.                                 */
  #define TWIM_TASKS_DMA_RX_START_START_Max (0x1UL)  /*!< Max enumerator value of START field.                                 */
  #define TWIM_TASKS_DMA_RX_START_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* TWIM_TASKS_DMA_RX_STOP: Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA
                            (channel) will also enter its lowest required power level. */

  #define TWIM_TASKS_DMA_RX_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                  */

/* STOP @Bit 0 : Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA (channel)
                 will also enter its lowest required power level. */

