adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TWIM_INTEN: Enable or disable interrupt */
  #define TWIM_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define TWIM_INTEN_STOPPED_Pos (1UL)               /*!< Position of STOPPED field.                                           */
  #define TWIM_INTEN_STOPPED_Msk (0x1UL << TWIM_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                             */
  #define TWIM_INTEN_STOPPED_Min (0x0UL)             /*!< Min enumerator value of STOPPED field.                               */
  #define TWIM_INTEN_STOPPED_Max (0x1UL)             /*!< Max enumerator value of STOPPED field.                               */
  #define TWIM_INTEN_STOPPED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TWIM_INTEN_STOPPED_Enabled (0x1UL)         /*!< Enable                                                               */

/* ERROR @Bit 5 : Enable or disable interrupt for event ERROR */
  #define TWIM_INTEN_ERROR_Pos (5UL)                 /*!< Position of ERROR field.                                             */
  #define TWIM_INTEN_ERROR_Msk (0x1UL << TWIM_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                   */
  #define TWIM_INTEN_ERROR_Min (0x0UL)               /*!< Min enumerator value of ERROR field.                                 */
  #define TWIM_INTEN_ERROR_Max (0x1UL)               /*!< Max enumerator value of ERROR field.                                 */
  #define TWIM_INTEN_ERROR_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TWIM_INTEN_ERROR_Enabled (0x1UL)           /*!< Enable                                                               */

/* BB @Bit 8 : Enable or disable interrupt for event BB */
  #define TWIM_INTEN_BB_Pos (8UL)                    /*!< Position of BB field.                                                */
  #define TWIM_INTEN_BB_Msk (0x1UL << TWIM_INTEN_BB_Pos) /*!< Bit mask of BB field.                                            */
  #define TWIM_INTEN_BB_Min (0x0UL)                  /*!< Min enumerator value of BB field.                                    */
  #define TWIM_INTEN_BB_Max (0x1UL)                  /*!< Max enumerator value of BB field.                                    */
  #define TWIM_INTEN_BB_Disabled (0x0UL)             /*!< Disable                                                              */
  #define TWIM_INTEN_BB_Enabled (0x1UL)              /*!< Enable                                                               */

/* SUSPENDED @Bit 10 : Enable or disable interrupt for event SUSPENDED */
  #define TWIM_INTEN_SUSPENDED_Pos (10UL)            /*!< Position of SUSPENDED field.                                         */
  #define TWIM_INTEN_SUSPENDED_Msk (0x1UL << TWIM_INTEN_SUSPENDED_Pos) /*!< Bit mask of SUSPENDED field.                       */
  #define TWIM_INTEN_SUSPENDED_Min (0x0UL)           /*!< Min enumerator value of SUSPENDED field.                             */
  #define TWIM_INTEN_SUSPENDED_Max (0x1UL)           /*!< Max enumerator value of SUSPENDED field.                             */
  #define TWIM_INTEN_SUSPENDED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TWIM_INTEN_SUSPENDED_Enabled (0x1UL)       /*!< Enable                                                               */

/* LASTRX @Bit 13 : Enable or disable interrupt for event LASTRX */
  #define TWIM_INTEN_LASTRX_Pos (13UL)               /*!< Position of LASTRX field.                                            */
  #define TWIM_INTEN_LASTRX_Msk (0x1UL << TWIM_INTEN_LASTRX_Pos) /*!< Bit mask of LASTRX field.                                */
  #define TWIM_INTEN_LASTRX_Min (0x0UL)              /*!< Min enumerator value of LASTRX field.                                */
  #define TWIM_INTEN_LASTRX_Max (0x1UL)              /*!< Max enumerator value of LASTRX field.                                */
  #define TWIM_INTEN_LASTRX_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TWIM_INTEN_LASTRX_Enabled (0x1UL)          /*!< Enable                                                               */

/* LASTTX @Bit 14 : Enable or disable interrupt for event LASTTX */
  #define TWIM_INTEN_LASTTX_Pos (14UL)               /*!< Position of LASTTX field.                                            */
  #define TWIM_INTEN_LASTTX_Msk (0x1UL << TWIM_INTEN_LASTTX_Pos) /*!< Bit mask of LASTTX field.                                */
  #define TWIM_INTEN_LASTTX_Min (0x0UL)              /*!< Min enumerator value of LASTTX field.                                */
  #define TWIM_INTEN_LASTTX_Max (0x1UL)              /*!< Max enumerator value of LASTTX field.                                */
  #define TWIM_INTEN_LASTTX_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TWIM_INTEN_LASTTX_Enabled (0x1UL)          /*!< Enable                                                               */

/* DMARXEND @Bit 19 : Enable or disable interrupt for event DMARXEND */
  #define TWIM_INTEN_DMARXEND_Pos (19UL)             /*!< Position of DMARXEND field.                                          */
  #define TWIM_INTEN_DMARXEND_Msk (0x1UL << TWIM_INTEN_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                          */
  #define TWIM_INTEN_DMARXEND_Min (0x0UL)            /*!< Min enumerator value of DMARXEND field.                              */
  #define TWIM_INTEN_DMARXEND_Max (0x1UL)            /*!< Max enumerator value of DMARXEND field.                              */
  #define TWIM_INTEN_DMARXEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define TWIM_INTEN_DMARXEND_Enabled (0x1UL)        /*!< Enable                                                               */

