adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DMATXREADY @Bit 27 : Enable or disable interrupt for event DMATXREADY */
  #define TWIM_INTEN_DMATXREADY_Pos (27UL)           /*!< Position of DMATXREADY field.                                        */
  #define TWIM_INTEN_DMATXREADY_Msk (0x1UL << TWIM_INTEN_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.                    */
  #define TWIM_INTEN_DMATXREADY_Min (0x0UL)          /*!< Min enumerator value of DMATXREADY field.                            */
  #define TWIM_INTEN_DMATXREADY_Max (0x1UL)          /*!< Max enumerator value of DMATXREADY field.                            */
  #define TWIM_INTEN_DMATXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIM_INTEN_DMATXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMATXBUSERROR @Bit 28 : Enable or disable interrupt for event DMATXBUSERROR */
  #define TWIM_INTEN_DMATXBUSERROR_Pos (28UL)        /*!< Position of DMATXBUSERROR field.                                     */
  #define TWIM_INTEN_DMATXBUSERROR_Msk (0x1UL << TWIM_INTEN_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.           */
  #define TWIM_INTEN_DMATXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define TWIM_INTEN_DMATXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define TWIM_INTEN_DMATXBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define TWIM_INTEN_DMATXBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */


/* TWIM_INTENSET: Enable interrupt */
  #define TWIM_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define TWIM_INTENSET_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIM_INTENSET_STOPPED_Msk (0x1UL << TWIM_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIM_INTENSET_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIM_INTENSET_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIM_INTENSET_STOPPED_Set (0x1UL)          /*!< Enable                                                               */
  #define TWIM_INTENSET_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 5 : Write '1' to enable interrupt for event ERROR */
  #define TWIM_INTENSET_ERROR_Pos (5UL)              /*!< Position of ERROR field.                                             */
  #define TWIM_INTENSET_ERROR_Msk (0x1UL << TWIM_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIM_INTENSET_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIM_INTENSET_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIM_INTENSET_ERROR_Set (0x1UL)            /*!< Enable                                                               */
  #define TWIM_INTENSET_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* BB @Bit 8 : Write '1' to enable interrupt for event BB */
  #define TWIM_INTENSET_BB_Pos (8UL)                 /*!< Position of BB field.                                                */
  #define TWIM_INTENSET_BB_Msk (0x1UL << TWIM_INTENSET_BB_Pos) /*!< Bit mask of BB field.                                      */
  #define TWIM_INTENSET_BB_Min (0x0UL)               /*!< Min enumerator value of BB field.                                    */
  #define TWIM_INTENSET_BB_Max (0x1UL)               /*!< Max enumerator value of BB field.                                    */
  #define TWIM_INTENSET_BB_Set (0x1UL)               /*!< Enable                                                               */
  #define TWIM_INTENSET_BB_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_BB_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* SUSPENDED @Bit 10 : Write '1' to enable interrupt for event SUSPENDED */
  #define TWIM_INTENSET_SUSPENDED_Pos (10UL)         /*!< Position of SUSPENDED field.                                         */
  #define TWIM_INTENSET_SUSPENDED_Msk (0x1UL << TWIM_INTENSET_SUSPENDED_Pos) /*!< Bit mask of SUSPENDED field.                 */
  #define TWIM_INTENSET_SUSPENDED_Min (0x0UL)        /*!< Min enumerator value of SUSPENDED field.                             */
  #define TWIM_INTENSET_SUSPENDED_Max (0x1UL)        /*!< Max enumerator value of SUSPENDED field.                             */
  #define TWIM_INTENSET_SUSPENDED_Set (0x1UL)        /*!< Enable                                                               */
  #define TWIM_INTENSET_SUSPENDED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_SUSPENDED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* LASTRX @Bit 13 : Write '1' to enable interrupt for event LASTRX */
  #define TWIM_INTENSET_LASTRX_Pos (13UL)            /*!< Position of LASTRX field.                                            */
  #define TWIM_INTENSET_LASTRX_Msk (0x1UL << TWIM_INTENSET_LASTRX_Pos) /*!< Bit mask of LASTRX field.                          */
  #define TWIM_INTENSET_LASTRX_Min (0x0UL)           /*!< Min enumerator value of LASTRX field.                                */
  #define TWIM_INTENSET_LASTRX_Max (0x1UL)           /*!< Max enumerator value of LASTRX field.                                */
  #define TWIM_INTENSET_LASTRX_Set (0x1UL)           /*!< Enable                                                               */
  #define TWIM_INTENSET_LASTRX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_LASTRX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* LASTTX @Bit 14 : Write '1' to enable interrupt for event LASTTX */
  #define TWIM_INTENSET_LASTTX_Pos (14UL)            /*!< Position of LASTTX field.                                            */
  #define TWIM_INTENSET_LASTTX_Msk (0x1UL << TWIM_INTENSET_LASTTX_Pos) /*!< Bit mask of LASTTX field.                          */
  #define TWIM_INTENSET_LASTTX_Min (0x0UL)           /*!< Min enumerator value of LASTTX field.                                */
  #define TWIM_INTENSET_LASTTX_Max (0x1UL)           /*!< Max enumerator value of LASTTX field.                                */
  #define TWIM_INTENSET_LASTTX_Set (0x1UL)           /*!< Enable                                                               */
  #define TWIM_INTENSET_LASTTX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_LASTTX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

