adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BB @Bit 8 : Write '1' to disable interrupt for event BB */
  #define TWIM_INTENCLR_BB_Pos (8UL)                 /*!< Position of BB field.                                                */
  #define TWIM_INTENCLR_BB_Msk (0x1UL << TWIM_INTENCLR_BB_Pos) /*!< Bit mask of BB field.                                      */
  #define TWIM_INTENCLR_BB_Min (0x0UL)               /*!< Min enumerator value of BB field.                                    */
  #define TWIM_INTENCLR_BB_Max (0x1UL)               /*!< Max enumerator value of BB field.                                    */
  #define TWIM_INTENCLR_BB_Clear (0x1UL)             /*!< Disable                                                              */
  #define TWIM_INTENCLR_BB_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_BB_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* SUSPENDED @Bit 10 : Write '1' to disable interrupt for event SUSPENDED */
  #define TWIM_INTENCLR_SUSPENDED_Pos (10UL)         /*!< Position of SUSPENDED field.                                         */
  #define TWIM_INTENCLR_SUSPENDED_Msk (0x1UL << TWIM_INTENCLR_SUSPENDED_Pos) /*!< Bit mask of SUSPENDED field.                 */
  #define TWIM_INTENCLR_SUSPENDED_Min (0x0UL)        /*!< Min enumerator value of SUSPENDED field.                             */
  #define TWIM_INTENCLR_SUSPENDED_Max (0x1UL)        /*!< Max enumerator value of SUSPENDED field.                             */
  #define TWIM_INTENCLR_SUSPENDED_Clear (0x1UL)      /*!< Disable                                                              */
  #define TWIM_INTENCLR_SUSPENDED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_SUSPENDED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* LASTRX @Bit 13 : Write '1' to disable interrupt for event LASTRX */
  #define TWIM_INTENCLR_LASTRX_Pos (13UL)            /*!< Position of LASTRX field.                                            */
  #define TWIM_INTENCLR_LASTRX_Msk (0x1UL << TWIM_INTENCLR_LASTRX_Pos) /*!< Bit mask of LASTRX field.                          */
  #define TWIM_INTENCLR_LASTRX_Min (0x0UL)           /*!< Min enumerator value of LASTRX field.                                */
  #define TWIM_INTENCLR_LASTRX_Max (0x1UL)           /*!< Max enumerator value of LASTRX field.                                */
  #define TWIM_INTENCLR_LASTRX_Clear (0x1UL)         /*!< Disable                                                              */
  #define TWIM_INTENCLR_LASTRX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_LASTRX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* LASTTX @Bit 14 : Write '1' to disable interrupt for event LASTTX */
  #define TWIM_INTENCLR_LASTTX_Pos (14UL)            /*!< Position of LASTTX field.                                            */
  #define TWIM_INTENCLR_LASTTX_Msk (0x1UL << TWIM_INTENCLR_LASTTX_Pos) /*!< Bit mask of LASTTX field.                          */
  #define TWIM_INTENCLR_LASTTX_Min (0x0UL)           /*!< Min enumerator value of LASTTX field.                                */
  #define TWIM_INTENCLR_LASTTX_Max (0x1UL)           /*!< Max enumerator value of LASTTX field.                                */
  #define TWIM_INTENCLR_LASTTX_Clear (0x1UL)         /*!< Disable                                                              */
  #define TWIM_INTENCLR_LASTTX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_LASTTX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* DMARXEND @Bit 19 : Write '1' to disable interrupt for event DMARXEND */
  #define TWIM_INTENCLR_DMARXEND_Pos (19UL)          /*!< Position of DMARXEND field.                                          */
  #define TWIM_INTENCLR_DMARXEND_Msk (0x1UL << TWIM_INTENCLR_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                    */
  #define TWIM_INTENCLR_DMARXEND_Min (0x0UL)         /*!< Min enumerator value of DMARXEND field.                              */
  #define TWIM_INTENCLR_DMARXEND_Max (0x1UL)         /*!< Max enumerator value of DMARXEND field.                              */
  #define TWIM_INTENCLR_DMARXEND_Clear (0x1UL)       /*!< Disable                                                              */
  #define TWIM_INTENCLR_DMARXEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_DMARXEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define TWIM_INTENCLR_DMARXREADY_Pos (20UL)        /*!< Position of DMARXREADY field.                                        */
  #define TWIM_INTENCLR_DMARXREADY_Msk (0x1UL << TWIM_INTENCLR_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.              */
  #define TWIM_INTENCLR_DMARXREADY_Min (0x0UL)       /*!< Min enumerator value of DMARXREADY field.                            */
  #define TWIM_INTENCLR_DMARXREADY_Max (0x1UL)       /*!< Max enumerator value of DMARXREADY field.                            */
  #define TWIM_INTENCLR_DMARXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define TWIM_INTENCLR_DMARXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_DMARXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMARXBUSERROR @Bit 21 : Write '1' to disable interrupt for event DMARXBUSERROR */
  #define TWIM_INTENCLR_DMARXBUSERROR_Pos (21UL)     /*!< Position of DMARXBUSERROR field.                                     */
  #define TWIM_INTENCLR_DMARXBUSERROR_Msk (0x1UL << TWIM_INTENCLR_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.     */
  #define TWIM_INTENCLR_DMARXBUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define TWIM_INTENCLR_DMARXBUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define TWIM_INTENCLR_DMARXBUSERROR_Clear (0x1UL)  /*!< Disable                                                              */
  #define TWIM_INTENCLR_DMARXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define TWIM_INTENCLR_DMARXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

