adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EVENTS_NACKTX @Bit 0 : NACK on TX */
  #define TWIS_EVENTS_NACKTX_EVENTS_NACKTX_Pos (0UL) /*!< Position of EVENTS_NACKTX field.                                     */
  #define TWIS_EVENTS_NACKTX_EVENTS_NACKTX_Msk (0x1UL << TWIS_EVENTS_NACKTX_EVENTS_NACKTX_Pos) /*!< Bit mask of EVENTS_NACKTX
                                                                            field.*/
  #define TWIS_EVENTS_NACKTX_EVENTS_NACKTX_Min (0x0UL) /*!< Min enumerator value of EVENTS_NACKTX field.                       */
  #define TWIS_EVENTS_NACKTX_EVENTS_NACKTX_Max (0x1UL) /*!< Max enumerator value of EVENTS_NACKTX field.                       */
  #define TWIS_EVENTS_NACKTX_EVENTS_NACKTX_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define TWIS_EVENTS_NACKTX_EVENTS_NACKTX_Generated (0x1UL) /*!< Event generated                                              */


/* TWIS_EVENTS_BB: TWI byte boundary, generated before each byte that is sent or received */
  #define TWIS_EVENTS_BB_ResetValue (0x00000000UL)   /*!< Reset value of EVENTS_BB register.                                   */

/* EVENTS_BB @Bit 0 : TWI byte boundary, generated before each byte that is sent or received */
  #define TWIS_EVENTS_BB_EVENTS_BB_Pos (0UL)         /*!< Position of EVENTS_BB field.                                         */
  #define TWIS_EVENTS_BB_EVENTS_BB_Msk (0x1UL << TWIS_EVENTS_BB_EVENTS_BB_Pos) /*!< Bit mask of EVENTS_BB field.               */
  #define TWIS_EVENTS_BB_EVENTS_BB_Min (0x0UL)       /*!< Min enumerator value of EVENTS_BB field.                             */
  #define TWIS_EVENTS_BB_EVENTS_BB_Max (0x1UL)       /*!< Max enumerator value of EVENTS_BB field.                             */
  #define TWIS_EVENTS_BB_EVENTS_BB_NotGenerated (0x0UL) /*!< Event not generated                                               */
  #define TWIS_EVENTS_BB_EVENTS_BB_Generated (0x1UL) /*!< Event generated                                                      */


/* TWIS_EVENTS_WRITE: Write command received */
  #define TWIS_EVENTS_WRITE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WRITE register.                               */

/* EVENTS_WRITE @Bit 0 : Write command received */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos (0UL)   /*!< Position of EVENTS_WRITE field.                                      */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Msk (0x1UL << TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos) /*!< Bit mask of EVENTS_WRITE field.*/
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Min (0x0UL) /*!< Min enumerator value of EVENTS_WRITE field.                          */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Max (0x1UL) /*!< Max enumerator value of EVENTS_WRITE field.                          */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Generated (0x1UL) /*!< Event generated                                                */


/* TWIS_EVENTS_READ: Read command received */
  #define TWIS_EVENTS_READ_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READ register.                                 */

/* EVENTS_READ @Bit 0 : Read command received */
  #define TWIS_EVENTS_READ_EVENTS_READ_Pos (0UL)     /*!< Position of EVENTS_READ field.                                       */
  #define TWIS_EVENTS_READ_EVENTS_READ_Msk (0x1UL << TWIS_EVENTS_READ_EVENTS_READ_Pos) /*!< Bit mask of EVENTS_READ field.     */
  #define TWIS_EVENTS_READ_EVENTS_READ_Min (0x0UL)   /*!< Min enumerator value of EVENTS_READ field.                           */
  #define TWIS_EVENTS_READ_EVENTS_READ_Max (0x1UL)   /*!< Max enumerator value of EVENTS_READ field.                           */
  #define TWIS_EVENTS_READ_EVENTS_READ_NotGenerated (0x0UL) /*!< Event not generated                                           */
  #define TWIS_EVENTS_READ_EVENTS_READ_Generated (0x1UL) /*!< Event generated                                                  */


/* TWIS_EVENTS_CSSTARTED: TWI started stretching the clock */
  #define TWIS_EVENTS_CSSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CSSTARTED register.                       */

/* EVENTS_CSSTARTED @Bit 0 : TWI started stretching the clock */
  #define TWIS_EVENTS_CSSTARTED_EVENTS_CSSTARTED_Pos (0UL) /*!< Position of EVENTS_CSSTARTED field.                            */
  #define TWIS_EVENTS_CSSTARTED_EVENTS_CSSTARTED_Msk (0x1UL << TWIS_EVENTS_CSSTARTED_EVENTS_CSSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_CSSTARTED field.*/
  #define TWIS_EVENTS_CSSTARTED_EVENTS_CSSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_CSSTARTED field.              */
  #define TWIS_EVENTS_CSSTARTED_EVENTS_CSSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_CSSTARTED field.              */
  #define TWIS_EVENTS_CSSTARTED_EVENTS_CSSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define TWIS_EVENTS_CSSTARTED_EVENTS_CSSTARTED_Generated (0x1UL) /*!< Event generated                                        */


/* TWIS_EVENTS_CSSTOPPED: TWI stopped stretching the clock */
  #define TWIS_EVENTS_CSSTOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CSSTOPPED register.                       */

/* EVENTS_CSSTOPPED @Bit 0 : TWI stopped stretching the clock */
  #define TWIS_EVENTS_CSSTOPPED_EVENTS_CSSTOPPED_Pos (0UL) /*!< Position of EVENTS_CSSTOPPED field.                            */
  #define TWIS_EVENTS_CSSTOPPED_EVENTS_CSSTOPPED_Msk (0x1UL << TWIS_EVENTS_CSSTOPPED_EVENTS_CSSTOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_CSSTOPPED field.*/
  #define TWIS_EVENTS_CSSTOPPED_EVENTS_CSSTOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_CSSTOPPED field.              */
  #define TWIS_EVENTS_CSSTOPPED_EVENTS_CSSTOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_CSSTOPPED field.              */
  #define TWIS_EVENTS_CSSTOPPED_EVENTS_CSSTOPPED_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define TWIS_EVENTS_CSSTOPPED_EVENTS_CSSTOPPED_Generated (0x1UL) /*!< Event generated                                        */


