adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TWIS_PUBLISH_BB: Publish configuration for event BB */
  #define TWIS_PUBLISH_BB_ResetValue (0x00000000UL)  /*!< Reset value of PUBLISH_BB register.                                  */

/* CHIDX @Bits 0..7 : DPPI channel that event BB will publish to */
  #define TWIS_PUBLISH_BB_CHIDX_Pos (0UL)            /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_BB_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_BB_CHIDX_Pos) /*!< Bit mask of CHIDX field.                        */
  #define TWIS_PUBLISH_BB_CHIDX_Min (0x00UL)         /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_BB_CHIDX_Max (0xFFUL)         /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_BB_EN_Pos (31UL)              /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_BB_EN_Msk (0x1UL << TWIS_PUBLISH_BB_EN_Pos) /*!< Bit mask of EN field.                                  */
  #define TWIS_PUBLISH_BB_EN_Min (0x0UL)             /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_BB_EN_Max (0x1UL)             /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_BB_EN_Disabled (0x0UL)        /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_BB_EN_Enabled (0x1UL)         /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_WRITE: Publish configuration for event WRITE */
  #define TWIS_PUBLISH_WRITE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_WRITE register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event WRITE will publish to */
  #define TWIS_PUBLISH_WRITE_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_WRITE_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_WRITE_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TWIS_PUBLISH_WRITE_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_WRITE_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_WRITE_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_WRITE_EN_Msk (0x1UL << TWIS_PUBLISH_WRITE_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TWIS_PUBLISH_WRITE_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_WRITE_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_WRITE_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_WRITE_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_READ: Publish configuration for event READ */
  #define TWIS_PUBLISH_READ_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READ register.                               */

/* CHIDX @Bits 0..7 : DPPI channel that event READ will publish to */
  #define TWIS_PUBLISH_READ_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_READ_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_READ_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define TWIS_PUBLISH_READ_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_READ_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_READ_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_READ_EN_Msk (0x1UL << TWIS_PUBLISH_READ_EN_Pos) /*!< Bit mask of EN field.                              */
  #define TWIS_PUBLISH_READ_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_READ_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_READ_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_READ_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_CSSTARTED: Publish configuration for event CSSTARTED */
  #define TWIS_PUBLISH_CSSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CSSTARTED register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event CSSTARTED will publish to */
  #define TWIS_PUBLISH_CSSTARTED_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_CSSTARTED_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_CSSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TWIS_PUBLISH_CSSTARTED_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_CSSTARTED_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_CSSTARTED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_CSSTARTED_EN_Msk (0x1UL << TWIS_PUBLISH_CSSTARTED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TWIS_PUBLISH_CSSTARTED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_CSSTARTED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_CSSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_CSSTARTED_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


