adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* UARTE_DMA_RX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after
                         each MATCH event. */

  #define UARTE_DMA_RX_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                   */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define UARTE_DMA_RX_AMOUNT_AMOUNT_Pos (0UL)       /*!< Position of AMOUNT field.                                            */
  #define UARTE_DMA_RX_AMOUNT_AMOUNT_Msk (0xFFFFUL << UARTE_DMA_RX_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.           */
  #define UARTE_DMA_RX_AMOUNT_AMOUNT_Min (0x0001UL)  /*!< Min value of AMOUNT field.                                           */
  #define UARTE_DMA_RX_AMOUNT_AMOUNT_Max (0xFFFFUL)  /*!< Max size of AMOUNT field.                                            */


/* UARTE_DMA_RX_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define UARTE_DMA_RX_CURRENTAMOUNT_ResetValue (0x00000000UL) /*!< Reset value of CURRENTAMOUNT register.                     */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the current transaction. Continuously updated. Updated when data leaves
                        the internal FIFO and is transferred to the destination. */

  #define UARTE_DMA_RX_CURRENTAMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field.                                           */
  #define UARTE_DMA_RX_CURRENTAMOUNT_AMOUNT_Msk (0xFFFFUL << UARTE_DMA_RX_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/
  #define UARTE_DMA_RX_CURRENTAMOUNT_AMOUNT_Min (0x0001UL) /*!< Min value of AMOUNT field.                                     */
  #define UARTE_DMA_RX_CURRENTAMOUNT_AMOUNT_Max (0xFFFFUL) /*!< Max size of AMOUNT field.                                      */


/* UARTE_DMA_RX_LIST: EasyDMA list type */
  #define UARTE_DMA_RX_LIST_ResetValue (0x00000000UL) /*!< Reset value of LIST register.                                       */

/* TYPE @Bits 0..2 : List type */
  #define UARTE_DMA_RX_LIST_TYPE_Pos (0UL)           /*!< Position of TYPE field.                                              */
  #define UARTE_DMA_RX_LIST_TYPE_Msk (0x7UL << UARTE_DMA_RX_LIST_TYPE_Pos) /*!< Bit mask of TYPE field.                        */
  #define UARTE_DMA_RX_LIST_TYPE_Min (0x0UL)         /*!< Min enumerator value of TYPE field.                                  */
  #define UARTE_DMA_RX_LIST_TYPE_Max (0x1UL)         /*!< Max enumerator value of TYPE field.                                  */
  #define UARTE_DMA_RX_LIST_TYPE_Disabled (0x0UL)    /*!< Disable EasyDMA list                                                 */
  #define UARTE_DMA_RX_LIST_TYPE_ArrayList (0x1UL)   /*!< Use array list                                                       */


/* UARTE_DMA_RX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.         */

/* ENABLE @Bit 0 : (unspecified) */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                     */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                       */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                       */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                  */


/* UARTE_DMA_RX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                 */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* =================================================== Struct UARTE_DMA_TX =================================================== */
/**
  * @brief TX [UARTE_DMA_TX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Register doesn't do anything. Can be written and read,
                                                                         but has no functionality attached.*/
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) RAM buffer start address                              */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of bytes in channel buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/
  __IM  uint32_t  CURRENTAMOUNT;                     /*!< (@ 0x00000010) Number of bytes transferred in the current transaction*/
  __IOM uint32_t  LIST;                              /*!< (@ 0x00000014) EasyDMA list type                                     */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_UARTE_DMA_TX_Type;                             /*!< Size = 36 (0x024)                                                    */

