adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* UARTE_DMA_TX_ENABLE: Register doesn't do anything. Can be written and read, but has no functionality attached. */
  #define UARTE_DMA_TX_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                   */

/* ENABLE @Bit 0 : Register doesn't do anything. Can be written and read, but has no functionality attached. */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Pos (0UL)       /*!< Position of ENABLE field.                                            */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Msk (0x1UL << UARTE_DMA_TX_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Max (0x1UL)     /*!< Max enumerator value of ENABLE field.                                */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Disabled (0x0UL) /*!< Disable                                                             */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Enabled (0x1UL) /*!< Enable                                                               */


/* UARTE_DMA_TX_PTR: RAM buffer start address */
  #define UARTE_DMA_TX_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define UARTE_DMA_TX_PTR_PTR_Pos (0UL)             /*!< Position of PTR field.                                               */
  #define UARTE_DMA_TX_PTR_PTR_Msk (0xFFFFFFFFUL << UARTE_DMA_TX_PTR_PTR_Pos) /*!< Bit mask of PTR field.                      */


/* UARTE_DMA_TX_MAXCNT: Maximum number of bytes in channel buffer */
  #define UARTE_DMA_TX_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                   */

/* MAXCNT @Bits 0..15 : Maximum number of bytes in channel buffer */
  #define UARTE_DMA_TX_MAXCNT_MAXCNT_Pos (0UL)       /*!< Position of MAXCNT field.                                            */
  #define UARTE_DMA_TX_MAXCNT_MAXCNT_Msk (0xFFFFUL << UARTE_DMA_TX_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.           */
  #define UARTE_DMA_TX_MAXCNT_MAXCNT_Min (0x0001UL)  /*!< Min value of MAXCNT field.                                           */
  #define UARTE_DMA_TX_MAXCNT_MAXCNT_Max (0xFFFFUL)  /*!< Max size of MAXCNT field.                                            */


/* UARTE_DMA_TX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after
                         each MATCH event. */

  #define UARTE_DMA_TX_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                   */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define UARTE_DMA_TX_AMOUNT_AMOUNT_Pos (0UL)       /*!< Position of AMOUNT field.                                            */
  #define UARTE_DMA_TX_AMOUNT_AMOUNT_Msk (0xFFFFUL << UARTE_DMA_TX_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.           */
  #define UARTE_DMA_TX_AMOUNT_AMOUNT_Min (0x0001UL)  /*!< Min value of AMOUNT field.                                           */
  #define UARTE_DMA_TX_AMOUNT_AMOUNT_Max (0xFFFFUL)  /*!< Max size of AMOUNT field.                                            */


/* UARTE_DMA_TX_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define UARTE_DMA_TX_CURRENTAMOUNT_ResetValue (0x00000000UL) /*!< Reset value of CURRENTAMOUNT register.                     */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the current transaction. Continuously updated. Updated when data leaves
                        the internal FIFO and is transferred to the destination. */

  #define UARTE_DMA_TX_CURRENTAMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field.                                           */
  #define UARTE_DMA_TX_CURRENTAMOUNT_AMOUNT_Msk (0xFFFFUL << UARTE_DMA_TX_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/
  #define UARTE_DMA_TX_CURRENTAMOUNT_AMOUNT_Min (0x0001UL) /*!< Min value of AMOUNT field.                                     */
  #define UARTE_DMA_TX_CURRENTAMOUNT_AMOUNT_Max (0xFFFFUL) /*!< Max size of AMOUNT field.                                      */


/* UARTE_DMA_TX_LIST: EasyDMA list type */
  #define UARTE_DMA_TX_LIST_ResetValue (0x00000000UL) /*!< Reset value of LIST register.                                       */

/* TYPE @Bits 0..2 : List type */
  #define UARTE_DMA_TX_LIST_TYPE_Pos (0UL)           /*!< Position of TYPE field.                                              */
  #define UARTE_DMA_TX_LIST_TYPE_Msk (0x7UL << UARTE_DMA_TX_LIST_TYPE_Pos) /*!< Bit mask of TYPE field.                        */
  #define UARTE_DMA_TX_LIST_TYPE_Min (0x0UL)         /*!< Min enumerator value of TYPE field.                                  */
  #define UARTE_DMA_TX_LIST_TYPE_Max (0x1UL)         /*!< Max enumerator value of TYPE field.                                  */
  #define UARTE_DMA_TX_LIST_TYPE_Disabled (0x0UL)    /*!< Disable EasyDMA list                                                 */
  #define UARTE_DMA_TX_LIST_TYPE_ArrayList (0x1UL)   /*!< Use array list                                                       */


/* UARTE_DMA_TX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.         */

/* ENABLE @Bit 0 : (unspecified) */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                     */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                       */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                       */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                  */


