adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* UARTE_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                 */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ==================================================== Struct UARTE_DMA ===================================================== */
/**
  * @brief DMA [UARTE_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_UARTE_DMA_RX_Type RX;                    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UARTE_DMA_TX_Type TX;                    /*!< (@ 0x00000038) (unspecified)                                         */
} NRF_UARTE_DMA_Type;                                /*!< Size = 92 (0x05C)                                                    */

/* ====================================================== Struct UARTE ======================================================= */
/**
  * @brief UART with EasyDMA
  */
  typedef struct {                                   /*!< UARTE Structure                                                      */
    __IM uint32_t RESERVED[3];
    __OM uint32_t TASKS_SUSPEND;                     /*!< (@ 0x0000000C) Suspend UART transaction                              */
    __OM uint32_t TASKS_RESUME;                      /*!< (@ 0x00000010) Resume UART transaction                               */
    __IM uint32_t RESERVED1[2];
    __OM uint32_t TASKS_FLUSHRX;                     /*!< (@ 0x0000001C) Flush RX FIFO into RX buffer                          */
    __IM uint32_t RESERVED2[2];
    __OM NRF_UARTE_TASKS_DMA_Type TASKS_DMA;         /*!< (@ 0x00000028) Peripheral tasks.                                     */
    __IM uint32_t RESERVED3[13];
    __IOM uint32_t SUBSCRIBE_SUSPEND;                /*!< (@ 0x0000008C) Subscribe configuration for task SUSPEND              */
    __IOM uint32_t SUBSCRIBE_RESUME;                 /*!< (@ 0x00000090) Subscribe configuration for task RESUME               */
    __IM uint32_t RESERVED4[2];
    __IOM uint32_t SUBSCRIBE_FLUSHRX;                /*!< (@ 0x0000009C) Subscribe configuration for task FLUSHRX              */
    __IM uint32_t RESERVED5[2];
    __IOM NRF_UARTE_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA; /*!< (@ 0x000000A8) Subscribe configuration for tasks                    */
    __IM uint32_t RESERVED6[10];
    __IOM uint32_t EVENTS_CTS;                       /*!< (@ 0x00000100) CTS is activated (set low). Clear To Send.            */
    __IOM uint32_t EVENTS_NCTS;                      /*!< (@ 0x00000104) CTS is deactivated (set high). Not Clear To Send.     */
    __IM uint32_t RESERVED7;
    __IOM uint32_t EVENTS_TXDRDY;                    /*!< (@ 0x0000010C) Data sent from TXD                                    */
    __IOM uint32_t EVENTS_RXDRDY;                    /*!< (@ 0x00000110) Data received in RXD (but potentially not yet
                                                                         transferred to Data RAM)*/
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000114) Error detected                                        */
    __IM uint32_t RESERVED8[3];
    __IOM uint32_t EVENTS_RXTO;                      /*!< (@ 0x00000124) Receiver timeout                                      */
    __IM uint32_t RESERVED9;
    __IOM uint32_t EVENTS_RTS;                       /*!< (@ 0x0000012C) RX FIFO has only room for four more bytes before it
                                                                         overflows*/
    __IOM uint32_t EVENTS_TXSTOPPED;                 /*!< (@ 0x00000130) Transmitter stopped                                   */
    __IM uint32_t RESERVED10[6];
    __IOM NRF_UARTE_EVENTS_DMA_Type EVENTS_DMA;      /*!< (@ 0x0000014C) Peripheral events.                                    */
    __IOM uint32_t EVENTS_FRAMETIMEOUT;              /*!< (@ 0x00000174) Timed out due to bus being idle while receiving data. */
    __IM uint32_t RESERVED11[2];
    __IOM uint32_t PUBLISH_CTS;                      /*!< (@ 0x00000180) Publish configuration for event CTS                   */
    __IOM uint32_t PUBLISH_NCTS;                     /*!< (@ 0x00000184) Publish configuration for event NCTS                  */
    __IM uint32_t RESERVED12;
    __IOM uint32_t PUBLISH_TXDRDY;                   /*!< (@ 0x0000018C) Publish configuration for event TXDRDY                */
    __IOM uint32_t PUBLISH_RXDRDY;                   /*!< (@ 0x00000190) Publish configuration for event RXDRDY                */
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x00000194) Publish configuration for event ERROR                 */
    __IM uint32_t RESERVED13[3];
    __IOM uint32_t PUBLISH_RXTO;                     /*!< (@ 0x000001A4) Publish configuration for event RXTO                  */
    __IM uint32_t RESERVED14;
    __IOM uint32_t PUBLISH_RTS;                      /*!< (@ 0x000001AC) Publish configuration for event RTS                   */
    __IOM uint32_t PUBLISH_TXSTOPPED;                /*!< (@ 0x000001B0) Publish configuration for event TXSTOPPED             */
    __IM uint32_t RESERVED15[6];
    __IOM NRF_UARTE_PUBLISH_DMA_Type PUBLISH_DMA;    /*!< (@ 0x000001CC) Publish configuration for events                      */
    __IOM uint32_t PUBLISH_FRAMETIMEOUT;             /*!< (@ 0x000001F4) Publish configuration for event FRAMETIMEOUT          */
    __IM uint32_t RESERVED16[2];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED17[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED18[93];
    __IOM uint32_t ERRORSRC;                         /*!< (@ 0x00000480) Error source                                          */
    __IM uint32_t RESERVED19[31];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable UART                                           */
    __IM uint32_t RESERVED20[8];
    __IOM uint32_t BAUDRATE;                         /*!< (@ 0x00000524) Baud rate. Accuracy depends on the HFCLK source
                                                                         selected.*/
    __IM uint32_t RESERVED21[17];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000056C) Configuration of parity, hardware flow control,
                                                                         framesize, and packet timeout.*/
    __IM uint32_t RESERVED22;
    __IOM uint32_t ADDRESS;                          /*!< (@ 0x00000574) Set the address of the UARTE for RX when used in 9 bit
                                                                         data frame mode.*/
    __IOM uint32_t FRAMETIMEOUT;                     /*!< (@ 0x00000578) Set the number of UARTE bits to count before triggering
                                                                         packet timeout.*/
    __IM uint32_t RESERVED23[34];
    __IOM NRF_UARTE_PSEL_Type PSEL;                  /*!< (@ 0x00000604) (unspecified)                                         */
    __IM uint32_t RESERVED24[59];
    __IOM NRF_UARTE_DMA_Type DMA;                    /*!< (@ 0x00000700) (unspecified)                                         */
  } NRF_UARTE_Type;                                  /*!< Size = 1884 (0x75C)                                                  */

/* UARTE_TASKS_SUSPEND: Suspend UART transaction */
  #define UARTE_TASKS_SUSPEND_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SUSPEND register.                            */

/* TASKS_SUSPEND @Bit 0 : Suspend UART transaction */
  #define UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL) /*!< Position of TASKS_SUSPEND field.                                    */
  #define UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND
                                                                            field.*/
  #define UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Min (0x1UL) /*!< Min enumerator value of TASKS_SUSPEND field.                      */
  #define UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Max (0x1UL) /*!< Max enumerator value of TASKS_SUSPEND field.                      */
  #define UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL) /*!< Trigger task                                                  */


/* UARTE_TASKS_RESUME: Resume UART transaction */
  #define UARTE_TASKS_RESUME_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESUME register.                              */

/* TASKS_RESUME @Bit 0 : Resume UART transaction */
  #define UARTE_TASKS_RESUME_TASKS_RESUME_Pos (0UL)  /*!< Position of TASKS_RESUME field.                                      */
  #define UARTE_TASKS_RESUME_TASKS_RESUME_Msk (0x1UL << UARTE_TASKS_RESUME_TASKS_RESUME_Pos) /*!< Bit mask of TASKS_RESUME
                                                                            field.*/
  #define UARTE_TASKS_RESUME_TASKS_RESUME_Min (0x1UL) /*!< Min enumerator value of TASKS_RESUME field.                         */
  #define UARTE_TASKS_RESUME_TASKS_RESUME_Max (0x1UL) /*!< Max enumerator value of TASKS_RESUME field.                         */
  #define UARTE_TASKS_RESUME_TASKS_RESUME_Trigger (0x1UL) /*!< Trigger task                                                    */


/* UARTE_TASKS_FLUSHRX: Flush RX FIFO into RX buffer */
  #define UARTE_TASKS_FLUSHRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FLUSHRX register.                            */

