adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* UARTE_PUBLISH_RXDRDY: Publish configuration for event RXDRDY */
  #define UARTE_PUBLISH_RXDRDY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXDRDY register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event RXDRDY will publish to */
  #define UARTE_PUBLISH_RXDRDY_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_RXDRDY_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_RXDRDY_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define UARTE_PUBLISH_RXDRDY_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_RXDRDY_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_RXDRDY_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_RXDRDY_EN_Msk (0x1UL << UARTE_PUBLISH_RXDRDY_EN_Pos) /*!< Bit mask of EN field.                        */
  #define UARTE_PUBLISH_RXDRDY_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXDRDY_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXDRDY_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define UARTE_PUBLISH_RXDRDY_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define UARTE_PUBLISH_ERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define UARTE_PUBLISH_ERROR_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define UARTE_PUBLISH_ERROR_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_ERROR_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_ERROR_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_ERROR_EN_Msk (0x1UL << UARTE_PUBLISH_ERROR_EN_Pos) /*!< Bit mask of EN field.                          */
  #define UARTE_PUBLISH_ERROR_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_ERROR_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_ERROR_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define UARTE_PUBLISH_ERROR_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_RXTO: Publish configuration for event RXTO */
  #define UARTE_PUBLISH_RXTO_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXTO register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event RXTO will publish to */
  #define UARTE_PUBLISH_RXTO_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_RXTO_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_RXTO_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define UARTE_PUBLISH_RXTO_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_RXTO_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_RXTO_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_RXTO_EN_Msk (0x1UL << UARTE_PUBLISH_RXTO_EN_Pos) /*!< Bit mask of EN field.                            */
  #define UARTE_PUBLISH_RXTO_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXTO_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXTO_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define UARTE_PUBLISH_RXTO_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_RTS: Publish configuration for event RTS */
  #define UARTE_PUBLISH_RTS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RTS register.                                */

/* CHIDX @Bits 0..7 : DPPI channel that event RTS will publish to */
  #define UARTE_PUBLISH_RTS_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_RTS_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_RTS_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define UARTE_PUBLISH_RTS_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_RTS_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_RTS_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_RTS_EN_Msk (0x1UL << UARTE_PUBLISH_RTS_EN_Pos) /*!< Bit mask of EN field.                              */
  #define UARTE_PUBLISH_RTS_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RTS_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RTS_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define UARTE_PUBLISH_RTS_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_TXSTOPPED: Publish configuration for event TXSTOPPED */
  #define UARTE_PUBLISH_TXSTOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXSTOPPED register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event TXSTOPPED will publish to */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_TXSTOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Msk (0x1UL << UARTE_PUBLISH_TXSTOPPED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_FRAMETIMEOUT: Publish configuration for event FRAMETIMEOUT */
  #define UARTE_PUBLISH_FRAMETIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_FRAMETIMEOUT register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event FRAMETIMEOUT will publish to */
  #define UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Msk (0x1UL << UARTE_PUBLISH_FRAMETIMEOUT_EN_Pos) /*!< Bit mask of EN field.            */
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* UARTE_SHORTS: Shortcuts between local events and tasks */
  #define UARTE_SHORTS_ResetValue (0x00000000UL)     /*!< Reset value of SHORTS register.                                      */

/* CTS_DMA_RX_START @Bit 3 : Shortcut between event CTS and task DMA.RX.START */
  #define UARTE_SHORTS_CTS_DMA_RX_START_Pos (3UL)    /*!< Position of CTS_DMA_RX_START field.                                  */
  #define UARTE_SHORTS_CTS_DMA_RX_START_Msk (0x1UL << UARTE_SHORTS_CTS_DMA_RX_START_Pos) /*!< Bit mask of CTS_DMA_RX_START
                                                                            field.*/
  #define UARTE_SHORTS_CTS_DMA_RX_START_Min (0x0UL)  /*!< Min enumerator value of CTS_DMA_RX_START field.                      */
  #define UARTE_SHORTS_CTS_DMA_RX_START_Max (0x1UL)  /*!< Max enumerator value of CTS_DMA_RX_START field.                      */
  #define UARTE_SHORTS_CTS_DMA_RX_START_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define UARTE_SHORTS_CTS_DMA_RX_START_Enabled (0x1UL) /*!< Enable shortcut                                                   */

