adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* NCTS_DMA_RX_STOP @Bit 4 : Shortcut between event NCTS and task DMA.RX.STOP */
  #define UARTE_SHORTS_NCTS_DMA_RX_STOP_Pos (4UL)    /*!< Position of NCTS_DMA_RX_STOP field.                                  */
  #define UARTE_SHORTS_NCTS_DMA_RX_STOP_Msk (0x1UL << UARTE_SHORTS_NCTS_DMA_RX_STOP_Pos) /*!< Bit mask of NCTS_DMA_RX_STOP
                                                                            field.*/
  #define UARTE_SHORTS_NCTS_DMA_RX_STOP_Min (0x0UL)  /*!< Min enumerator value of NCTS_DMA_RX_STOP field.                      */
  #define UARTE_SHORTS_NCTS_DMA_RX_STOP_Max (0x1UL)  /*!< Max enumerator value of NCTS_DMA_RX_STOP field.                      */
  #define UARTE_SHORTS_NCTS_DMA_RX_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define UARTE_SHORTS_NCTS_DMA_RX_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* DMA_RX_END_DMA_RX_START @Bit 5 : Shortcut between event DMA.RX.END and task DMA.RX.START */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_START_Pos (5UL) /*!< Position of DMA_RX_END_DMA_RX_START field.                       */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_START_Msk (0x1UL << UARTE_SHORTS_DMA_RX_END_DMA_RX_START_Pos) /*!< Bit mask of
                                                                            DMA_RX_END_DMA_RX_START field.*/
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_START_Min (0x0UL) /*!< Min enumerator value of DMA_RX_END_DMA_RX_START field.         */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_START_Max (0x1UL) /*!< Max enumerator value of DMA_RX_END_DMA_RX_START field.         */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_START_Disabled (0x0UL) /*!< Disable shortcut                                          */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_START_Enabled (0x1UL) /*!< Enable shortcut                                            */

/* DMA_RX_END_DMA_RX_STOP @Bit 6 : Shortcut between event DMA.RX.END and task DMA.RX.STOP */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_STOP_Pos (6UL) /*!< Position of DMA_RX_END_DMA_RX_STOP field.                         */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_STOP_Msk (0x1UL << UARTE_SHORTS_DMA_RX_END_DMA_RX_STOP_Pos) /*!< Bit mask of
                                                                            DMA_RX_END_DMA_RX_STOP field.*/
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_RX_END_DMA_RX_STOP field.           */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_RX_END_DMA_RX_STOP field.           */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_STOP_Disabled (0x0UL) /*!< Disable shortcut                                           */
  #define UARTE_SHORTS_DMA_RX_END_DMA_RX_STOP_Enabled (0x1UL) /*!< Enable shortcut                                             */

/* DMA_TX_END_DMA_TX_STOP @Bit 18 : Shortcut between event DMA.TX.END and task DMA.TX.STOP */
  #define UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Pos (18UL) /*!< Position of DMA_TX_END_DMA_TX_STOP field.                        */
  #define UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Msk (0x1UL << UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Pos) /*!< Bit mask of
                                                                            DMA_TX_END_DMA_TX_STOP field.*/
  #define UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_TX_END_DMA_TX_STOP field.           */
  #define UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_TX_END_DMA_TX_STOP field.           */
  #define UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Disabled (0x0UL) /*!< Disable shortcut                                           */
  #define UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Enabled (0x1UL) /*!< Enable shortcut                                             */

/* DMA_RX_BUSERROR_DMA_RX_STOP @Bit 19 : Shortcut between event DMA.RX.BUSERROR and task DMA.RX.STOP */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_DMA_RX_STOP_Pos (19UL) /*!< Position of DMA_RX_BUSERROR_DMA_RX_STOP field.              */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_DMA_RX_STOP_Msk (0x1UL << UARTE_SHORTS_DMA_RX_BUSERROR_DMA_RX_STOP_Pos) /*!< Bit mask of
                                                                            DMA_RX_BUSERROR_DMA_RX_STOP field.*/
  #define UARTE_SHORTS_DMA_RX_BUSERROR_DMA_RX_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_RX_BUSERROR_DMA_RX_STOP field. */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_DMA_RX_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_RX_BUSERROR_DMA_RX_STOP field. */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_DMA_RX_STOP_Disabled (0x0UL) /*!< Disable shortcut                                      */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_DMA_RX_STOP_Enabled (0x1UL) /*!< Enable shortcut                                        */

/* DMA_TX_BUSERROR_DMA_TX_STOP @Bit 20 : Shortcut between event DMA.TX.BUSERROR and task DMA.TX.STOP */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_DMA_TX_STOP_Pos (20UL) /*!< Position of DMA_TX_BUSERROR_DMA_TX_STOP field.              */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_DMA_TX_STOP_Msk (0x1UL << UARTE_SHORTS_DMA_TX_BUSERROR_DMA_TX_STOP_Pos) /*!< Bit mask of
                                                                            DMA_TX_BUSERROR_DMA_TX_STOP field.*/
  #define UARTE_SHORTS_DMA_TX_BUSERROR_DMA_TX_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_TX_BUSERROR_DMA_TX_STOP field. */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_DMA_TX_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_TX_BUSERROR_DMA_TX_STOP field. */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_DMA_TX_STOP_Disabled (0x0UL) /*!< Disable shortcut                                      */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_DMA_TX_STOP_Enabled (0x1UL) /*!< Enable shortcut                                        */

/* DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 @Bit 21 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] Allows
                                               daisy-chaining match events. */

  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos (21UL) /*!< Position of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.  */
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1
                                                                            field.*/
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 @Bit 22 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[2] Allows
                                               daisy-chaining match events. */

