adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
  #define UICR_MEM_MaxCount (16UL)                   /*!< Size of MEM[16] array.                                               */
  #define UICR_MEM_MaxIndex (15UL)                   /*!< Max index of MEM[16] array.                                          */
  #define UICR_MEM_MinIndex (0UL)                    /*!< Min index of MEM[16] array.                                          */

/* UICR_MEM_CONFIG: Memory configuration of the memory region */
  #define UICR_MEM_CONFIG_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of CONFIG register.                                      */

/* READ @Bit 0 : (unspecified) */
  #define UICR_MEM_CONFIG_READ_Pos (0UL)             /*!< Position of READ field.                                              */
  #define UICR_MEM_CONFIG_READ_Msk (0x1UL << UICR_MEM_CONFIG_READ_Pos) /*!< Bit mask of READ field.                            */
  #define UICR_MEM_CONFIG_READ_Min (0x0UL)           /*!< Min enumerator value of READ field.                                  */
  #define UICR_MEM_CONFIG_READ_Max (0x1UL)           /*!< Max enumerator value of READ field.                                  */
  #define UICR_MEM_CONFIG_READ_NotAllowed (0x1UL)    /*!< Read access to MEM[n] is not allowed                                 */
  #define UICR_MEM_CONFIG_READ_Allowed (0x0UL)       /*!< Read access to MEM[n] is allowed                                     */

/* WRITE @Bit 1 : (unspecified) */
  #define UICR_MEM_CONFIG_WRITE_Pos (1UL)            /*!< Position of WRITE field.                                             */
  #define UICR_MEM_CONFIG_WRITE_Msk (0x1UL << UICR_MEM_CONFIG_WRITE_Pos) /*!< Bit mask of WRITE field.                         */
  #define UICR_MEM_CONFIG_WRITE_Min (0x0UL)          /*!< Min enumerator value of WRITE field.                                 */
  #define UICR_MEM_CONFIG_WRITE_Max (0x1UL)          /*!< Max enumerator value of WRITE field.                                 */
  #define UICR_MEM_CONFIG_WRITE_NotAllowed (0x1UL)   /*!< Write access to MEM[n] is not allowed                                */
  #define UICR_MEM_CONFIG_WRITE_Allowed (0x0UL)      /*!< Write access to MEM[n] is allowed                                    */

/* EXECUTE @Bit 2 : (unspecified) */
  #define UICR_MEM_CONFIG_EXECUTE_Pos (2UL)          /*!< Position of EXECUTE field.                                           */
  #define UICR_MEM_CONFIG_EXECUTE_Msk (0x1UL << UICR_MEM_CONFIG_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.                   */
  #define UICR_MEM_CONFIG_EXECUTE_Min (0x0UL)        /*!< Min enumerator value of EXECUTE field.                               */
  #define UICR_MEM_CONFIG_EXECUTE_Max (0x1UL)        /*!< Max enumerator value of EXECUTE field.                               */
  #define UICR_MEM_CONFIG_EXECUTE_NotAllowed (0x1UL) /*!< SW execution from MEM[n] is not allowed                              */
  #define UICR_MEM_CONFIG_EXECUTE_Allowed (0x0UL)    /*!< SW execution from MEM[n] is allowed                                  */

/* SECURE @Bit 3 : (unspecified) */
  #define UICR_MEM_CONFIG_SECURE_Pos (3UL)           /*!< Position of SECURE field.                                            */
  #define UICR_MEM_CONFIG_SECURE_Msk (0x1UL << UICR_MEM_CONFIG_SECURE_Pos) /*!< Bit mask of SECURE field.                      */
  #define UICR_MEM_CONFIG_SECURE_Min (0x0UL)         /*!< Min enumerator value of SECURE field.                                */
  #define UICR_MEM_CONFIG_SECURE_Max (0x1UL)         /*!< Max enumerator value of SECURE field.                                */
  #define UICR_MEM_CONFIG_SECURE_Secure (0x1UL)      /*!< Non-secure access to MEM[n] is not allowed                           */
  #define UICR_MEM_CONFIG_SECURE_NonSecure (0x0UL)   /*!< Non-secure access to MEM[n] is allowed                               */

/* NSC @Bit 4 : (unspecified) */
  #define UICR_MEM_CONFIG_NSC_Pos (4UL)              /*!< Position of NSC field.                                               */
  #define UICR_MEM_CONFIG_NSC_Msk (0x1UL << UICR_MEM_CONFIG_NSC_Pos) /*!< Bit mask of NSC field.                               */
  #define UICR_MEM_CONFIG_NSC_Min (0x0UL)            /*!< Min enumerator value of NSC field.                                   */
  #define UICR_MEM_CONFIG_NSC_Max (0x1UL)            /*!< Max enumerator value of NSC field.                                   */
  #define UICR_MEM_CONFIG_NSC_Disabled (0x1UL)       /*!< Memory region is not non-secure callable                             */
  #define UICR_MEM_CONFIG_NSC_Enabled (0x0UL)        /*!< Memory region is non-secure callable                                 */

/* OWNERID @Bits 8..11 : Memory owner identification */
  #define UICR_MEM_CONFIG_OWNERID_Pos (8UL)          /*!< Position of OWNERID field.                                           */
  #define UICR_MEM_CONFIG_OWNERID_Msk (0xFUL << UICR_MEM_CONFIG_OWNERID_Pos) /*!< Bit mask of OWNERID field.                   */
  #define UICR_MEM_CONFIG_OWNERID_Min (0x0UL)        /*!< Min value of OWNERID field.                                          */
  #define UICR_MEM_CONFIG_OWNERID_Max (0xFUL)        /*!< Max size of OWNERID field.                                           */

/* ADDRESS @Bits 12..31 : Memory region start address, bits [31:12] */
  #define UICR_MEM_CONFIG_ADDRESS_Pos (12UL)         /*!< Position of ADDRESS field.                                           */
  #define UICR_MEM_CONFIG_ADDRESS_Msk (0xFFFFFUL << UICR_MEM_CONFIG_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.               */


/* UICR_MEM_SIZE: Size of the memory region */
  #define UICR_MEM_SIZE_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SIZE register.                                        */

/* SIZE @Bits 0..31 : Memory size in bytes */
  #define UICR_MEM_SIZE_SIZE_Pos (0UL)               /*!< Position of SIZE field.                                              */
  #define UICR_MEM_SIZE_SIZE_Msk (0xFFFFFFFFUL << UICR_MEM_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.                         */



