adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH17 @Bit 17 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH17_Pos (17UL)         /*!< Position of CH17 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH17_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH17_Pos) /*!< Bit mask of CH17 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH17_Min (0x0UL)        /*!< Min enumerator value of CH17 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH17_Max (0x1UL)        /*!< Max enumerator value of CH17 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH17_NotOwn (0x1UL)     /*!< Do not own the channel 17                                            */
  #define UICR_GPIOTE_CH_OWN_CH17_Own (0x0UL)        /*!< Own the channel 17                                                   */

/* CH18 @Bit 18 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH18_Pos (18UL)         /*!< Position of CH18 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH18_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH18_Pos) /*!< Bit mask of CH18 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH18_Min (0x0UL)        /*!< Min enumerator value of CH18 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH18_Max (0x1UL)        /*!< Max enumerator value of CH18 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH18_NotOwn (0x1UL)     /*!< Do not own the channel 18                                            */
  #define UICR_GPIOTE_CH_OWN_CH18_Own (0x0UL)        /*!< Own the channel 18                                                   */

/* CH19 @Bit 19 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH19_Pos (19UL)         /*!< Position of CH19 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH19_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH19_Pos) /*!< Bit mask of CH19 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH19_Min (0x0UL)        /*!< Min enumerator value of CH19 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH19_Max (0x1UL)        /*!< Max enumerator value of CH19 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH19_NotOwn (0x1UL)     /*!< Do not own the channel 19                                            */
  #define UICR_GPIOTE_CH_OWN_CH19_Own (0x0UL)        /*!< Own the channel 19                                                   */

/* CH20 @Bit 20 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH20_Pos (20UL)         /*!< Position of CH20 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH20_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH20_Pos) /*!< Bit mask of CH20 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH20_Min (0x0UL)        /*!< Min enumerator value of CH20 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH20_Max (0x1UL)        /*!< Max enumerator value of CH20 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH20_NotOwn (0x1UL)     /*!< Do not own the channel 20                                            */
  #define UICR_GPIOTE_CH_OWN_CH20_Own (0x0UL)        /*!< Own the channel 20                                                   */

/* CH21 @Bit 21 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH21_Pos (21UL)         /*!< Position of CH21 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH21_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH21_Pos) /*!< Bit mask of CH21 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH21_Min (0x0UL)        /*!< Min enumerator value of CH21 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH21_Max (0x1UL)        /*!< Max enumerator value of CH21 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH21_NotOwn (0x1UL)     /*!< Do not own the channel 21                                            */
  #define UICR_GPIOTE_CH_OWN_CH21_Own (0x0UL)        /*!< Own the channel 21                                                   */

/* CH22 @Bit 22 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH22_Pos (22UL)         /*!< Position of CH22 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH22_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH22_Pos) /*!< Bit mask of CH22 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH22_Min (0x0UL)        /*!< Min enumerator value of CH22 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH22_Max (0x1UL)        /*!< Max enumerator value of CH22 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH22_NotOwn (0x1UL)     /*!< Do not own the channel 22                                            */
  #define UICR_GPIOTE_CH_OWN_CH22_Own (0x0UL)        /*!< Own the channel 22                                                   */

/* CH23 @Bit 23 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH23_Pos (23UL)         /*!< Position of CH23 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH23_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH23_Pos) /*!< Bit mask of CH23 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH23_Min (0x0UL)        /*!< Min enumerator value of CH23 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH23_Max (0x1UL)        /*!< Max enumerator value of CH23 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH23_NotOwn (0x1UL)     /*!< Do not own the channel 23                                            */
  #define UICR_GPIOTE_CH_OWN_CH23_Own (0x0UL)        /*!< Own the channel 23                                                   */

/* CH24 @Bit 24 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH24_Pos (24UL)         /*!< Position of CH24 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH24_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH24_Pos) /*!< Bit mask of CH24 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH24_Min (0x0UL)        /*!< Min enumerator value of CH24 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH24_Max (0x1UL)        /*!< Max enumerator value of CH24 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH24_NotOwn (0x1UL)     /*!< Do not own the channel 24                                            */
  #define UICR_GPIOTE_CH_OWN_CH24_Own (0x0UL)        /*!< Own the channel 24                                                   */

/* CH25 @Bit 25 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH25_Pos (25UL)         /*!< Position of CH25 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH25_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH25_Pos) /*!< Bit mask of CH25 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH25_Min (0x0UL)        /*!< Min enumerator value of CH25 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH25_Max (0x1UL)        /*!< Max enumerator value of CH25 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH25_NotOwn (0x1UL)     /*!< Do not own the channel 25                                            */
  #define UICR_GPIOTE_CH_OWN_CH25_Own (0x0UL)        /*!< Own the channel 25                                                   */

/* CH26 @Bit 26 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH26_Pos (26UL)         /*!< Position of CH26 field.                                              */
  #define UICR_GPIOTE_CH_OWN_CH26_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH26_Pos) /*!< Bit mask of CH26 field.                      */
  #define UICR_GPIOTE_CH_OWN_CH26_Min (0x0UL)        /*!< Min enumerator value of CH26 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH26_Max (0x1UL)        /*!< Max enumerator value of CH26 field.                                  */
  #define UICR_GPIOTE_CH_OWN_CH26_NotOwn (0x1UL)     /*!< Do not own the channel 26                                            */
  #define UICR_GPIOTE_CH_OWN_CH26_Own (0x0UL)        /*!< Own the channel 26                                                   */

