adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH27 @Bit 27 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH27_Pos (27UL)      /*!< Position of CH27 field.                                              */
  #define UICR_GPIOTE_CH_SECURE_CH27_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH27_Pos) /*!< Bit mask of CH27 field.                */
  #define UICR_GPIOTE_CH_SECURE_CH27_Min (0x0UL)     /*!< Min enumerator value of CH27 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH27_Max (0x1UL)     /*!< Max enumerator value of CH27 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH27_Secure (0x1UL)  /*!< The channel 27 is secure                                             */
  #define UICR_GPIOTE_CH_SECURE_CH27_NonSecure (0x0UL) /*!< The channel 27 is non-secure                                       */

/* CH28 @Bit 28 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH28_Pos (28UL)      /*!< Position of CH28 field.                                              */
  #define UICR_GPIOTE_CH_SECURE_CH28_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH28_Pos) /*!< Bit mask of CH28 field.                */
  #define UICR_GPIOTE_CH_SECURE_CH28_Min (0x0UL)     /*!< Min enumerator value of CH28 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH28_Max (0x1UL)     /*!< Max enumerator value of CH28 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH28_Secure (0x1UL)  /*!< The channel 28 is secure                                             */
  #define UICR_GPIOTE_CH_SECURE_CH28_NonSecure (0x0UL) /*!< The channel 28 is non-secure                                       */

/* CH29 @Bit 29 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH29_Pos (29UL)      /*!< Position of CH29 field.                                              */
  #define UICR_GPIOTE_CH_SECURE_CH29_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH29_Pos) /*!< Bit mask of CH29 field.                */
  #define UICR_GPIOTE_CH_SECURE_CH29_Min (0x0UL)     /*!< Min enumerator value of CH29 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH29_Max (0x1UL)     /*!< Max enumerator value of CH29 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH29_Secure (0x1UL)  /*!< The channel 29 is secure                                             */
  #define UICR_GPIOTE_CH_SECURE_CH29_NonSecure (0x0UL) /*!< The channel 29 is non-secure                                       */

/* CH30 @Bit 30 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH30_Pos (30UL)      /*!< Position of CH30 field.                                              */
  #define UICR_GPIOTE_CH_SECURE_CH30_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH30_Pos) /*!< Bit mask of CH30 field.                */
  #define UICR_GPIOTE_CH_SECURE_CH30_Min (0x0UL)     /*!< Min enumerator value of CH30 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH30_Max (0x1UL)     /*!< Max enumerator value of CH30 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH30_Secure (0x1UL)  /*!< The channel 30 is secure                                             */
  #define UICR_GPIOTE_CH_SECURE_CH30_NonSecure (0x0UL) /*!< The channel 30 is non-secure                                       */

/* CH31 @Bit 31 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH31_Pos (31UL)      /*!< Position of CH31 field.                                              */
  #define UICR_GPIOTE_CH_SECURE_CH31_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH31_Pos) /*!< Bit mask of CH31 field.                */
  #define UICR_GPIOTE_CH_SECURE_CH31_Min (0x0UL)     /*!< Min enumerator value of CH31 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH31_Max (0x1UL)     /*!< Max enumerator value of CH31 field.                                  */
  #define UICR_GPIOTE_CH_SECURE_CH31_Secure (0x1UL)  /*!< The channel 31 is secure                                             */
  #define UICR_GPIOTE_CH_SECURE_CH31_NonSecure (0x0UL) /*!< The channel 31 is non-secure                                       */



/* =================================================== Struct UICR_GPIOTE ==================================================== */
/**
  * @brief GPIOTE [UICR_GPIOTE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;                          /*!< (@ 0x00000000) Address of the GPIOTE instance associated with
                                                                         GPIOTE[n]*/
  __IOM NRF_UICR_GPIOTE_CH_Type CH;                  /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_UICR_GPIOTE_Type;                              /*!< Size = 12 (0x00C)                                                    */
  #define UICR_GPIOTE_MaxCount (4UL)                 /*!< Size of GPIOTE[4] array.                                             */
  #define UICR_GPIOTE_MaxIndex (3UL)                 /*!< Max index of GPIOTE[4] array.                                        */
  #define UICR_GPIOTE_MinIndex (0UL)                 /*!< Min index of GPIOTE[4] array.                                        */

/* UICR_GPIOTE_INSTANCE: Address of the GPIOTE instance associated with GPIOTE[n] */
  #define UICR_GPIOTE_INSTANCE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of INSTANCE register.                                */

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICR_GPIOTE_INSTANCE_ADDRESS_Pos (0UL)     /*!< Position of ADDRESS field.                                           */
  #define UICR_GPIOTE_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICR_GPIOTE_INSTANCE_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.  */



/* ================================================ Struct UICR_IPCT_LOCAL_CH ================================================ */
/**
  * @brief CH [UICR_IPCT_LOCAL_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000000) Request permission for the channels of IPCT in the
                                                                         local domain*/
} NRF_UICR_IPCT_LOCAL_CH_Type;                       /*!< Size = 4 (0x004)                                                     */

