adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH27 @Bit 27 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Pos (27UL)  /*!< Position of CH27 field.                                              */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH27_Pos) /*!< Bit mask of CH27 field.        */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Min (0x0UL) /*!< Min enumerator value of CH27 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Max (0x1UL) /*!< Max enumerator value of CH27 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Secure (0x1UL) /*!< The channel 27 is secure                                          */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_NonSecure (0x0UL) /*!< The channel 27 is non-secure                                   */

/* CH28 @Bit 28 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Pos (28UL)  /*!< Position of CH28 field.                                              */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH28_Pos) /*!< Bit mask of CH28 field.        */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Min (0x0UL) /*!< Min enumerator value of CH28 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Max (0x1UL) /*!< Max enumerator value of CH28 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Secure (0x1UL) /*!< The channel 28 is secure                                          */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_NonSecure (0x0UL) /*!< The channel 28 is non-secure                                   */

/* CH29 @Bit 29 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Pos (29UL)  /*!< Position of CH29 field.                                              */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH29_Pos) /*!< Bit mask of CH29 field.        */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Min (0x0UL) /*!< Min enumerator value of CH29 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Max (0x1UL) /*!< Max enumerator value of CH29 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Secure (0x1UL) /*!< The channel 29 is secure                                          */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_NonSecure (0x0UL) /*!< The channel 29 is non-secure                                   */

/* CH30 @Bit 30 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Pos (30UL)  /*!< Position of CH30 field.                                              */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH30_Pos) /*!< Bit mask of CH30 field.        */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Min (0x0UL) /*!< Min enumerator value of CH30 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Max (0x1UL) /*!< Max enumerator value of CH30 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Secure (0x1UL) /*!< The channel 30 is secure                                          */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_NonSecure (0x0UL) /*!< The channel 30 is non-secure                                   */

/* CH31 @Bit 31 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Pos (31UL)  /*!< Position of CH31 field.                                              */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH31_Pos) /*!< Bit mask of CH31 field.        */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Min (0x0UL) /*!< Min enumerator value of CH31 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Max (0x1UL) /*!< Max enumerator value of CH31 field.                                  */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Secure (0x1UL) /*!< The channel 31 is secure                                          */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_NonSecure (0x0UL) /*!< The channel 31 is non-secure                                   */



/* ============================================ Struct UICR_IPCT_LOCAL_INTERRUPT ============================================= */
/**
  * @brief INTERRUPT [UICR_IPCT_LOCAL_INTERRUPT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000000) Request permission for the interrupts of IPCT in the
                                                                         local domain*/
} NRF_UICR_IPCT_LOCAL_INTERRUPT_Type;                /*!< Size = 4 (0x004)                                                     */

/* UICR_IPCT_LOCAL_INTERRUPT_SECURE: Request permission for the interrupts of IPCT in the local domain */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SECURE register.                      */

/* INT0 @Bit 0 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Pos (0UL) /*!< Position of INT0 field.                                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Pos) /*!< Bit mask of INT0
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Min (0x0UL) /*!< Min enumerator value of INT0 field.                           */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Max (0x1UL) /*!< Max enumerator value of INT0 field.                           */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Secure (0x1UL) /*!< The interrupt 0 is secure                                  */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_NonSecure (0x0UL) /*!< The interrupt 0 is non-secure                           */

/* INT1 @Bit 1 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Pos (1UL) /*!< Position of INT1 field.                                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Pos) /*!< Bit mask of INT1
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Min (0x0UL) /*!< Min enumerator value of INT1 field.                           */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Max (0x1UL) /*!< Max enumerator value of INT1 field.                           */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Secure (0x1UL) /*!< The interrupt 1 is secure                                  */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_NonSecure (0x0UL) /*!< The interrupt 1 is non-secure                           */

/* INT2 @Bit 2 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Pos (2UL) /*!< Position of INT2 field.                                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Pos) /*!< Bit mask of INT2
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Min (0x0UL) /*!< Min enumerator value of INT2 field.                           */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Max (0x1UL) /*!< Max enumerator value of INT2 field.                           */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Secure (0x1UL) /*!< The interrupt 2 is secure                                  */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_NonSecure (0x0UL) /*!< The interrupt 2 is non-secure                           */

/* INT3 @Bit 3 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Pos (3UL) /*!< Position of INT3 field.                                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Pos) /*!< Bit mask of INT3
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Min (0x0UL) /*!< Min enumerator value of INT3 field.                           */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Max (0x1UL) /*!< Max enumerator value of INT3 field.                           */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Secure (0x1UL) /*!< The interrupt 3 is secure                                  */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_NonSecure (0x0UL) /*!< The interrupt 3 is non-secure                           */

