adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* INT4 @Bit 4 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Pos (4UL) /*!< Position of INT4 field.                                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Pos) /*!< Bit mask of INT4
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Min (0x0UL) /*!< Min enumerator value of INT4 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Max (0x1UL) /*!< Max enumerator value of INT4 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_NotOwn (0x1UL) /*!< Do not own the interrupt 4                                   */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Own (0x0UL) /*!< Own the interrupt 4                                             */

/* INT5 @Bit 5 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Pos (5UL) /*!< Position of INT5 field.                                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Pos) /*!< Bit mask of INT5
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Min (0x0UL) /*!< Min enumerator value of INT5 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Max (0x1UL) /*!< Max enumerator value of INT5 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_NotOwn (0x1UL) /*!< Do not own the interrupt 5                                   */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Own (0x0UL) /*!< Own the interrupt 5                                             */

/* INT6 @Bit 6 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Pos (6UL) /*!< Position of INT6 field.                                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Pos) /*!< Bit mask of INT6
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Min (0x0UL) /*!< Min enumerator value of INT6 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Max (0x1UL) /*!< Max enumerator value of INT6 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_NotOwn (0x1UL) /*!< Do not own the interrupt 6                                   */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Own (0x0UL) /*!< Own the interrupt 6                                             */

/* INT7 @Bit 7 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Pos (7UL) /*!< Position of INT7 field.                                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Pos) /*!< Bit mask of INT7
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Min (0x0UL) /*!< Min enumerator value of INT7 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Max (0x1UL) /*!< Max enumerator value of INT7 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_NotOwn (0x1UL) /*!< Do not own the interrupt 7                                   */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Own (0x0UL) /*!< Own the interrupt 7                                             */

/* INT8 @Bit 8 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Pos (8UL) /*!< Position of INT8 field.                                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Pos) /*!< Bit mask of INT8
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Min (0x0UL) /*!< Min enumerator value of INT8 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Max (0x1UL) /*!< Max enumerator value of INT8 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_NotOwn (0x1UL) /*!< Do not own the interrupt 8                                   */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Own (0x0UL) /*!< Own the interrupt 8                                             */

/* INT9 @Bit 9 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Pos (9UL) /*!< Position of INT9 field.                                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Pos) /*!< Bit mask of INT9
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Min (0x0UL) /*!< Min enumerator value of INT9 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Max (0x1UL) /*!< Max enumerator value of INT9 field.                             */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_NotOwn (0x1UL) /*!< Do not own the interrupt 9                                   */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Own (0x0UL) /*!< Own the interrupt 9                                             */

/* INT10 @Bit 10 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Pos (10UL) /*!< Position of INT10 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Pos) /*!< Bit mask of INT10
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Min (0x0UL) /*!< Min enumerator value of INT10 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Max (0x1UL) /*!< Max enumerator value of INT10 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_NotOwn (0x1UL) /*!< Do not own the interrupt 10                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Own (0x0UL) /*!< Own the interrupt 10                                           */

/* INT11 @Bit 11 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Pos (11UL) /*!< Position of INT11 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Pos) /*!< Bit mask of INT11
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Min (0x0UL) /*!< Min enumerator value of INT11 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Max (0x1UL) /*!< Max enumerator value of INT11 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_NotOwn (0x1UL) /*!< Do not own the interrupt 11                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Own (0x0UL) /*!< Own the interrupt 11                                           */

/* INT12 @Bit 12 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Pos (12UL) /*!< Position of INT12 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Pos) /*!< Bit mask of INT12
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Min (0x0UL) /*!< Min enumerator value of INT12 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Max (0x1UL) /*!< Max enumerator value of INT12 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_NotOwn (0x1UL) /*!< Do not own the interrupt 12                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Own (0x0UL) /*!< Own the interrupt 12                                           */

/* INT13 @Bit 13 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Pos (13UL) /*!< Position of INT13 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Pos) /*!< Bit mask of INT13
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Min (0x0UL) /*!< Min enumerator value of INT13 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Max (0x1UL) /*!< Max enumerator value of INT13 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_NotOwn (0x1UL) /*!< Do not own the interrupt 13                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Own (0x0UL) /*!< Own the interrupt 13                                           */

/* INT14 @Bit 14 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Pos (14UL) /*!< Position of INT14 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Pos) /*!< Bit mask of INT14
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Min (0x0UL) /*!< Min enumerator value of INT14 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Max (0x1UL) /*!< Max enumerator value of INT14 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_NotOwn (0x1UL) /*!< Do not own the interrupt 14                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Own (0x0UL) /*!< Own the interrupt 14                                           */

/* INT15 @Bit 15 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Pos (15UL) /*!< Position of INT15 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Pos) /*!< Bit mask of INT15
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Min (0x0UL) /*!< Min enumerator value of INT15 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Max (0x1UL) /*!< Max enumerator value of INT15 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_NotOwn (0x1UL) /*!< Do not own the interrupt 15                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Own (0x0UL) /*!< Own the interrupt 15                                           */

