adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH23 @Bit 23 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Pos (23UL) /*!< Position of CH23 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Pos) /*!< Bit mask of CH23 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Min (0x0UL) /*!< Min enumerator value of CH23 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Max (0x1UL) /*!< Max enumerator value of CH23 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Source (0x1UL) /*!< The channel 23 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Sink (0x0UL) /*!< The channel 23 is linked as sink                                  */

/* CH24 @Bit 24 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Pos (24UL) /*!< Position of CH24 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Pos) /*!< Bit mask of CH24 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Min (0x0UL) /*!< Min enumerator value of CH24 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Max (0x1UL) /*!< Max enumerator value of CH24 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Source (0x1UL) /*!< The channel 24 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Sink (0x0UL) /*!< The channel 24 is linked as sink                                  */

/* CH25 @Bit 25 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Pos (25UL) /*!< Position of CH25 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Pos) /*!< Bit mask of CH25 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Min (0x0UL) /*!< Min enumerator value of CH25 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Max (0x1UL) /*!< Max enumerator value of CH25 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Source (0x1UL) /*!< The channel 25 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Sink (0x0UL) /*!< The channel 25 is linked as sink                                  */

/* CH26 @Bit 26 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Pos (26UL) /*!< Position of CH26 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Pos) /*!< Bit mask of CH26 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Min (0x0UL) /*!< Min enumerator value of CH26 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Max (0x1UL) /*!< Max enumerator value of CH26 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Source (0x1UL) /*!< The channel 26 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Sink (0x0UL) /*!< The channel 26 is linked as sink                                  */

/* CH27 @Bit 27 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Pos (27UL) /*!< Position of CH27 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Pos) /*!< Bit mask of CH27 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Min (0x0UL) /*!< Min enumerator value of CH27 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Max (0x1UL) /*!< Max enumerator value of CH27 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Source (0x1UL) /*!< The channel 27 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Sink (0x0UL) /*!< The channel 27 is linked as sink                                  */

/* CH28 @Bit 28 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Pos (28UL) /*!< Position of CH28 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Pos) /*!< Bit mask of CH28 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Min (0x0UL) /*!< Min enumerator value of CH28 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Max (0x1UL) /*!< Max enumerator value of CH28 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Source (0x1UL) /*!< The channel 28 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Sink (0x0UL) /*!< The channel 28 is linked as sink                                  */

/* CH29 @Bit 29 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Pos (29UL) /*!< Position of CH29 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Pos) /*!< Bit mask of CH29 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Min (0x0UL) /*!< Min enumerator value of CH29 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Max (0x1UL) /*!< Max enumerator value of CH29 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Source (0x1UL) /*!< The channel 29 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Sink (0x0UL) /*!< The channel 29 is linked as sink                                  */

/* CH30 @Bit 30 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Pos (30UL) /*!< Position of CH30 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Pos) /*!< Bit mask of CH30 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Min (0x0UL) /*!< Min enumerator value of CH30 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Max (0x1UL) /*!< Max enumerator value of CH30 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Source (0x1UL) /*!< The channel 30 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Sink (0x0UL) /*!< The channel 30 is linked as sink                                  */

/* CH31 @Bit 31 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Pos (31UL) /*!< Position of CH31 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Pos) /*!< Bit mask of CH31 field.    */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Min (0x0UL) /*!< Min enumerator value of CH31 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Max (0x1UL) /*!< Max enumerator value of CH31 field.                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Source (0x1UL) /*!< The channel 31 is linked as source                              */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Sink (0x0UL) /*!< The channel 31 is linked as sink                                  */


/* UICR_DPPI_LOCAL_CH_LINK_EN: Request linking of the channels of DPPI[n] in the local domain */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of EN register.                                */

/* CH0 @Bit 0 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Pos (0UL)   /*!< Position of CH0 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Pos) /*!< Bit mask of CH0 field.         */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Min (0x0UL) /*!< Min enumerator value of CH0 field.                                   */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Max (0x1UL) /*!< Max enumerator value of CH0 field.                                   */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Disabled (0x1UL) /*!< The channel 0 is disabled                                       */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Enabled (0x0UL) /*!< The channel 0 is enabled                                         */

/* CH1 @Bit 1 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Pos (1UL)   /*!< Position of CH1 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Pos) /*!< Bit mask of CH1 field.         */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Min (0x0UL) /*!< Min enumerator value of CH1 field.                                   */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Max (0x1UL) /*!< Max enumerator value of CH1 field.                                   */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Disabled (0x1UL) /*!< The channel 1 is disabled                                       */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Enabled (0x0UL) /*!< The channel 1 is enabled                                         */

