adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH27 @Bit 27 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Pos (27UL)  /*!< Position of CH27 field.                                              */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH27_Pos) /*!< Bit mask of CH27 field.        */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Min (0x0UL) /*!< Min enumerator value of CH27 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Max (0x1UL) /*!< Max enumerator value of CH27 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Secure (0x1UL) /*!< The channel 27 is secure                                          */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_NonSecure (0x0UL) /*!< The channel 27 is non-secure                                   */

/* CH28 @Bit 28 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Pos (28UL)  /*!< Position of CH28 field.                                              */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH28_Pos) /*!< Bit mask of CH28 field.        */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Min (0x0UL) /*!< Min enumerator value of CH28 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Max (0x1UL) /*!< Max enumerator value of CH28 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Secure (0x1UL) /*!< The channel 28 is secure                                          */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_NonSecure (0x0UL) /*!< The channel 28 is non-secure                                   */

/* CH29 @Bit 29 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Pos (29UL)  /*!< Position of CH29 field.                                              */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH29_Pos) /*!< Bit mask of CH29 field.        */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Min (0x0UL) /*!< Min enumerator value of CH29 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Max (0x1UL) /*!< Max enumerator value of CH29 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Secure (0x1UL) /*!< The channel 29 is secure                                          */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_NonSecure (0x0UL) /*!< The channel 29 is non-secure                                   */

/* CH30 @Bit 30 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Pos (30UL)  /*!< Position of CH30 field.                                              */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH30_Pos) /*!< Bit mask of CH30 field.        */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Min (0x0UL) /*!< Min enumerator value of CH30 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Max (0x1UL) /*!< Max enumerator value of CH30 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Secure (0x1UL) /*!< The channel 30 is secure                                          */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_NonSecure (0x0UL) /*!< The channel 30 is non-secure                                   */

/* CH31 @Bit 31 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Pos (31UL)  /*!< Position of CH31 field.                                              */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH31_Pos) /*!< Bit mask of CH31 field.        */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Min (0x0UL) /*!< Min enumerator value of CH31 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Max (0x1UL) /*!< Max enumerator value of CH31 field.                                  */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Secure (0x1UL) /*!< The channel 31 is secure                                          */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_NonSecure (0x0UL) /*!< The channel 31 is non-secure                                   */



/* =============================================== Struct UICR_DPPI_LOCAL_CHG ================================================ */
/**
  * @brief CHG [UICR_DPPI_LOCAL_CHG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000000) Request permission for the channel groups of DPPI[n] in
                                                                         the local domain*/
} NRF_UICR_DPPI_LOCAL_CHG_Type;                      /*!< Size = 4 (0x004)                                                     */

/* UICR_DPPI_LOCAL_CHG_SECURE: Request permission for the channel groups of DPPI[n] in the local domain */
  #define UICR_DPPI_LOCAL_CHG_SECURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SECURE register.                            */

/* CHG0 @Bit 0 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Pos (0UL)  /*!< Position of CHG0 field.                                              */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Pos) /*!< Bit mask of CHG0 field.      */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Min (0x0UL) /*!< Min enumerator value of CHG0 field.                                 */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Max (0x1UL) /*!< Max enumerator value of CHG0 field.                                 */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Secure (0x1UL) /*!< The channel group 0 is secure                                    */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_NonSecure (0x0UL) /*!< The channel group 0 is non-secure                             */

/* CHG1 @Bit 1 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Pos (1UL)  /*!< Position of CHG1 field.                                              */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Pos) /*!< Bit mask of CHG1 field.      */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Min (0x0UL) /*!< Min enumerator value of CHG1 field.                                 */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Max (0x1UL) /*!< Max enumerator value of CHG1 field.                                 */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Secure (0x1UL) /*!< The channel group 1 is secure                                    */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_NonSecure (0x0UL) /*!< The channel group 1 is non-secure                             */

