adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH13 @Bit 13 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH13_Pos (13UL) /*!< Position of CH13 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH13_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH13_Pos) /*!< Bit mask of CH13 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH13_Min (0x0UL) /*!< Min enumerator value of CH13 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH13_Max (0x1UL) /*!< Max enumerator value of CH13 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH13_Source (0x1UL) /*!< The channel 13 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH13_Sink (0x0UL) /*!< The channel 13 is linked as sink                                 */

/* CH14 @Bit 14 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH14_Pos (14UL) /*!< Position of CH14 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH14_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH14_Pos) /*!< Bit mask of CH14 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH14_Min (0x0UL) /*!< Min enumerator value of CH14 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH14_Max (0x1UL) /*!< Max enumerator value of CH14 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH14_Source (0x1UL) /*!< The channel 14 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH14_Sink (0x0UL) /*!< The channel 14 is linked as sink                                 */

/* CH15 @Bit 15 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH15_Pos (15UL) /*!< Position of CH15 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH15_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH15_Pos) /*!< Bit mask of CH15 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH15_Min (0x0UL) /*!< Min enumerator value of CH15 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH15_Max (0x1UL) /*!< Max enumerator value of CH15 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH15_Source (0x1UL) /*!< The channel 15 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH15_Sink (0x0UL) /*!< The channel 15 is linked as sink                                 */

/* CH16 @Bit 16 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH16_Pos (16UL) /*!< Position of CH16 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH16_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH16_Pos) /*!< Bit mask of CH16 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH16_Min (0x0UL) /*!< Min enumerator value of CH16 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH16_Max (0x1UL) /*!< Max enumerator value of CH16 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH16_Source (0x1UL) /*!< The channel 16 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH16_Sink (0x0UL) /*!< The channel 16 is linked as sink                                 */

/* CH17 @Bit 17 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH17_Pos (17UL) /*!< Position of CH17 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH17_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH17_Pos) /*!< Bit mask of CH17 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH17_Min (0x0UL) /*!< Min enumerator value of CH17 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH17_Max (0x1UL) /*!< Max enumerator value of CH17 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH17_Source (0x1UL) /*!< The channel 17 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH17_Sink (0x0UL) /*!< The channel 17 is linked as sink                                 */

/* CH18 @Bit 18 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH18_Pos (18UL) /*!< Position of CH18 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH18_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH18_Pos) /*!< Bit mask of CH18 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH18_Min (0x0UL) /*!< Min enumerator value of CH18 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH18_Max (0x1UL) /*!< Max enumerator value of CH18 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH18_Source (0x1UL) /*!< The channel 18 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH18_Sink (0x0UL) /*!< The channel 18 is linked as sink                                 */

/* CH19 @Bit 19 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH19_Pos (19UL) /*!< Position of CH19 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH19_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH19_Pos) /*!< Bit mask of CH19 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH19_Min (0x0UL) /*!< Min enumerator value of CH19 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH19_Max (0x1UL) /*!< Max enumerator value of CH19 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH19_Source (0x1UL) /*!< The channel 19 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH19_Sink (0x0UL) /*!< The channel 19 is linked as sink                                 */

/* CH20 @Bit 20 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH20_Pos (20UL) /*!< Position of CH20 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH20_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH20_Pos) /*!< Bit mask of CH20 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH20_Min (0x0UL) /*!< Min enumerator value of CH20 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH20_Max (0x1UL) /*!< Max enumerator value of CH20 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH20_Source (0x1UL) /*!< The channel 20 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH20_Sink (0x0UL) /*!< The channel 20 is linked as sink                                 */

/* CH21 @Bit 21 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH21_Pos (21UL) /*!< Position of CH21 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH21_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH21_Pos) /*!< Bit mask of CH21 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH21_Min (0x0UL) /*!< Min enumerator value of CH21 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH21_Max (0x1UL) /*!< Max enumerator value of CH21 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH21_Source (0x1UL) /*!< The channel 21 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH21_Sink (0x0UL) /*!< The channel 21 is linked as sink                                 */

/* CH22 @Bit 22 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH22_Pos (22UL) /*!< Position of CH22 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH22_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH22_Pos) /*!< Bit mask of CH22 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH22_Min (0x0UL) /*!< Min enumerator value of CH22 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH22_Max (0x1UL) /*!< Max enumerator value of CH22 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH22_Source (0x1UL) /*!< The channel 22 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH22_Sink (0x0UL) /*!< The channel 22 is linked as sink                                 */

