adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH2 @Bit 2 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH2_Pos (2UL)  /*!< Position of CH2 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH2_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH2_Pos) /*!< Bit mask of CH2 field.       */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH2_Min (0x0UL) /*!< Min enumerator value of CH2 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH2_Max (0x1UL) /*!< Max enumerator value of CH2 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH2_Disabled (0x1UL) /*!< The channel 2 is disabled                                      */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH2_Enabled (0x0UL) /*!< The channel 2 is enabled                                        */

/* CH3 @Bit 3 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH3_Pos (3UL)  /*!< Position of CH3 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH3_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH3_Pos) /*!< Bit mask of CH3 field.       */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH3_Min (0x0UL) /*!< Min enumerator value of CH3 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH3_Max (0x1UL) /*!< Max enumerator value of CH3 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH3_Disabled (0x1UL) /*!< The channel 3 is disabled                                      */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH3_Enabled (0x0UL) /*!< The channel 3 is enabled                                        */

/* CH4 @Bit 4 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH4_Pos (4UL)  /*!< Position of CH4 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH4_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH4_Pos) /*!< Bit mask of CH4 field.       */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH4_Min (0x0UL) /*!< Min enumerator value of CH4 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH4_Max (0x1UL) /*!< Max enumerator value of CH4 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH4_Disabled (0x1UL) /*!< The channel 4 is disabled                                      */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH4_Enabled (0x0UL) /*!< The channel 4 is enabled                                        */

/* CH5 @Bit 5 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH5_Pos (5UL)  /*!< Position of CH5 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH5_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH5_Pos) /*!< Bit mask of CH5 field.       */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH5_Min (0x0UL) /*!< Min enumerator value of CH5 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH5_Max (0x1UL) /*!< Max enumerator value of CH5 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH5_Disabled (0x1UL) /*!< The channel 5 is disabled                                      */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH5_Enabled (0x0UL) /*!< The channel 5 is enabled                                        */

/* CH6 @Bit 6 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH6_Pos (6UL)  /*!< Position of CH6 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH6_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH6_Pos) /*!< Bit mask of CH6 field.       */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH6_Min (0x0UL) /*!< Min enumerator value of CH6 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH6_Max (0x1UL) /*!< Max enumerator value of CH6 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH6_Disabled (0x1UL) /*!< The channel 6 is disabled                                      */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH6_Enabled (0x0UL) /*!< The channel 6 is enabled                                        */

/* CH7 @Bit 7 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH7_Pos (7UL)  /*!< Position of CH7 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH7_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH7_Pos) /*!< Bit mask of CH7 field.       */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH7_Min (0x0UL) /*!< Min enumerator value of CH7 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH7_Max (0x1UL) /*!< Max enumerator value of CH7 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH7_Disabled (0x1UL) /*!< The channel 7 is disabled                                      */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH7_Enabled (0x0UL) /*!< The channel 7 is enabled                                        */

/* CH8 @Bit 8 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH8_Pos (8UL)  /*!< Position of CH8 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH8_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH8_Pos) /*!< Bit mask of CH8 field.       */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH8_Min (0x0UL) /*!< Min enumerator value of CH8 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH8_Max (0x1UL) /*!< Max enumerator value of CH8 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH8_Disabled (0x1UL) /*!< The channel 8 is disabled                                      */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH8_Enabled (0x0UL) /*!< The channel 8 is enabled                                        */

/* CH9 @Bit 9 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH9_Pos (9UL)  /*!< Position of CH9 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH9_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH9_Pos) /*!< Bit mask of CH9 field.       */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH9_Min (0x0UL) /*!< Min enumerator value of CH9 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH9_Max (0x1UL) /*!< Max enumerator value of CH9 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH9_Disabled (0x1UL) /*!< The channel 9 is disabled                                      */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH9_Enabled (0x0UL) /*!< The channel 9 is enabled                                        */

/* CH10 @Bit 10 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH10_Pos (10UL) /*!< Position of CH10 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH10_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH10_Pos) /*!< Bit mask of CH10 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH10_Min (0x0UL) /*!< Min enumerator value of CH10 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH10_Max (0x1UL) /*!< Max enumerator value of CH10 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH10_Disabled (0x1UL) /*!< The channel 10 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH10_Enabled (0x0UL) /*!< The channel 10 is enabled                                      */

/* CH11 @Bit 11 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH11_Pos (11UL) /*!< Position of CH11 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH11_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH11_Pos) /*!< Bit mask of CH11 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH11_Min (0x0UL) /*!< Min enumerator value of CH11 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH11_Max (0x1UL) /*!< Max enumerator value of CH11 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH11_Disabled (0x1UL) /*!< The channel 11 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH11_Enabled (0x0UL) /*!< The channel 11 is enabled                                      */

/* CH12 @Bit 12 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH12_Pos (12UL) /*!< Position of CH12 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH12_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH12_Pos) /*!< Bit mask of CH12 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH12_Min (0x0UL) /*!< Min enumerator value of CH12 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH12_Max (0x1UL) /*!< Max enumerator value of CH12 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH12_Disabled (0x1UL) /*!< The channel 12 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH12_Enabled (0x0UL) /*!< The channel 12 is enabled                                      */

/* CH13 @Bit 13 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH13_Pos (13UL) /*!< Position of CH13 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH13_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH13_Pos) /*!< Bit mask of CH13 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH13_Min (0x0UL) /*!< Min enumerator value of CH13 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH13_Max (0x1UL) /*!< Max enumerator value of CH13 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH13_Disabled (0x1UL) /*!< The channel 13 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH13_Enabled (0x0UL) /*!< The channel 13 is enabled                                      */

/* CH14 @Bit 14 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH14_Pos (14UL) /*!< Position of CH14 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH14_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH14_Pos) /*!< Bit mask of CH14 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH14_Min (0x0UL) /*!< Min enumerator value of CH14 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH14_Max (0x1UL) /*!< Max enumerator value of CH14 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH14_Disabled (0x1UL) /*!< The channel 14 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH14_Enabled (0x0UL) /*!< The channel 14 is enabled                                      */

/* CH15 @Bit 15 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH15_Pos (15UL) /*!< Position of CH15 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH15_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH15_Pos) /*!< Bit mask of CH15 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH15_Min (0x0UL) /*!< Min enumerator value of CH15 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH15_Max (0x1UL) /*!< Max enumerator value of CH15 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH15_Disabled (0x1UL) /*!< The channel 15 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH15_Enabled (0x0UL) /*!< The channel 15 is enabled                                      */

/* CH16 @Bit 16 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH16_Pos (16UL) /*!< Position of CH16 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH16_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH16_Pos) /*!< Bit mask of CH16 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH16_Min (0x0UL) /*!< Min enumerator value of CH16 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH16_Max (0x1UL) /*!< Max enumerator value of CH16 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH16_Disabled (0x1UL) /*!< The channel 16 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH16_Enabled (0x0UL) /*!< The channel 16 is enabled                                      */

/* CH17 @Bit 17 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH17_Pos (17UL) /*!< Position of CH17 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH17_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH17_Pos) /*!< Bit mask of CH17 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH17_Min (0x0UL) /*!< Min enumerator value of CH17 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH17_Max (0x1UL) /*!< Max enumerator value of CH17 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH17_Disabled (0x1UL) /*!< The channel 17 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH17_Enabled (0x0UL) /*!< The channel 17 is enabled                                      */

/* CH18 @Bit 18 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH18_Pos (18UL) /*!< Position of CH18 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH18_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH18_Pos) /*!< Bit mask of CH18 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH18_Min (0x0UL) /*!< Min enumerator value of CH18 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH18_Max (0x1UL) /*!< Max enumerator value of CH18 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH18_Disabled (0x1UL) /*!< The channel 18 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH18_Enabled (0x0UL) /*!< The channel 18 is enabled                                      */

/* CH19 @Bit 19 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH19_Pos (19UL) /*!< Position of CH19 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH19_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH19_Pos) /*!< Bit mask of CH19 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH19_Min (0x0UL) /*!< Min enumerator value of CH19 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH19_Max (0x1UL) /*!< Max enumerator value of CH19 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH19_Disabled (0x1UL) /*!< The channel 19 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH19_Enabled (0x0UL) /*!< The channel 19 is enabled                                      */

/* CH20 @Bit 20 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH20_Pos (20UL) /*!< Position of CH20 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH20_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH20_Pos) /*!< Bit mask of CH20 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH20_Min (0x0UL) /*!< Min enumerator value of CH20 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH20_Max (0x1UL) /*!< Max enumerator value of CH20 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH20_Disabled (0x1UL) /*!< The channel 20 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH20_Enabled (0x0UL) /*!< The channel 20 is enabled                                      */

/* CH21 @Bit 21 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH21_Pos (21UL) /*!< Position of CH21 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH21_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH21_Pos) /*!< Bit mask of CH21 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH21_Min (0x0UL) /*!< Min enumerator value of CH21 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH21_Max (0x1UL) /*!< Max enumerator value of CH21 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH21_Disabled (0x1UL) /*!< The channel 21 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH21_Enabled (0x0UL) /*!< The channel 21 is enabled                                      */

/* CH22 @Bit 22 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH22_Pos (22UL) /*!< Position of CH22 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH22_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH22_Pos) /*!< Bit mask of CH22 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH22_Min (0x0UL) /*!< Min enumerator value of CH22 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH22_Max (0x1UL) /*!< Max enumerator value of CH22 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH22_Disabled (0x1UL) /*!< The channel 22 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH22_Enabled (0x0UL) /*!< The channel 22 is enabled                                      */

/* CH23 @Bit 23 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH23_Pos (23UL) /*!< Position of CH23 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH23_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH23_Pos) /*!< Bit mask of CH23 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH23_Min (0x0UL) /*!< Min enumerator value of CH23 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH23_Max (0x1UL) /*!< Max enumerator value of CH23 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH23_Disabled (0x1UL) /*!< The channel 23 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH23_Enabled (0x0UL) /*!< The channel 23 is enabled                                      */

/* CH24 @Bit 24 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH24_Pos (24UL) /*!< Position of CH24 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH24_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH24_Pos) /*!< Bit mask of CH24 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH24_Min (0x0UL) /*!< Min enumerator value of CH24 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH24_Max (0x1UL) /*!< Max enumerator value of CH24 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH24_Disabled (0x1UL) /*!< The channel 24 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH24_Enabled (0x0UL) /*!< The channel 24 is enabled                                      */

/* CH25 @Bit 25 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH25_Pos (25UL) /*!< Position of CH25 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH25_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH25_Pos) /*!< Bit mask of CH25 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH25_Min (0x0UL) /*!< Min enumerator value of CH25 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH25_Max (0x1UL) /*!< Max enumerator value of CH25 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH25_Disabled (0x1UL) /*!< The channel 25 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH25_Enabled (0x0UL) /*!< The channel 25 is enabled                                      */

/* CH26 @Bit 26 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH26_Pos (26UL) /*!< Position of CH26 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH26_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH26_Pos) /*!< Bit mask of CH26 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH26_Min (0x0UL) /*!< Min enumerator value of CH26 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH26_Max (0x1UL) /*!< Max enumerator value of CH26 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH26_Disabled (0x1UL) /*!< The channel 26 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH26_Enabled (0x0UL) /*!< The channel 26 is enabled                                      */

/* CH27 @Bit 27 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH27_Pos (27UL) /*!< Position of CH27 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH27_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH27_Pos) /*!< Bit mask of CH27 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH27_Min (0x0UL) /*!< Min enumerator value of CH27 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH27_Max (0x1UL) /*!< Max enumerator value of CH27 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH27_Disabled (0x1UL) /*!< The channel 27 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH27_Enabled (0x0UL) /*!< The channel 27 is enabled                                      */

/* CH28 @Bit 28 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH28_Pos (28UL) /*!< Position of CH28 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH28_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH28_Pos) /*!< Bit mask of CH28 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH28_Min (0x0UL) /*!< Min enumerator value of CH28 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH28_Max (0x1UL) /*!< Max enumerator value of CH28 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH28_Disabled (0x1UL) /*!< The channel 28 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH28_Enabled (0x0UL) /*!< The channel 28 is enabled                                      */

/* CH29 @Bit 29 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH29_Pos (29UL) /*!< Position of CH29 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH29_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH29_Pos) /*!< Bit mask of CH29 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH29_Min (0x0UL) /*!< Min enumerator value of CH29 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH29_Max (0x1UL) /*!< Max enumerator value of CH29 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH29_Disabled (0x1UL) /*!< The channel 29 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH29_Enabled (0x0UL) /*!< The channel 29 is enabled                                      */

