adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CH27 @Bit 27 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH27_Pos (27UL) /*!< Position of CH27 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH27_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH27_Pos) /*!< Bit mask of CH27 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH27_Min (0x0UL) /*!< Min enumerator value of CH27 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH27_Max (0x1UL) /*!< Max enumerator value of CH27 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH27_Secure (0x1UL) /*!< The channel 27 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH27_NonSecure (0x0UL) /*!< The channel 27 is non-secure                                  */

/* CH28 @Bit 28 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH28_Pos (28UL) /*!< Position of CH28 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH28_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH28_Pos) /*!< Bit mask of CH28 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH28_Min (0x0UL) /*!< Min enumerator value of CH28 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH28_Max (0x1UL) /*!< Max enumerator value of CH28 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH28_Secure (0x1UL) /*!< The channel 28 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH28_NonSecure (0x0UL) /*!< The channel 28 is non-secure                                  */

/* CH29 @Bit 29 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH29_Pos (29UL) /*!< Position of CH29 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH29_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH29_Pos) /*!< Bit mask of CH29 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH29_Min (0x0UL) /*!< Min enumerator value of CH29 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH29_Max (0x1UL) /*!< Max enumerator value of CH29 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH29_Secure (0x1UL) /*!< The channel 29 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH29_NonSecure (0x0UL) /*!< The channel 29 is non-secure                                  */

/* CH30 @Bit 30 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH30_Pos (30UL) /*!< Position of CH30 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH30_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH30_Pos) /*!< Bit mask of CH30 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH30_Min (0x0UL) /*!< Min enumerator value of CH30 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH30_Max (0x1UL) /*!< Max enumerator value of CH30 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH30_Secure (0x1UL) /*!< The channel 30 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH30_NonSecure (0x0UL) /*!< The channel 30 is non-secure                                  */

/* CH31 @Bit 31 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH31_Pos (31UL) /*!< Position of CH31 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH31_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH31_Pos) /*!< Bit mask of CH31 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH31_Min (0x0UL) /*!< Min enumerator value of CH31 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH31_Max (0x1UL) /*!< Max enumerator value of CH31 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH31_Secure (0x1UL) /*!< The channel 31 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH31_NonSecure (0x0UL) /*!< The channel 31 is non-secure                                  */



/* =============================================== Struct UICR_DPPI_GLOBAL_CHG =============================================== */
/**
  * @brief CHG [UICR_DPPI_GLOBAL_CHG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;                               /*!< (@ 0x00000000) Request ownership of the channel groups of DPPI[n] in
                                                                         Global domain*/
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Request permission for the channel groups of DPPI[n] in
                                                                         Global domain*/
} NRF_UICR_DPPI_GLOBAL_CHG_Type;                     /*!< Size = 8 (0x008)                                                     */

/* UICR_DPPI_GLOBAL_CHG_OWN: Request ownership of the channel groups of DPPI[n] in Global domain */
  #define UICR_DPPI_GLOBAL_CHG_OWN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OWN register.                                 */

/* CHG0 @Bit 0 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG0_Pos (0UL)    /*!< Position of CHG0 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG0_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG0_Pos) /*!< Bit mask of CHG0 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG0_Min (0x0UL)  /*!< Min enumerator value of CHG0 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG0_Max (0x1UL)  /*!< Max enumerator value of CHG0 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG0_NotOwn (0x1UL) /*!< Do not own the channel group 0                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG0_Own (0x0UL)  /*!< Own the channel group 0                                              */

/* CHG1 @Bit 1 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG1_Pos (1UL)    /*!< Position of CHG1 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG1_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG1_Pos) /*!< Bit mask of CHG1 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG1_Min (0x0UL)  /*!< Min enumerator value of CHG1 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG1_Max (0x1UL)  /*!< Max enumerator value of CHG1 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG1_NotOwn (0x1UL) /*!< Do not own the channel group 1                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG1_Own (0x0UL)  /*!< Own the channel group 1                                              */

