adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHG2 @Bit 2 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG2_Pos (2UL)    /*!< Position of CHG2 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG2_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG2_Pos) /*!< Bit mask of CHG2 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG2_Min (0x0UL)  /*!< Min enumerator value of CHG2 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG2_Max (0x1UL)  /*!< Max enumerator value of CHG2 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG2_NotOwn (0x1UL) /*!< Do not own the channel group 2                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG2_Own (0x0UL)  /*!< Own the channel group 2                                              */

/* CHG3 @Bit 3 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG3_Pos (3UL)    /*!< Position of CHG3 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG3_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG3_Pos) /*!< Bit mask of CHG3 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG3_Min (0x0UL)  /*!< Min enumerator value of CHG3 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG3_Max (0x1UL)  /*!< Max enumerator value of CHG3 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG3_NotOwn (0x1UL) /*!< Do not own the channel group 3                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG3_Own (0x0UL)  /*!< Own the channel group 3                                              */

/* CHG4 @Bit 4 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG4_Pos (4UL)    /*!< Position of CHG4 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG4_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG4_Pos) /*!< Bit mask of CHG4 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG4_Min (0x0UL)  /*!< Min enumerator value of CHG4 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG4_Max (0x1UL)  /*!< Max enumerator value of CHG4 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG4_NotOwn (0x1UL) /*!< Do not own the channel group 4                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG4_Own (0x0UL)  /*!< Own the channel group 4                                              */

/* CHG5 @Bit 5 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG5_Pos (5UL)    /*!< Position of CHG5 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG5_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG5_Pos) /*!< Bit mask of CHG5 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG5_Min (0x0UL)  /*!< Min enumerator value of CHG5 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG5_Max (0x1UL)  /*!< Max enumerator value of CHG5 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG5_NotOwn (0x1UL) /*!< Do not own the channel group 5                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG5_Own (0x0UL)  /*!< Own the channel group 5                                              */

/* CHG6 @Bit 6 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG6_Pos (6UL)    /*!< Position of CHG6 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG6_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG6_Pos) /*!< Bit mask of CHG6 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG6_Min (0x0UL)  /*!< Min enumerator value of CHG6 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG6_Max (0x1UL)  /*!< Max enumerator value of CHG6 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG6_NotOwn (0x1UL) /*!< Do not own the channel group 6                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG6_Own (0x0UL)  /*!< Own the channel group 6                                              */

/* CHG7 @Bit 7 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG7_Pos (7UL)    /*!< Position of CHG7 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG7_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG7_Pos) /*!< Bit mask of CHG7 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG7_Min (0x0UL)  /*!< Min enumerator value of CHG7 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG7_Max (0x1UL)  /*!< Max enumerator value of CHG7 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG7_NotOwn (0x1UL) /*!< Do not own the channel group 7                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG7_Own (0x0UL)  /*!< Own the channel group 7                                              */

/* CHG8 @Bit 8 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG8_Pos (8UL)    /*!< Position of CHG8 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG8_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG8_Pos) /*!< Bit mask of CHG8 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG8_Min (0x0UL)  /*!< Min enumerator value of CHG8 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG8_Max (0x1UL)  /*!< Max enumerator value of CHG8 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG8_NotOwn (0x1UL) /*!< Do not own the channel group 8                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG8_Own (0x0UL)  /*!< Own the channel group 8                                              */

/* CHG9 @Bit 9 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG9_Pos (9UL)    /*!< Position of CHG9 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG9_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG9_Pos) /*!< Bit mask of CHG9 field.          */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG9_Min (0x0UL)  /*!< Min enumerator value of CHG9 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG9_Max (0x1UL)  /*!< Max enumerator value of CHG9 field.                                  */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG9_NotOwn (0x1UL) /*!< Do not own the channel group 9                                     */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG9_Own (0x0UL)  /*!< Own the channel group 9                                              */

/* CHG10 @Bit 10 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG10_Pos (10UL)  /*!< Position of CHG10 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG10_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG10_Pos) /*!< Bit mask of CHG10 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG10_Min (0x0UL) /*!< Min enumerator value of CHG10 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG10_Max (0x1UL) /*!< Max enumerator value of CHG10 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG10_NotOwn (0x1UL) /*!< Do not own the channel group 10                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG10_Own (0x0UL) /*!< Own the channel group 10                                             */

/* CHG11 @Bit 11 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG11_Pos (11UL)  /*!< Position of CHG11 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG11_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG11_Pos) /*!< Bit mask of CHG11 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG11_Min (0x0UL) /*!< Min enumerator value of CHG11 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG11_Max (0x1UL) /*!< Max enumerator value of CHG11 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG11_NotOwn (0x1UL) /*!< Do not own the channel group 11                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG11_Own (0x0UL) /*!< Own the channel group 11                                             */

/* CHG12 @Bit 12 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG12_Pos (12UL)  /*!< Position of CHG12 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG12_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG12_Pos) /*!< Bit mask of CHG12 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG12_Min (0x0UL) /*!< Min enumerator value of CHG12 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG12_Max (0x1UL) /*!< Max enumerator value of CHG12 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG12_NotOwn (0x1UL) /*!< Do not own the channel group 12                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG12_Own (0x0UL) /*!< Own the channel group 12                                             */

