adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHG22 @Bit 22 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Pos (22UL)  /*!< Position of CHG22 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Pos) /*!< Bit mask of CHG22 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Min (0x0UL) /*!< Min enumerator value of CHG22 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Max (0x1UL) /*!< Max enumerator value of CHG22 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_NotOwn (0x1UL) /*!< Do not own the channel group 22                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Own (0x0UL) /*!< Own the channel group 22                                             */

/* CHG23 @Bit 23 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Pos (23UL)  /*!< Position of CHG23 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Pos) /*!< Bit mask of CHG23 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Min (0x0UL) /*!< Min enumerator value of CHG23 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Max (0x1UL) /*!< Max enumerator value of CHG23 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_NotOwn (0x1UL) /*!< Do not own the channel group 23                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Own (0x0UL) /*!< Own the channel group 23                                             */

/* CHG24 @Bit 24 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Pos (24UL)  /*!< Position of CHG24 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Pos) /*!< Bit mask of CHG24 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Min (0x0UL) /*!< Min enumerator value of CHG24 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Max (0x1UL) /*!< Max enumerator value of CHG24 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_NotOwn (0x1UL) /*!< Do not own the channel group 24                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Own (0x0UL) /*!< Own the channel group 24                                             */

/* CHG25 @Bit 25 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Pos (25UL)  /*!< Position of CHG25 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Pos) /*!< Bit mask of CHG25 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Min (0x0UL) /*!< Min enumerator value of CHG25 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Max (0x1UL) /*!< Max enumerator value of CHG25 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_NotOwn (0x1UL) /*!< Do not own the channel group 25                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Own (0x0UL) /*!< Own the channel group 25                                             */

/* CHG26 @Bit 26 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Pos (26UL)  /*!< Position of CHG26 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Pos) /*!< Bit mask of CHG26 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Min (0x0UL) /*!< Min enumerator value of CHG26 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Max (0x1UL) /*!< Max enumerator value of CHG26 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_NotOwn (0x1UL) /*!< Do not own the channel group 26                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Own (0x0UL) /*!< Own the channel group 26                                             */

/* CHG27 @Bit 27 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Pos (27UL)  /*!< Position of CHG27 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Pos) /*!< Bit mask of CHG27 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Min (0x0UL) /*!< Min enumerator value of CHG27 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Max (0x1UL) /*!< Max enumerator value of CHG27 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_NotOwn (0x1UL) /*!< Do not own the channel group 27                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Own (0x0UL) /*!< Own the channel group 27                                             */

/* CHG28 @Bit 28 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG28_Pos (28UL)  /*!< Position of CHG28 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG28_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG28_Pos) /*!< Bit mask of CHG28 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG28_Min (0x0UL) /*!< Min enumerator value of CHG28 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG28_Max (0x1UL) /*!< Max enumerator value of CHG28 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG28_NotOwn (0x1UL) /*!< Do not own the channel group 28                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG28_Own (0x0UL) /*!< Own the channel group 28                                             */

/* CHG29 @Bit 29 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG29_Pos (29UL)  /*!< Position of CHG29 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG29_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG29_Pos) /*!< Bit mask of CHG29 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG29_Min (0x0UL) /*!< Min enumerator value of CHG29 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG29_Max (0x1UL) /*!< Max enumerator value of CHG29 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG29_NotOwn (0x1UL) /*!< Do not own the channel group 29                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG29_Own (0x0UL) /*!< Own the channel group 29                                             */

/* CHG30 @Bit 30 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG30_Pos (30UL)  /*!< Position of CHG30 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG30_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG30_Pos) /*!< Bit mask of CHG30 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG30_Min (0x0UL) /*!< Min enumerator value of CHG30 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG30_Max (0x1UL) /*!< Max enumerator value of CHG30 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG30_NotOwn (0x1UL) /*!< Do not own the channel group 30                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG30_Own (0x0UL) /*!< Own the channel group 30                                             */

/* CHG31 @Bit 31 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG31_Pos (31UL)  /*!< Position of CHG31 field.                                             */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG31_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG31_Pos) /*!< Bit mask of CHG31 field.       */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG31_Min (0x0UL) /*!< Min enumerator value of CHG31 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG31_Max (0x1UL) /*!< Max enumerator value of CHG31 field.                                 */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG31_NotOwn (0x1UL) /*!< Do not own the channel group 31                                   */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG31_Own (0x0UL) /*!< Own the channel group 31                                             */


/* UICR_DPPI_GLOBAL_CHG_SECURE: Request permission for the channel groups of DPPI[n] in Global domain */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SECURE register.                           */

/* CHG0 @Bit 0 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG0_Pos (0UL) /*!< Position of CHG0 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG0_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG0_Pos) /*!< Bit mask of CHG0 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG0_Min (0x0UL) /*!< Min enumerator value of CHG0 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG0_Max (0x1UL) /*!< Max enumerator value of CHG0 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG0_Secure (0x1UL) /*!< The channel group 0 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG0_NonSecure (0x0UL) /*!< The channel group 0 is non-secure                            */

/* CHG1 @Bit 1 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG1_Pos (1UL) /*!< Position of CHG1 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG1_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG1_Pos) /*!< Bit mask of CHG1 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG1_Min (0x0UL) /*!< Min enumerator value of CHG1 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG1_Max (0x1UL) /*!< Max enumerator value of CHG1 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG1_Secure (0x1UL) /*!< The channel group 1 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG1_NonSecure (0x0UL) /*!< The channel group 1 is non-secure                            */

