adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHG2 @Bit 2 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG2_Pos (2UL) /*!< Position of CHG2 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG2_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG2_Pos) /*!< Bit mask of CHG2 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG2_Min (0x0UL) /*!< Min enumerator value of CHG2 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG2_Max (0x1UL) /*!< Max enumerator value of CHG2 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG2_Secure (0x1UL) /*!< The channel group 2 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG2_NonSecure (0x0UL) /*!< The channel group 2 is non-secure                            */

/* CHG3 @Bit 3 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG3_Pos (3UL) /*!< Position of CHG3 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG3_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG3_Pos) /*!< Bit mask of CHG3 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG3_Min (0x0UL) /*!< Min enumerator value of CHG3 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG3_Max (0x1UL) /*!< Max enumerator value of CHG3 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG3_Secure (0x1UL) /*!< The channel group 3 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG3_NonSecure (0x0UL) /*!< The channel group 3 is non-secure                            */

/* CHG4 @Bit 4 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG4_Pos (4UL) /*!< Position of CHG4 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG4_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG4_Pos) /*!< Bit mask of CHG4 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG4_Min (0x0UL) /*!< Min enumerator value of CHG4 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG4_Max (0x1UL) /*!< Max enumerator value of CHG4 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG4_Secure (0x1UL) /*!< The channel group 4 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG4_NonSecure (0x0UL) /*!< The channel group 4 is non-secure                            */

/* CHG5 @Bit 5 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG5_Pos (5UL) /*!< Position of CHG5 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG5_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG5_Pos) /*!< Bit mask of CHG5 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG5_Min (0x0UL) /*!< Min enumerator value of CHG5 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG5_Max (0x1UL) /*!< Max enumerator value of CHG5 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG5_Secure (0x1UL) /*!< The channel group 5 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG5_NonSecure (0x0UL) /*!< The channel group 5 is non-secure                            */

/* CHG6 @Bit 6 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG6_Pos (6UL) /*!< Position of CHG6 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG6_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG6_Pos) /*!< Bit mask of CHG6 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG6_Min (0x0UL) /*!< Min enumerator value of CHG6 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG6_Max (0x1UL) /*!< Max enumerator value of CHG6 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG6_Secure (0x1UL) /*!< The channel group 6 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG6_NonSecure (0x0UL) /*!< The channel group 6 is non-secure                            */

/* CHG7 @Bit 7 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG7_Pos (7UL) /*!< Position of CHG7 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG7_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG7_Pos) /*!< Bit mask of CHG7 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG7_Min (0x0UL) /*!< Min enumerator value of CHG7 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG7_Max (0x1UL) /*!< Max enumerator value of CHG7 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG7_Secure (0x1UL) /*!< The channel group 7 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG7_NonSecure (0x0UL) /*!< The channel group 7 is non-secure                            */

/* CHG8 @Bit 8 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG8_Pos (8UL) /*!< Position of CHG8 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG8_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG8_Pos) /*!< Bit mask of CHG8 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG8_Min (0x0UL) /*!< Min enumerator value of CHG8 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG8_Max (0x1UL) /*!< Max enumerator value of CHG8 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG8_Secure (0x1UL) /*!< The channel group 8 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG8_NonSecure (0x0UL) /*!< The channel group 8 is non-secure                            */

/* CHG9 @Bit 9 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG9_Pos (9UL) /*!< Position of CHG9 field.                                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG9_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG9_Pos) /*!< Bit mask of CHG9 field.    */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG9_Min (0x0UL) /*!< Min enumerator value of CHG9 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG9_Max (0x1UL) /*!< Max enumerator value of CHG9 field.                                */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG9_Secure (0x1UL) /*!< The channel group 9 is secure                                   */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG9_NonSecure (0x0UL) /*!< The channel group 9 is non-secure                            */

/* CHG10 @Bit 10 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG10_Pos (10UL) /*!< Position of CHG10 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG10_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG10_Pos) /*!< Bit mask of CHG10 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG10_Min (0x0UL) /*!< Min enumerator value of CHG10 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG10_Max (0x1UL) /*!< Max enumerator value of CHG10 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG10_Secure (0x1UL) /*!< The channel group 10 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG10_NonSecure (0x0UL) /*!< The channel group 10 is non-secure                          */

/* CHG11 @Bit 11 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG11_Pos (11UL) /*!< Position of CHG11 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG11_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG11_Pos) /*!< Bit mask of CHG11 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG11_Min (0x0UL) /*!< Min enumerator value of CHG11 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG11_Max (0x1UL) /*!< Max enumerator value of CHG11 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG11_Secure (0x1UL) /*!< The channel group 11 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG11_NonSecure (0x0UL) /*!< The channel group 11 is non-secure                          */

/* CHG12 @Bit 12 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG12_Pos (12UL) /*!< Position of CHG12 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG12_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG12_Pos) /*!< Bit mask of CHG12 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG12_Min (0x0UL) /*!< Min enumerator value of CHG12 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG12_Max (0x1UL) /*!< Max enumerator value of CHG12 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG12_Secure (0x1UL) /*!< The channel group 12 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG12_NonSecure (0x0UL) /*!< The channel group 12 is non-secure                          */

