adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CC9 @Bit 9 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC9_Pos (9UL)             /*!< Position of CC9 field.                                               */
  #define UICR_GRTC_CC_OWN_CC9_Msk (0x1UL << UICR_GRTC_CC_OWN_CC9_Pos) /*!< Bit mask of CC9 field.                             */
  #define UICR_GRTC_CC_OWN_CC9_Min (0x0UL)           /*!< Min enumerator value of CC9 field.                                   */
  #define UICR_GRTC_CC_OWN_CC9_Max (0x1UL)           /*!< Max enumerator value of CC9 field.                                   */
  #define UICR_GRTC_CC_OWN_CC9_NotOwn (0x1UL)        /*!< Do not own the CC register 9                                         */
  #define UICR_GRTC_CC_OWN_CC9_Own (0x0UL)           /*!< Own the CC register 9                                                */

/* CC10 @Bit 10 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC10_Pos (10UL)           /*!< Position of CC10 field.                                              */
  #define UICR_GRTC_CC_OWN_CC10_Msk (0x1UL << UICR_GRTC_CC_OWN_CC10_Pos) /*!< Bit mask of CC10 field.                          */
  #define UICR_GRTC_CC_OWN_CC10_Min (0x0UL)          /*!< Min enumerator value of CC10 field.                                  */
  #define UICR_GRTC_CC_OWN_CC10_Max (0x1UL)          /*!< Max enumerator value of CC10 field.                                  */
  #define UICR_GRTC_CC_OWN_CC10_NotOwn (0x1UL)       /*!< Do not own the CC register 10                                        */
  #define UICR_GRTC_CC_OWN_CC10_Own (0x0UL)          /*!< Own the CC register 10                                               */

/* CC11 @Bit 11 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC11_Pos (11UL)           /*!< Position of CC11 field.                                              */
  #define UICR_GRTC_CC_OWN_CC11_Msk (0x1UL << UICR_GRTC_CC_OWN_CC11_Pos) /*!< Bit mask of CC11 field.                          */
  #define UICR_GRTC_CC_OWN_CC11_Min (0x0UL)          /*!< Min enumerator value of CC11 field.                                  */
  #define UICR_GRTC_CC_OWN_CC11_Max (0x1UL)          /*!< Max enumerator value of CC11 field.                                  */
  #define UICR_GRTC_CC_OWN_CC11_NotOwn (0x1UL)       /*!< Do not own the CC register 11                                        */
  #define UICR_GRTC_CC_OWN_CC11_Own (0x0UL)          /*!< Own the CC register 11                                               */

/* CC12 @Bit 12 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC12_Pos (12UL)           /*!< Position of CC12 field.                                              */
  #define UICR_GRTC_CC_OWN_CC12_Msk (0x1UL << UICR_GRTC_CC_OWN_CC12_Pos) /*!< Bit mask of CC12 field.                          */
  #define UICR_GRTC_CC_OWN_CC12_Min (0x0UL)          /*!< Min enumerator value of CC12 field.                                  */
  #define UICR_GRTC_CC_OWN_CC12_Max (0x1UL)          /*!< Max enumerator value of CC12 field.                                  */
  #define UICR_GRTC_CC_OWN_CC12_NotOwn (0x1UL)       /*!< Do not own the CC register 12                                        */
  #define UICR_GRTC_CC_OWN_CC12_Own (0x0UL)          /*!< Own the CC register 12                                               */

/* CC13 @Bit 13 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC13_Pos (13UL)           /*!< Position of CC13 field.                                              */
  #define UICR_GRTC_CC_OWN_CC13_Msk (0x1UL << UICR_GRTC_CC_OWN_CC13_Pos) /*!< Bit mask of CC13 field.                          */
  #define UICR_GRTC_CC_OWN_CC13_Min (0x0UL)          /*!< Min enumerator value of CC13 field.                                  */
  #define UICR_GRTC_CC_OWN_CC13_Max (0x1UL)          /*!< Max enumerator value of CC13 field.                                  */
  #define UICR_GRTC_CC_OWN_CC13_NotOwn (0x1UL)       /*!< Do not own the CC register 13                                        */
  #define UICR_GRTC_CC_OWN_CC13_Own (0x0UL)          /*!< Own the CC register 13                                               */

/* CC14 @Bit 14 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC14_Pos (14UL)           /*!< Position of CC14 field.                                              */
  #define UICR_GRTC_CC_OWN_CC14_Msk (0x1UL << UICR_GRTC_CC_OWN_CC14_Pos) /*!< Bit mask of CC14 field.                          */
  #define UICR_GRTC_CC_OWN_CC14_Min (0x0UL)          /*!< Min enumerator value of CC14 field.                                  */
  #define UICR_GRTC_CC_OWN_CC14_Max (0x1UL)          /*!< Max enumerator value of CC14 field.                                  */
  #define UICR_GRTC_CC_OWN_CC14_NotOwn (0x1UL)       /*!< Do not own the CC register 14                                        */
  #define UICR_GRTC_CC_OWN_CC14_Own (0x0UL)          /*!< Own the CC register 14                                               */

/* CC15 @Bit 15 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC15_Pos (15UL)           /*!< Position of CC15 field.                                              */
  #define UICR_GRTC_CC_OWN_CC15_Msk (0x1UL << UICR_GRTC_CC_OWN_CC15_Pos) /*!< Bit mask of CC15 field.                          */
  #define UICR_GRTC_CC_OWN_CC15_Min (0x0UL)          /*!< Min enumerator value of CC15 field.                                  */
  #define UICR_GRTC_CC_OWN_CC15_Max (0x1UL)          /*!< Max enumerator value of CC15 field.                                  */
  #define UICR_GRTC_CC_OWN_CC15_NotOwn (0x1UL)       /*!< Do not own the CC register 15                                        */
  #define UICR_GRTC_CC_OWN_CC15_Own (0x0UL)          /*!< Own the CC register 15                                               */


/* UICR_GRTC_CC_SECURE: Request permission for the CCs of GRTC */
  #define UICR_GRTC_CC_SECURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SECURE register.                                   */

/* CC0 @Bit 0 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC0_Pos (0UL)          /*!< Position of CC0 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC0_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC0_Pos) /*!< Bit mask of CC0 field.                       */
  #define UICR_GRTC_CC_SECURE_CC0_Min (0x0UL)        /*!< Min enumerator value of CC0 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC0_Max (0x1UL)        /*!< Max enumerator value of CC0 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC0_Secure (0x1UL)     /*!< The CC register 0 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC0_NonSecure (0x0UL)  /*!< The CC register 0 is non-secure                                      */

/* CC1 @Bit 1 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC1_Pos (1UL)          /*!< Position of CC1 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC1_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC1_Pos) /*!< Bit mask of CC1 field.                       */
  #define UICR_GRTC_CC_SECURE_CC1_Min (0x0UL)        /*!< Min enumerator value of CC1 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC1_Max (0x1UL)        /*!< Max enumerator value of CC1 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC1_Secure (0x1UL)     /*!< The CC register 1 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC1_NonSecure (0x0UL)  /*!< The CC register 1 is non-secure                                      */

/* CC2 @Bit 2 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC2_Pos (2UL)          /*!< Position of CC2 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC2_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC2_Pos) /*!< Bit mask of CC2 field.                       */
  #define UICR_GRTC_CC_SECURE_CC2_Min (0x0UL)        /*!< Min enumerator value of CC2 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC2_Max (0x1UL)        /*!< Max enumerator value of CC2 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC2_Secure (0x1UL)     /*!< The CC register 2 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC2_NonSecure (0x0UL)  /*!< The CC register 2 is non-secure                                      */

/* CC3 @Bit 3 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC3_Pos (3UL)          /*!< Position of CC3 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC3_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC3_Pos) /*!< Bit mask of CC3 field.                       */
  #define UICR_GRTC_CC_SECURE_CC3_Min (0x0UL)        /*!< Min enumerator value of CC3 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC3_Max (0x1UL)        /*!< Max enumerator value of CC3 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC3_Secure (0x1UL)     /*!< The CC register 3 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC3_NonSecure (0x0UL)  /*!< The CC register 3 is non-secure                                      */

/* CC4 @Bit 4 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC4_Pos (4UL)          /*!< Position of CC4 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC4_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC4_Pos) /*!< Bit mask of CC4 field.                       */
  #define UICR_GRTC_CC_SECURE_CC4_Min (0x0UL)        /*!< Min enumerator value of CC4 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC4_Max (0x1UL)        /*!< Max enumerator value of CC4 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC4_Secure (0x1UL)     /*!< The CC register 4 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC4_NonSecure (0x0UL)  /*!< The CC register 4 is non-secure                                      */

/* CC5 @Bit 5 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC5_Pos (5UL)          /*!< Position of CC5 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC5_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC5_Pos) /*!< Bit mask of CC5 field.                       */
  #define UICR_GRTC_CC_SECURE_CC5_Min (0x0UL)        /*!< Min enumerator value of CC5 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC5_Max (0x1UL)        /*!< Max enumerator value of CC5 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC5_Secure (0x1UL)     /*!< The CC register 5 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC5_NonSecure (0x0UL)  /*!< The CC register 5 is non-secure                                      */

/* CC6 @Bit 6 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC6_Pos (6UL)          /*!< Position of CC6 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC6_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC6_Pos) /*!< Bit mask of CC6 field.                       */
  #define UICR_GRTC_CC_SECURE_CC6_Min (0x0UL)        /*!< Min enumerator value of CC6 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC6_Max (0x1UL)        /*!< Max enumerator value of CC6 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC6_Secure (0x1UL)     /*!< The CC register 6 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC6_NonSecure (0x0UL)  /*!< The CC register 6 is non-secure                                      */

/* CC7 @Bit 7 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC7_Pos (7UL)          /*!< Position of CC7 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC7_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC7_Pos) /*!< Bit mask of CC7 field.                       */
  #define UICR_GRTC_CC_SECURE_CC7_Min (0x0UL)        /*!< Min enumerator value of CC7 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC7_Max (0x1UL)        /*!< Max enumerator value of CC7 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC7_Secure (0x1UL)     /*!< The CC register 7 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC7_NonSecure (0x0UL)  /*!< The CC register 7 is non-secure                                      */

/* CC8 @Bit 8 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC8_Pos (8UL)          /*!< Position of CC8 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC8_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC8_Pos) /*!< Bit mask of CC8 field.                       */
  #define UICR_GRTC_CC_SECURE_CC8_Min (0x0UL)        /*!< Min enumerator value of CC8 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC8_Max (0x1UL)        /*!< Max enumerator value of CC8 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC8_Secure (0x1UL)     /*!< The CC register 8 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC8_NonSecure (0x0UL)  /*!< The CC register 8 is non-secure                                      */

