adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CC9 @Bit 9 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC9_Pos (9UL)          /*!< Position of CC9 field.                                               */
  #define UICR_GRTC_CC_SECURE_CC9_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC9_Pos) /*!< Bit mask of CC9 field.                       */
  #define UICR_GRTC_CC_SECURE_CC9_Min (0x0UL)        /*!< Min enumerator value of CC9 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC9_Max (0x1UL)        /*!< Max enumerator value of CC9 field.                                   */
  #define UICR_GRTC_CC_SECURE_CC9_Secure (0x1UL)     /*!< The CC register 9 is secure                                          */
  #define UICR_GRTC_CC_SECURE_CC9_NonSecure (0x0UL)  /*!< The CC register 9 is non-secure                                      */

/* CC10 @Bit 10 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC10_Pos (10UL)        /*!< Position of CC10 field.                                              */
  #define UICR_GRTC_CC_SECURE_CC10_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC10_Pos) /*!< Bit mask of CC10 field.                    */
  #define UICR_GRTC_CC_SECURE_CC10_Min (0x0UL)       /*!< Min enumerator value of CC10 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC10_Max (0x1UL)       /*!< Max enumerator value of CC10 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC10_Secure (0x1UL)    /*!< The CC register 10 is secure                                         */
  #define UICR_GRTC_CC_SECURE_CC10_NonSecure (0x0UL) /*!< The CC register 10 is non-secure                                     */

/* CC11 @Bit 11 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC11_Pos (11UL)        /*!< Position of CC11 field.                                              */
  #define UICR_GRTC_CC_SECURE_CC11_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC11_Pos) /*!< Bit mask of CC11 field.                    */
  #define UICR_GRTC_CC_SECURE_CC11_Min (0x0UL)       /*!< Min enumerator value of CC11 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC11_Max (0x1UL)       /*!< Max enumerator value of CC11 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC11_Secure (0x1UL)    /*!< The CC register 11 is secure                                         */
  #define UICR_GRTC_CC_SECURE_CC11_NonSecure (0x0UL) /*!< The CC register 11 is non-secure                                     */

/* CC12 @Bit 12 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC12_Pos (12UL)        /*!< Position of CC12 field.                                              */
  #define UICR_GRTC_CC_SECURE_CC12_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC12_Pos) /*!< Bit mask of CC12 field.                    */
  #define UICR_GRTC_CC_SECURE_CC12_Min (0x0UL)       /*!< Min enumerator value of CC12 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC12_Max (0x1UL)       /*!< Max enumerator value of CC12 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC12_Secure (0x1UL)    /*!< The CC register 12 is secure                                         */
  #define UICR_GRTC_CC_SECURE_CC12_NonSecure (0x0UL) /*!< The CC register 12 is non-secure                                     */

/* CC13 @Bit 13 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC13_Pos (13UL)        /*!< Position of CC13 field.                                              */
  #define UICR_GRTC_CC_SECURE_CC13_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC13_Pos) /*!< Bit mask of CC13 field.                    */
  #define UICR_GRTC_CC_SECURE_CC13_Min (0x0UL)       /*!< Min enumerator value of CC13 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC13_Max (0x1UL)       /*!< Max enumerator value of CC13 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC13_Secure (0x1UL)    /*!< The CC register 13 is secure                                         */
  #define UICR_GRTC_CC_SECURE_CC13_NonSecure (0x0UL) /*!< The CC register 13 is non-secure                                     */

/* CC14 @Bit 14 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC14_Pos (14UL)        /*!< Position of CC14 field.                                              */
  #define UICR_GRTC_CC_SECURE_CC14_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC14_Pos) /*!< Bit mask of CC14 field.                    */
  #define UICR_GRTC_CC_SECURE_CC14_Min (0x0UL)       /*!< Min enumerator value of CC14 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC14_Max (0x1UL)       /*!< Max enumerator value of CC14 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC14_Secure (0x1UL)    /*!< The CC register 14 is secure                                         */
  #define UICR_GRTC_CC_SECURE_CC14_NonSecure (0x0UL) /*!< The CC register 14 is non-secure                                     */

/* CC15 @Bit 15 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC15_Pos (15UL)        /*!< Position of CC15 field.                                              */
  #define UICR_GRTC_CC_SECURE_CC15_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC15_Pos) /*!< Bit mask of CC15 field.                    */
  #define UICR_GRTC_CC_SECURE_CC15_Min (0x0UL)       /*!< Min enumerator value of CC15 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC15_Max (0x1UL)       /*!< Max enumerator value of CC15 field.                                  */
  #define UICR_GRTC_CC_SECURE_CC15_Secure (0x1UL)    /*!< The CC register 15 is secure                                         */
  #define UICR_GRTC_CC_SECURE_CC15_NonSecure (0x0UL) /*!< The CC register 15 is non-secure                                     */



/* ==================================================== Struct UICR_GRTC ===================================================== */
/**
  * @brief GRTC [UICR_GRTC] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_GRTC_CC_Type CC;                    /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_UICR_GRTC_Type;                                /*!< Size = 8 (0x008)                                                     */


/* =================================================== Struct UICR_MAILBOX =================================================== */
/**
  * @brief MAILBOX [UICR_MAILBOX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Memory start address of mailbox n                     */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Configuration of mailbox n                            */
} NRF_UICR_MAILBOX_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define UICR_MAILBOX_MaxCount (8UL)                /*!< Size of MAILBOX[8] array.                                            */
  #define UICR_MAILBOX_MaxIndex (7UL)                /*!< Max index of MAILBOX[8] array.                                       */
  #define UICR_MAILBOX_MinIndex (0UL)                /*!< Min index of MAILBOX[8] array.                                       */

/* UICR_MAILBOX_ADDRESS: Memory start address of mailbox n */
  #define UICR_MAILBOX_ADDRESS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDRESS register.                                 */

/* ADDRESS @Bits 0..31 : Memory address */
  #define UICR_MAILBOX_ADDRESS_ADDRESS_Pos (0UL)     /*!< Position of ADDRESS field.                                           */
  #define UICR_MAILBOX_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UICR_MAILBOX_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.  */


