adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* UICR_MAILBOX_CONFIG: Configuration of mailbox n */
  #define UICR_MAILBOX_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                   */

/* SECURE @Bit 3 : Permission */
  #define UICR_MAILBOX_CONFIG_SECURE_Pos (3UL)       /*!< Position of SECURE field.                                            */
  #define UICR_MAILBOX_CONFIG_SECURE_Msk (0x1UL << UICR_MAILBOX_CONFIG_SECURE_Pos) /*!< Bit mask of SECURE field.              */
  #define UICR_MAILBOX_CONFIG_SECURE_Min (0x0UL)     /*!< Min enumerator value of SECURE field.                                */
  #define UICR_MAILBOX_CONFIG_SECURE_Max (0x1UL)     /*!< Max enumerator value of SECURE field.                                */
  #define UICR_MAILBOX_CONFIG_SECURE_Secure (0x1UL)  /*!< The mailbox memory is secure                                         */
  #define UICR_MAILBOX_CONFIG_SECURE_NonSecure (0x0UL) /*!< The mailbox memory is non-secure                                   */

/* OWNERID @Bits 8..11 : Remote owner identification */
  #define UICR_MAILBOX_CONFIG_OWNERID_Pos (8UL)      /*!< Position of OWNERID field.                                           */
  #define UICR_MAILBOX_CONFIG_OWNERID_Msk (0xFUL << UICR_MAILBOX_CONFIG_OWNERID_Pos) /*!< Bit mask of OWNERID field.           */
  #define UICR_MAILBOX_CONFIG_OWNERID_Min (0x0UL)    /*!< Min value of OWNERID field.                                          */
  #define UICR_MAILBOX_CONFIG_OWNERID_Max (0xFUL)    /*!< Max size of OWNERID field.                                           */

/* SIZE @Bits 16..31 : Memory size */
  #define UICR_MAILBOX_CONFIG_SIZE_Pos (16UL)        /*!< Position of SIZE field.                                              */
  #define UICR_MAILBOX_CONFIG_SIZE_Msk (0xFFFFUL << UICR_MAILBOX_CONFIG_SIZE_Pos) /*!< Bit mask of SIZE field.                 */



/* ================================================ Struct UICR_TRACE_ETBSINK ================================================ */
/**
  * @brief ETBSINK [UICR_TRACE_ETBSINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SOURCES;                           /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_UICR_TRACE_ETBSINK_Type;                       /*!< Size = 4 (0x004)                                                     */

/* UICR_TRACE_ETBSINK_SOURCES: (unspecified) */
  #define UICR_TRACE_ETBSINK_SOURCES_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SOURCES register.                           */

/* STMMAINCORE @Bit 0 : STM trace from the domain main CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Pos (0UL) /*!< Position of STMMAINCORE field.                                 */
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Pos) /*!< Bit mask of
                                                                            STMMAINCORE field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Min (0x0UL) /*!< Min enumerator value of STMMAINCORE field.                   */
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Max (0x1UL) /*!< Max enumerator value of STMMAINCORE field.                   */
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_NotRequested (0x1UL) /*!< Not Requested                                       */
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Requested (0x0UL) /*!< Requested                                              */

/* ETMMAINCORE @Bit 1 : ETM trace from the domain main CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Pos (1UL) /*!< Position of ETMMAINCORE field.                                 */
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Pos) /*!< Bit mask of
                                                                            ETMMAINCORE field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Min (0x0UL) /*!< Min enumerator value of ETMMAINCORE field.                   */
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Max (0x1UL) /*!< Max enumerator value of ETMMAINCORE field.                   */
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_NotRequested (0x1UL) /*!< Not Requested                                       */
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Requested (0x0UL) /*!< Requested                                              */

/* STMHWEVENTS @Bit 2 : STM HW events trace */
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Pos (2UL) /*!< Position of STMHWEVENTS field.                                 */
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Pos) /*!< Bit mask of
                                                                            STMHWEVENTS field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Min (0x0UL) /*!< Min enumerator value of STMHWEVENTS field.                   */
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Max (0x1UL) /*!< Max enumerator value of STMHWEVENTS field.                   */
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_NotRequested (0x1UL) /*!< Not Requested                                       */
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Requested (0x0UL) /*!< Requested                                              */

/* STMPPR @Bit 3 : STM trace from PPR CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Pos (3UL) /*!< Position of STMPPR field.                                           */
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMPPR_Pos) /*!< Bit mask of STMPPR field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Min (0x0UL) /*!< Min enumerator value of STMPPR field.                             */
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Max (0x1UL) /*!< Max enumerator value of STMPPR field.                             */
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_NotRequested (0x1UL) /*!< Not Requested                                            */
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Requested (0x0UL) /*!< Requested                                                   */

/* STMFLPR @Bit 4 : STM trace from FLPR CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Pos (4UL) /*!< Position of STMFLPR field.                                         */
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Pos) /*!< Bit mask of STMFLPR
                                                                            field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Min (0x0UL) /*!< Min enumerator value of STMFLPR field.                           */
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Max (0x1UL) /*!< Max enumerator value of STMFLPR field.                           */
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_NotRequested (0x1UL) /*!< Not Requested                                           */
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Requested (0x0UL) /*!< Requested                                                  */

/* STMBBPR @Bit 5 : STM trace from BBPR CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_STMBBPR_Pos (5UL) /*!< Position of STMBBPR field.                                         */
  #define UICR_TRACE_ETBSINK_SOURCES_STMBBPR_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMBBPR_Pos) /*!< Bit mask of STMBBPR
                                                                            field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_STMBBPR_Min (0x0UL) /*!< Min enumerator value of STMBBPR field.                           */
  #define UICR_TRACE_ETBSINK_SOURCES_STMBBPR_Max (0x1UL) /*!< Max enumerator value of STMBBPR field.                           */
  #define UICR_TRACE_ETBSINK_SOURCES_STMBBPR_NotRequested (0x1UL) /*!< Not Requested                                           */
  #define UICR_TRACE_ETBSINK_SOURCES_STMBBPR_Requested (0x0UL) /*!< Requested                                                  */



/* =============================================== Struct UICR_TRACE_TPIUSINK ================================================ */
/**
  * @brief TPIUSINK [UICR_TRACE_TPIUSINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SOURCES;                           /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_UICR_TRACE_TPIUSINK_Type;                      /*!< Size = 4 (0x004)                                                     */

