adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* UICR_TRACE_PORTCONFIG: Trace port speed configuration */
  #define UICR_TRACE_PORTCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PORTCONFIG register.                             */

/* PORTCONFIG @Bits 0..1 : (unspecified) */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Pos (0UL) /*!< Position of PORTCONFIG field.                                        */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Msk (0x3UL << UICR_TRACE_PORTCONFIG_PORTCONFIG_Pos) /*!< Bit mask of PORTCONFIG
                                                                            field.*/
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Min (0x0UL) /*!< Min enumerator value of PORTCONFIG field.                          */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Max (0x3UL) /*!< Max enumerator value of PORTCONFIG field.                          */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_FullSpeed (0x3UL) /*!< Full speed                                                   */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_HalfSpeed (0x2UL) /*!< Half speed                                                   */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_QuarterSpeed (0x1UL) /*!< One quarter speed                                         */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_EightSpeed (0x0UL) /*!< One eigth speed                                             */



/* ============================================== Struct UICR_TAMPER_DETECTION =============================================== */
/**
  * @brief DETECTION [UICR_TAMPER_DETECTION] Tamper policy configuration for detected security events.
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM uint32_t  RESPONSE0;                         /*!< (@ 0x00000004) (unspecified)                                         */
  __IOM uint32_t  RESPONSE1;                         /*!< (@ 0x00000008) (unspecified)                                         */
  __IOM uint32_t  TEMPDETECTORCONFIG;                /*!< (@ 0x0000000C) (unspecified)                                         */
} NRF_UICR_TAMPER_DETECTION_Type;                    /*!< Size = 16 (0x010)                                                    */

/* UICR_TAMPER_DETECTION_ENABLE: (unspecified) */
  #define UICR_TAMPER_DETECTION_ENABLE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ENABLE register.                          */

/* GlobalEnable @Bit 0 : Enable tamper detection. When disabled all tamper enable and policy switches are ignored. */
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Pos (0UL) /*!< Position of GlobalEnable field.                             */
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Pos) /*!< Bit mask
                                                                            of GlobalEnable field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Min (0x0UL) /*!< Min enumerator value of GlobalEnable field.               */
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Max (0x1UL) /*!< Max enumerator value of GlobalEnable field.               */
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Enable (0x0UL) /*!< Enable tamper detection.                               */
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Disable (0x1UL) /*!< Disable tamper detection.                             */

/* VoltageLevel @Bit 1 : Enable voltage level detectors (VDETs) on supply lines. An automatic system reset is issued when
                         voltage on the corresponding supply line is too low. */

  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Pos (1UL) /*!< Position of VoltageLevel field.                             */
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Pos) /*!< Bit mask
                                                                            of VoltageLevel field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Min (0x0UL) /*!< Min enumerator value of VoltageLevel field.               */
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Max (0x1UL) /*!< Max enumerator value of VoltageLevel field.               */
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Enable (0x0UL) /*!< Enable voltage level detectors.                        */
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Disable (0x1UL) /*!< Disable voltage level detectors.                      */

/* Watchdog @Bit 2 : Reserved field, as watchdog timer is always enabled. */
  #define UICR_TAMPER_DETECTION_ENABLE_Watchdog_Pos (2UL) /*!< Position of Watchdog field.                                     */
  #define UICR_TAMPER_DETECTION_ENABLE_Watchdog_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_Watchdog_Pos) /*!< Bit mask of
                                                                            Watchdog field.*/

/* ExternalTamperSwitch @Bit 3 : Enable external tamper switch detector. */
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalTamperSwitch_Pos (3UL) /*!< Position of ExternalTamperSwitch field.             */
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalTamperSwitch_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_ExternalTamperSwitch_Pos)
                                                                            /*!< Bit mask of ExternalTamperSwitch field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalTamperSwitch_Min (0x0UL) /*!< Min enumerator value of ExternalTamperSwitch
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalTamperSwitch_Max (0x1UL) /*!< Max enumerator value of ExternalTamperSwitch
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalTamperSwitch_Enable (0x0UL) /*!< Enable external tamper switch detector.        */
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalTamperSwitch_Disable (0x1UL) /*!< Disable external tamper switch detector.      */

