adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ExternalActiveShield @Bit 4 : Enable external active shield detector. */
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Pos (4UL) /*!< Position of ExternalActiveShield field.             */
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Pos)
                                                                            /*!< Bit mask of ExternalActiveShield field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Min (0x0UL) /*!< Min enumerator value of ExternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Max (0x1UL) /*!< Max enumerator value of ExternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Enable (0x0UL) /*!< Enable external active shield detector.        */
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Disable (0x1UL) /*!< Disable external active shield detector.      */

/* InternalActiveShield @Bit 5 : Enable internal active shield detector. */
  #define UICR_TAMPER_DETECTION_ENABLE_InternalActiveShield_Pos (5UL) /*!< Position of InternalActiveShield field.             */
  #define UICR_TAMPER_DETECTION_ENABLE_InternalActiveShield_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_InternalActiveShield_Pos)
                                                                            /*!< Bit mask of InternalActiveShield field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_InternalActiveShield_Min (0x0UL) /*!< Min enumerator value of InternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_InternalActiveShield_Max (0x1UL) /*!< Max enumerator value of InternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_InternalActiveShield_Enable (0x0UL) /*!< Enable internal active shield detector.        */
  #define UICR_TAMPER_DETECTION_ENABLE_InternalActiveShield_Disable (0x1UL) /*!< Disable internal active shield detector.      */

/* InternalDetectors @Bit 6 : Reserved field, as internal detectors are always enabled. */
  #define UICR_TAMPER_DETECTION_ENABLE_InternalDetectors_Pos (6UL) /*!< Position of InternalDetectors field.                   */
  #define UICR_TAMPER_DETECTION_ENABLE_InternalDetectors_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_InternalDetectors_Pos) /*!<
                                                                            Bit mask of InternalDetectors field.*/

/* HardFault @Bit 7 : Configure if tamper prevention should react on hard faults. */
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Pos (7UL) /*!< Position of HardFault field.                                   */
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_HardFault_Pos) /*!< Bit mask of
                                                                            HardFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Min (0x0UL) /*!< Min enumerator value of HardFault field.                     */
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Max (0x1UL) /*!< Max enumerator value of HardFault field.                     */
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Enable (0x0UL) /*!< Enable hard fault detector.                               */
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Disable (0x1UL) /*!< Disable hard fault detector.                             */

/* ApiFault @Bit 8 : Configure if tamper prevention should react on invalid API usage. */
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Pos (8UL) /*!< Position of ApiFault field.                                     */
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_ApiFault_Pos) /*!< Bit mask of
                                                                            ApiFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Min (0x0UL) /*!< Min enumerator value of ApiFault field.                       */
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Max (0x1UL) /*!< Max enumerator value of ApiFault field.                       */
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Enable (0x0UL) /*!< Enable API fault detector.                                 */
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Disable (0x1UL) /*!< Disable API fault detector.                               */

/* AdacFault @Bit 9 : Configure if tamper prevention should react on invalid ADAC usage. */
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Pos (9UL) /*!< Position of AdacFault field.                                   */
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_AdacFault_Pos) /*!< Bit mask of
                                                                            AdacFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Min (0x0UL) /*!< Min enumerator value of AdacFault field.                     */
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Max (0x1UL) /*!< Max enumerator value of AdacFault field.                     */
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Enable (0x0UL) /*!< Enable invalid ADAC usage detector.                       */
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Disable (0x1UL) /*!< Disable invalid ADAC usage detector.                     */

/* StateFault @Bit 10 : Configure if tamper prevention should react on invalid firmware execution state. */
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Pos (10UL) /*!< Position of StateFault field.                                */
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_StateFault_Pos) /*!< Bit mask of
                                                                            StateFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Min (0x0UL) /*!< Min enumerator value of StateFault field.                   */
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Max (0x1UL) /*!< Max enumerator value of StateFault field.                   */
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Enable (0x0UL) /*!< Enable invalid firmware execution state detector.        */
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Disable (0x1UL) /*!< Disable invalid firmware execution state detector.      */

