adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TemperatureFault @Bit 11 : Configure if tamper prevention should react when on-die temperature exceeds a valid range. */
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Pos (11UL) /*!< Position of TemperatureFault field.                    */
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Pos) /*!<
                                                                            Bit mask of TemperatureFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Min (0x0UL) /*!< Min enumerator value of TemperatureFault field.       */
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Max (0x1UL) /*!< Max enumerator value of TemperatureFault field.       */
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Enable (0x0UL) /*!< Enable invalid out-of-range temperature detector.  */
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Disable (0x1UL) /*!< Disable invalid out-of-range temperature detector.*/


/* UICR_TAMPER_DETECTION_RESPONSE0: (unspecified) */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RESPONSE0 register.                    */

/* VoltageLevel @Bits 0..3 : Configure tamper policy for invalid voltage level on supply lines. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Pos (0UL) /*!< Position of VoltageLevel field.                          */
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Pos) /*!< Bit
                                                                            mask of VoltageLevel field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Min (0x2UL) /*!< Min enumerator value of VoltageLevel field.            */
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Max (0xFUL) /*!< Max enumerator value of VoltageLevel field.            */
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_15Minutes (0x3UL) /*!< Block secure services until device has been
                                                                            powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_1Hour (0x4UL) /*!< Block secure services until device has been powered
                                                                          and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this
                                                                            bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic reset. */

/* Watchdog @Bits 4..7 : Configure tamper policy for watchdog timer. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Pos (4UL) /*!< Position of Watchdog field.                                  */
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Pos) /*!< Bit mask of
                                                                            Watchdog field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Min (0x2UL) /*!< Min enumerator value of Watchdog field.                    */
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Max (0xFUL) /*!< Max enumerator value of Watchdog field.                    */
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                           device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                          and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                      idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic reset.     */

/* ExternalTamperSwitch @Bits 8..11 : Configure tamper policy for external tamper switch. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_Pos (8UL) /*!< Position of ExternalTamperSwitch field.          */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_Pos)
                                                                            /*!< Bit mask of ExternalTamperSwitch field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_Min (0x1UL) /*!< Min enumerator value of ExternalTamperSwitch
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_Max (0xFUL) /*!< Max enumerator value of ExternalTamperSwitch
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_Manual (0x1UL) /*!< Block secure services until requested to
                                                                            unblock secure services. Allows user application to
                                                                            take required actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_PowerCycle (0x2UL) /*!< Block secure services until power cycling
                                                                            the device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_15Minutes (0x3UL) /*!< Block secure services until device has
                                                                            been powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_1Hour (0x4UL) /*!< Block secure services until device has been
                                                                            powered and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning,
                                                                            this bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalTamperSwitch_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic
                                                                            reset.*/

