adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ExternalActiveShield @Bits 12..15 : Configure tamper policy for external active shield. BICR is used to specify which
                                       channels (GPIOs) are enabled. */

  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Pos (12UL) /*!< Position of ExternalActiveShield field.         */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Pos)
                                                                            /*!< Bit mask of ExternalActiveShield field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Min (0x1UL) /*!< Min enumerator value of ExternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Max (0xFUL) /*!< Max enumerator value of ExternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Manual (0x1UL) /*!< Block secure services until requested to
                                                                            unblock secure services. Allows user application to
                                                                            take required actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_PowerCycle (0x2UL) /*!< Block secure services until power cycling
                                                                            the device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_15Minutes (0x3UL) /*!< Block secure services until device has
                                                                            been powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_1Hour (0x4UL) /*!< Block secure services until device has been
                                                                            powered and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning,
                                                                            this bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic
                                                                            reset.*/

/* InternalActiveShield @Bits 16..19 : Configure tamper policy for internal active shield. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_Pos (16UL) /*!< Position of InternalActiveShield field.         */
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_Pos)
                                                                            /*!< Bit mask of InternalActiveShield field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_Min (0x1UL) /*!< Min enumerator value of InternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_Max (0xFUL) /*!< Max enumerator value of InternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_Manual (0x1UL) /*!< Block secure services until requested to
                                                                            unblock secure services. Allows user application to
                                                                            take required actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_PowerCycle (0x2UL) /*!< Block secure services until power cycling
                                                                            the device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_15Minutes (0x3UL) /*!< Block secure services until device has
                                                                            been powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_1Hour (0x4UL) /*!< Block secure services until device has been
                                                                            powered and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning,
                                                                            this bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalActiveShield_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic
                                                                            reset.*/

/* InternalDetectors @Bits 20..23 : Configure tamper policy for internal detectors including glitch detector, signal protector
                                    and CRACEN detector. See for more information. An automatic reset is issued upon detection.
                                    */

  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Pos (20UL) /*!< Position of InternalDetectors field.               */
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Pos)
                                                                            /*!< Bit mask of InternalDetectors field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Min (0x2UL) /*!< Min enumerator value of InternalDetectors field.  */
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Max (0xFUL) /*!< Max enumerator value of InternalDetectors field.  */
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_PowerCycle (0x2UL) /*!< Block secure services until power cycling
                                                                            the device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_15Minutes (0x3UL) /*!< Block secure services until device has been
                                                                            powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_1Hour (0x4UL) /*!< Block secure services until device has been
                                                                            powered and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this
                                                                            bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic
                                                                            reset.*/

/* HardFault @Bits 24..27 : Configure tamper policy for hard fault. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Pos (24UL) /*!< Position of HardFault field.                               */
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Pos) /*!< Bit mask
                                                                            of HardFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Min (0x1UL) /*!< Min enumerator value of HardFault field.                  */
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Max (0xFUL) /*!< Max enumerator value of HardFault field.                  */
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Manual (0x1UL) /*!< Block secure services until requested to unblock secure
                                                                        services. Allows user application to take required
                                                                        actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                           and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                       idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic reset.    */

