adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ApiFault @Bits 28..31 : Configure tamper policy for invalid API usage. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Pos (28UL) /*!< Position of ApiFault field.                                 */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Pos) /*!< Bit mask of
                                                                            ApiFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Min (0x1UL) /*!< Min enumerator value of ApiFault field.                    */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Max (0xFUL) /*!< Max enumerator value of ApiFault field.                    */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Manual (0x1UL) /*!< Block secure services until requested to unblock secure
                                                                       services. Allows user application to take required
                                                                       actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                           device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                          and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                      idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic reset.     */


/* UICR_TAMPER_DETECTION_RESPONSE1: (unspecified) */
  #define UICR_TAMPER_DETECTION_RESPONSE1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RESPONSE1 register.                    */

/* AdacFault @Bits 0..3 : Configure tamper policy for invalid ADAC usage. */
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Pos (0UL) /*!< Position of AdacFault field.                                */
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Pos) /*!< Bit mask
                                                                            of AdacFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Min (0x1UL) /*!< Min enumerator value of AdacFault field.                  */
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Max (0xFUL) /*!< Max enumerator value of AdacFault field.                  */
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Manual (0x1UL) /*!< Block secure services until requested to unblock secure
                                                                        services. Allows user application to take required
                                                                        actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                           and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                       idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic reset.    */

/* StateFault @Bits 4..7 : Configure tamper policy for illegal firmware execution state. Automatic reset is issued be secure
                           domain before secure services are permitted again. */

  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Pos (4UL) /*!< Position of StateFault field.                              */
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Pos) /*!< Bit mask
                                                                            of StateFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Min (0x1UL) /*!< Min enumerator value of StateFault field.                */
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Max (0xFUL) /*!< Max enumerator value of StateFault field.                */
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Manual (0x1UL) /*!< Block secure services until requested to unblock secure
                                                                         services. Allows user application to take required
                                                                         actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                            and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                        idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic reset.   */

