adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TemperatureFault @Bits 8..11 : Configure out-of-range on-die temperature tamper policy. A reset is required to continue
                                  providing secure services once the on-temperature is within valid operating conditions again.
                                  This reset is automatically triggered by the secure domain. */

  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Pos (8UL) /*!< Position of TemperatureFault field.                  */
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Pos)
                                                                            /*!< Bit mask of TemperatureFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Min (0x1UL) /*!< Min enumerator value of TemperatureFault field.    */
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Max (0xFUL) /*!< Max enumerator value of TemperatureFault field.    */
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Manual (0x1UL) /*!< Block secure services until requested to unblock
                                                                            secure services. Allows user application to take
                                                                            required actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_15Minutes (0x3UL) /*!< Block secure services until device has been
                                                                            powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_1Hour (0x4UL) /*!< Block secure services until device has been
                                                                            powered and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this
                                                                            bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic
                                                                            reset.*/


/* UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG: (unspecified) */
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TEMPDETECTORCONFIG register.  */

/* TemperatureDetectionStrategy @Bits 0..1 : Configure when on-die temperature sensor should check the temperature. */
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Pos (0UL) /*!< Position of
                                                                            TemperatureDetectionStrategy field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Msk (0x3UL << UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Pos)
                                                                            /*!< Bit mask of TemperatureDetectionStrategy
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Min (0x1UL) /*!< Min enumerator value of
                                                                            TemperatureDetectionStrategy field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Max (0x3UL) /*!< Max enumerator value of
                                                                            TemperatureDetectionStrategy field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Periodically (0x1UL) /*!< On-die temperature
                                                                            sensor is read periodically with selected interval.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_OnServiceCallAndPeriodically (0x2UL) /*!< On-die
                                                                            temperature sensor is read before each secure
                                                                            service call and periodically with selected
                                                                            interval.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_OnServiceCallOnly (0x3UL) /*!< On-die
                                                                            temperature sensor is read before each secure
                                                                            service call.*/

/* TemperatureDetectionInterval @Bits 2..3 : Configure interval for on-die temperature reading if periodic reading is enabled. */
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Pos (2UL) /*!< Position of
                                                                            TemperatureDetectionInterval field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Msk (0x3UL << UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Pos)
                                                                            /*!< Bit mask of TemperatureDetectionInterval
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Min (0x0UL) /*!< Min enumerator value of
                                                                            TemperatureDetectionInterval field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Max (0x3UL) /*!< Max enumerator value of
                                                                            TemperatureDetectionInterval field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_1Minute (0x0UL) /*!< On-die temperature sensor
                                                                            is read with one minute intervals.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_15Minutes (0x2UL) /*!< On-die temperature sensor
                                                                            is read with 15 minutes intervals.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_1Hour (0x3UL) /*!< On-die temperature sensor is
                                                                            read with one hour intervals.*/

/* LowTemperatureThresholdShift @Bits 4..11 : Low temperature detection threshold shift in degrees Celsius. The low temperature
                                              threshold is calculated by adding the threshold shift to the minimum operating
                                              temperature of the SoC. */

  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_LowTemperatureThresholdShift_Pos (4UL) /*!< Position of
                                                                            LowTemperatureThresholdShift field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_LowTemperatureThresholdShift_Msk (0xFFUL << UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_LowTemperatureThresholdShift_Pos)
                                                                            /*!< Bit mask of LowTemperatureThresholdShift
                                                                            field.*/

/* HighTemperatureThresholdShift @Bits 12..19 : High temperature detection threshold shift in degrees Celsius. The high
                                                temperature threshold is calculated by subtracting the threshold shift from the
                                                maximum operating temperature of the SoC. */

  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_HighTemperatureThresholdShift_Pos (12UL) /*!< Position of
                                                                            HighTemperatureThresholdShift field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_HighTemperatureThresholdShift_Msk (0xFFUL << UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_HighTemperatureThresholdShift_Pos)
                                                                            /*!< Bit mask of HighTemperatureThresholdShift
                                                                            field.*/



/* =========================================== Struct UICR_TAMPER_COUNTERMEASURES ============================================ */
/**
  * @brief COUNTERMEASURES [UICR_TAMPER_COUNTERMEASURES] Configuration of countermeasures.
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_UICR_TAMPER_COUNTERMEASURES_Type;              /*!< Size = 4 (0x004)                                                     */

/* UICR_TAMPER_COUNTERMEASURES_ENABLE: (unspecified) */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ENABLE register.                    */

/* DPAAES @Bit 0 : Configure Differential Power Analysis countermeasure for CRACEN AES. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Pos (0UL) /*!< Position of DPAAES field.                                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Pos) /*!< Bit mask
                                                                            of DPAAES field.*/
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Min (0x0UL) /*!< Min enumerator value of DPAAES field.                     */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Max (0x1UL) /*!< Max enumerator value of DPAAES field.                     */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Enable (0x0UL) /*!< Enable countermeasure.                                 */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Disable (0x1UL) /*!< Disable countermeasure.                               */

/* DPAPK @Bit 1 : Configure Differential Power Analysis countermeasure for CRACEN PK. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Pos (1UL) /*!< Position of DPAPK field.                                     */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Pos) /*!< Bit mask of
                                                                            DPAPK field.*/
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Min (0x0UL) /*!< Min enumerator value of DPAPK field.                       */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Max (0x1UL) /*!< Max enumerator value of DPAPK field.                       */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Enable (0x0UL) /*!< Enable countermeasure.                                  */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Disable (0x1UL) /*!< Disable countermeasure.                                */

