adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DPASM4 @Bit 2 : Configure Differential Power Analysis countermeasure for CRACEN SM4. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPASM4_Pos (2UL) /*!< Position of DPASM4 field.                                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPASM4_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DPASM4_Pos) /*!< Bit mask
                                                                            of DPASM4 field.*/
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPASM4_Min (0x0UL) /*!< Min enumerator value of DPASM4 field.                     */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPASM4_Max (0x1UL) /*!< Max enumerator value of DPASM4 field.                     */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPASM4_Enable (0x0UL) /*!< Enable countermeasure.                                 */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPASM4_Disable (0x1UL) /*!< Disable countermeasure.                               */

/* DPAECC @Bit 3 : Reserved for configuration of Differential Power Analysis countermeasure for CRACEN ECC. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAECC_Pos (3UL) /*!< Position of DPAECC field.                                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAECC_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAECC_Pos) /*!< Bit mask
                                                                            of DPAECC field.*/

/* DFAAES @Bit 4 : Reserved for configuration of Differential Fault Analysis countermeasure for CRACEN AES. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAAES_Pos (4UL) /*!< Position of DFAAES field.                                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAAES_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAAES_Pos) /*!< Bit mask
                                                                            of DFAAES field.*/

/* DFAPK @Bit 5 : Reserved for configuration of Differential Fault Analysis countermeasure for CRACEN PK. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAPK_Pos (5UL) /*!< Position of DFAPK field.                                     */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAPK_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAPK_Pos) /*!< Bit mask of
                                                                            DFAPK field.*/

/* DFASM4 @Bit 6 : Reserved for configuration of Differential Fault Analysis countermeasure for CRACEN SM4. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DFASM4_Pos (6UL) /*!< Position of DFASM4 field.                                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DFASM4_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DFASM4_Pos) /*!< Bit mask
                                                                            of DFASM4 field.*/

/* DFAECC @Bit 7 : Reserved for configuration of Differential Fault Analysis countermeasure for CRACEN ECC. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAECC_Pos (7UL) /*!< Position of DFAECC field.                                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAECC_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DFAECC_Pos) /*!< Bit mask
                                                                            of DFAECC field.*/

/* KEYLOAD @Bit 8 : Configure countermeasure for verifying if cryptography key is loaded correctly into CRACEN. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_KEYLOAD_Pos (8UL) /*!< Position of KEYLOAD field.                                 */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_KEYLOAD_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_KEYLOAD_Pos) /*!< Bit mask
                                                                            of KEYLOAD field.*/
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_KEYLOAD_Min (0x0UL) /*!< Min enumerator value of KEYLOAD field.                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_KEYLOAD_Max (0x1UL) /*!< Max enumerator value of KEYLOAD field.                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_KEYLOAD_Enable (0x0UL) /*!< Enable countermeasure.                                */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_KEYLOAD_Disable (0x1UL) /*!< Disable countermeasure.                              */

/* ClockDithering @Bit 9 : Configure the clock dithering countermeasure. When enabled clock will be randomly jittered based on
                           TRNG. */

  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Pos (9UL) /*!< Position of ClockDithering field.                   */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Pos)
                                                                            /*!< Bit mask of ClockDithering field.*/
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Min (0x0UL) /*!< Min enumerator value of ClockDithering field.     */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Max (0x1UL) /*!< Max enumerator value of ClockDithering field.     */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Enable (0x0UL) /*!< Enable countermeasure.                         */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Disable (0x1UL) /*!< Disable countermeasure.                       */



/* =================================================== Struct UICR_TAMPER ==================================================== */
/**
  * @brief TAMPER [UICR_TAMPER] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_TAMPER_DETECTION_Type DETECTION;    /*!< (@ 0x00000000) Tamper policy configuration for detected security
                                                                         events.*/
  __IOM NRF_UICR_TAMPER_COUNTERMEASURES_Type COUNTERMEASURES; /*!< (@ 0x00000010) Configuration of countermeasures.            */
} NRF_UICR_TAMPER_Type;                              /*!< Size = 20 (0x014)                                                    */

/* ======================================================= Struct UICR ======================================================= */
/**
  * @brief User information configuration registers
  */
  typedef struct {                                   /*!< UICR Structure                                                       */
    __IOM NRF_UICR_MEM_Type MEM[16];                 /*!< (@ 0x00000000) (unspecified)                                         */
    __IM uint32_t RESERVED[32];
    __IOM NRF_UICR_PERIPH_Type PERIPH[192];          /*!< (@ 0x00000100) (unspecified)                                         */
    __IM uint32_t RESERVED1[32];
    __IOM NRF_UICR_GPIOTE_Type GPIOTE[4];            /*!< (@ 0x00000480) (unspecified)                                         */
    __IOM NRF_UICR_IPCT_Type IPCT;                   /*!< (@ 0x000004B0) (unspecified)                                         */
    __IOM NRF_UICR_DPPI_Type DPPI;                   /*!< (@ 0x000004E0) (unspecified)                                         */
    __IM uint32_t RESERVED2[2];
    __IOM NRF_UICR_GRTC_Type GRTC;                   /*!< (@ 0x00000660) (unspecified)                                         */
    __IM uint32_t RESERVED3[6];
    __IOM uint32_t IPCMAP[16];                       /*!< (@ 0x00000680) Request configuration for the channel n of IPCMAP     */
    __IM uint32_t RESERVED4[16];
    __IOM NRF_UICR_MAILBOX_Type MAILBOX[8];          /*!< (@ 0x00000700) (unspecified)                                         */
    __IOM NRF_UICR_TRACE_Type TRACE;                 /*!< (@ 0x00000740) (unspecified)                                         */
    __IM uint32_t RESERVED5[4];
    __IOM NRF_UICR_TAMPER_Type TAMPER;               /*!< (@ 0x00000760) (unspecified)                                         */
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t INITSVTOR;                        /*!< (@ 0x00000780) Initial value of the secure VTOR (Vector Table Offset
                                                                         Register) after CPU reset.*/
    __IOM uint32_t INITNSVTOR;                       /*!< (@ 0x00000784) Initial value of the non-secure VTOR (Vector Table
                                                                         Offset Register).*/
    __IM uint32_t RESERVED7[29];
    __IOM uint32_t PTREXTUICR;                       /*!< (@ 0x000007FC) Pointer to extended UICR.                             */
  } NRF_UICR_Type;                                   /*!< Size = 2048 (0x800)                                                  */

/* UICR_IPCMAP: Request configuration for the channel n of IPCMAP */
  #define UICR_IPCMAP_MaxCount (16UL)                /*!< Max size of IPCMAP[16] array.                                        */
  #define UICR_IPCMAP_MaxIndex (15UL)                /*!< Max index of IPCMAP[16] array.                                       */
  #define UICR_IPCMAP_MinIndex (0UL)                 /*!< Min index of IPCMAP[16] array.                                       */
  #define UICR_IPCMAP_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of IPCMAP[16] register.                                  */

