adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* IPCTCHSINK @Bits 0..7 : IPCT channel number (sink side) */
  #define UICR_IPCMAP_IPCTCHSINK_Pos (0UL)           /*!< Position of IPCTCHSINK field.                                        */
  #define UICR_IPCMAP_IPCTCHSINK_Msk (0xFFUL << UICR_IPCMAP_IPCTCHSINK_Pos) /*!< Bit mask of IPCTCHSINK field.                 */

/* DOMAINIDSINK @Bits 8..11 : Domain ID (sink side) */
  #define UICR_IPCMAP_DOMAINIDSINK_Pos (8UL)         /*!< Position of DOMAINIDSINK field.                                      */
  #define UICR_IPCMAP_DOMAINIDSINK_Msk (0xFUL << UICR_IPCMAP_DOMAINIDSINK_Pos) /*!< Bit mask of DOMAINIDSINK field.            */

/* IPCTCHSOURCE @Bits 16..23 : IPCT channel number (source side) */
  #define UICR_IPCMAP_IPCTCHSOURCE_Pos (16UL)        /*!< Position of IPCTCHSOURCE field.                                      */
  #define UICR_IPCMAP_IPCTCHSOURCE_Msk (0xFFUL << UICR_IPCMAP_IPCTCHSOURCE_Pos) /*!< Bit mask of IPCTCHSOURCE field.           */

/* DOMAINIDSOURCE @Bits 24..27 : Domain ID (source side) */
  #define UICR_IPCMAP_DOMAINIDSOURCE_Pos (24UL)      /*!< Position of DOMAINIDSOURCE field.                                    */
  #define UICR_IPCMAP_DOMAINIDSOURCE_Msk (0xFUL << UICR_IPCMAP_DOMAINIDSOURCE_Pos) /*!< Bit mask of DOMAINIDSOURCE field.      */


/* UICR_INITSVTOR: Initial value of the secure VTOR (Vector Table Offset Register) after CPU reset. */
  #define UICR_INITSVTOR_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of INITSVTOR register.                                   */

/* INITSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define UICR_INITSVTOR_INITSVTOR_Pos (0UL)         /*!< Position of INITSVTOR field.                                         */
  #define UICR_INITSVTOR_INITSVTOR_Msk (0xFFFFFFFFUL << UICR_INITSVTOR_INITSVTOR_Pos) /*!< Bit mask of INITSVTOR field.        */


/* UICR_INITNSVTOR: Initial value of the non-secure VTOR (Vector Table Offset Register). */
  #define UICR_INITNSVTOR_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of INITNSVTOR register.                                  */

/* INITNSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define UICR_INITNSVTOR_INITNSVTOR_Pos (0UL)       /*!< Position of INITNSVTOR field.                                        */
  #define UICR_INITNSVTOR_INITNSVTOR_Msk (0xFFFFFFFFUL << UICR_INITNSVTOR_INITNSVTOR_Pos) /*!< Bit mask of INITNSVTOR field.   */


/* UICR_PTREXTUICR: Pointer to extended UICR. */
  #define UICR_PTREXTUICR_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of PTREXTUICR register.                                  */

/* PTREXTUICR @Bits 0..31 : Pointer to extended UICR. */
  #define UICR_PTREXTUICR_PTREXTUICR_Pos (0UL)       /*!< Position of PTREXTUICR field.                                        */
  #define UICR_PTREXTUICR_PTREXTUICR_Msk (0xFFFFFFFFUL << UICR_PTREXTUICR_PTREXTUICR_Pos) /*!< Bit mask of PTREXTUICR field.   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       UICREXTENDED                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct UICREXTENDED_GPIO_PIN =============================================== */
/**
  * @brief PIN [UICREXTENDED_GPIO_PIN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRLSEL;                           /*!< (@ 0x00000000) CTRLSEL values for PIN[o] of GPIO port P[n]           */
} NRF_UICREXTENDED_GPIO_PIN_Type;                    /*!< Size = 4 (0x004)                                                     */
  #define UICREXTENDED_GPIO_PIN_MaxCount (14UL)      /*!< Size of PIN[14] array.                                               */
  #define UICREXTENDED_GPIO_PIN_MaxIndex (13UL)      /*!< Max index of PIN[14] array.                                          */
  #define UICREXTENDED_GPIO_PIN_MinIndex (0UL)       /*!< Min index of PIN[14] array.                                          */

/* UICREXTENDED_GPIO_PIN_CTRLSEL: CTRLSEL values for PIN[o] of GPIO port P[n] */

/* CTRLSEL @Bits 0..2 : CTRLSEL value */
  #define UICREXTENDED_GPIO_PIN_CTRLSEL_CTRLSEL_Pos (0UL) /*!< Position of CTRLSEL field.                                      */
  #define UICREXTENDED_GPIO_PIN_CTRLSEL_CTRLSEL_Msk (0x7UL << UICREXTENDED_GPIO_PIN_CTRLSEL_CTRLSEL_Pos) /*!< Bit mask of
                                                                            CTRLSEL field.*/



/* ================================================ Struct UICREXTENDED_GPIO ================================================= */
/**
  * @brief GPIO [UICREXTENDED_GPIO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;                          /*!< (@ 0x00000000) Address of the GPIO instance associated with GPIO[n]  */
  __IOM uint32_t  OWN;                               /*!< (@ 0x00000004) Request ownership of the pins at GPIO port P[n]       */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000008) Request permission for the pins at GPIO port P[n]     */
  __IOM NRF_UICREXTENDED_GPIO_PIN_Type PIN[14];      /*!< (@ 0x0000000C) (unspecified)                                         */
} NRF_UICREXTENDED_GPIO_Type;                        /*!< Size = 68 (0x044)                                                    */
  #define UICREXTENDED_GPIO_MaxCount (10UL)          /*!< Size of GPIO[10] array.                                              */
  #define UICREXTENDED_GPIO_MaxIndex (9UL)           /*!< Max index of GPIO[10] array.                                         */
  #define UICREXTENDED_GPIO_MinIndex (0UL)           /*!< Min index of GPIO[10] array.                                         */

