adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PIN10 @Bit 10 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN10_Pos (10UL)     /*!< Position of PIN10 field.                                             */
  #define UICREXTENDED_GPIO_OWN_PIN10_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN10_Pos) /*!< Bit mask of PIN10 field.             */
  #define UICREXTENDED_GPIO_OWN_PIN10_Min (0x0UL)    /*!< Min enumerator value of PIN10 field.                                 */
  #define UICREXTENDED_GPIO_OWN_PIN10_Max (0x1UL)    /*!< Max enumerator value of PIN10 field.                                 */
  #define UICREXTENDED_GPIO_OWN_PIN10_NotOwn (0x1UL) /*!< Do not own the pin 10                                                */
  #define UICREXTENDED_GPIO_OWN_PIN10_Own (0x0UL)    /*!< Own the pin 10                                                       */

/* PIN11 @Bit 11 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN11_Pos (11UL)     /*!< Position of PIN11 field.                                             */
  #define UICREXTENDED_GPIO_OWN_PIN11_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN11_Pos) /*!< Bit mask of PIN11 field.             */
  #define UICREXTENDED_GPIO_OWN_PIN11_Min (0x0UL)    /*!< Min enumerator value of PIN11 field.                                 */
  #define UICREXTENDED_GPIO_OWN_PIN11_Max (0x1UL)    /*!< Max enumerator value of PIN11 field.                                 */
  #define UICREXTENDED_GPIO_OWN_PIN11_NotOwn (0x1UL) /*!< Do not own the pin 11                                                */
  #define UICREXTENDED_GPIO_OWN_PIN11_Own (0x0UL)    /*!< Own the pin 11                                                       */

/* PIN12 @Bit 12 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN12_Pos (12UL)     /*!< Position of PIN12 field.                                             */
  #define UICREXTENDED_GPIO_OWN_PIN12_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN12_Pos) /*!< Bit mask of PIN12 field.             */
  #define UICREXTENDED_GPIO_OWN_PIN12_Min (0x0UL)    /*!< Min enumerator value of PIN12 field.                                 */
  #define UICREXTENDED_GPIO_OWN_PIN12_Max (0x1UL)    /*!< Max enumerator value of PIN12 field.                                 */
  #define UICREXTENDED_GPIO_OWN_PIN12_NotOwn (0x1UL) /*!< Do not own the pin 12                                                */
  #define UICREXTENDED_GPIO_OWN_PIN12_Own (0x0UL)    /*!< Own the pin 12                                                       */

/* PIN13 @Bit 13 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN13_Pos (13UL)     /*!< Position of PIN13 field.                                             */
  #define UICREXTENDED_GPIO_OWN_PIN13_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN13_Pos) /*!< Bit mask of PIN13 field.             */
  #define UICREXTENDED_GPIO_OWN_PIN13_Min (0x0UL)    /*!< Min enumerator value of PIN13 field.                                 */
  #define UICREXTENDED_GPIO_OWN_PIN13_Max (0x1UL)    /*!< Max enumerator value of PIN13 field.                                 */
  #define UICREXTENDED_GPIO_OWN_PIN13_NotOwn (0x1UL) /*!< Do not own the pin 13                                                */
  #define UICREXTENDED_GPIO_OWN_PIN13_Own (0x0UL)    /*!< Own the pin 13                                                       */


/* UICREXTENDED_GPIO_SECURE: Request permission for the pins at GPIO port P[n] */

/* PIN0 @Bit 0 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN0_Pos (0UL)    /*!< Position of PIN0 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN0_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN0_Pos) /*!< Bit mask of PIN0 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN0_Min (0x0UL)  /*!< Min enumerator value of PIN0 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN0_Max (0x1UL)  /*!< Max enumerator value of PIN0 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN0_Secure (0x1UL) /*!< The pin 0 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN0_NonSecure (0x0UL) /*!< The pin 0 is non-secure                                         */

/* PIN1 @Bit 1 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN1_Pos (1UL)    /*!< Position of PIN1 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN1_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN1_Pos) /*!< Bit mask of PIN1 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN1_Min (0x0UL)  /*!< Min enumerator value of PIN1 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN1_Max (0x1UL)  /*!< Max enumerator value of PIN1 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN1_Secure (0x1UL) /*!< The pin 1 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN1_NonSecure (0x0UL) /*!< The pin 1 is non-secure                                         */

/* PIN2 @Bit 2 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN2_Pos (2UL)    /*!< Position of PIN2 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN2_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN2_Pos) /*!< Bit mask of PIN2 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN2_Min (0x0UL)  /*!< Min enumerator value of PIN2 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN2_Max (0x1UL)  /*!< Max enumerator value of PIN2 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN2_Secure (0x1UL) /*!< The pin 2 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN2_NonSecure (0x0UL) /*!< The pin 2 is non-secure                                         */

/* PIN3 @Bit 3 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN3_Pos (3UL)    /*!< Position of PIN3 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN3_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN3_Pos) /*!< Bit mask of PIN3 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN3_Min (0x0UL)  /*!< Min enumerator value of PIN3 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN3_Max (0x1UL)  /*!< Max enumerator value of PIN3 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN3_Secure (0x1UL) /*!< The pin 3 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN3_NonSecure (0x0UL) /*!< The pin 3 is non-secure                                         */

/* PIN4 @Bit 4 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN4_Pos (4UL)    /*!< Position of PIN4 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN4_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN4_Pos) /*!< Bit mask of PIN4 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN4_Min (0x0UL)  /*!< Min enumerator value of PIN4 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN4_Max (0x1UL)  /*!< Max enumerator value of PIN4 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN4_Secure (0x1UL) /*!< The pin 4 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN4_NonSecure (0x0UL) /*!< The pin 4 is non-secure                                         */

/* PIN5 @Bit 5 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN5_Pos (5UL)    /*!< Position of PIN5 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN5_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN5_Pos) /*!< Bit mask of PIN5 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN5_Min (0x0UL)  /*!< Min enumerator value of PIN5 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN5_Max (0x1UL)  /*!< Max enumerator value of PIN5 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN5_Secure (0x1UL) /*!< The pin 5 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN5_NonSecure (0x0UL) /*!< The pin 5 is non-secure                                         */

/* PIN6 @Bit 6 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN6_Pos (6UL)    /*!< Position of PIN6 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN6_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN6_Pos) /*!< Bit mask of PIN6 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN6_Min (0x0UL)  /*!< Min enumerator value of PIN6 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN6_Max (0x1UL)  /*!< Max enumerator value of PIN6 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN6_Secure (0x1UL) /*!< The pin 6 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN6_NonSecure (0x0UL) /*!< The pin 6 is non-secure                                         */

/* PIN7 @Bit 7 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN7_Pos (7UL)    /*!< Position of PIN7 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN7_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN7_Pos) /*!< Bit mask of PIN7 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN7_Min (0x0UL)  /*!< Min enumerator value of PIN7 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN7_Max (0x1UL)  /*!< Max enumerator value of PIN7 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN7_Secure (0x1UL) /*!< The pin 7 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN7_NonSecure (0x0UL) /*!< The pin 7 is non-secure                                         */

/* PIN8 @Bit 8 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN8_Pos (8UL)    /*!< Position of PIN8 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN8_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN8_Pos) /*!< Bit mask of PIN8 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN8_Min (0x0UL)  /*!< Min enumerator value of PIN8 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN8_Max (0x1UL)  /*!< Max enumerator value of PIN8 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN8_Secure (0x1UL) /*!< The pin 8 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN8_NonSecure (0x0UL) /*!< The pin 8 is non-secure                                         */

/* PIN9 @Bit 9 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN9_Pos (9UL)    /*!< Position of PIN9 field.                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN9_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN9_Pos) /*!< Bit mask of PIN9 field.          */
  #define UICREXTENDED_GPIO_SECURE_PIN9_Min (0x0UL)  /*!< Min enumerator value of PIN9 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN9_Max (0x1UL)  /*!< Max enumerator value of PIN9 field.                                  */
  #define UICREXTENDED_GPIO_SECURE_PIN9_Secure (0x1UL) /*!< The pin 9 is secure                                                */
  #define UICREXTENDED_GPIO_SECURE_PIN9_NonSecure (0x0UL) /*!< The pin 9 is non-secure                                         */

