adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PIN10 @Bit 10 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN10_Pos (10UL)  /*!< Position of PIN10 field.                                             */
  #define UICREXTENDED_GPIO_SECURE_PIN10_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN10_Pos) /*!< Bit mask of PIN10 field.       */
  #define UICREXTENDED_GPIO_SECURE_PIN10_Min (0x0UL) /*!< Min enumerator value of PIN10 field.                                 */
  #define UICREXTENDED_GPIO_SECURE_PIN10_Max (0x1UL) /*!< Max enumerator value of PIN10 field.                                 */
  #define UICREXTENDED_GPIO_SECURE_PIN10_Secure (0x1UL) /*!< The pin 10 is secure                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN10_NonSecure (0x0UL) /*!< The pin 10 is non-secure                                       */

/* PIN11 @Bit 11 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN11_Pos (11UL)  /*!< Position of PIN11 field.                                             */
  #define UICREXTENDED_GPIO_SECURE_PIN11_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN11_Pos) /*!< Bit mask of PIN11 field.       */
  #define UICREXTENDED_GPIO_SECURE_PIN11_Min (0x0UL) /*!< Min enumerator value of PIN11 field.                                 */
  #define UICREXTENDED_GPIO_SECURE_PIN11_Max (0x1UL) /*!< Max enumerator value of PIN11 field.                                 */
  #define UICREXTENDED_GPIO_SECURE_PIN11_Secure (0x1UL) /*!< The pin 11 is secure                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN11_NonSecure (0x0UL) /*!< The pin 11 is non-secure                                       */

/* PIN12 @Bit 12 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN12_Pos (12UL)  /*!< Position of PIN12 field.                                             */
  #define UICREXTENDED_GPIO_SECURE_PIN12_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN12_Pos) /*!< Bit mask of PIN12 field.       */
  #define UICREXTENDED_GPIO_SECURE_PIN12_Min (0x0UL) /*!< Min enumerator value of PIN12 field.                                 */
  #define UICREXTENDED_GPIO_SECURE_PIN12_Max (0x1UL) /*!< Max enumerator value of PIN12 field.                                 */
  #define UICREXTENDED_GPIO_SECURE_PIN12_Secure (0x1UL) /*!< The pin 12 is secure                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN12_NonSecure (0x0UL) /*!< The pin 12 is non-secure                                       */

/* PIN13 @Bit 13 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN13_Pos (13UL)  /*!< Position of PIN13 field.                                             */
  #define UICREXTENDED_GPIO_SECURE_PIN13_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN13_Pos) /*!< Bit mask of PIN13 field.       */
  #define UICREXTENDED_GPIO_SECURE_PIN13_Min (0x0UL) /*!< Min enumerator value of PIN13 field.                                 */
  #define UICREXTENDED_GPIO_SECURE_PIN13_Max (0x1UL) /*!< Max enumerator value of PIN13 field.                                 */
  #define UICREXTENDED_GPIO_SECURE_PIN13_Secure (0x1UL) /*!< The pin 13 is secure                                              */
  #define UICREXTENDED_GPIO_SECURE_PIN13_NonSecure (0x0UL) /*!< The pin 13 is non-secure                                       */


/* =================================================== Struct UICREXTENDED =================================================== */
/**
  * @brief Extended UICR.
  */
  typedef struct {                                   /*!< UICREXTENDED Structure                                               */
    __IOM NRF_UICREXTENDED_GPIO_Type GPIO[10];       /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_UICREXTENDED_Type;                           /*!< Size = 680 (0x2A8)                                                   */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           USBHS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct USBHS_PHY ===================================================== */
/**
  * @brief PHY [USBHS_PHY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) USB PHY parameter overrides                           */
  __IOM uint32_t  CLOCK;                             /*!< (@ 0x00000004) USB PHY clock configurations                          */
  __IOM uint32_t  BATTCHRG;                          /*!< (@ 0x00000008) Battery Charging Configuration                        */
  __IOM uint32_t  VREGBYPASS;                        /*!< (@ 0x0000000C) Vreg18 bypass control                                 */
  __IOM uint32_t  VREGBYPASSLOCK;                    /*!< (@ 0x00000010) Enables the lock for the PHY.VREGBYPASS               */
  __IOM uint32_t  INPUTOVERRIDE;                     /*!< (@ 0x00000014) Enables overriding of the input signals to the PHY,
                                                                         used for PHY Built In Self Test (BIST).*/
  __IOM uint32_t  OVERRIDEVALUES;                    /*!< (@ 0x00000018) Values that are used to override the input signals to
                                                                         the PHY.*/
} NRF_USBHS_PHY_Type;                                /*!< Size = 28 (0x01C)                                                    */

/* USBHS_PHY_CONFIG: USB PHY parameter overrides */
  #define USBHS_PHY_CONFIG_ResetValue (0x5533D6F0UL) /*!< Reset value of CONFIG register.                                      */

/* PLLITUNE @Bits 0..1 : PLL Integral Path Tune */
  #define USBHS_PHY_CONFIG_PLLITUNE_Pos (0UL)        /*!< Position of PLLITUNE field.                                          */
  #define USBHS_PHY_CONFIG_PLLITUNE_Msk (0x3UL << USBHS_PHY_CONFIG_PLLITUNE_Pos) /*!< Bit mask of PLLITUNE field.              */
  #define USBHS_PHY_CONFIG_PLLITUNE_Min (0x0UL)      /*!< Min value of PLLITUNE field.                                         */
  #define USBHS_PHY_CONFIG_PLLITUNE_Max (0x3UL)      /*!< Max size of PLLITUNE field.                                          */

/* PLLPTUNE @Bits 2..5 : PLL Proportional Path Tune */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Pos (2UL)        /*!< Position of PLLPTUNE field.                                          */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Msk (0xFUL << USBHS_PHY_CONFIG_PLLPTUNE_Pos) /*!< Bit mask of PLLPTUNE field.              */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Min (0x0UL)      /*!< Min value of PLLPTUNE field.                                         */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Max (0xFUL)      /*!< Max size of PLLPTUNE field.                                          */

/* COMPDISTUNE0 @Bits 6..8 : Disconnect Threshold Adjustment */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Pos (6UL)    /*!< Position of COMPDISTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Msk (0x7UL << USBHS_PHY_CONFIG_COMPDISTUNE0_Pos) /*!< Bit mask of COMPDISTUNE0 field.  */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Min (0x0UL)  /*!< Min value of COMPDISTUNE0 field.                                     */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Max (0x7UL)  /*!< Max size of COMPDISTUNE0 field.                                      */

/* SQRXTUNE0 @Bits 9..11 : Squelch Threshold Adjustment */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Pos (9UL)       /*!< Position of SQRXTUNE0 field.                                         */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Msk (0x7UL << USBHS_PHY_CONFIG_SQRXTUNE0_Pos) /*!< Bit mask of SQRXTUNE0 field.           */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Min (0x0UL)     /*!< Min value of SQRXTUNE0 field.                                        */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Max (0x3UL)     /*!< Max size of SQRXTUNE0 field.                                         */

/* VDATREFTUNE0 @Bits 12..13 : Data Detect Voltage Adjustment */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Pos (12UL)   /*!< Position of VDATREFTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_VDATREFTUNE0_Pos) /*!< Bit mask of VDATREFTUNE0 field.  */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Min (0x0UL)  /*!< Min value of VDATREFTUNE0 field.                                     */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Max (0x3UL)  /*!< Max size of VDATREFTUNE0 field.                                      */

/* TXHSXVTUNE0 @Bits 14..15 : Transmitter High-Speed Crossover Adjustment */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Pos (14UL)    /*!< Position of TXHSXVTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXHSXVTUNE0_Pos) /*!< Bit mask of TXHSXVTUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Min (0x0UL)   /*!< Min value of TXHSXVTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Max (0x2UL)   /*!< Max size of TXHSXVTUNE0 field.                                       */

