adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SLEEPM0 @Bit 26 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_SLEEPM0_Pos (26UL) /*!< Position of SLEEPM0 field.                                          */
  #define USBHS_PHY_OVERRIDEVALUES_SLEEPM0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_SLEEPM0_Pos) /*!< Bit mask of SLEEPM0 field. */

/* BYPASSSEL0 @Bit 27 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_BYPASSSEL0_Pos (27UL) /*!< Position of BYPASSSEL0 field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_BYPASSSEL0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_BYPASSSEL0_Pos) /*!< Bit mask of BYPASSSEL0
                                                                            field.*/

/* BYPASSDPEN0 @Bit 28 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_BYPASSDPEN0_Pos (28UL) /*!< Position of BYPASSDPEN0 field.                                  */
  #define USBHS_PHY_OVERRIDEVALUES_BYPASSDPEN0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_BYPASSDPEN0_Pos) /*!< Bit mask of
                                                                            BYPASSDPEN0 field.*/

/* BYPASSDPDATA0 @Bit 29 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_BYPASSDPDATA0_Pos (29UL) /*!< Position of BYPASSDPDATA0 field.                              */
  #define USBHS_PHY_OVERRIDEVALUES_BYPASSDPDATA0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_BYPASSDPDATA0_Pos) /*!< Bit mask of
                                                                            BYPASSDPDATA0 field.*/



/* ==================================================== Struct USBHS_DFT ===================================================== */
/**
  * @brief DFT [USBHS_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus configuration                        */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
  __IOM uint32_t  TESTADDR;                          /*!< (@ 0x00000034) Test data address                                     */
  __IOM uint32_t  TESTDATAIN;                        /*!< (@ 0x00000038) Test data input                                       */
  __IOM uint32_t  TESTDATAOUTSEL;                    /*!< (@ 0x0000003C) Test data out select                                  */
  __IM  uint32_t  TESTDATAOUT;                       /*!< (@ 0x00000040) Test data output                                      */
  __IOM uint32_t  TLATCH;                            /*!< (@ 0x00000044) Test data latch                                       */
} NRF_USBHS_DFT_Type;                                /*!< Size = 72 (0x048)                                                    */

/* USBHS_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define USBHS_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                              */

/* EN @Bit 31 : Enable ANALOGTEST on the analog test bus */
  #define USBHS_DFT_ATB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define USBHS_DFT_ATB0CONFIG_EN_Msk (0x1UL << USBHS_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define USBHS_DFT_ATB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define USBHS_DFT_ATB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define USBHS_DFT_ATB0CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define USBHS_DFT_ATB0CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* USBHS_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define USBHS_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                              */

/* EN @Bit 31 : Enable ANALOGTESTATE on the analog test bus */
  #define USBHS_DFT_ATB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define USBHS_DFT_ATB1CONFIG_EN_Msk (0x1UL << USBHS_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define USBHS_DFT_ATB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define USBHS_DFT_ATB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define USBHS_DFT_ATB1CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define USBHS_DFT_ATB1CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* USBHS_DFT_DTBCONFIG: Digital Test Bus configuration */
  #define USBHS_DFT_DTBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTBCONFIG register.                                */

/* DTB0EN @Bit 28 : Enable TESTDATAOUT[0] on DTB0 */
  #define USBHS_DFT_DTBCONFIG_DTB0EN_Pos (28UL)      /*!< Position of DTB0EN field.                                            */
  #define USBHS_DFT_DTBCONFIG_DTB0EN_Msk (0x1UL << USBHS_DFT_DTBCONFIG_DTB0EN_Pos) /*!< Bit mask of DTB0EN field.              */
  #define USBHS_DFT_DTBCONFIG_DTB0EN_Min (0x0UL)     /*!< Min enumerator value of DTB0EN field.                                */
  #define USBHS_DFT_DTBCONFIG_DTB0EN_Max (0x1UL)     /*!< Max enumerator value of DTB0EN field.                                */
  #define USBHS_DFT_DTBCONFIG_DTB0EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                        */
  #define USBHS_DFT_DTBCONFIG_DTB0EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                          */

/* DTB1EN @Bit 29 : Enable TESTDATAOUT[1] on DTB1 */
  #define USBHS_DFT_DTBCONFIG_DTB1EN_Pos (29UL)      /*!< Position of DTB1EN field.                                            */
  #define USBHS_DFT_DTBCONFIG_DTB1EN_Msk (0x1UL << USBHS_DFT_DTBCONFIG_DTB1EN_Pos) /*!< Bit mask of DTB1EN field.              */
  #define USBHS_DFT_DTBCONFIG_DTB1EN_Min (0x0UL)     /*!< Min enumerator value of DTB1EN field.                                */
  #define USBHS_DFT_DTBCONFIG_DTB1EN_Max (0x1UL)     /*!< Max enumerator value of DTB1EN field.                                */
  #define USBHS_DFT_DTBCONFIG_DTB1EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                        */
  #define USBHS_DFT_DTBCONFIG_DTB1EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                          */

/* DTB2EN @Bit 30 : Enable TESTDATAOUT[2] on DTB2 */
  #define USBHS_DFT_DTBCONFIG_DTB2EN_Pos (30UL)      /*!< Position of DTB2EN field.                                            */
  #define USBHS_DFT_DTBCONFIG_DTB2EN_Msk (0x1UL << USBHS_DFT_DTBCONFIG_DTB2EN_Pos) /*!< Bit mask of DTB2EN field.              */
  #define USBHS_DFT_DTBCONFIG_DTB2EN_Min (0x0UL)     /*!< Min enumerator value of DTB2EN field.                                */
  #define USBHS_DFT_DTBCONFIG_DTB2EN_Max (0x1UL)     /*!< Max enumerator value of DTB2EN field.                                */
  #define USBHS_DFT_DTBCONFIG_DTB2EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                        */
  #define USBHS_DFT_DTBCONFIG_DTB2EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                          */

/* DTB3EN @Bit 31 : Enable TESTDATAOUT[3] on DTB3 */
  #define USBHS_DFT_DTBCONFIG_DTB3EN_Pos (31UL)      /*!< Position of DTB3EN field.                                            */
  #define USBHS_DFT_DTBCONFIG_DTB3EN_Msk (0x1UL << USBHS_DFT_DTBCONFIG_DTB3EN_Pos) /*!< Bit mask of DTB3EN field.              */
  #define USBHS_DFT_DTBCONFIG_DTB3EN_Min (0x0UL)     /*!< Min enumerator value of DTB3EN field.                                */
  #define USBHS_DFT_DTBCONFIG_DTB3EN_Max (0x1UL)     /*!< Max enumerator value of DTB3EN field.                                */
  #define USBHS_DFT_DTBCONFIG_DTB3EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                        */
  #define USBHS_DFT_DTBCONFIG_DTB3EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                          */


/* USBHS_DFT_TCFG: Test mode configuration */
  #define USBHS_DFT_TCFG_ResetValue (0x00000000UL)   /*!< Reset value of TCFG register.                                        */

/* ATERESET @Bit 0 : ATE reset input. Disables PHYCLOCK0 and FREECLK */
  #define USBHS_DFT_TCFG_ATERESET_Pos (0UL)          /*!< Position of ATERESET field.                                          */
  #define USBHS_DFT_TCFG_ATERESET_Msk (0x1UL << USBHS_DFT_TCFG_ATERESET_Pos) /*!< Bit mask of ATERESET field.                  */
  #define USBHS_DFT_TCFG_ATERESET_Min (0x0UL)        /*!< Min enumerator value of ATERESET field.                              */
  #define USBHS_DFT_TCFG_ATERESET_Max (0x1UL)        /*!< Max enumerator value of ATERESET field.                              */
  #define USBHS_DFT_TCFG_ATERESET_Clockenabled (0x0UL) /*!< PHYCLK0 and FREECLK enabled                                        */
  #define USBHS_DFT_TCFG_ATERESET_Clockdisabled (0x1UL) /*!< PHYCLK0 and FREECLK disabled                                      */

/* SIDDQ @Bit 1 : IDDQ Test Enable */
  #define USBHS_DFT_TCFG_SIDDQ_Pos (1UL)             /*!< Position of SIDDQ field.                                             */
  #define USBHS_DFT_TCFG_SIDDQ_Msk (0x1UL << USBHS_DFT_TCFG_SIDDQ_Pos) /*!< Bit mask of SIDDQ field.                           */
  #define USBHS_DFT_TCFG_SIDDQ_Min (0x0UL)           /*!< Min enumerator value of SIDDQ field.                                 */
  #define USBHS_DFT_TCFG_SIDDQ_Max (0x1UL)           /*!< Max enumerator value of SIDDQ field.                                 */
  #define USBHS_DFT_TCFG_SIDDQ_Disabled (0x0UL)      /*!< Analog blocks are powered up                                         */
  #define USBHS_DFT_TCFG_SIDDQ_Enabled (0x1UL)       /*!< Analog blocks are powered down                                       */

