adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TASKS_STOP @Bit 0 : Stop the USB peripheral */
  #define USBHS_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Msk (0x1UL << USBHS_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* USBHS_EVENTS_CORE: Event indicating that interrupt triggered at USBHS core */
  #define USBHS_EVENTS_CORE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CORE register.                                */

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at USBHS core */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Pos (0UL)    /*!< Position of EVENTS_CORE field.                                       */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << USBHS_EVENTS_CORE_EVENTS_CORE_Pos) /*!< Bit mask of EVENTS_CORE field.   */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)  /*!< Min enumerator value of EVENTS_CORE field.                           */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)  /*!< Max enumerator value of EVENTS_CORE field.                           */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL) /*!< Event generated                                                 */


/* USBHS_INTEN: Enable or disable interrupt */
  #define USBHS_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define USBHS_INTEN_CORE_Pos (0UL)                 /*!< Position of CORE field.                                              */
  #define USBHS_INTEN_CORE_Msk (0x1UL << USBHS_INTEN_CORE_Pos) /*!< Bit mask of CORE field.                                    */
  #define USBHS_INTEN_CORE_Min (0x0UL)               /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTEN_CORE_Max (0x1UL)               /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTEN_CORE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define USBHS_INTEN_CORE_Enabled (0x1UL)           /*!< Enable                                                               */


/* USBHS_INTENSET: Enable interrupt */
  #define USBHS_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define USBHS_INTENSET_CORE_Pos (0UL)              /*!< Position of CORE field.                                              */
  #define USBHS_INTENSET_CORE_Msk (0x1UL << USBHS_INTENSET_CORE_Pos) /*!< Bit mask of CORE field.                              */
  #define USBHS_INTENSET_CORE_Min (0x0UL)            /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTENSET_CORE_Max (0x1UL)            /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTENSET_CORE_Set (0x1UL)            /*!< Enable                                                               */
  #define USBHS_INTENSET_CORE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define USBHS_INTENSET_CORE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* USBHS_INTENCLR: Disable interrupt */
  #define USBHS_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define USBHS_INTENCLR_CORE_Pos (0UL)              /*!< Position of CORE field.                                              */
  #define USBHS_INTENCLR_CORE_Msk (0x1UL << USBHS_INTENCLR_CORE_Pos) /*!< Bit mask of CORE field.                              */
  #define USBHS_INTENCLR_CORE_Min (0x0UL)            /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTENCLR_CORE_Max (0x1UL)            /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTENCLR_CORE_Clear (0x1UL)          /*!< Disable                                                              */
  #define USBHS_INTENCLR_CORE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define USBHS_INTENCLR_CORE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* USBHS_INTPEND: Pending interrupts */
  #define USBHS_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define USBHS_INTPEND_CORE_Pos (0UL)               /*!< Position of CORE field.                                              */
  #define USBHS_INTPEND_CORE_Msk (0x1UL << USBHS_INTPEND_CORE_Pos) /*!< Bit mask of CORE field.                                */
  #define USBHS_INTPEND_CORE_Min (0x0UL)             /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTPEND_CORE_Max (0x1UL)             /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTPEND_CORE_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define USBHS_INTPEND_CORE_Pending (0x1UL)         /*!< Read: Pending                                                        */


/* USBHS_ENABLE: Enable USB peripheral. */
  #define USBHS_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* CORE @Bit 0 : Enable USB Controller */
  #define USBHS_ENABLE_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define USBHS_ENABLE_CORE_Msk (0x1UL << USBHS_ENABLE_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Disabled (0x0UL)         /*!< USB Controller disabled.                                             */
  #define USBHS_ENABLE_CORE_Enabled (0x1UL)          /*!< USB Controller enabled.                                              */

/* PHY @Bit 1 : Enable USB PHY */
  #define USBHS_ENABLE_PHY_Pos (1UL)                 /*!< Position of PHY field.                                               */
  #define USBHS_ENABLE_PHY_Msk (0x1UL << USBHS_ENABLE_PHY_Pos) /*!< Bit mask of PHY field.                                     */
  #define USBHS_ENABLE_PHY_Min (0x0UL)               /*!< Min enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Max (0x1UL)               /*!< Max enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Disabled (0x0UL)          /*!< USB PHY disabled.                                                    */
  #define USBHS_ENABLE_PHY_Enabled (0x1UL)           /*!< USB PHY enabled.                                                     */


/* USBHS_DEBOUNCEFILTER: Configuration of debounce filters for avalid, bvalid, vbusvalid, sessend and iddig signals */
  #define USBHS_DEBOUNCEFILTER_ResetValue (0x00000000UL) /*!< Reset value of DEBOUNCEFILTER register.                          */

/* BYPASS @Bit 0 : Bypass debounce filters */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Pos (0UL)      /*!< Position of BYPASS field.                                            */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Msk (0x1UL << USBHS_DEBOUNCEFILTER_BYPASS_Pos) /*!< Bit mask of BYPASS field.            */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Min (0x0UL)    /*!< Min enumerator value of BYPASS field.                                */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Max (0x1UL)    /*!< Max enumerator value of BYPASS field.                                */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Disabled (0x0UL) /*!< Bypass disabled.                                                   */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Enabled (0x1UL) /*!< Bypass enabled.                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         USBHSCORE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

