adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HCHINTMSK @Bit 25 : Mode: Host only. Host Channels Interrupt Mask (HChIntMsk) */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Pos (25UL)     /*!< Position of HCHINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_HCHINTMSK_Pos) /*!< Bit mask of HCHINTMSK field.         */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Min (0x0UL)    /*!< Min enumerator value of HCHINTMSK field.                             */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Max (0x1UL)    /*!< Max enumerator value of HCHINTMSK field.                             */
  #define USBHSCORE_GINTMSK_HCHINTMSK_MASK (0x0UL)   /*!< Host Channels Interrupt Mask                                         */
  #define USBHSCORE_GINTMSK_HCHINTMSK_NOMASK (0x1UL) /*!< No Host Channels Interrupt Mask                                      */

/* LPMINTMSK @Bit 27 : Mode: Host and Device. LPM Transaction Received Interrupt (LPM_Int) */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Pos (27UL)     /*!< Position of LPMINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_LPMINTMSK_Pos) /*!< Bit mask of LPMINTMSK field.         */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Min (0x0UL)    /*!< Min enumerator value of LPMINTMSK field.                             */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Max (0x1UL)    /*!< Max enumerator value of LPMINTMSK field.                             */
  #define USBHSCORE_GINTMSK_LPMINTMSK_MASK (0x0UL)   /*!< LPM Transaction received interrupt Mask                              */
  #define USBHSCORE_GINTMSK_LPMINTMSK_NOMASK (0x1UL) /*!< No LPM Transaction received interrupt Mask                           */

/* CONIDSTSCHNGMSK @Bit 28 : Mode: Host and Device. Connector ID Status Change Mask (ConIDStsChngMsk) */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Pos (28UL) /*!< Position of CONIDSTSCHNGMSK field.                                 */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Msk (0x1UL << USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Pos) /*!< Bit mask of
                                                                            CONIDSTSCHNGMSK field.*/
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Min (0x0UL) /*!< Min enumerator value of CONIDSTSCHNGMSK field.                    */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Max (0x1UL) /*!< Max enumerator value of CONIDSTSCHNGMSK field.                    */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_MASK (0x0UL) /*!< Connector ID Status Change Mask                                  */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_NOMASK (0x1UL) /*!< No Connector ID Status Change Mask                             */

/* DISCONNINTMSK @Bit 29 : Mode: Host and Device. Disconnect Detected Interrupt Mask (DisconnIntMsk) */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Pos (29UL) /*!< Position of DISCONNINTMSK field.                                     */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_DISCONNINTMSK_Pos) /*!< Bit mask of DISCONNINTMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Min (0x0UL) /*!< Min enumerator value of DISCONNINTMSK field.                        */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Max (0x1UL) /*!< Max enumerator value of DISCONNINTMSK field.                        */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_MASK (0x0UL) /*!< Disconnect Detected Interrupt Mask                                 */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_NOMASK (0x1UL) /*!< No Disconnect Detected Interrupt Mask                            */

/* SESSREQINTMSK @Bit 30 : Mode: Host and Device. Session Request/New Session Detected Interrupt Mask (SessReqIntMsk) */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Pos (30UL) /*!< Position of SESSREQINTMSK field.                                     */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_SESSREQINTMSK_Pos) /*!< Bit mask of SESSREQINTMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Min (0x0UL) /*!< Min enumerator value of SESSREQINTMSK field.                        */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Max (0x1UL) /*!< Max enumerator value of SESSREQINTMSK field.                        */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_MASK (0x0UL) /*!< Session Request or New Session Detected Interrupt Mask             */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_NOMASK (0x1UL) /*!< No Session Request or New Session Detected Interrupt Mask        */

/* WKUPINTMSK @Bit 31 : Mode: Host and Device. Resume/Remote Wakeup Detected Interrupt Mask (WkUpIntMsk) */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Pos (31UL)    /*!< Position of WKUPINTMSK field.                                        */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_WKUPINTMSK_Pos) /*!< Bit mask of WKUPINTMSK field.      */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Min (0x0UL)   /*!< Min enumerator value of WKUPINTMSK field.                            */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Max (0x1UL)   /*!< Max enumerator value of WKUPINTMSK field.                            */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_MASK (0x0UL)  /*!< Resume or Remote Wakeup Detected Interrupt Mask                      */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_NOMASK (0x1UL) /*!< Unmask Resume Remote Wakeup Detected Interrupt                      */


/* USBHSCORE_GRXSTSR: Receive Status Debug Read Register */
  #define USBHSCORE_GRXSTSR_ResetValue (0x00000000UL) /*!< Reset value of GRXSTSR register.                                    */

/* CHNUM @Bits 0..3 : Channel Number (ChNum) */
  #define USBHSCORE_GRXSTSR_CHNUM_Pos (0UL)          /*!< Position of CHNUM field.                                             */
  #define USBHSCORE_GRXSTSR_CHNUM_Msk (0xFUL << USBHSCORE_GRXSTSR_CHNUM_Pos) /*!< Bit mask of CHNUM field.                     */
  #define USBHSCORE_GRXSTSR_CHNUM_Min (0x0UL)        /*!< Min enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSR_CHNUM_Max (0xFUL)        /*!< Max enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP0 (0x0UL)      /*!< Channel or EndPoint 0                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP1 (0x1UL)      /*!< Channel or EndPoint 1                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP2 (0x2UL)      /*!< Channel or EndPoint 2                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP3 (0x3UL)      /*!< Channel or EndPoint 3                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP4 (0x4UL)      /*!< Channel or EndPoint 4                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP5 (0x5UL)      /*!< Channel or EndPoint 5                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP6 (0x6UL)      /*!< Channel or EndPoint 6                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP7 (0x7UL)      /*!< Channel or EndPoint 7                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP8 (0x8UL)      /*!< Channel or EndPoint 8                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP9 (0x9UL)      /*!< Channel or EndPoint 9                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP10 (0xAUL)     /*!< Channel or EndPoint 10                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP11 (0xBUL)     /*!< Channel or EndPoint 11                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP12 (0xCUL)     /*!< Channel or EndPoint 12                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP13 (0xDUL)     /*!< Channel or EndPoint 13                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP14 (0xEUL)     /*!< Channel or EndPoint 14                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP15 (0xFUL)     /*!< Channel or EndPoint 15                                               */

/* BCNT @Bits 4..14 : Byte Count (BCnt) */
  #define USBHSCORE_GRXSTSR_BCNT_Pos (4UL)           /*!< Position of BCNT field.                                              */
  #define USBHSCORE_GRXSTSR_BCNT_Msk (0x7FFUL << USBHSCORE_GRXSTSR_BCNT_Pos) /*!< Bit mask of BCNT field.                      */

/* DPID @Bits 15..16 : Data PID (DPID) */
  #define USBHSCORE_GRXSTSR_DPID_Pos (15UL)          /*!< Position of DPID field.                                              */
  #define USBHSCORE_GRXSTSR_DPID_Msk (0x3UL << USBHSCORE_GRXSTSR_DPID_Pos) /*!< Bit mask of DPID field.                        */
  #define USBHSCORE_GRXSTSR_DPID_Min (0x0UL)         /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSR_DPID_Max (0x3UL)         /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSR_DPID_DATA0 (0x0UL)       /*!< DATA0                                                                */
  #define USBHSCORE_GRXSTSR_DPID_DATA2 (0x1UL)       /*!< DATA2                                                                */
  #define USBHSCORE_GRXSTSR_DPID_DATA1 (0x2UL)       /*!< DATA1                                                                */
  #define USBHSCORE_GRXSTSR_DPID_MDATA (0x3UL)       /*!< MDATA                                                                */

