adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PKTSTS @Bits 17..20 : Packet Status (PktSts) indicates the status of the received packet. */
  #define USBHSCORE_GRXSTSP_PKTSTS_Pos (17UL)        /*!< Position of PKTSTS field.                                            */
  #define USBHSCORE_GRXSTSP_PKTSTS_Msk (0xFUL << USBHSCORE_GRXSTSP_PKTSTS_Pos) /*!< Bit mask of PKTSTS field.                  */
  #define USBHSCORE_GRXSTSP_PKTSTS_Min (0x1UL)       /*!< Min enumerator value of PKTSTS field.                                */
  #define USBHSCORE_GRXSTSP_PKTSTS_Max (0x5UL)       /*!< Max enumerator value of PKTSTS field.                                */
  #define USBHSCORE_GRXSTSP_PKTSTS_OUTNAK (0x1UL)    /*!< Global OUT NAK in device mode (triggers an interrupt)                */
  #define USBHSCORE_GRXSTSP_PKTSTS_INOUTDPRX (0x2UL) /*!< IN data packet received in host mode and OUT data packet received in
                                                          device mode*/
  #define USBHSCORE_GRXSTSP_PKTSTS_INOUTTRCOM (0x3UL) /*!< IN or OUT transfer completed in both host and device mode (triggers
                                                           an interrupt)*/
  #define USBHSCORE_GRXSTSP_PKTSTS_DSETUPCOM (0x4UL) /*!< SETUP transaction completed in device mode (triggers an interrupt)   */
  #define USBHSCORE_GRXSTSP_PKTSTS_DTTOG (0x5UL)     /*!< Data toggle error (triggers an interrupt) in host mode               */

/* FN @Bits 21..24 : Mode: Device only. Frame Number (FN) */
  #define USBHSCORE_GRXSTSP_FN_Pos (21UL)            /*!< Position of FN field.                                                */
  #define USBHSCORE_GRXSTSP_FN_Msk (0xFUL << USBHSCORE_GRXSTSP_FN_Pos) /*!< Bit mask of FN field.                              */


/* USBHSCORE_GRXFSIZ: Receive FIFO Size Register */
  #define USBHSCORE_GRXFSIZ_ResetValue (0x00000224UL) /*!< Reset value of GRXFSIZ register.                                    */

/* RXFDEP @Bits 0..9 : Mode: Host and Device. RxFIFO Depth (RxFDep) */
  #define USBHSCORE_GRXFSIZ_RXFDEP_Pos (0UL)         /*!< Position of RXFDEP field.                                            */
  #define USBHSCORE_GRXFSIZ_RXFDEP_Msk (0x3FFUL << USBHSCORE_GRXFSIZ_RXFDEP_Pos) /*!< Bit mask of RXFDEP field.                */


/* USBHSCORE_GNPTXFSIZ: Non-periodic Transmit FIFO Size Register */
  #define USBHSCORE_GNPTXFSIZ_ResetValue (0x02000224UL) /*!< Reset value of GNPTXFSIZ register.                                */

/* NPTXFSTADDR @Bits 0..9 : Non-periodic Transmit RAM Start Address (NPTxFStAddr) */
  #define USBHSCORE_GNPTXFSIZ_NPTXFSTADDR_Pos (0UL)  /*!< Position of NPTXFSTADDR field.                                       */
  #define USBHSCORE_GNPTXFSIZ_NPTXFSTADDR_Msk (0x3FFUL << USBHSCORE_GNPTXFSIZ_NPTXFSTADDR_Pos) /*!< Bit mask of NPTXFSTADDR
                                                                            field.*/

/* NPTXFDEP @Bits 16..25 : Mode: Host only. Non-periodic TxFIFO Depth (NPTxFDep) */
  #define USBHSCORE_GNPTXFSIZ_NPTXFDEP_Pos (16UL)    /*!< Position of NPTXFDEP field.                                          */
  #define USBHSCORE_GNPTXFSIZ_NPTXFDEP_Msk (0x3FFUL << USBHSCORE_GNPTXFSIZ_NPTXFDEP_Pos) /*!< Bit mask of NPTXFDEP field.      */


/* USBHSCORE_GNPTXSTS: Non-periodic Transmit FIFO/Queue Status Register */
  #define USBHSCORE_GNPTXSTS_ResetValue (0x00080200UL) /*!< Reset value of GNPTXSTS register.                                  */

/* NPTXFSPCAVAIL @Bits 0..15 : Non-periodic TxFIFO Space Avail (NPTxFSpcAvail) */
  #define USBHSCORE_GNPTXSTS_NPTXFSPCAVAIL_Pos (0UL) /*!< Position of NPTXFSPCAVAIL field.                                     */
  #define USBHSCORE_GNPTXSTS_NPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_GNPTXSTS_NPTXFSPCAVAIL_Pos) /*!< Bit mask of NPTXFSPCAVAIL
                                                                            field.*/

/* NPTXQSPCAVAIL @Bits 16..23 : Non-periodic Transmit Request Queue Space Available (NPTxQSpcAvail) */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Pos (16UL) /*!< Position of NPTXQSPCAVAIL field.                                    */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Msk (0xFFUL << USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Pos) /*!< Bit mask of NPTXQSPCAVAIL
                                                                            field.*/
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Min (0x0UL) /*!< Min enumerator value of NPTXQSPCAVAIL field.                       */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Max (0x8UL) /*!< Max enumerator value of NPTXQSPCAVAIL field.                       */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_FULL (0x00UL) /*!< Non-periodic Transmit Request Queue is full                      */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE1 (0x01UL) /*!< 1 location available                                             */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE2 (0x02UL) /*!< 2 locations available                                            */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE3 (0x03UL) /*!< 3 locations available                                            */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE4 (0x04UL) /*!< 4 locations available                                            */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE5 (0x05UL) /*!< 5 locations available                                            */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE6 (0x06UL) /*!< 6 locations available                                            */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE7 (0x07UL) /*!< 7 locations available                                            */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE8 (0x08UL) /*!< 8 locations available                                            */

/* NPTXQTOP @Bits 24..30 : Top of the Non-periodic Transmit Request Queue (NPTxQTop) */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_Pos (24UL)     /*!< Position of NPTXQTOP field.                                          */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_Msk (0x7FUL << USBHSCORE_GNPTXSTS_NPTXQTOP_Pos) /*!< Bit mask of NPTXQTOP field.         */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_Min (0x0UL)    /*!< Min enumerator value of NPTXQTOP field.                              */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_Max (0x3UL)    /*!< Max enumerator value of NPTXQTOP field.                              */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_INOUTTK (0x00UL) /*!< IN/OUT token                                                       */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_ZEROTX (0x01UL) /*!< Zero-length transmit packet (device IN/host OUT)                    */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_PINGCSPLIT (0x02UL) /*!< PING/CSPLIT token                                               */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_CHNHALT (0x03UL) /*!< Channel halt command                                               */


/* USBHSCORE_GGPIO: General Purpose Input/Output Register */
  #define USBHSCORE_GGPIO_ResetValue (0x00000000UL)  /*!< Reset value of GGPIO register.                                       */

/* GPI @Bits 0..15 : (unspecified) */
  #define USBHSCORE_GGPIO_GPI_Pos (0UL)              /*!< Position of GPI field.                                               */
  #define USBHSCORE_GGPIO_GPI_Msk (0xFFFFUL << USBHSCORE_GGPIO_GPI_Pos) /*!< Bit mask of GPI field.                            */

/* GPO @Bits 16..31 : (unspecified) */
  #define USBHSCORE_GGPIO_GPO_Pos (16UL)             /*!< Position of GPO field.                                               */
  #define USBHSCORE_GGPIO_GPO_Msk (0xFFFFUL << USBHSCORE_GGPIO_GPO_Pos) /*!< Bit mask of GPO field.                            */


/* USBHSCORE_GUID: User ID Register */
  #define USBHSCORE_GUID_ResetValue (0x00000000UL)   /*!< Reset value of GUID register.                                        */

/* GUID @Bits 0..31 : User ID (UserID) Application-programmable ID field. */
  #define USBHSCORE_GUID_GUID_Pos (0UL)              /*!< Position of GUID field.                                              */
  #define USBHSCORE_GUID_GUID_Msk (0xFFFFFFFFUL << USBHSCORE_GUID_GUID_Pos) /*!< Bit mask of GUID field.                       */


