adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* USBHSCORE_GSNPSID: Synopsys ID Register */
  #define USBHSCORE_GSNPSID_ResetValue (0x4F54430AUL) /*!< Reset value of GSNPSID register.                                    */

/* SYNOPSYSID @Bits 0..31 : Release number of the controller being used currently. */
  #define USBHSCORE_GSNPSID_SYNOPSYSID_Pos (0UL)     /*!< Position of SYNOPSYSID field.                                        */
  #define USBHSCORE_GSNPSID_SYNOPSYSID_Msk (0xFFFFFFFFUL << USBHSCORE_GSNPSID_SYNOPSYSID_Pos) /*!< Bit mask of SYNOPSYSID
                                                                            field.*/


/* USBHSCORE_GHWCFG1: User Hardware Configuration 1 Register */
  #define USBHSCORE_GHWCFG1_ResetValue (0xAA555000UL) /*!< Reset value of GHWCFG1 register.                                    */

/* EPDIR @Bits 0..31 : This 32-bit field uses two bits per */
  #define USBHSCORE_GHWCFG1_EPDIR_Pos (0UL)          /*!< Position of EPDIR field.                                             */
  #define USBHSCORE_GHWCFG1_EPDIR_Msk (0xFFFFFFFFUL << USBHSCORE_GHWCFG1_EPDIR_Pos) /*!< Bit mask of EPDIR field.              */


/* USBHSCORE_GHWCFG2: User Hardware Configuration 2 Register */
  #define USBHSCORE_GHWCFG2_ResetValue (0x228BFC72UL) /*!< Reset value of GHWCFG2 register.                                    */

/* OTGMODE @Bits 0..2 : Mode of Operation (OtgMode) */
  #define USBHSCORE_GHWCFG2_OTGMODE_Pos (0UL)        /*!< Position of OTGMODE field.                                           */
  #define USBHSCORE_GHWCFG2_OTGMODE_Msk (0x7UL << USBHSCORE_GHWCFG2_OTGMODE_Pos) /*!< Bit mask of OTGMODE field.               */
  #define USBHSCORE_GHWCFG2_OTGMODE_Min (0x0UL)      /*!< Min enumerator value of OTGMODE field.                               */
  #define USBHSCORE_GHWCFG2_OTGMODE_Max (0x6UL)      /*!< Max enumerator value of OTGMODE field.                               */
  #define USBHSCORE_GHWCFG2_OTGMODE_HNPSRP (0x0UL)   /*!< HNP- and SRP-Capable OTG (Host and Device)                           */
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPOTG (0x1UL)   /*!< SRP-Capable OTG (Host and Device)                                    */
  #define USBHSCORE_GHWCFG2_OTGMODE_NHNPNSRP (0x2UL) /*!< Non-HNP and Non-SRP Capable OTG (Host and Device)                    */
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPCAPD (0x3UL)  /*!< SRP-Capable Device                                                   */
  #define USBHSCORE_GHWCFG2_OTGMODE_NONOTGD (0x4UL)  /*!< Non-OTG Device                                                       */
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPCAPH (0x5UL)  /*!< SRP-Capable Host                                                     */
  #define USBHSCORE_GHWCFG2_OTGMODE_NONOTGH (0x6UL)  /*!< Non-OTG Host                                                         */

/* OTGARCH @Bits 3..4 : Architecture (OtgArch) */
  #define USBHSCORE_GHWCFG2_OTGARCH_Pos (3UL)        /*!< Position of OTGARCH field.                                           */
  #define USBHSCORE_GHWCFG2_OTGARCH_Msk (0x3UL << USBHSCORE_GHWCFG2_OTGARCH_Pos) /*!< Bit mask of OTGARCH field.               */
  #define USBHSCORE_GHWCFG2_OTGARCH_Min (0x0UL)      /*!< Min enumerator value of OTGARCH field.                               */
  #define USBHSCORE_GHWCFG2_OTGARCH_Max (0x2UL)      /*!< Max enumerator value of OTGARCH field.                               */
  #define USBHSCORE_GHWCFG2_OTGARCH_SLAVEMODE (0x0UL) /*!< Slave Mode                                                          */
  #define USBHSCORE_GHWCFG2_OTGARCH_EXTERNALDMA (0x1UL) /*!< External DMA Mode                                                 */
  #define USBHSCORE_GHWCFG2_OTGARCH_INTERNALDMA (0x2UL) /*!< Internal DMA Mode                                                 */

/* SINGPNT @Bit 5 : Point-to-Point (SingPnt) */
  #define USBHSCORE_GHWCFG2_SINGPNT_Pos (5UL)        /*!< Position of SINGPNT field.                                           */
  #define USBHSCORE_GHWCFG2_SINGPNT_Msk (0x1UL << USBHSCORE_GHWCFG2_SINGPNT_Pos) /*!< Bit mask of SINGPNT field.               */
  #define USBHSCORE_GHWCFG2_SINGPNT_Min (0x0UL)      /*!< Min enumerator value of SINGPNT field.                               */
  #define USBHSCORE_GHWCFG2_SINGPNT_Max (0x1UL)      /*!< Max enumerator value of SINGPNT field.                               */
  #define USBHSCORE_GHWCFG2_SINGPNT_MULTIPOINT (0x0UL) /*!< Multi-point application (hub and split support)                    */
  #define USBHSCORE_GHWCFG2_SINGPNT_SINGLEPOINT (0x1UL) /*!< Single-point application (no hub and split support)               */

/* HSPHYTYPE @Bits 6..7 : High-Speed PHY Interface Type (HSPhyType) */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Pos (6UL)      /*!< Position of HSPHYTYPE field.                                         */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Msk (0x3UL << USBHSCORE_GHWCFG2_HSPHYTYPE_Pos) /*!< Bit mask of HSPHYTYPE field.         */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Min (0x0UL)    /*!< Min enumerator value of HSPHYTYPE field.                             */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Max (0x3UL)    /*!< Max enumerator value of HSPHYTYPE field.                             */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_NOHS (0x0UL)   /*!< High-Speed interface not supported                                   */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_UTMIPLUS (0x1UL) /*!< High Speed Interface UTMI+ is supported                            */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_ULPI (0x2UL)   /*!< High Speed Interface ULPI is supported                               */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_UTMIPUSULPI (0x3UL) /*!< High Speed Interfaces UTMI+ and ULPI is supported               */

/* FSPHYTYPE @Bits 8..9 : Full-Speed PHY Interface Type (FSPhyType) */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Pos (8UL)      /*!< Position of FSPHYTYPE field.                                         */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Msk (0x3UL << USBHSCORE_GHWCFG2_FSPHYTYPE_Pos) /*!< Bit mask of FSPHYTYPE field.         */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Min (0x0UL)    /*!< Min enumerator value of FSPHYTYPE field.                             */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Max (0x3UL)    /*!< Max enumerator value of FSPHYTYPE field.                             */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_NO_FS (0x0UL)  /*!< Full-speed interface not supported                                   */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FS (0x1UL)     /*!< Dedicated full-speed interface is supported                          */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FSPLUSUTMI (0x2UL) /*!< FS pins shared with UTMI+ pins is supported                      */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FSPLUSULPI (0x3UL) /*!< FS pins shared with ULPI pins is supported                       */

/* NUMDEVEPS @Bits 10..13 : Number of Device Endpoints (NumDevEps) */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Pos (10UL)     /*!< Position of NUMDEVEPS field.                                         */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Msk (0xFUL << USBHSCORE_GHWCFG2_NUMDEVEPS_Pos) /*!< Bit mask of NUMDEVEPS field.         */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Min (0x0UL)    /*!< Min enumerator value of NUMDEVEPS field.                             */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Max (0xFUL)    /*!< Max enumerator value of NUMDEVEPS field.                             */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT0 (0x0UL) /*!< End point 0                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT1 (0x1UL) /*!< End point 1                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT2 (0x2UL) /*!< End point 2                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT3 (0x3UL) /*!< End point 3                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT4 (0x4UL) /*!< End point 4                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT5 (0x5UL) /*!< End point 5                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT6 (0x6UL) /*!< End point 6                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT7 (0x7UL) /*!< End point 7                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT8 (0x8UL) /*!< End point 8                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT9 (0x9UL) /*!< End point 9                                                          */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT10 (0xAUL) /*!< End point 10                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT11 (0xBUL) /*!< End point 11                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT12 (0xCUL) /*!< End point 12                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT13 (0xDUL) /*!< End point 13                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT14 (0xEUL) /*!< End point 14                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT15 (0xFUL) /*!< End point 15                                                        */

/* NUMHSTCHNL @Bits 14..17 : Number of Host Channels (NumHstChnl) */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Pos (14UL)    /*!< Position of NUMHSTCHNL field.                                        */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Msk (0xFUL << USBHSCORE_GHWCFG2_NUMHSTCHNL_Pos) /*!< Bit mask of NUMHSTCHNL field.      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Min (0x0UL)   /*!< Min enumerator value of NUMHSTCHNL field.                            */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Max (0xFUL)   /*!< Max enumerator value of NUMHSTCHNL field.                            */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH0 (0x0UL) /*!< Host Channel 1                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH1 (0x1UL) /*!< Host Channel 2                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH2 (0x2UL) /*!< Host Channel 3                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH3 (0x3UL) /*!< Host Channel 4                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH4 (0x4UL) /*!< Host Channel 5                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH5 (0x5UL) /*!< Host Channel 6                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH6 (0x6UL) /*!< Host Channel 7                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH7 (0x7UL) /*!< Host Channel 8                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH8 (0x8UL) /*!< Host Channel 9                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH9 (0x9UL) /*!< Host Channel 10                                                    */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH10 (0xAUL) /*!< Host Channel 11                                                   */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH11 (0xBUL) /*!< Host Channel 12                                                   */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH12 (0xCUL) /*!< Host Channel 13                                                   */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH13 (0xDUL) /*!< Host Channel 14                                                   */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH14 (0xEUL) /*!< Host Channel 15                                                   */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH15 (0xFUL) /*!< Host Channel 16                                                   */

/* PERIOSUPPORT @Bit 18 : Periodic OUT Channels Supported in Host Mode (PerioSupport) */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Pos (18UL)  /*!< Position of PERIOSUPPORT field.                                      */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Msk (0x1UL << USBHSCORE_GHWCFG2_PERIOSUPPORT_Pos) /*!< Bit mask of PERIOSUPPORT field.*/
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Min (0x0UL) /*!< Min enumerator value of PERIOSUPPORT field.                          */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Max (0x1UL) /*!< Max enumerator value of PERIOSUPPORT field.                          */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_DISABLED (0x0UL) /*!< Periodic OUT Channels is not supported in Host Mode             */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_ENABLED (0x1UL) /*!< Periodic OUT Channels Supported in Host Mode Supported           */

/* DYNFIFOSIZING @Bit 19 : Dynamic FIFO Sizing Enabled (DynFifoSizing) */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Pos (19UL) /*!< Position of DYNFIFOSIZING field.                                     */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Msk (0x1UL << USBHSCORE_GHWCFG2_DYNFIFOSIZING_Pos) /*!< Bit mask of DYNFIFOSIZING
                                                                            field.*/
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Min (0x0UL) /*!< Min enumerator value of DYNFIFOSIZING field.                        */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Max (0x1UL) /*!< Max enumerator value of DYNFIFOSIZING field.                        */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_DISABLED (0x0UL) /*!< Dynamic FIFO Sizing Disabled                                   */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_ENABLED (0x1UL) /*!< Dynamic FIFO Sizing Enabled                                     */

