adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* MULTIPROCINTRPT @Bit 20 : Multi Processor Interrupt Enabled (MultiProcIntrpt) */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Pos (20UL) /*!< Position of MULTIPROCINTRPT field.                                 */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Msk (0x1UL << USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Pos) /*!< Bit mask of
                                                                            MULTIPROCINTRPT field.*/
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Min (0x0UL) /*!< Min enumerator value of MULTIPROCINTRPT field.                    */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Max (0x1UL) /*!< Max enumerator value of MULTIPROCINTRPT field.                    */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_DISABLED (0x0UL) /*!< No Multi Processor Interrupt Enabled                         */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_ENABLED (0x1UL) /*!< Multi Processor Interrupt Enabled                             */

/* NPTXQDEPTH @Bits 22..23 : Non-periodic Request Queue Depth (NPTxQDepth) */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Pos (22UL)    /*!< Position of NPTXQDEPTH field.                                        */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Msk (0x3UL << USBHSCORE_GHWCFG2_NPTXQDEPTH_Pos) /*!< Bit mask of NPTXQDEPTH field.      */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Min (0x0UL)   /*!< Min enumerator value of NPTXQDEPTH field.                            */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Max (0x2UL)   /*!< Max enumerator value of NPTXQDEPTH field.                            */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_TWO (0x0UL)   /*!< Queue size 2                                                         */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_FOUR (0x1UL)  /*!< Queue size 4                                                         */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_EIGHT (0x2UL) /*!< Queue size 8                                                         */

/* PTXQDEPTH @Bits 24..25 : Host Mode Periodic Request Queue Depth (PTxQDepth) */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Pos (24UL)     /*!< Position of PTXQDEPTH field.                                         */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Msk (0x3UL << USBHSCORE_GHWCFG2_PTXQDEPTH_Pos) /*!< Bit mask of PTXQDEPTH field.         */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Min (0x0UL)    /*!< Min enumerator value of PTXQDEPTH field.                             */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Max (0x3UL)    /*!< Max enumerator value of PTXQDEPTH field.                             */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE2 (0x0UL)   /*!< Queue Depth 2                                                        */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE4 (0x1UL)   /*!< Queue Depth 4                                                        */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE8 (0x2UL)   /*!< Queue Depth 8                                                        */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE16 (0x3UL)  /*!< Queue Depth 16                                                       */

/* TKNQDEPTH @Bits 26..30 : Device Mode IN Token Sequence Learning Queue Depth (TknQDepth) */
  #define USBHSCORE_GHWCFG2_TKNQDEPTH_Pos (26UL)     /*!< Position of TKNQDEPTH field.                                         */
  #define USBHSCORE_GHWCFG2_TKNQDEPTH_Msk (0x1FUL << USBHSCORE_GHWCFG2_TKNQDEPTH_Pos) /*!< Bit mask of TKNQDEPTH field.        */


/* USBHSCORE_GHWCFG3: User Hardware Configuration 3 Register */
  #define USBHSCORE_GHWCFG3_ResetValue (0x0BEAC0E8UL) /*!< Reset value of GHWCFG3 register.                                    */

/* XFERSIZEWIDTH @Bits 0..3 : Width of Transfer Size Counters (XferSizeWidth) */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Pos (0UL)  /*!< Position of XFERSIZEWIDTH field.                                     */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Msk (0xFUL << USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Pos) /*!< Bit mask of XFERSIZEWIDTH
                                                                            field.*/
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Min (0x0UL) /*!< Min enumerator value of XFERSIZEWIDTH field.                        */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Max (0x8UL) /*!< Max enumerator value of XFERSIZEWIDTH field.                        */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH11 (0x0UL) /*!< Width of Transfer Size Counter 11 bits                          */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH12 (0x1UL) /*!< Width of Transfer Size Counter 12 bits                          */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH13 (0x2UL) /*!< Width of Transfer Size Counter 13 bits                          */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH14 (0x3UL) /*!< Width of Transfer Size Counter 14 bits                          */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH15 (0x4UL) /*!< Width of Transfer Size Counter 15 bits                          */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH16 (0x5UL) /*!< Width of Transfer Size Counter 16 bits                          */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH17 (0x6UL) /*!< Width of Transfer Size Counter 17 bits                          */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH18 (0x7UL) /*!< Width of Transfer Size Counter 18 bits                          */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH19 (0x8UL) /*!< Width of Transfer Size Counter 19 bits                          */

/* PKTSIZEWIDTH @Bits 4..6 : Width of Packet Size Counters (PktSizeWidth) */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Pos (4UL)   /*!< Position of PKTSIZEWIDTH field.                                      */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Msk (0x7UL << USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Pos) /*!< Bit mask of PKTSIZEWIDTH field.*/
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Min (0x0UL) /*!< Min enumerator value of PKTSIZEWIDTH field.                          */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Max (0x6UL) /*!< Max enumerator value of PKTSIZEWIDTH field.                          */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS4 (0x0UL) /*!< Width of Packet Size Counter 4                                     */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS5 (0x1UL) /*!< Width of Packet Size Counter 5                                     */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS6 (0x2UL) /*!< Width of Packet Size Counter 6                                     */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS7 (0x3UL) /*!< Width of Packet Size Counter 7                                     */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS8 (0x4UL) /*!< Width of Packet Size Counter 8                                     */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS9 (0x5UL) /*!< Width of Packet Size Counter 9                                     */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS10 (0x6UL) /*!< Width of Packet Size Counter 10                                   */

/* OTGEN @Bit 7 : OTG Function Enabled (OtgEn) */
  #define USBHSCORE_GHWCFG3_OTGEN_Pos (7UL)          /*!< Position of OTGEN field.                                             */
  #define USBHSCORE_GHWCFG3_OTGEN_Msk (0x1UL << USBHSCORE_GHWCFG3_OTGEN_Pos) /*!< Bit mask of OTGEN field.                     */
  #define USBHSCORE_GHWCFG3_OTGEN_Min (0x0UL)        /*!< Min enumerator value of OTGEN field.                                 */
  #define USBHSCORE_GHWCFG3_OTGEN_Max (0x1UL)        /*!< Max enumerator value of OTGEN field.                                 */
  #define USBHSCORE_GHWCFG3_OTGEN_DISABLED (0x0UL)   /*!< Not OTG Capable                                                      */
  #define USBHSCORE_GHWCFG3_OTGEN_ENABLED (0x1UL)    /*!< OTG Capable                                                          */

