adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* USBHSCORE_DCTL: Device Control Register */
  #define USBHSCORE_DCTL_ResetValue (0x00000002UL)   /*!< Reset value of DCTL register.                                        */

/* RMTWKUPSIG @Bit 0 : Remote Wakeup Signaling (RmtWkUpSig) */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Pos (0UL)        /*!< Position of RMTWKUPSIG field.                                        */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Msk (0x1UL << USBHSCORE_DCTL_RMTWKUPSIG_Pos) /*!< Bit mask of RMTWKUPSIG field.            */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Min (0x0UL)      /*!< Min enumerator value of RMTWKUPSIG field.                            */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Max (0x1UL)      /*!< Max enumerator value of RMTWKUPSIG field.                            */
  #define USBHSCORE_DCTL_RMTWKUPSIG_DISABLEDRMWKUP (0x0UL) /*!< Core does not send Remote Wakeup Signaling                     */
  #define USBHSCORE_DCTL_RMTWKUPSIG_ENABLERMWKUP (0x1UL) /*!< Core sends Remote Wakeup Signaling                               */

/* SFTDISCON @Bit 1 : Soft Disconnect (SftDiscon) */
  #define USBHSCORE_DCTL_SFTDISCON_Pos (1UL)         /*!< Position of SFTDISCON field.                                         */
  #define USBHSCORE_DCTL_SFTDISCON_Msk (0x1UL << USBHSCORE_DCTL_SFTDISCON_Pos) /*!< Bit mask of SFTDISCON field.               */
  #define USBHSCORE_DCTL_SFTDISCON_Min (0x0UL)       /*!< Min enumerator value of SFTDISCON field.                             */
  #define USBHSCORE_DCTL_SFTDISCON_Max (0x1UL)       /*!< Max enumerator value of SFTDISCON field.                             */
  #define USBHSCORE_DCTL_SFTDISCON_NODISCONNECT (0x0UL) /*!< The core drives the phy_opmode_o signal on the UTMI+ to 2'b00,
                                                             which generates a device connect event to the USB host*/
  #define USBHSCORE_DCTL_SFTDISCON_DISCONNECT (0x1UL) /*!< The core drives the phy_opmode_o signal on the UTMI+ to 2'b01, which
                                                           generates a device disconnect event to the USB host*/

/* GNPINNAKSTS @Bit 2 : Global Non-periodic IN NAK Status (GNPINNakSts) */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Pos (2UL)       /*!< Position of GNPINNAKSTS field.                                       */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Msk (0x1UL << USBHSCORE_DCTL_GNPINNAKSTS_Pos) /*!< Bit mask of GNPINNAKSTS field.         */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Min (0x0UL)     /*!< Min enumerator value of GNPINNAKSTS field.                           */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Max (0x1UL)     /*!< Max enumerator value of GNPINNAKSTS field.                           */
  #define USBHSCORE_DCTL_GNPINNAKSTS_INACTIVE (0x0UL) /*!< A handshake is sent out based on the data availability in the
                                                           transmit FIFO*/
  #define USBHSCORE_DCTL_GNPINNAKSTS_ACTIVE (0x1UL)  /*!< A NAK handshake is sent out on all non-periodic IN endpoints,
                                                          irrespective of the data availability in the transmit FIFO.*/

/* GOUTNAKSTS @Bit 3 : Global OUT NAK Status (GOUTNakSts) */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Pos (3UL)        /*!< Position of GOUTNAKSTS field.                                        */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Msk (0x1UL << USBHSCORE_DCTL_GOUTNAKSTS_Pos) /*!< Bit mask of GOUTNAKSTS field.            */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Min (0x0UL)      /*!< Min enumerator value of GOUTNAKSTS field.                            */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Max (0x1UL)      /*!< Max enumerator value of GOUTNAKSTS field.                            */
  #define USBHSCORE_DCTL_GOUTNAKSTS_INACTIVE (0x0UL) /*!< A handshake is sent based on the FIFO Status and the NAK and STALL bit
                                                          settings.*/
  #define USBHSCORE_DCTL_GOUTNAKSTS_ACTIVE (0x1UL)   /*!< No data is written to the RxFIFO, irrespective of space availability.
                                                          Sends a NAK handshake on all packets, except on SETUP transactions.
                                                          All isochronous OUT packets are dropped.*/

/* TSTCTL @Bits 4..6 : Test Control (TstCtl) */
  #define USBHSCORE_DCTL_TSTCTL_Pos (4UL)            /*!< Position of TSTCTL field.                                            */
  #define USBHSCORE_DCTL_TSTCTL_Msk (0x7UL << USBHSCORE_DCTL_TSTCTL_Pos) /*!< Bit mask of TSTCTL field.                        */
  #define USBHSCORE_DCTL_TSTCTL_Min (0x0UL)          /*!< Min enumerator value of TSTCTL field.                                */
  #define USBHSCORE_DCTL_TSTCTL_Max (0x5UL)          /*!< Max enumerator value of TSTCTL field.                                */
  #define USBHSCORE_DCTL_TSTCTL_DISABLED (0x0UL)     /*!< Test mode disabled                                                   */
  #define USBHSCORE_DCTL_TSTCTL_TESTJ (0x1UL)        /*!< Test_J mode                                                          */
  #define USBHSCORE_DCTL_TSTCTL_TESTK (0x2UL)        /*!< Test_K mode                                                          */
  #define USBHSCORE_DCTL_TSTCTL_TESTSN (0x3UL)       /*!< Test_SE0_NAK mode                                                    */
  #define USBHSCORE_DCTL_TSTCTL_TESTPM (0x4UL)       /*!< Test_Packet mode                                                     */
  #define USBHSCORE_DCTL_TSTCTL_TESTFE (0x5UL)       /*!< Test_force_Enable                                                    */

/* SGNPINNAK @Bit 7 : Set Global Non-periodic IN NAK (SGNPInNak) */
  #define USBHSCORE_DCTL_SGNPINNAK_Pos (7UL)         /*!< Position of SGNPINNAK field.                                         */
  #define USBHSCORE_DCTL_SGNPINNAK_Msk (0x1UL << USBHSCORE_DCTL_SGNPINNAK_Pos) /*!< Bit mask of SGNPINNAK field.               */
  #define USBHSCORE_DCTL_SGNPINNAK_Min (0x0UL)       /*!< Min enumerator value of SGNPINNAK field.                             */
  #define USBHSCORE_DCTL_SGNPINNAK_Max (0x1UL)       /*!< Max enumerator value of SGNPINNAK field.                             */
  #define USBHSCORE_DCTL_SGNPINNAK_DISABLE (0x0UL)   /*!< Disable Global Non-periodic IN NAK                                   */
  #define USBHSCORE_DCTL_SGNPINNAK_ENABLE (0x1UL)    /*!< Set Global Non-periodic IN NAK                                       */

/* CGNPINNAK @Bit 8 : Clear Global Non-periodic IN NAK (CGNPInNak) */
  #define USBHSCORE_DCTL_CGNPINNAK_Pos (8UL)         /*!< Position of CGNPINNAK field.                                         */
  #define USBHSCORE_DCTL_CGNPINNAK_Msk (0x1UL << USBHSCORE_DCTL_CGNPINNAK_Pos) /*!< Bit mask of CGNPINNAK field.               */
  #define USBHSCORE_DCTL_CGNPINNAK_Min (0x0UL)       /*!< Min enumerator value of CGNPINNAK field.                             */
  #define USBHSCORE_DCTL_CGNPINNAK_Max (0x1UL)       /*!< Max enumerator value of CGNPINNAK field.                             */
  #define USBHSCORE_DCTL_CGNPINNAK_DISABLE (0x0UL)   /*!< Disable Global Non-periodic IN NAK                                   */
  #define USBHSCORE_DCTL_CGNPINNAK_ENABLE (0x1UL)    /*!< Clear Global Non-periodic IN NAK                                     */

/* SGOUTNAK @Bit 9 : Set Global OUT NAK (SGOUTNak) */
  #define USBHSCORE_DCTL_SGOUTNAK_Pos (9UL)          /*!< Position of SGOUTNAK field.                                          */
  #define USBHSCORE_DCTL_SGOUTNAK_Msk (0x1UL << USBHSCORE_DCTL_SGOUTNAK_Pos) /*!< Bit mask of SGOUTNAK field.                  */
  #define USBHSCORE_DCTL_SGOUTNAK_Min (0x0UL)        /*!< Min enumerator value of SGOUTNAK field.                              */
  #define USBHSCORE_DCTL_SGOUTNAK_Max (0x1UL)        /*!< Max enumerator value of SGOUTNAK field.                              */
  #define USBHSCORE_DCTL_SGOUTNAK_DISABLED (0x0UL)   /*!< Disable Global OUT NAK                                               */
  #define USBHSCORE_DCTL_SGOUTNAK_ENABLED (0x1UL)    /*!< Set Global OUT NAK                                                   */

