adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* USBHSCORE_DAINTMSK: Device All Endpoints Interrupt Mask Register */
  #define USBHSCORE_DAINTMSK_ResetValue (0x00000000UL) /*!< Reset value of DAINTMSK register.                                  */

/* INEPMSK0 @Bit 0 : IN Endpoint 0 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Pos (0UL)      /*!< Position of INEPMSK0 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK0_Pos) /*!< Bit mask of INEPMSK0 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Min (0x0UL)    /*!< Min enumerator value of INEPMSK0 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Max (0x1UL)    /*!< Max enumerator value of INEPMSK0 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK0_MASK (0x0UL)   /*!< Mask IN Endpoint 0 Interrupt                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK0_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK1 @Bit 1 : IN Endpoint 1 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Pos (1UL)      /*!< Position of INEPMSK1 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK1_Pos) /*!< Bit mask of INEPMSK1 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Min (0x0UL)    /*!< Min enumerator value of INEPMSK1 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Max (0x1UL)    /*!< Max enumerator value of INEPMSK1 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK1_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK1_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK2 @Bit 2 : IN Endpoint 2 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Pos (2UL)      /*!< Position of INEPMSK2 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK2_Pos) /*!< Bit mask of INEPMSK2 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Min (0x0UL)    /*!< Min enumerator value of INEPMSK2 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Max (0x1UL)    /*!< Max enumerator value of INEPMSK2 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK2_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK2_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK3 @Bit 3 : IN Endpoint 3 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Pos (3UL)      /*!< Position of INEPMSK3 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK3_Pos) /*!< Bit mask of INEPMSK3 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Min (0x0UL)    /*!< Min enumerator value of INEPMSK3 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Max (0x1UL)    /*!< Max enumerator value of INEPMSK3 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK3_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK3_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK4 @Bit 4 : IN Endpoint 4 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Pos (4UL)      /*!< Position of INEPMSK4 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK4_Pos) /*!< Bit mask of INEPMSK4 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Min (0x0UL)    /*!< Min enumerator value of INEPMSK4 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Max (0x1UL)    /*!< Max enumerator value of INEPMSK4 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK4_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK4_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK5 @Bit 5 : IN Endpoint 5 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Pos (5UL)      /*!< Position of INEPMSK5 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK5_Pos) /*!< Bit mask of INEPMSK5 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Min (0x0UL)    /*!< Min enumerator value of INEPMSK5 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Max (0x1UL)    /*!< Max enumerator value of INEPMSK5 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK5_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK5_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK6 @Bit 6 : IN Endpoint 6 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Pos (6UL)      /*!< Position of INEPMSK6 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK6_Pos) /*!< Bit mask of INEPMSK6 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Min (0x0UL)    /*!< Min enumerator value of INEPMSK6 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Max (0x1UL)    /*!< Max enumerator value of INEPMSK6 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK6_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK6_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK7 @Bit 7 : IN Endpoint 7 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Pos (7UL)      /*!< Position of INEPMSK7 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK7_Pos) /*!< Bit mask of INEPMSK7 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Min (0x0UL)    /*!< Min enumerator value of INEPMSK7 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Max (0x1UL)    /*!< Max enumerator value of INEPMSK7 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK7_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK7_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

