adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* OPMODEXCVRSELCHIRPENCORRDIS @Bit 17 : Disable the STAR fix added for correcting Opmode and XcvrSel on UTMI Interface when
                                         reset is detected in suspend state. */

  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Pos (17UL) /*!< Position of OPMODEXCVRSELCHIRPENCORRDIS field.      */
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Pos)
                                                                            /*!< Bit mask of OPMODEXCVRSELCHIRPENCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Min (0x0UL) /*!< Min enumerator value of OPMODEXCVRSELCHIRPENCORRDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Max (0x1UL) /*!< Max enumerator value of OPMODEXCVRSELCHIRPENCORRDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_ENABLE_FIX (0x0UL) /*!< Valid Combination of Opmode and XcvrSel is
                                                                            driven when reset is detected in suspend state*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_DISABLE_FIX (0x1UL) /*!< Invalid Combination of Opmode and XcvrSel is
                                                                            driven when reset is detected in suspend state*/

/* TXVALIDDEASSERTIONCORRDIS @Bit 18 : Disable the STAR fix added for correcting Txvalid deassertion on UTMI Interface when soft
                                       disconnect is done. */

  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Pos (18UL) /*!< Position of TXVALIDDEASSERTIONCORRDIS field.          */
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Pos) /*!<
                                                                            Bit mask of TXVALIDDEASSERTIONCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Min (0x0UL) /*!< Min enumerator value of TXVALIDDEASSERTIONCORRDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Max (0x1UL) /*!< Max enumerator value of TXVALIDDEASSERTIONCORRDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_ENABLE_FIX (0x0UL) /*!< Txvalid is deasserted during soft disconnect
                                                                            after receiving Txready from the PHY*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_DISABLE_FIX (0x1UL) /*!< Txvalid is deasserted during soft disconnect
                                                                            without waiting for Txready from the PHY*/

/* HOSTNOXFERAFTERPRTDISFIXDIS @Bit 19 : Disable the STAR fix added for correcting Host behavior when port is disabled. */
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Pos (19UL) /*!< Position of HOSTNOXFERAFTERPRTDISFIXDIS field.      */
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Pos)
                                                                            /*!< Bit mask of HOSTNOXFERAFTERPRTDISFIXDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Min (0x0UL) /*!< Min enumerator value of HOSTNOXFERAFTERPRTDISFIXDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Max (0x1UL) /*!< Max enumerator value of HOSTNOXFERAFTERPRTDISFIXDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_ENABLE_FIX (0x0UL) /*!< Txvalid is not asserted when port is
                                                                            disabled*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_DISABLE_FIX (0x1UL) /*!< Txvalid can be asserted when port is
                                                                            disabled*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VDET1V0                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct VDET1V0_CONFIG ================================================== */
/**
  * @brief CONFIG [VDET1V0_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Voltage detector configuration                        */
  __IOM uint32_t  PWRGOODLVL;                        /*!< (@ 0x00000004) Power good detector threshold voltage level           */
} NRF_VDET1V0_CONFIG_Type;                           /*!< Size = 8 (0x008)                                                     */

/* VDET1V0_CONFIG_CFG: Voltage detector configuration */
  #define VDET1V0_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                       */

/* PWRGOODHYST @Bit 0 : Power good detector hysteresis setting */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_Pos (0UL)   /*!< Position of PWRGOODHYST field.                                       */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_Msk (0x1UL << VDET1V0_CONFIG_CFG_PWRGOODHYST_Pos) /*!< Bit mask of PWRGOODHYST field. */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_Min (0x0UL) /*!< Min enumerator value of PWRGOODHYST field.                           */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_Max (0x1UL) /*!< Max enumerator value of PWRGOODHYST field.                           */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_HystLow (0x0UL) /*!< Hysteresis is 1.16 percent of the configured PGD level           */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_HystHigh (0x1UL) /*!< Hysteresis is 2.33 percent of the configured PGD level          */


/* VDET1V0_CONFIG_PWRGOODLVL: Power good detector threshold voltage level */
  #define VDET1V0_CONFIG_PWRGOODLVL_ResetValue (0x00000011UL) /*!< Reset value of PWRGOODLVL register.                         */

/* VAL @Bits 0..5 : Threshold voltage value */
  #define VDET1V0_CONFIG_PWRGOODLVL_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDET1V0_CONFIG_PWRGOODLVL_VAL_Msk (0x3FUL << VDET1V0_CONFIG_PWRGOODLVL_VAL_Pos) /*!< Bit mask of VAL field.          */



/* =================================================== Struct VDET1V0_TRIM =================================================== */
/**
  * @brief TRIM [VDET1V0_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Power good detector trimming                          */
} NRF_VDET1V0_TRIM_Type;                             /*!< Size = 4 (0x004)                                                     */

/* VDET1V0_TRIM_PWRGOOD: Power good detector trimming */
  #define VDET1V0_TRIM_PWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of PWRGOOD register.                                 */

