adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define VDET1V0_DFT_DTB0CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VDET1V0_DFT_DTB0CONFIG_EN_Msk (0x1UL << VDET1V0_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VDET1V0_DFT_DTB0CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_DFT_DTB0CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define VDET1V0_DFT_DTB0CONFIG_EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */


/* VDET1V0_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VDET1V0_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                            */

/* SELMUX @Bit 0 : Select multiplexer for DTB1 */
  #define VDET1V0_DFT_DTB1CONFIG_SELMUX_Pos (0UL)    /*!< Position of SELMUX field.                                            */
  #define VDET1V0_DFT_DTB1CONFIG_SELMUX_Msk (0x1UL << VDET1V0_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.        */
  #define VDET1V0_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)  /*!< Min enumerator value of SELMUX field.                                */
  #define VDET1V0_DFT_DTB1CONFIG_SELMUX_Max (0x1UL)  /*!< Max enumerator value of SELMUX field.                                */
  #define VDET1V0_DFT_DTB1CONFIG_SELMUX_Spare0 (0x0UL) /*!< None selected, logic 0                                             */
  #define VDET1V0_DFT_DTB1CONFIG_SELMUX_Ready (0x1UL) /*!< READY_VDET1V0_AO_0V8                                                */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDET1V0_DFT_DTB1CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VDET1V0_DFT_DTB1CONFIG_EN_Msk (0x1UL << VDET1V0_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VDET1V0_DFT_DTB1CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_DFT_DTB1CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define VDET1V0_DFT_DTB1CONFIG_EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */


/* VDET1V0_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VDET1V0_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                            */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VDET1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                  */
  #define VDET1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VDET1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/
  #define VDET1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                     */
  #define VDET1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                     */
  #define VDET1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                       */
  #define VDET1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                         */


/* VDET1V0_DFT_TCFG: Test mode configuration */
  #define VDET1V0_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                        */

/* FORCEPGDLOW @Bit 0 : Force VDET1V0_PGD_AO_0V8 low */
  #define VDET1V0_DFT_TCFG_FORCEPGDLOW_Pos (0UL)     /*!< Position of FORCEPGDLOW field.                                       */
  #define VDET1V0_DFT_TCFG_FORCEPGDLOW_Msk (0x1UL << VDET1V0_DFT_TCFG_FORCEPGDLOW_Pos) /*!< Bit mask of FORCEPGDLOW field.     */
  #define VDET1V0_DFT_TCFG_FORCEPGDLOW_Min (0x0UL)   /*!< Min enumerator value of FORCEPGDLOW field.                           */
  #define VDET1V0_DFT_TCFG_FORCEPGDLOW_Max (0x1UL)   /*!< Max enumerator value of FORCEPGDLOW field.                           */
  #define VDET1V0_DFT_TCFG_FORCEPGDLOW_Disabled (0x0UL) /*!< Normal operation                                                  */
  #define VDET1V0_DFT_TCFG_FORCEPGDLOW_Enabled (0x1UL) /*!< Test mode enabled                                                  */

/* COMPPWRDWN @Bit 1 : Power down PGD comparator */
  #define VDET1V0_DFT_TCFG_COMPPWRDWN_Pos (1UL)      /*!< Position of COMPPWRDWN field.                                        */
  #define VDET1V0_DFT_TCFG_COMPPWRDWN_Msk (0x1UL << VDET1V0_DFT_TCFG_COMPPWRDWN_Pos) /*!< Bit mask of COMPPWRDWN field.        */
  #define VDET1V0_DFT_TCFG_COMPPWRDWN_Min (0x0UL)    /*!< Min enumerator value of COMPPWRDWN field.                            */
  #define VDET1V0_DFT_TCFG_COMPPWRDWN_Max (0x1UL)    /*!< Max enumerator value of COMPPWRDWN field.                            */
  #define VDET1V0_DFT_TCFG_COMPPWRDWN_Disabled (0x0UL) /*!< Normal operation                                                   */
  #define VDET1V0_DFT_TCFG_COMPPWRDWN_Enabled (0x1UL) /*!< Test mode enabled                                                   */

/* DISABLEHYST @Bit 2 : Disable comparator hysteresis */
  #define VDET1V0_DFT_TCFG_DISABLEHYST_Pos (2UL)     /*!< Position of DISABLEHYST field.                                       */
  #define VDET1V0_DFT_TCFG_DISABLEHYST_Msk (0x1UL << VDET1V0_DFT_TCFG_DISABLEHYST_Pos) /*!< Bit mask of DISABLEHYST field.     */
  #define VDET1V0_DFT_TCFG_DISABLEHYST_Min (0x0UL)   /*!< Min enumerator value of DISABLEHYST field.                           */
  #define VDET1V0_DFT_TCFG_DISABLEHYST_Max (0x1UL)   /*!< Max enumerator value of DISABLEHYST field.                           */
  #define VDET1V0_DFT_TCFG_DISABLEHYST_Disabled (0x0UL) /*!< Normal operation                                                  */
  #define VDET1V0_DFT_TCFG_DISABLEHYST_Enabled (0x1UL) /*!< Test mode enabled                                                  */


