adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ===================================================== Struct VDET1V0 ====================================================== */
/**
  * @brief VDET1V0 peripheral
  */
  typedef struct {                                   /*!< VDET1V0 Structure                                                    */
    __OM uint32_t TASKS_PWRUP;                       /*!< (@ 0x00000000) Power up voltage detector                             */
    __OM uint32_t TASKS_PWRDOWN;                     /*!< (@ 0x00000004) Power down voltage detector                           */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IOM uint32_t EVENTS_PWRGOOD;                   /*!< (@ 0x00000108) Power good detector detected voltage above threshold
                                                                         level*/
    __IOM uint32_t EVENTS_PWRNOTGOOD;                /*!< (@ 0x0000010C) Power good detector detected voltage below threshold
                                                                         level*/
    __IM uint32_t RESERVED1[124];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000400) Status of analog module output signals                */
    __IM uint32_t RESERVED3[3];
    __IOM NRF_VDET1V0_CONFIG_Type CONFIG;            /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_VDET1V0_TRIM_Type TRIM;                /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[15];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IM uint32_t RESERVED6[31];
    __IOM NRF_VDET1V0_OVERRIDE_Type OVERRIDE;        /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[59];
    __IOM NRF_VDET1V0_DFT_Type DFT;                  /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VDET1V0_Type;                                /*!< Size = 1588 (0x634)                                                  */

/* VDET1V0_TASKS_PWRUP: Power up voltage detector */
  #define VDET1V0_TASKS_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUP register.                              */

/* TASKS_PWRUP @Bit 0 : Power up voltage detector */
  #define VDET1V0_TASKS_PWRUP_TASKS_PWRUP_Pos (0UL)  /*!< Position of TASKS_PWRUP field.                                       */
  #define VDET1V0_TASKS_PWRUP_TASKS_PWRUP_Msk (0x1UL << VDET1V0_TASKS_PWRUP_TASKS_PWRUP_Pos) /*!< Bit mask of TASKS_PWRUP
                                                                            field.*/
  #define VDET1V0_TASKS_PWRUP_TASKS_PWRUP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRUP field.                          */
  #define VDET1V0_TASKS_PWRUP_TASKS_PWRUP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRUP field.                          */
  #define VDET1V0_TASKS_PWRUP_TASKS_PWRUP_Trigger (0x1UL) /*!< Trigger task                                                    */


/* VDET1V0_TASKS_PWRDOWN: Power down voltage detector */
  #define VDET1V0_TASKS_PWRDOWN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWN register.                          */

/* TASKS_PWRDOWN @Bit 0 : Power down voltage detector */
  #define VDET1V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos (0UL) /*!< Position of TASKS_PWRDOWN field.                                  */
  #define VDET1V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Msk (0x1UL << VDET1V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos) /*!< Bit mask of
                                                                            TASKS_PWRDOWN field.*/
  #define VDET1V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWN field.                    */
  #define VDET1V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWN field.                    */
  #define VDET1V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Trigger (0x1UL) /*!< Trigger task                                                */


/* VDET1V0_EVENTS_READY: Power up done */
  #define VDET1V0_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                            */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VDET1V0_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                     */
  #define VDET1V0_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VDET1V0_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY
                                                                            field.*/
  #define VDET1V0_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                       */
  #define VDET1V0_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                       */
  #define VDET1V0_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define VDET1V0_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                             */


/* VDET1V0_EVENTS_SETTLED: Settled flag for MODE handshake */
  #define VDET1V0_EVENTS_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED register.                        */

