adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define VDET1V0_INTENSET_SETTLED_Pos (1UL)         /*!< Position of SETTLED field.                                           */
  #define VDET1V0_INTENSET_SETTLED_Msk (0x1UL << VDET1V0_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.                 */
  #define VDET1V0_INTENSET_SETTLED_Min (0x0UL)       /*!< Min enumerator value of SETTLED field.                               */
  #define VDET1V0_INTENSET_SETTLED_Max (0x1UL)       /*!< Max enumerator value of SETTLED field.                               */
  #define VDET1V0_INTENSET_SETTLED_Set (0x1UL)       /*!< Enable                                                               */
  #define VDET1V0_INTENSET_SETTLED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDET1V0_INTENSET_SETTLED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PWRGOOD @Bit 2 : Write '1' to enable interrupt for event PWRGOOD */
  #define VDET1V0_INTENSET_PWRGOOD_Pos (2UL)         /*!< Position of PWRGOOD field.                                           */
  #define VDET1V0_INTENSET_PWRGOOD_Msk (0x1UL << VDET1V0_INTENSET_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.                 */
  #define VDET1V0_INTENSET_PWRGOOD_Min (0x0UL)       /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDET1V0_INTENSET_PWRGOOD_Max (0x1UL)       /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDET1V0_INTENSET_PWRGOOD_Set (0x1UL)       /*!< Enable                                                               */
  #define VDET1V0_INTENSET_PWRGOOD_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDET1V0_INTENSET_PWRGOOD_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PWRNOTGOOD @Bit 3 : Write '1' to enable interrupt for event PWRNOTGOOD */
  #define VDET1V0_INTENSET_PWRNOTGOOD_Pos (3UL)      /*!< Position of PWRNOTGOOD field.                                        */
  #define VDET1V0_INTENSET_PWRNOTGOOD_Msk (0x1UL << VDET1V0_INTENSET_PWRNOTGOOD_Pos) /*!< Bit mask of PWRNOTGOOD field.        */
  #define VDET1V0_INTENSET_PWRNOTGOOD_Min (0x0UL)    /*!< Min enumerator value of PWRNOTGOOD field.                            */
  #define VDET1V0_INTENSET_PWRNOTGOOD_Max (0x1UL)    /*!< Max enumerator value of PWRNOTGOOD field.                            */
  #define VDET1V0_INTENSET_PWRNOTGOOD_Set (0x1UL)    /*!< Enable                                                               */
  #define VDET1V0_INTENSET_PWRNOTGOOD_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDET1V0_INTENSET_PWRNOTGOOD_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* VDET1V0_INTENCLR: Disable interrupt */
  #define VDET1V0_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VDET1V0_INTENCLR_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define VDET1V0_INTENCLR_READY_Msk (0x1UL << VDET1V0_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                       */
  #define VDET1V0_INTENCLR_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define VDET1V0_INTENCLR_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define VDET1V0_INTENCLR_READY_Clear (0x1UL)       /*!< Disable                                                              */
  #define VDET1V0_INTENCLR_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define VDET1V0_INTENCLR_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define VDET1V0_INTENCLR_SETTLED_Pos (1UL)         /*!< Position of SETTLED field.                                           */
  #define VDET1V0_INTENCLR_SETTLED_Msk (0x1UL << VDET1V0_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.                 */
  #define VDET1V0_INTENCLR_SETTLED_Min (0x0UL)       /*!< Min enumerator value of SETTLED field.                               */
  #define VDET1V0_INTENCLR_SETTLED_Max (0x1UL)       /*!< Max enumerator value of SETTLED field.                               */
  #define VDET1V0_INTENCLR_SETTLED_Clear (0x1UL)     /*!< Disable                                                              */
  #define VDET1V0_INTENCLR_SETTLED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDET1V0_INTENCLR_SETTLED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PWRGOOD @Bit 2 : Write '1' to disable interrupt for event PWRGOOD */
  #define VDET1V0_INTENCLR_PWRGOOD_Pos (2UL)         /*!< Position of PWRGOOD field.                                           */
  #define VDET1V0_INTENCLR_PWRGOOD_Msk (0x1UL << VDET1V0_INTENCLR_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.                 */
  #define VDET1V0_INTENCLR_PWRGOOD_Min (0x0UL)       /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDET1V0_INTENCLR_PWRGOOD_Max (0x1UL)       /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDET1V0_INTENCLR_PWRGOOD_Clear (0x1UL)     /*!< Disable                                                              */
  #define VDET1V0_INTENCLR_PWRGOOD_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDET1V0_INTENCLR_PWRGOOD_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PWRNOTGOOD @Bit 3 : Write '1' to disable interrupt for event PWRNOTGOOD */
  #define VDET1V0_INTENCLR_PWRNOTGOOD_Pos (3UL)      /*!< Position of PWRNOTGOOD field.                                        */
  #define VDET1V0_INTENCLR_PWRNOTGOOD_Msk (0x1UL << VDET1V0_INTENCLR_PWRNOTGOOD_Pos) /*!< Bit mask of PWRNOTGOOD field.        */
  #define VDET1V0_INTENCLR_PWRNOTGOOD_Min (0x0UL)    /*!< Min enumerator value of PWRNOTGOOD field.                            */
  #define VDET1V0_INTENCLR_PWRNOTGOOD_Max (0x1UL)    /*!< Max enumerator value of PWRNOTGOOD field.                            */
  #define VDET1V0_INTENCLR_PWRNOTGOOD_Clear (0x1UL)  /*!< Disable                                                              */
  #define VDET1V0_INTENCLR_PWRNOTGOOD_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDET1V0_INTENCLR_PWRNOTGOOD_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* VDET1V0_INTPEND: Pending interrupts */
  #define VDET1V0_INTPEND_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND register.                                     */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VDET1V0_INTPEND_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define VDET1V0_INTPEND_READY_Msk (0x1UL << VDET1V0_INTPEND_READY_Pos) /*!< Bit mask of READY field.                         */
  #define VDET1V0_INTPEND_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define VDET1V0_INTPEND_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define VDET1V0_INTPEND_READY_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define VDET1V0_INTPEND_READY_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define VDET1V0_INTPEND_SETTLED_Pos (1UL)          /*!< Position of SETTLED field.                                           */
  #define VDET1V0_INTPEND_SETTLED_Msk (0x1UL << VDET1V0_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.                   */
  #define VDET1V0_INTPEND_SETTLED_Min (0x0UL)        /*!< Min enumerator value of SETTLED field.                               */
  #define VDET1V0_INTPEND_SETTLED_Max (0x1UL)        /*!< Max enumerator value of SETTLED field.                               */
  #define VDET1V0_INTPEND_SETTLED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VDET1V0_INTPEND_SETTLED_Pending (0x1UL)    /*!< Read: Pending                                                        */

