adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VDETAO0V8_OVERRIDE_PGDCANCEL: Override the PGD_CANCEL signal to the analog module */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_ResetValue (0x00000000UL) /*!< Reset value of PGDCANCEL register.                       */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_PGDCANCEL_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_PGDCANCEL_EN_Pos) /*!< Bit mask of EN field.        */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define VDETAO0V8_OVERRIDE_PGDCANCEL_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* VDETAO0V8_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VDETAO0V8_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETAO0V8_OVERRIDE_READY_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_READY_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_READY_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_READY_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO0V8_OVERRIDE_READY_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_READY_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VDETAO0V8_OVERRIDE_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VDETAO0V8_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define VDETAO0V8_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETAO0V8_OVERRIDE_SETTLED_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_SETTLED_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_SETTLED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_SETTLED_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.            */
  #define VDETAO0V8_OVERRIDE_SETTLED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_SETTLED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VDETAO0V8_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* VDETAO0V8_OVERRIDE_BOD: Override the BOD signal from the analog module */
  #define VDETAO0V8_OVERRIDE_BOD_ResetValue (0x00000000UL) /*!< Reset value of BOD register.                                   */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETAO0V8_OVERRIDE_BOD_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_BOD_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_BOD_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_BOD_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_BOD_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_BOD_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VDETAO0V8_OVERRIDE_BOD_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_BOD_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_BOD_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VDETAO0V8_OVERRIDE_BOD_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VDETAO0V8_OVERRIDE_PGD: Override the PGD signal from the analog module */
  #define VDETAO0V8_OVERRIDE_PGD_ResetValue (0x00000000UL) /*!< Reset value of PGD register.                                   */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETAO0V8_OVERRIDE_PGD_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_PGD_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_PGD_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_PGD_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_PGD_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_PGD_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VDETAO0V8_OVERRIDE_PGD_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_PGD_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_PGD_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VDETAO0V8_OVERRIDE_PGD_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VDETAO0V8_OVERRIDE_BODVOLTSEL: Override the BOD_VOLT_SEL signal to the analog module */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_ResetValue (0x00000000UL) /*!< Reset value of BODVOLTSEL register.                     */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_BODVOLTSEL_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_BODVOLTSEL_EN_Pos) /*!< Bit mask of EN field.      */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define VDETAO0V8_OVERRIDE_BODVOLTSEL_EN_Enabled (0x1UL) /*!< Override is enabled                                            */


/* VDETAO0V8_OVERRIDE_MUXEDBOD: Override the muxselect to BOD HP/LP level multiplexer */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_ResetValue (0x00000000UL) /*!< Reset value of MUXEDBOD register.                         */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_MUXEDBOD_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_MUXEDBOD_EN_Pos) /*!< Bit mask of EN field.          */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VDETAO0V8_OVERRIDE_MUXEDBOD_EN_Enabled (0x1UL) /*!< Override is enabled                                              */



/* ================================================== Struct VDETAO0V8_DFT =================================================== */
/**
  * @brief DFT [VDETAO0V8_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_VDETAO0V8_DFT_Type;                            /*!< Size = 52 (0x034)                                                    */

/* VDETAO0V8_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VDETAO0V8_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                          */

