adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VDETAO0V8_EVENTS_PWRGOOD: Power good detector detected voltage above threshold level */
  #define VDETAO0V8_EVENTS_PWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PWRGOOD register.                      */

/* EVENTS_PWRGOOD @Bit 0 : Power good detector detected voltage above threshold level */
  #define VDETAO0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Pos (0UL) /*!< Position of EVENTS_PWRGOOD field.                             */
  #define VDETAO0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Msk (0x1UL << VDETAO0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Pos) /*!< Bit mask of
                                                                            EVENTS_PWRGOOD field.*/
  #define VDETAO0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Min (0x0UL) /*!< Min enumerator value of EVENTS_PWRGOOD field.               */
  #define VDETAO0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Max (0x1UL) /*!< Max enumerator value of EVENTS_PWRGOOD field.               */
  #define VDETAO0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define VDETAO0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Generated (0x1UL) /*!< Event generated                                       */


/* VDETAO0V8_INTEN: Enable or disable interrupt */
  #define VDETAO0V8_INTEN_ResetValue (0x00000000UL)  /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VDETAO0V8_INTEN_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define VDETAO0V8_INTEN_READY_Msk (0x1UL << VDETAO0V8_INTEN_READY_Pos) /*!< Bit mask of READY field.                         */
  #define VDETAO0V8_INTEN_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define VDETAO0V8_INTEN_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define VDETAO0V8_INTEN_READY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VDETAO0V8_INTEN_READY_Enabled (0x1UL)      /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VDETAO0V8_INTEN_SETTLED_Pos (1UL)          /*!< Position of SETTLED field.                                           */
  #define VDETAO0V8_INTEN_SETTLED_Msk (0x1UL << VDETAO0V8_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                   */
  #define VDETAO0V8_INTEN_SETTLED_Min (0x0UL)        /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO0V8_INTEN_SETTLED_Max (0x1UL)        /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO0V8_INTEN_SETTLED_Disabled (0x0UL)   /*!< Disable                                                              */
  #define VDETAO0V8_INTEN_SETTLED_Enabled (0x1UL)    /*!< Enable                                                               */

/* PWRGOOD @Bit 2 : Enable or disable interrupt for event PWRGOOD */
  #define VDETAO0V8_INTEN_PWRGOOD_Pos (2UL)          /*!< Position of PWRGOOD field.                                           */
  #define VDETAO0V8_INTEN_PWRGOOD_Msk (0x1UL << VDETAO0V8_INTEN_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.                   */
  #define VDETAO0V8_INTEN_PWRGOOD_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDETAO0V8_INTEN_PWRGOOD_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDETAO0V8_INTEN_PWRGOOD_Disabled (0x0UL)   /*!< Disable                                                              */
  #define VDETAO0V8_INTEN_PWRGOOD_Enabled (0x1UL)    /*!< Enable                                                               */


/* VDETAO0V8_INTENSET: Enable interrupt */
  #define VDETAO0V8_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                  */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VDETAO0V8_INTENSET_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETAO0V8_INTENSET_READY_Msk (0x1UL << VDETAO0V8_INTENSET_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETAO0V8_INTENSET_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETAO0V8_INTENSET_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETAO0V8_INTENSET_READY_Set (0x1UL)       /*!< Enable                                                               */
  #define VDETAO0V8_INTENSET_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDETAO0V8_INTENSET_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define VDETAO0V8_INTENSET_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETAO0V8_INTENSET_SETTLED_Msk (0x1UL << VDETAO0V8_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETAO0V8_INTENSET_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO0V8_INTENSET_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO0V8_INTENSET_SETTLED_Set (0x1UL)     /*!< Enable                                                               */
  #define VDETAO0V8_INTENSET_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETAO0V8_INTENSET_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* PWRGOOD @Bit 2 : Write '1' to enable interrupt for event PWRGOOD */
  #define VDETAO0V8_INTENSET_PWRGOOD_Pos (2UL)       /*!< Position of PWRGOOD field.                                           */
  #define VDETAO0V8_INTENSET_PWRGOOD_Msk (0x1UL << VDETAO0V8_INTENSET_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.             */
  #define VDETAO0V8_INTENSET_PWRGOOD_Min (0x0UL)     /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDETAO0V8_INTENSET_PWRGOOD_Max (0x1UL)     /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDETAO0V8_INTENSET_PWRGOOD_Set (0x1UL)     /*!< Enable                                                               */
  #define VDETAO0V8_INTENSET_PWRGOOD_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETAO0V8_INTENSET_PWRGOOD_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* VDETAO0V8_INTENCLR: Disable interrupt */
  #define VDETAO0V8_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                  */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VDETAO0V8_INTENCLR_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETAO0V8_INTENCLR_READY_Msk (0x1UL << VDETAO0V8_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETAO0V8_INTENCLR_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETAO0V8_INTENCLR_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETAO0V8_INTENCLR_READY_Clear (0x1UL)     /*!< Disable                                                              */
  #define VDETAO0V8_INTENCLR_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDETAO0V8_INTENCLR_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

