adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define VDETAO0V8_INTENCLR_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETAO0V8_INTENCLR_SETTLED_Msk (0x1UL << VDETAO0V8_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETAO0V8_INTENCLR_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO0V8_INTENCLR_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO0V8_INTENCLR_SETTLED_Clear (0x1UL)   /*!< Disable                                                              */
  #define VDETAO0V8_INTENCLR_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETAO0V8_INTENCLR_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* PWRGOOD @Bit 2 : Write '1' to disable interrupt for event PWRGOOD */
  #define VDETAO0V8_INTENCLR_PWRGOOD_Pos (2UL)       /*!< Position of PWRGOOD field.                                           */
  #define VDETAO0V8_INTENCLR_PWRGOOD_Msk (0x1UL << VDETAO0V8_INTENCLR_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.             */
  #define VDETAO0V8_INTENCLR_PWRGOOD_Min (0x0UL)     /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDETAO0V8_INTENCLR_PWRGOOD_Max (0x1UL)     /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDETAO0V8_INTENCLR_PWRGOOD_Clear (0x1UL)   /*!< Disable                                                              */
  #define VDETAO0V8_INTENCLR_PWRGOOD_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETAO0V8_INTENCLR_PWRGOOD_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* VDETAO0V8_INTPEND: Pending interrupts */
  #define VDETAO0V8_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                    */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VDETAO0V8_INTPEND_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VDETAO0V8_INTPEND_READY_Msk (0x1UL << VDETAO0V8_INTPEND_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VDETAO0V8_INTPEND_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VDETAO0V8_INTPEND_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VDETAO0V8_INTPEND_READY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VDETAO0V8_INTPEND_READY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define VDETAO0V8_INTPEND_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VDETAO0V8_INTPEND_SETTLED_Msk (0x1UL << VDETAO0V8_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */
  #define VDETAO0V8_INTPEND_SETTLED_Min (0x0UL)      /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO0V8_INTPEND_SETTLED_Max (0x1UL)      /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO0V8_INTPEND_SETTLED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VDETAO0V8_INTPEND_SETTLED_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* PWRGOOD @Bit 2 : Read pending status of interrupt for event PWRGOOD */
  #define VDETAO0V8_INTPEND_PWRGOOD_Pos (2UL)        /*!< Position of PWRGOOD field.                                           */
  #define VDETAO0V8_INTPEND_PWRGOOD_Msk (0x1UL << VDETAO0V8_INTPEND_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.               */
  #define VDETAO0V8_INTPEND_PWRGOOD_Min (0x0UL)      /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDETAO0V8_INTPEND_PWRGOOD_Max (0x1UL)      /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDETAO0V8_INTPEND_PWRGOOD_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VDETAO0V8_INTPEND_PWRGOOD_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* VDETAO0V8_STATUS: Voltage detector status */
  #define VDETAO0V8_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Current voltage detector mode */
  #define VDETAO0V8_STATUS_MODE_Pos (0UL)            /*!< Position of MODE field.                                              */
  #define VDETAO0V8_STATUS_MODE_Msk (0x3UL << VDETAO0V8_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define VDETAO0V8_STATUS_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define VDETAO0V8_STATUS_MODE_Max (0x2UL)          /*!< Max enumerator value of MODE field.                                  */
  #define VDETAO0V8_STATUS_MODE_HighPower (0x0UL)    /*!< High power mode                                                      */
  #define VDETAO0V8_STATUS_MODE_LowPower (0x1UL)     /*!< Low power mode                                                       */
  #define VDETAO0V8_STATUS_MODE_UltraLowPowerRefresh (0x2UL) /*!< Ultra-low power refresh mode                                 */


/* VDETAO0V8_STATUSANA: Status of analog module output signals */
  #define VDETAO0V8_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VDETAO0V8_STATUSANA_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VDETAO0V8_STATUSANA_READY_Msk (0x1UL << VDETAO0V8_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                 */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VDETAO0V8_STATUSANA_SETTLED_Pos (1UL)      /*!< Position of SETTLED field.                                           */
  #define VDETAO0V8_STATUSANA_SETTLED_Msk (0x1UL << VDETAO0V8_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.           */

/* BOD @Bit 2 : Current value of the BOD signal from the analog module */
  #define VDETAO0V8_STATUSANA_BOD_Pos (2UL)          /*!< Position of BOD field.                                               */
  #define VDETAO0V8_STATUSANA_BOD_Msk (0x1UL << VDETAO0V8_STATUSANA_BOD_Pos) /*!< Bit mask of BOD field.                       */

/* PGD @Bit 3 : Current value of the PGD signal from the analog module */
  #define VDETAO0V8_STATUSANA_PGD_Pos (3UL)          /*!< Position of PGD field.                                               */
  #define VDETAO0V8_STATUSANA_PGD_Msk (0x1UL << VDETAO0V8_STATUSANA_PGD_Pos) /*!< Bit mask of PGD field.                       */


/* VDETAO0V8_MIRROR: Enable LOCK for mirrored registers */
  #define VDETAO0V8_MIRROR_ResetValue (0x00000001UL) /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VDETAO0V8_MIRROR_LOCK_Pos (0UL)            /*!< Position of LOCK field.                                              */
  #define VDETAO0V8_MIRROR_LOCK_Msk (0x1UL << VDETAO0V8_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                          */
  #define VDETAO0V8_MIRROR_LOCK_Min (0x0UL)          /*!< Min enumerator value of LOCK field.                                  */
  #define VDETAO0V8_MIRROR_LOCK_Max (0x1UL)          /*!< Max enumerator value of LOCK field.                                  */
  #define VDETAO0V8_MIRROR_LOCK_Disabled (0x0UL)     /*!< Lock disabled                                                        */
  #define VDETAO0V8_MIRROR_LOCK_Enabled (0x1UL)      /*!< Lock enabled                                                         */


/* VDETAO0V8_MODE: Voltage detector mode */
  #define VDETAO0V8_MODE_ResetValue (0x00000000UL)   /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..2 : Mode */
  #define VDETAO0V8_MODE_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define VDETAO0V8_MODE_MODE_Msk (0x7UL << VDETAO0V8_MODE_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define VDETAO0V8_MODE_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define VDETAO0V8_MODE_MODE_Max (0x3UL)            /*!< Max enumerator value of MODE field.                                  */
  #define VDETAO0V8_MODE_MODE_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define VDETAO0V8_MODE_MODE_HighPower (0x1UL)      /*!< High power mode                                                      */
  #define VDETAO0V8_MODE_MODE_LowPower (0x2UL)       /*!< Low power mode                                                       */
  #define VDETAO0V8_MODE_MODE_UltraLowPowerRefresh (0x3UL) /*!< Ultra-low power refresh mode                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VDETAO1V8                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VDETAO1V8_CONFIG ================================================= */
/**
  * @brief CONFIG [VDETAO1V8_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Voltage detector configuration                        */
  __IOM uint32_t  BROWNOUTCONFIG;                    /*!< (@ 0x00000004) Brown out detector configuration                      */
} NRF_VDETAO1V8_CONFIG_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VDETAO1V8_CONFIG_CFG: Voltage detector configuration */
  #define VDETAO1V8_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                     */

/* BROWNOUTHIGHHYST @Bits 0..1 : Brown out detector high level hysteresis voltage value */
  #define VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Pos (0UL) /*!< Position of BROWNOUTHIGHHYST field.                             */
  #define VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Msk (0x3UL << VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Pos) /*!< Bit mask of
                                                                            BROWNOUTHIGHHYST field.*/
  #define VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Min (0x0UL) /*!< Min enumerator value of BROWNOUTHIGHHYST field.               */
  #define VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Max (0x3UL) /*!< Max enumerator value of BROWNOUTHIGHHYST field.               */
  #define VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Val0V020 (0x0UL) /*!< Hysteresis voltage is 20mV                               */
  #define VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Val0V040 (0x1UL) /*!< Hysteresis voltage is 40mV                               */
  #define VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Val0V000 (0x2UL) /*!< Hysteresis voltage is 0mV                                */
  #define VDETAO1V8_CONFIG_CFG_BROWNOUTHIGHHYST_Val0V010 (0x3UL) /*!< Hysteresis voltage is 10mV                               */

/* BODVOLTAGERAISE @Bit 2 : Change in BODH and BODL threshold in ULPR and LP modes. */
  #define VDETAO1V8_CONFIG_CFG_BODVOLTAGERAISE_Pos (2UL) /*!< Position of BODVOLTAGERAISE field.                               */
  #define VDETAO1V8_CONFIG_CFG_BODVOLTAGERAISE_Msk (0x1UL << VDETAO1V8_CONFIG_CFG_BODVOLTAGERAISE_Pos) /*!< Bit mask of
                                                                            BODVOLTAGERAISE field.*/
  #define VDETAO1V8_CONFIG_CFG_BODVOLTAGERAISE_Min (0x0UL) /*!< Min enumerator value of BODVOLTAGERAISE field.                 */
  #define VDETAO1V8_CONFIG_CFG_BODVOLTAGERAISE_Max (0x1UL) /*!< Max enumerator value of BODVOLTAGERAISE field.                 */
  #define VDETAO1V8_CONFIG_CFG_BODVOLTAGERAISE_NoChange (0x0UL) /*!< No change in BODH and BODL threshold in ULPR and LP modes.*/
  #define VDETAO1V8_CONFIG_CFG_BODVOLTAGERAISE_Raise (0x1UL) /*!< 20mV voltage raise in BODH and BODL threshold in ULPR and LP
                                                                  modes.*/


/* VDETAO1V8_CONFIG_BROWNOUTCONFIG: Brown out detector configuration */
  #define VDETAO1V8_CONFIG_BROWNOUTCONFIG_ResetValue (0x00000000UL) /*!< Reset value of BROWNOUTCONFIG register.               */

