adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENBROWNOUTLVLLOW @Bit 0 : Enable Brown out detector low level */
  #define VDETAO1V8_CONFIG_BROWNOUTCONFIG_ENBROWNOUTLVLLOW_Pos (0UL) /*!< Position of ENBROWNOUTLVLLOW field.                  */
  #define VDETAO1V8_CONFIG_BROWNOUTCONFIG_ENBROWNOUTLVLLOW_Msk (0x1UL << VDETAO1V8_CONFIG_BROWNOUTCONFIG_ENBROWNOUTLVLLOW_Pos)
                                                                            /*!< Bit mask of ENBROWNOUTLVLLOW field.*/
  #define VDETAO1V8_CONFIG_BROWNOUTCONFIG_ENBROWNOUTLVLLOW_Min (0x0UL) /*!< Min enumerator value of ENBROWNOUTLVLLOW field.    */
  #define VDETAO1V8_CONFIG_BROWNOUTCONFIG_ENBROWNOUTLVLLOW_Max (0x1UL) /*!< Max enumerator value of ENBROWNOUTLVLLOW field.    */
  #define VDETAO1V8_CONFIG_BROWNOUTCONFIG_ENBROWNOUTLVLLOW_Disabled (0x0UL) /*!< Brown out detector low level is disabled      */
  #define VDETAO1V8_CONFIG_BROWNOUTCONFIG_ENBROWNOUTLVLLOW_Enabled (0x1UL) /*!< Brown out detector low level is enabled        */



/* ================================================== Struct VDETAO1V8_TRIM ================================================== */
/**
  * @brief TRIM [VDETAO1V8_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  BROWNOUTLVLHIGH;                   /*!< (@ 0x00000000) Brown out detector high threshold voltage level       */
  __IOM uint32_t  BROWNOUTLVLLOW;                    /*!< (@ 0x00000004) Brown out detector low threshold voltage level        */
} NRF_VDETAO1V8_TRIM_Type;                           /*!< Size = 8 (0x008)                                                     */

/* VDETAO1V8_TRIM_BROWNOUTLVLHIGH: Brown out detector high threshold voltage level */
  #define VDETAO1V8_TRIM_BROWNOUTLVLHIGH_ResetValue (0x00000000UL) /*!< Reset value of BROWNOUTLVLHIGH register.               */

/* VAL @Bits 0..3 : Threshold voltage value. */
  #define VDETAO1V8_TRIM_BROWNOUTLVLHIGH_VAL_Pos (0UL) /*!< Position of VAL field.                                             */
  #define VDETAO1V8_TRIM_BROWNOUTLVLHIGH_VAL_Msk (0xFUL << VDETAO1V8_TRIM_BROWNOUTLVLHIGH_VAL_Pos) /*!< Bit mask of VAL field. */


/* VDETAO1V8_TRIM_BROWNOUTLVLLOW: Brown out detector low threshold voltage level */
  #define VDETAO1V8_TRIM_BROWNOUTLVLLOW_ResetValue (0x00000000UL) /*!< Reset value of BROWNOUTLVLLOW register.                 */

/* VAL @Bits 0..3 : Threshold voltage value. */
  #define VDETAO1V8_TRIM_BROWNOUTLVLLOW_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define VDETAO1V8_TRIM_BROWNOUTLVLLOW_VAL_Msk (0xFUL << VDETAO1V8_TRIM_BROWNOUTLVLLOW_VAL_Pos) /*!< Bit mask of VAL field.   */



/* ================================================ Struct VDETAO1V8_OVERRIDE ================================================ */
/**
  * @brief OVERRIDE [VDETAO1V8_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x00000008) Override the MODE_LP signal to the analog module      */
  __IOM uint32_t  MODEULPR;                          /*!< (@ 0x0000000C) Override the MODE_ULPR signal to the analog module    */
  __IOM uint32_t  BODLEN;                            /*!< (@ 0x00000010) Override the BODL_EN signal to the analog module      */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000014) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000018) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  BODH;                              /*!< (@ 0x0000001C) Override the BODH signal from the analog module       */
} NRF_VDETAO1V8_OVERRIDE_Type;                       /*!< Size = 32 (0x020)                                                    */

/* VDETAO1V8_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VDETAO1V8_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO1V8_OVERRIDE_PWRUP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VDETAO1V8_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VDETAO1V8_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VDETAO1V8_OVERRIDE_PWRUP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO1V8_OVERRIDE_PWRUP_EN_Msk (0x1UL << VDETAO1V8_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO1V8_OVERRIDE_PWRUP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_PWRUP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VDETAO1V8_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VDETAO1V8_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VDETAO1V8_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO1V8_OVERRIDE_RETAIN_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDETAO1V8_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VDETAO1V8_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VDETAO1V8_OVERRIDE_RETAIN_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETAO1V8_OVERRIDE_RETAIN_EN_Msk (0x1UL << VDETAO1V8_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETAO1V8_OVERRIDE_RETAIN_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_RETAIN_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VDETAO1V8_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VDETAO1V8_OVERRIDE_MODELP: Override the MODE_LP signal to the analog module */
  #define VDETAO1V8_OVERRIDE_MODELP_ResetValue (0x00000000UL) /*!< Reset value of MODELP register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO1V8_OVERRIDE_MODELP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDETAO1V8_OVERRIDE_MODELP_VAL_Msk (0x1UL << VDETAO1V8_OVERRIDE_MODELP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VDETAO1V8_OVERRIDE_MODELP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETAO1V8_OVERRIDE_MODELP_EN_Msk (0x1UL << VDETAO1V8_OVERRIDE_MODELP_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETAO1V8_OVERRIDE_MODELP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_MODELP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_MODELP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VDETAO1V8_OVERRIDE_MODELP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VDETAO1V8_OVERRIDE_MODEULPR: Override the MODE_ULPR signal to the analog module */
  #define VDETAO1V8_OVERRIDE_MODEULPR_ResetValue (0x00000000UL) /*!< Reset value of MODEULPR register.                         */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO1V8_OVERRIDE_MODEULPR_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETAO1V8_OVERRIDE_MODEULPR_VAL_Msk (0x1UL << VDETAO1V8_OVERRIDE_MODEULPR_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VDETAO1V8_OVERRIDE_MODEULPR_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VDETAO1V8_OVERRIDE_MODEULPR_EN_Msk (0x1UL << VDETAO1V8_OVERRIDE_MODEULPR_EN_Pos) /*!< Bit mask of EN field.          */
  #define VDETAO1V8_OVERRIDE_MODEULPR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_MODEULPR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_MODEULPR_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VDETAO1V8_OVERRIDE_MODEULPR_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


/* VDETAO1V8_OVERRIDE_BODLEN: Override the BODL_EN signal to the analog module */
  #define VDETAO1V8_OVERRIDE_BODLEN_ResetValue (0x00000000UL) /*!< Reset value of BODLEN register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO1V8_OVERRIDE_BODLEN_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDETAO1V8_OVERRIDE_BODLEN_VAL_Msk (0x1UL << VDETAO1V8_OVERRIDE_BODLEN_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VDETAO1V8_OVERRIDE_BODLEN_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETAO1V8_OVERRIDE_BODLEN_EN_Msk (0x1UL << VDETAO1V8_OVERRIDE_BODLEN_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETAO1V8_OVERRIDE_BODLEN_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_BODLEN_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_BODLEN_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VDETAO1V8_OVERRIDE_BODLEN_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


