adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VDETAO1V8_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VDETAO1V8_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETAO1V8_OVERRIDE_READY_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VDETAO1V8_OVERRIDE_READY_VAL_Msk (0x1UL << VDETAO1V8_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VDETAO1V8_OVERRIDE_READY_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO1V8_OVERRIDE_READY_EN_Msk (0x1UL << VDETAO1V8_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO1V8_OVERRIDE_READY_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_READY_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VDETAO1V8_OVERRIDE_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VDETAO1V8_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define VDETAO1V8_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETAO1V8_OVERRIDE_SETTLED_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VDETAO1V8_OVERRIDE_SETTLED_VAL_Msk (0x1UL << VDETAO1V8_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VDETAO1V8_OVERRIDE_SETTLED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VDETAO1V8_OVERRIDE_SETTLED_EN_Msk (0x1UL << VDETAO1V8_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.            */
  #define VDETAO1V8_OVERRIDE_SETTLED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_SETTLED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VDETAO1V8_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* VDETAO1V8_OVERRIDE_BODH: Override the BODH signal from the analog module */
  #define VDETAO1V8_OVERRIDE_BODH_ResetValue (0x00000000UL) /*!< Reset value of BODH register.                                 */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETAO1V8_OVERRIDE_BODH_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VDETAO1V8_OVERRIDE_BODH_VAL_Msk (0x1UL << VDETAO1V8_OVERRIDE_BODH_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VDETAO1V8_OVERRIDE_BODH_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VDETAO1V8_OVERRIDE_BODH_EN_Msk (0x1UL << VDETAO1V8_OVERRIDE_BODH_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VDETAO1V8_OVERRIDE_BODH_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_BODH_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_OVERRIDE_BODH_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VDETAO1V8_OVERRIDE_BODH_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */



/* ================================================== Struct VDETAO1V8_DFT =================================================== */
/**
  * @brief DFT [VDETAO1V8_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_VDETAO1V8_DFT_Type;                            /*!< Size = 52 (0x034)                                                    */

/* VDETAO1V8_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VDETAO1V8_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define VDETAO1V8_DFT_ATB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETAO1V8_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << VDETAO1V8_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETAO1V8_DFT_ATB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETAO1V8_DFT_ATB0CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETAO1V8_DFT_ATB0CONFIG_SELMUX_IDBG1u (0x0UL) /*!< BOD CMP IDBG 1u current                                          */
  #define VDETAO1V8_DFT_ATB0CONFIG_SELMUX_VSS (0x1UL) /*!< Connect VSS                                                         */
  #define VDETAO1V8_DFT_ATB0CONFIG_SELMUX_ConnectSenseVoltage (0x3UL) /*!< Connect internal sense voltage for BOD comparators  */

