adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define VDETAO1V8_DFT_ATB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO1V8_DFT_ATB0CONFIG_EN_Msk (0x1UL << VDETAO1V8_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO1V8_DFT_ATB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_DFT_ATB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VDETAO1V8_DFT_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VDETAO1V8_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VDETAO1V8_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define VDETAO1V8_DFT_ATB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETAO1V8_DFT_ATB1CONFIG_SELMUX_Msk (0x3UL << VDETAO1V8_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETAO1V8_DFT_ATB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETAO1V8_DFT_ATB1CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETAO1V8_DFT_ATB1CONFIG_SELMUX_HiZ (0x0UL) /*!< HiZ                                                                 */
  #define VDETAO1V8_DFT_ATB1CONFIG_SELMUX_MonitorSenseVoltage (0x1UL) /*!< Monitor internal sense voltage for BOD comparators  */
  #define VDETAO1V8_DFT_ATB1CONFIG_SELMUX_VREFH (0x2UL) /*!< Connect VREFH                                                     */
  #define VDETAO1V8_DFT_ATB1CONFIG_SELMUX_VREFL (0x3UL) /*!< Connect VREFL                                                     */

/* EN @Bit 31 : Enable the analog test bus */
  #define VDETAO1V8_DFT_ATB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO1V8_DFT_ATB1CONFIG_EN_Msk (0x1UL << VDETAO1V8_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO1V8_DFT_ATB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_DFT_ATB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VDETAO1V8_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VDETAO1V8_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VDETAO1V8_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                          */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << VDETAO1V8_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_Max (0x7UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_ModeLP (0x0UL) /*!< MODE LP is selected                                              */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_ModeULPR (0x1UL) /*!< MODE ULPR is selected                                          */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_BODLCompOutput (0x2UL) /*!< BODL comparator output is selected                       */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_Ready (0x3UL) /*!< READY is selected                                                 */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_BODLPWUP (0x4UL) /*!< Power up BODL is selected                                      */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_BODLBPWUP (0x5UL) /*!< Power up BODL bias is selected                                */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_BODLLCKACKSW (0x6UL) /*!< BODL lock acknowledge is selected                          */
  #define VDETAO1V8_DFT_DTB0CONFIG_SELMUX_BODLCompOutputHS (0x7UL) /*!< BODL comparator output after handshake is selected     */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDETAO1V8_DFT_DTB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO1V8_DFT_DTB0CONFIG_EN_Msk (0x1UL << VDETAO1V8_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO1V8_DFT_DTB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_DFT_DTB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VDETAO1V8_DFT_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VDETAO1V8_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VDETAO1V8_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                          */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB1 */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_Msk (0x7UL << VDETAO1V8_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_Max (0x7UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_BODLReady (0x0UL) /*!< BODL ready is selected                                        */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_BODHReady (0x1UL) /*!< BODH ready is selected                                        */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_BODHCompOutput (0x2UL) /*!< BODH comparator output is selected                       */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_Settled (0x3UL) /*!< SETTLED is selected                                             */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_BODHPwUp (0x4UL) /*!< Power up BODH is selected                                      */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_BODHPwUpB (0x5UL) /*!< Power up BODH bias is selected                                */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_BODHLckReqSW (0x6UL) /*!< BODH Lock Req SW is selected                               */
  #define VDETAO1V8_DFT_DTB1CONFIG_SELMUX_BODLCompOutputHS (0x7UL) /*!< BODH comparator output after handshake is selected     */

