adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define VDETAO1V8_DFT_DTB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO1V8_DFT_DTB1CONFIG_EN_Msk (0x1UL << VDETAO1V8_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO1V8_DFT_DTB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO1V8_DFT_DTB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO1V8_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VDETAO1V8_DFT_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VDETAO1V8_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VDETAO1V8_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                          */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VDETAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                */
  #define VDETAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VDETAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/
  #define VDETAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                   */
  #define VDETAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                   */
  #define VDETAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                     */
  #define VDETAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                       */


/* VDETAO1V8_DFT_TCFG: Test mode configuration */
  #define VDETAO1V8_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                      */

/* PWRUPBODHCOMP @Bit 0 : Power-up signal for BODH comparator */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMP_Pos (0UL) /*!< Position of PWRUPBODHCOMP field.                                     */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMP_Msk (0x1UL << VDETAO1V8_DFT_TCFG_PWRUPBODHCOMP_Pos) /*!< Bit mask of PWRUPBODHCOMP
                                                                            field.*/
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMP_Min (0x0UL) /*!< Min enumerator value of PWRUPBODHCOMP field.                       */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMP_Max (0x1UL) /*!< Max enumerator value of PWRUPBODHCOMP field.                       */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMP_Disabled (0x0UL) /*!< Power-up disabled                                             */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMP_Enabled (0x1UL) /*!< Power-up enabled                                               */

/* PWRUPBODHCOMPB @Bit 1 : Power-up signal for BODH comparator bias */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMPB_Pos (1UL) /*!< Position of PWRUPBODHCOMPB field.                                   */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMPB_Msk (0x1UL << VDETAO1V8_DFT_TCFG_PWRUPBODHCOMPB_Pos) /*!< Bit mask of PWRUPBODHCOMPB
                                                                            field.*/
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMPB_Min (0x0UL) /*!< Min enumerator value of PWRUPBODHCOMPB field.                     */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMPB_Max (0x1UL) /*!< Max enumerator value of PWRUPBODHCOMPB field.                     */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMPB_Disabled (0x0UL) /*!< Power-up disabled                                            */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODHCOMPB_Enabled (0x1UL) /*!< Power-up enabled                                              */

/* BODHLOCK @Bit 2 : BODH lock request signal */
  #define VDETAO1V8_DFT_TCFG_BODHLOCK_Pos (2UL)      /*!< Position of BODHLOCK field.                                          */
  #define VDETAO1V8_DFT_TCFG_BODHLOCK_Msk (0x1UL << VDETAO1V8_DFT_TCFG_BODHLOCK_Pos) /*!< Bit mask of BODHLOCK field.          */
  #define VDETAO1V8_DFT_TCFG_BODHLOCK_Min (0x0UL)    /*!< Min enumerator value of BODHLOCK field.                              */
  #define VDETAO1V8_DFT_TCFG_BODHLOCK_Max (0x1UL)    /*!< Max enumerator value of BODHLOCK field.                              */
  #define VDETAO1V8_DFT_TCFG_BODHLOCK_Disabled (0x0UL) /*!< Lock request is 0                                                  */
  #define VDETAO1V8_DFT_TCFG_BODHLOCK_Enabled (0x1UL) /*!< Lock request is 1                                                   */

/* PWRUPBODLCOMP @Bit 3 : Power-up signal for BODL comparator */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMP_Pos (3UL) /*!< Position of PWRUPBODLCOMP field.                                     */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMP_Msk (0x1UL << VDETAO1V8_DFT_TCFG_PWRUPBODLCOMP_Pos) /*!< Bit mask of PWRUPBODLCOMP
                                                                            field.*/
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMP_Min (0x0UL) /*!< Min enumerator value of PWRUPBODLCOMP field.                       */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMP_Max (0x1UL) /*!< Max enumerator value of PWRUPBODLCOMP field.                       */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMP_Disabled (0x0UL) /*!< Power-up disabled                                             */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMP_Enabled (0x1UL) /*!< Power-up enabled                                               */

/* PWRUPBODLCOMPB @Bit 4 : Power-up signal for BODL comparator bias */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMPB_Pos (4UL) /*!< Position of PWRUPBODLCOMPB field.                                   */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMPB_Msk (0x1UL << VDETAO1V8_DFT_TCFG_PWRUPBODLCOMPB_Pos) /*!< Bit mask of PWRUPBODLCOMPB
                                                                            field.*/
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMPB_Min (0x0UL) /*!< Min enumerator value of PWRUPBODLCOMPB field.                     */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMPB_Max (0x1UL) /*!< Max enumerator value of PWRUPBODLCOMPB field.                     */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMPB_Disabled (0x0UL) /*!< Power-up disabled                                            */
  #define VDETAO1V8_DFT_TCFG_PWRUPBODLCOMPB_Enabled (0x1UL) /*!< Power-up enabled                                              */

/* ENABLEOVERRIDE @Bit 5 : Enable bits [4:0] in TCFG for overriding internal controls */
  #define VDETAO1V8_DFT_TCFG_ENABLEOVERRIDE_Pos (5UL) /*!< Position of ENABLEOVERRIDE field.                                   */
  #define VDETAO1V8_DFT_TCFG_ENABLEOVERRIDE_Msk (0x1UL << VDETAO1V8_DFT_TCFG_ENABLEOVERRIDE_Pos) /*!< Bit mask of ENABLEOVERRIDE
                                                                            field.*/
  #define VDETAO1V8_DFT_TCFG_ENABLEOVERRIDE_Min (0x0UL) /*!< Min enumerator value of ENABLEOVERRIDE field.                     */
  #define VDETAO1V8_DFT_TCFG_ENABLEOVERRIDE_Max (0x1UL) /*!< Max enumerator value of ENABLEOVERRIDE field.                     */
  #define VDETAO1V8_DFT_TCFG_ENABLEOVERRIDE_Disabled (0x0UL) /*!< Overriding internal controls disabled                        */
  #define VDETAO1V8_DFT_TCFG_ENABLEOVERRIDE_Enabled (0x1UL) /*!< Overriding internal controls enabled                          */

