adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VDETAO5V0_TRIM_PWRGOOD: Power good detector trimming */
  #define VDETAO5V0_TRIM_PWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of PWRGOOD register.                               */

/* VAL @Bits 0..2 : Threshold voltage trimming value */
  #define VDETAO5V0_TRIM_PWRGOOD_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VDETAO5V0_TRIM_PWRGOOD_VAL_Msk (0x7UL << VDETAO5V0_TRIM_PWRGOOD_VAL_Pos) /*!< Bit mask of VAL field.                 */



/* ================================================ Struct VDETAO5V0_OVERRIDE ================================================ */
/**
  * @brief OVERRIDE [VDETAO5V0_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODEULPR;                          /*!< (@ 0x00000008) Override the MODE_ULPR signal to the analog module    */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x0000000C) Override the MODE_LP signal to the analog module      */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000010) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000014) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  PGD;                               /*!< (@ 0x00000018) Override the PGD signal from the analog module        */
} NRF_VDETAO5V0_OVERRIDE_Type;                       /*!< Size = 28 (0x01C)                                                    */

/* VDETAO5V0_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VDETAO5V0_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO5V0_OVERRIDE_PWRUP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VDETAO5V0_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VDETAO5V0_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VDETAO5V0_OVERRIDE_PWRUP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO5V0_OVERRIDE_PWRUP_EN_Msk (0x1UL << VDETAO5V0_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO5V0_OVERRIDE_PWRUP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_PWRUP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VDETAO5V0_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VDETAO5V0_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VDETAO5V0_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO5V0_OVERRIDE_RETAIN_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDETAO5V0_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VDETAO5V0_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VDETAO5V0_OVERRIDE_RETAIN_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETAO5V0_OVERRIDE_RETAIN_EN_Msk (0x1UL << VDETAO5V0_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETAO5V0_OVERRIDE_RETAIN_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_RETAIN_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VDETAO5V0_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VDETAO5V0_OVERRIDE_MODEULPR: Override the MODE_ULPR signal to the analog module */
  #define VDETAO5V0_OVERRIDE_MODEULPR_ResetValue (0x00000000UL) /*!< Reset value of MODEULPR register.                         */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO5V0_OVERRIDE_MODEULPR_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETAO5V0_OVERRIDE_MODEULPR_VAL_Msk (0x1UL << VDETAO5V0_OVERRIDE_MODEULPR_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VDETAO5V0_OVERRIDE_MODEULPR_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VDETAO5V0_OVERRIDE_MODEULPR_EN_Msk (0x1UL << VDETAO5V0_OVERRIDE_MODEULPR_EN_Pos) /*!< Bit mask of EN field.          */
  #define VDETAO5V0_OVERRIDE_MODEULPR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_MODEULPR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_MODEULPR_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VDETAO5V0_OVERRIDE_MODEULPR_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


/* VDETAO5V0_OVERRIDE_MODELP: Override the MODE_LP signal to the analog module */
  #define VDETAO5V0_OVERRIDE_MODELP_ResetValue (0x00000000UL) /*!< Reset value of MODELP register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO5V0_OVERRIDE_MODELP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDETAO5V0_OVERRIDE_MODELP_VAL_Msk (0x1UL << VDETAO5V0_OVERRIDE_MODELP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VDETAO5V0_OVERRIDE_MODELP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETAO5V0_OVERRIDE_MODELP_EN_Msk (0x1UL << VDETAO5V0_OVERRIDE_MODELP_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETAO5V0_OVERRIDE_MODELP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_MODELP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_MODELP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VDETAO5V0_OVERRIDE_MODELP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VDETAO5V0_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VDETAO5V0_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETAO5V0_OVERRIDE_READY_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VDETAO5V0_OVERRIDE_READY_VAL_Msk (0x1UL << VDETAO5V0_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VDETAO5V0_OVERRIDE_READY_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO5V0_OVERRIDE_READY_EN_Msk (0x1UL << VDETAO5V0_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO5V0_OVERRIDE_READY_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_READY_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO5V0_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VDETAO5V0_OVERRIDE_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


