adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define VDETAO5V0_INTENSET_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETAO5V0_INTENSET_SETTLED_Msk (0x1UL << VDETAO5V0_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETAO5V0_INTENSET_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO5V0_INTENSET_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO5V0_INTENSET_SETTLED_Set (0x1UL)     /*!< Enable                                                               */
  #define VDETAO5V0_INTENSET_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETAO5V0_INTENSET_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* VDETAO5V0_INTENCLR: Disable interrupt */
  #define VDETAO5V0_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                  */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VDETAO5V0_INTENCLR_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETAO5V0_INTENCLR_READY_Msk (0x1UL << VDETAO5V0_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETAO5V0_INTENCLR_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETAO5V0_INTENCLR_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETAO5V0_INTENCLR_READY_Clear (0x1UL)     /*!< Disable                                                              */
  #define VDETAO5V0_INTENCLR_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDETAO5V0_INTENCLR_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define VDETAO5V0_INTENCLR_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETAO5V0_INTENCLR_SETTLED_Msk (0x1UL << VDETAO5V0_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETAO5V0_INTENCLR_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO5V0_INTENCLR_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO5V0_INTENCLR_SETTLED_Clear (0x1UL)   /*!< Disable                                                              */
  #define VDETAO5V0_INTENCLR_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETAO5V0_INTENCLR_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* VDETAO5V0_INTPEND: Pending interrupts */
  #define VDETAO5V0_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                    */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VDETAO5V0_INTPEND_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VDETAO5V0_INTPEND_READY_Msk (0x1UL << VDETAO5V0_INTPEND_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VDETAO5V0_INTPEND_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VDETAO5V0_INTPEND_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VDETAO5V0_INTPEND_READY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VDETAO5V0_INTPEND_READY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define VDETAO5V0_INTPEND_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VDETAO5V0_INTPEND_SETTLED_Msk (0x1UL << VDETAO5V0_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */
  #define VDETAO5V0_INTPEND_SETTLED_Min (0x0UL)      /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO5V0_INTPEND_SETTLED_Max (0x1UL)      /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO5V0_INTPEND_SETTLED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VDETAO5V0_INTPEND_SETTLED_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* VDETAO5V0_STATUS: Voltage detector status */
  #define VDETAO5V0_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Current voltage detector mode */
  #define VDETAO5V0_STATUS_MODE_Pos (0UL)            /*!< Position of MODE field.                                              */
  #define VDETAO5V0_STATUS_MODE_Msk (0x3UL << VDETAO5V0_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define VDETAO5V0_STATUS_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define VDETAO5V0_STATUS_MODE_Max (0x2UL)          /*!< Max enumerator value of MODE field.                                  */
  #define VDETAO5V0_STATUS_MODE_HighPower (0x0UL)    /*!< High power mode                                                      */
  #define VDETAO5V0_STATUS_MODE_LowPower (0x1UL)     /*!< Low power mode                                                       */
  #define VDETAO5V0_STATUS_MODE_UltraLowPowerRefresh (0x2UL) /*!< Ultra-low power refresh mode                                 */


/* VDETAO5V0_STATUSANA: Status of analog module output signals */
  #define VDETAO5V0_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VDETAO5V0_STATUSANA_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VDETAO5V0_STATUSANA_READY_Msk (0x1UL << VDETAO5V0_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                 */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VDETAO5V0_STATUSANA_SETTLED_Pos (1UL)      /*!< Position of SETTLED field.                                           */
  #define VDETAO5V0_STATUSANA_SETTLED_Msk (0x1UL << VDETAO5V0_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.           */

