adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PGD @Bit 2 : Current value of the PGD signal from the analog module */
  #define VDETAO5V0_STATUSANA_PGD_Pos (2UL)          /*!< Position of PGD field.                                               */
  #define VDETAO5V0_STATUSANA_PGD_Msk (0x1UL << VDETAO5V0_STATUSANA_PGD_Pos) /*!< Bit mask of PGD field.                       */


/* VDETAO5V0_MIRROR: Enable LOCK for mirrored registers */
  #define VDETAO5V0_MIRROR_ResetValue (0x00000001UL) /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VDETAO5V0_MIRROR_LOCK_Pos (0UL)            /*!< Position of LOCK field.                                              */
  #define VDETAO5V0_MIRROR_LOCK_Msk (0x1UL << VDETAO5V0_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                          */
  #define VDETAO5V0_MIRROR_LOCK_Min (0x0UL)          /*!< Min enumerator value of LOCK field.                                  */
  #define VDETAO5V0_MIRROR_LOCK_Max (0x1UL)          /*!< Max enumerator value of LOCK field.                                  */
  #define VDETAO5V0_MIRROR_LOCK_Disabled (0x0UL)     /*!< Lock disabled                                                        */
  #define VDETAO5V0_MIRROR_LOCK_Enabled (0x1UL)      /*!< Lock enabled                                                         */


/* VDETAO5V0_MODE: Voltage detector mode */
  #define VDETAO5V0_MODE_ResetValue (0x00000000UL)   /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Mode */
  #define VDETAO5V0_MODE_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define VDETAO5V0_MODE_MODE_Msk (0x3UL << VDETAO5V0_MODE_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define VDETAO5V0_MODE_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define VDETAO5V0_MODE_MODE_Max (0x3UL)            /*!< Max enumerator value of MODE field.                                  */
  #define VDETAO5V0_MODE_MODE_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define VDETAO5V0_MODE_MODE_HighPower (0x1UL)      /*!< High power mode                                                      */
  #define VDETAO5V0_MODE_MODE_LowPower (0x2UL)       /*!< Low power mode                                                       */
  #define VDETAO5V0_MODE_MODE_UltraLowPowerRefresh (0x3UL) /*!< Ultra-low power refresh mode                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VDETIO                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct VDETIO_CONFIG =================================================== */
/**
  * @brief CONFIG [VDETIO_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Power good detector configuration                     */
} NRF_VDETIO_CONFIG_Type;                            /*!< Size = 4 (0x004)                                                     */

/* VDETIO_CONFIG_PWRGOOD: Power good detector configuration */
  #define VDETIO_CONFIG_PWRGOOD_ResetValue (0x000002C6UL) /*!< Reset value of PWRGOOD register.                                */

/* EN0 @Bit 0 : Enable the power good detector for port [0] */
  #define VDETIO_CONFIG_PWRGOOD_EN0_Pos (0UL)        /*!< Position of EN0 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN0_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN0_Pos) /*!< Bit mask of EN0 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN0_Min (0x0UL)      /*!< Min enumerator value of EN0 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN0_Max (0x1UL)      /*!< Max enumerator value of EN0 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN0_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN0_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN1 @Bit 1 : Enable the power good detector for port [1] */
  #define VDETIO_CONFIG_PWRGOOD_EN1_Pos (1UL)        /*!< Position of EN1 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN1_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN1_Pos) /*!< Bit mask of EN1 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN1_Min (0x0UL)      /*!< Min enumerator value of EN1 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN1_Max (0x1UL)      /*!< Max enumerator value of EN1 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN1_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN1_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN2 @Bit 2 : Enable the power good detector for port [2] */
  #define VDETIO_CONFIG_PWRGOOD_EN2_Pos (2UL)        /*!< Position of EN2 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN2_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN2_Pos) /*!< Bit mask of EN2 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN2_Min (0x0UL)      /*!< Min enumerator value of EN2 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN2_Max (0x1UL)      /*!< Max enumerator value of EN2 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN2_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN2_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN3 @Bit 3 : Enable the power good detector for port [3] */
  #define VDETIO_CONFIG_PWRGOOD_EN3_Pos (3UL)        /*!< Position of EN3 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN3_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN3_Pos) /*!< Bit mask of EN3 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN3_Min (0x0UL)      /*!< Min enumerator value of EN3 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN3_Max (0x1UL)      /*!< Max enumerator value of EN3 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN3_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN3_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

