adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN4 @Bit 4 : Enable the power good detector for port [4] */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Pos (4UL)        /*!< Position of EN4 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN4_Pos) /*!< Bit mask of EN4 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Min (0x0UL)      /*!< Min enumerator value of EN4 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Max (0x1UL)      /*!< Max enumerator value of EN4 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN5 @Bit 5 : Enable the power good detector for port [5] */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Pos (5UL)        /*!< Position of EN5 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN5_Pos) /*!< Bit mask of EN5 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Min (0x0UL)      /*!< Min enumerator value of EN5 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Max (0x1UL)      /*!< Max enumerator value of EN5 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN6 @Bit 6 : Enable the power good detector for port [6] */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Pos (6UL)        /*!< Position of EN6 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN6_Pos) /*!< Bit mask of EN6 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Min (0x0UL)      /*!< Min enumerator value of EN6 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Max (0x1UL)      /*!< Max enumerator value of EN6 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN7 @Bit 7 : Enable the power good detector for port [7] */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Pos (7UL)        /*!< Position of EN7 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN7_Pos) /*!< Bit mask of EN7 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Min (0x0UL)      /*!< Min enumerator value of EN7 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Max (0x1UL)      /*!< Max enumerator value of EN7 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN8 @Bit 8 : Enable the power good detector for port [8] */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Pos (8UL)        /*!< Position of EN8 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN8_Pos) /*!< Bit mask of EN8 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Min (0x0UL)      /*!< Min enumerator value of EN8 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Max (0x1UL)      /*!< Max enumerator value of EN8 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN9 @Bit 9 : Enable the power good detector for port [9] */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Pos (9UL)        /*!< Position of EN9 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN9_Pos) /*!< Bit mask of EN9 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Min (0x0UL)      /*!< Min enumerator value of EN9 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Max (0x1UL)      /*!< Max enumerator value of EN9 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */


/* ====================================================== Struct VDETIO ====================================================== */
/**
  * @brief VDETIO peripheral
  */
  typedef struct {                                   /*!< VDETIO Structure                                                     */
    __IM uint32_t RESERVED[256];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Voltage detector status                               */
    __IM uint32_t RESERVED1[3];
    __IOM NRF_VDETIO_CONFIG_Type CONFIG;             /*!< (@ 0x00000410) (unspecified)                                         */
  } NRF_VDETIO_Type;                                 /*!< Size = 1044 (0x414)                                                  */

/* VDETIO_STATUS: Voltage detector status */
  #define VDETIO_STATUS_ResetValue (0x00000000UL)    /*!< Reset value of STATUS register.                                      */

/* PWRGOOD0 @Bit 0 : Power good detector status for port [0] */
  #define VDETIO_STATUS_PWRGOOD0_Pos (0UL)           /*!< Position of PWRGOOD0 field.                                          */
  #define VDETIO_STATUS_PWRGOOD0_Msk (0x1UL << VDETIO_STATUS_PWRGOOD0_Pos) /*!< Bit mask of PWRGOOD0 field.                    */
  #define VDETIO_STATUS_PWRGOOD0_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD0 field.                              */
  #define VDETIO_STATUS_PWRGOOD0_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD0 field.                              */
  #define VDETIO_STATUS_PWRGOOD0_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD0_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD1 @Bit 1 : Power good detector status for port [1] */
  #define VDETIO_STATUS_PWRGOOD1_Pos (1UL)           /*!< Position of PWRGOOD1 field.                                          */
  #define VDETIO_STATUS_PWRGOOD1_Msk (0x1UL << VDETIO_STATUS_PWRGOOD1_Pos) /*!< Bit mask of PWRGOOD1 field.                    */
  #define VDETIO_STATUS_PWRGOOD1_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD1 field.                              */
  #define VDETIO_STATUS_PWRGOOD1_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD1 field.                              */
  #define VDETIO_STATUS_PWRGOOD1_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD1_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD2 @Bit 2 : Power good detector status for port [2] */
  #define VDETIO_STATUS_PWRGOOD2_Pos (2UL)           /*!< Position of PWRGOOD2 field.                                          */
  #define VDETIO_STATUS_PWRGOOD2_Msk (0x1UL << VDETIO_STATUS_PWRGOOD2_Pos) /*!< Bit mask of PWRGOOD2 field.                    */
  #define VDETIO_STATUS_PWRGOOD2_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD2 field.                              */
  #define VDETIO_STATUS_PWRGOOD2_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD2 field.                              */
  #define VDETIO_STATUS_PWRGOOD2_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD2_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD3 @Bit 3 : Power good detector status for port [3] */
  #define VDETIO_STATUS_PWRGOOD3_Pos (3UL)           /*!< Position of PWRGOOD3 field.                                          */
  #define VDETIO_STATUS_PWRGOOD3_Msk (0x1UL << VDETIO_STATUS_PWRGOOD3_Pos) /*!< Bit mask of PWRGOOD3 field.                    */
  #define VDETIO_STATUS_PWRGOOD3_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD3 field.                              */
  #define VDETIO_STATUS_PWRGOOD3_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD3 field.                              */
  #define VDETIO_STATUS_PWRGOOD3_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD3_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD4 @Bit 4 : Power good detector status for port [4] */
  #define VDETIO_STATUS_PWRGOOD4_Pos (4UL)           /*!< Position of PWRGOOD4 field.                                          */
  #define VDETIO_STATUS_PWRGOOD4_Msk (0x1UL << VDETIO_STATUS_PWRGOOD4_Pos) /*!< Bit mask of PWRGOOD4 field.                    */
  #define VDETIO_STATUS_PWRGOOD4_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD4 field.                              */
  #define VDETIO_STATUS_PWRGOOD4_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD4 field.                              */
  #define VDETIO_STATUS_PWRGOOD4_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD4_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD5 @Bit 5 : Power good detector status for port [5] */
  #define VDETIO_STATUS_PWRGOOD5_Pos (5UL)           /*!< Position of PWRGOOD5 field.                                          */
  #define VDETIO_STATUS_PWRGOOD5_Msk (0x1UL << VDETIO_STATUS_PWRGOOD5_Pos) /*!< Bit mask of PWRGOOD5 field.                    */
  #define VDETIO_STATUS_PWRGOOD5_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD5 field.                              */
  #define VDETIO_STATUS_PWRGOOD5_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD5 field.                              */
  #define VDETIO_STATUS_PWRGOOD5_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD5_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD6 @Bit 6 : Power good detector status for port [6] */
  #define VDETIO_STATUS_PWRGOOD6_Pos (6UL)           /*!< Position of PWRGOOD6 field.                                          */
  #define VDETIO_STATUS_PWRGOOD6_Msk (0x1UL << VDETIO_STATUS_PWRGOOD6_Pos) /*!< Bit mask of PWRGOOD6 field.                    */
  #define VDETIO_STATUS_PWRGOOD6_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD6 field.                              */
  #define VDETIO_STATUS_PWRGOOD6_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD6 field.                              */
  #define VDETIO_STATUS_PWRGOOD6_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD6_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD7 @Bit 7 : Power good detector status for port [7] */
  #define VDETIO_STATUS_PWRGOOD7_Pos (7UL)           /*!< Position of PWRGOOD7 field.                                          */
  #define VDETIO_STATUS_PWRGOOD7_Msk (0x1UL << VDETIO_STATUS_PWRGOOD7_Pos) /*!< Bit mask of PWRGOOD7 field.                    */
  #define VDETIO_STATUS_PWRGOOD7_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD7 field.                              */
  #define VDETIO_STATUS_PWRGOOD7_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD7 field.                              */
  #define VDETIO_STATUS_PWRGOOD7_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD7_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD8 @Bit 8 : Power good detector status for port [8] */
  #define VDETIO_STATUS_PWRGOOD8_Pos (8UL)           /*!< Position of PWRGOOD8 field.                                          */
  #define VDETIO_STATUS_PWRGOOD8_Msk (0x1UL << VDETIO_STATUS_PWRGOOD8_Pos) /*!< Bit mask of PWRGOOD8 field.                    */
  #define VDETIO_STATUS_PWRGOOD8_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD8 field.                              */
  #define VDETIO_STATUS_PWRGOOD8_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD8 field.                              */
  #define VDETIO_STATUS_PWRGOOD8_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD8_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

