adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PWRGOOD9 @Bit 9 : Power good detector status for port [9] */
  #define VDETIO_STATUS_PWRGOOD9_Pos (9UL)           /*!< Position of PWRGOOD9 field.                                          */
  #define VDETIO_STATUS_PWRGOOD9_Msk (0x1UL << VDETIO_STATUS_PWRGOOD9_Pos) /*!< Bit mask of PWRGOOD9 field.                    */
  #define VDETIO_STATUS_PWRGOOD9_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD9 field.                              */
  #define VDETIO_STATUS_PWRGOOD9_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD9 field.                              */
  #define VDETIO_STATUS_PWRGOOD9_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD9_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        VDETPOF5V0                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct VDETPOF5V0_CONFIG ================================================= */
/**
  * @brief CONFIG [VDETPOF5V0_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Voltage detector configuration                        */
  __IOM uint32_t  POFWARNLVL;                        /*!< (@ 0x00000004) Power fail comparator threshold voltage level         */
} NRF_VDETPOF5V0_CONFIG_Type;                        /*!< Size = 8 (0x008)                                                     */

/* VDETPOF5V0_CONFIG_CFG: Voltage detector configuration */
  #define VDETPOF5V0_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                    */

/* POFWARNHYST @Bits 0..1 : Power fail comparator hysteresis voltage value */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Pos (0UL) /*!< Position of POFWARNHYST field.                                      */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Msk (0x3UL << VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Pos) /*!< Bit mask of POFWARNHYST
                                                                            field.*/
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Min (0x0UL) /*!< Min enumerator value of POFWARNHYST field.                        */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Max (0x3UL) /*!< Max enumerator value of POFWARNHYST field.                        */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Val0V050 (0x0UL) /*!< Hysteresis voltage is 50mV                                   */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Val0V100 (0x1UL) /*!< Hysteresis voltage is 100mV                                  */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Val0V000 (0x2UL) /*!< Hysteresis voltage is 0mV                                    */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Val0V025 (0x3UL) /*!< Hysteresis voltage is 25mV                                   */


/* VDETPOF5V0_CONFIG_POFWARNLVL: Power fail comparator threshold voltage level */
  #define VDETPOF5V0_CONFIG_POFWARNLVL_ResetValue (0x00000000UL) /*!< Reset value of POFWARNLVL register.                      */

/* VAL @Bits 0..4 : Threshold voltage value. */
  #define VDETPOF5V0_CONFIG_POFWARNLVL_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VDETPOF5V0_CONFIG_POFWARNLVL_VAL_Msk (0x1FUL << VDETPOF5V0_CONFIG_POFWARNLVL_VAL_Pos) /*!< Bit mask of VAL field.    */



/* ================================================= Struct VDETPOF5V0_TRIM ================================================== */
/**
  * @brief TRIM [VDETPOF5V0_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  POFWARN;                           /*!< (@ 0x00000000) Power fail comparator trimming                        */
} NRF_VDETPOF5V0_TRIM_Type;                          /*!< Size = 4 (0x004)                                                     */

/* VDETPOF5V0_TRIM_POFWARN: Power fail comparator trimming */
  #define VDETPOF5V0_TRIM_POFWARN_ResetValue (0x00000000UL) /*!< Reset value of POFWARN register.                              */

/* VAL @Bits 0..2 : Threshold voltage trimming value */
  #define VDETPOF5V0_TRIM_POFWARN_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VDETPOF5V0_TRIM_POFWARN_VAL_Msk (0x7UL << VDETPOF5V0_TRIM_POFWARN_VAL_Pos) /*!< Bit mask of VAL field.               */



/* =============================================== Struct VDETPOF5V0_OVERRIDE ================================================ */
/**
  * @brief OVERRIDE [VDETPOF5V0_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x0000000C) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  POFWARN;                           /*!< (@ 0x00000010) Override the POFAO5V0_WARN signal from the analog
                                                                         module*/
} NRF_VDETPOF5V0_OVERRIDE_Type;                      /*!< Size = 20 (0x014)                                                    */

