adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define VDETPOF5V0_DFT_ATB0CONFIG_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETPOF5V0_DFT_ATB0CONFIG_EN_Msk (0x1UL << VDETPOF5V0_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETPOF5V0_DFT_ATB0CONFIG_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETPOF5V0_DFT_ATB0CONFIG_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETPOF5V0_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                       */
  #define VDETPOF5V0_DFT_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                         */


/* VDETPOF5V0_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VDETPOF5V0_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                         */

/* SELMUX @Bit 0 : Select multiplexer for ATB1 */
  #define VDETPOF5V0_DFT_ATB1CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                            */
  #define VDETPOF5V0_DFT_ATB1CONFIG_SELMUX_Msk (0x1UL << VDETPOF5V0_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.  */
  #define VDETPOF5V0_DFT_ATB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                              */
  #define VDETPOF5V0_DFT_ATB1CONFIG_SELMUX_Max (0x1UL) /*!< Max enumerator value of SELMUX field.                              */
  #define VDETPOF5V0_DFT_ATB1CONFIG_SELMUX_ConnectVref (0x0UL) /*!< Connect VREF to ATB1                                       */
  #define VDETPOF5V0_DFT_ATB1CONFIG_SELMUX_ConnectVdiv (0x1UL) /*!< Connect VDIV to ATB1                                       */

/* EN @Bit 31 : Enable the analog test bus */
  #define VDETPOF5V0_DFT_ATB1CONFIG_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETPOF5V0_DFT_ATB1CONFIG_EN_Msk (0x1UL << VDETPOF5V0_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETPOF5V0_DFT_ATB1CONFIG_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETPOF5V0_DFT_ATB1CONFIG_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETPOF5V0_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                       */
  #define VDETPOF5V0_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                         */


/* VDETPOF5V0_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VDETPOF5V0_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                         */

/* SELMUX @Bit 0 : Select multiplexer for DTB0 */
  #define VDETPOF5V0_DFT_DTB0CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                            */
  #define VDETPOF5V0_DFT_DTB0CONFIG_SELMUX_Msk (0x1UL << VDETPOF5V0_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.  */
  #define VDETPOF5V0_DFT_DTB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                              */
  #define VDETPOF5V0_DFT_DTB0CONFIG_SELMUX_Max (0x1UL) /*!< Max enumerator value of SELMUX field.                              */
  #define VDETPOF5V0_DFT_DTB0CONFIG_SELMUX_Ready (0x0UL) /*!< READY_POFAO5V0_AO_0V8                                            */
  #define VDETPOF5V0_DFT_DTB0CONFIG_SELMUX_PofWarn (0x1UL) /*!< POFAO5V0_WARN_AO_0V8                                           */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDETPOF5V0_DFT_DTB0CONFIG_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETPOF5V0_DFT_DTB0CONFIG_EN_Msk (0x1UL << VDETPOF5V0_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETPOF5V0_DFT_DTB0CONFIG_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETPOF5V0_DFT_DTB0CONFIG_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETPOF5V0_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                      */
  #define VDETPOF5V0_DFT_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                        */


/* VDETPOF5V0_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VDETPOF5V0_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                         */

/* SELMUX @Bit 0 : Select multiplexer for DTB1 */
  #define VDETPOF5V0_DFT_DTB1CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                            */
  #define VDETPOF5V0_DFT_DTB1CONFIG_SELMUX_Msk (0x1UL << VDETPOF5V0_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.  */
  #define VDETPOF5V0_DFT_DTB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                              */
  #define VDETPOF5V0_DFT_DTB1CONFIG_SELMUX_Max (0x1UL) /*!< Max enumerator value of SELMUX field.                              */
  #define VDETPOF5V0_DFT_DTB1CONFIG_SELMUX_ReadyCmp (0x0UL) /*!< POFAO5V0_READY_CMP_2DTB_0V8 (from READY_CMP_SW_1V8)           */
  #define VDETPOF5V0_DFT_DTB1CONFIG_SELMUX_Settled (0x1UL) /*!< SETTLED_POFAO5V0_AO_0V8                                        */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDETPOF5V0_DFT_DTB1CONFIG_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETPOF5V0_DFT_DTB1CONFIG_EN_Msk (0x1UL << VDETPOF5V0_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETPOF5V0_DFT_DTB1CONFIG_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETPOF5V0_DFT_DTB1CONFIG_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETPOF5V0_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                      */
  #define VDETPOF5V0_DFT_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                        */


/* VDETPOF5V0_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VDETPOF5V0_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                         */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VDETPOF5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                               */
  #define VDETPOF5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VDETPOF5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/
  #define VDETPOF5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                  */
  #define VDETPOF5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                  */
  #define VDETPOF5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                    */
  #define VDETPOF5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                      */


/* ==================================================== Struct VDETPOF5V0 ==================================================== */
/**
  * @brief VDETPOF5V0 peripheral
  */
  typedef struct {                                   /*!< VDETPOF5V0 Structure                                                 */
    __OM uint32_t TASKS_PWRUP;                       /*!< (@ 0x00000000) Power up voltage detector                             */
    __OM uint32_t TASKS_PWRDOWN;                     /*!< (@ 0x00000004) Power down voltage detector                           */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IOM uint32_t EVENTS_POFWARN;                   /*!< (@ 0x00000108) Power failure warning                                 */
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[61];
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_VDETPOF5V0_CONFIG_Type CONFIG;         /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_VDETPOF5V0_TRIM_Type TRIM;             /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[15];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IM uint32_t RESERVED6[31];
    __IOM NRF_VDETPOF5V0_OVERRIDE_Type OVERRIDE;     /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[59];
    __IOM NRF_VDETPOF5V0_DFT_Type DFT;               /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VDETPOF5V0_Type;                             /*!< Size = 1568 (0x620)                                                  */

