adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* POFWARN @Bit 2 : Write '1' to disable interrupt for event POFWARN */
  #define VDETPOF5V0_INTENCLR_POFWARN_Pos (2UL)      /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_INTENCLR_POFWARN_Msk (0x1UL << VDETPOF5V0_INTENCLR_POFWARN_Pos) /*!< Bit mask of POFWARN field.           */
  #define VDETPOF5V0_INTENCLR_POFWARN_Min (0x0UL)    /*!< Min enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTENCLR_POFWARN_Max (0x1UL)    /*!< Max enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTENCLR_POFWARN_Clear (0x1UL)  /*!< Disable                                                              */
  #define VDETPOF5V0_INTENCLR_POFWARN_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDETPOF5V0_INTENCLR_POFWARN_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* VDETPOF5V0_INTPEND: Pending interrupts */
  #define VDETPOF5V0_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                   */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VDETPOF5V0_INTPEND_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETPOF5V0_INTPEND_READY_Msk (0x1UL << VDETPOF5V0_INTPEND_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETPOF5V0_INTPEND_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTPEND_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTPEND_READY_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define VDETPOF5V0_INTPEND_READY_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define VDETPOF5V0_INTPEND_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETPOF5V0_INTPEND_SETTLED_Msk (0x1UL << VDETPOF5V0_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETPOF5V0_INTPEND_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETPOF5V0_INTPEND_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETPOF5V0_INTPEND_SETTLED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define VDETPOF5V0_INTPEND_SETTLED_Pending (0x1UL) /*!< Read: Pending                                                        */

/* POFWARN @Bit 2 : Read pending status of interrupt for event POFWARN */
  #define VDETPOF5V0_INTPEND_POFWARN_Pos (2UL)       /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_INTPEND_POFWARN_Msk (0x1UL << VDETPOF5V0_INTPEND_POFWARN_Pos) /*!< Bit mask of POFWARN field.             */
  #define VDETPOF5V0_INTPEND_POFWARN_Min (0x0UL)     /*!< Min enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTPEND_POFWARN_Max (0x1UL)     /*!< Max enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTPEND_POFWARN_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define VDETPOF5V0_INTPEND_POFWARN_Pending (0x1UL) /*!< Read: Pending                                                        */


/* VDETPOF5V0_STATUSANA: Status of analog module output signals */
  #define VDETPOF5V0_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                               */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VDETPOF5V0_STATUSANA_READY_Pos (0UL)       /*!< Position of READY field.                                             */
  #define VDETPOF5V0_STATUSANA_READY_Msk (0x1UL << VDETPOF5V0_STATUSANA_READY_Pos) /*!< Bit mask of READY field.               */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VDETPOF5V0_STATUSANA_SETTLED_Pos (1UL)     /*!< Position of SETTLED field.                                           */
  #define VDETPOF5V0_STATUSANA_SETTLED_Msk (0x1UL << VDETPOF5V0_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.         */

/* POFWARN @Bit 2 : Current value of the POFAO5V0_WARN signal from the analog module */
  #define VDETPOF5V0_STATUSANA_POFWARN_Pos (2UL)     /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_STATUSANA_POFWARN_Msk (0x1UL << VDETPOF5V0_STATUSANA_POFWARN_Pos) /*!< Bit mask of POFWARN field.         */


/* VDETPOF5V0_MIRROR: Enable LOCK for mirrored registers */
  #define VDETPOF5V0_MIRROR_ResetValue (0x00000001UL) /*!< Reset value of MIRROR register.                                     */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VDETPOF5V0_MIRROR_LOCK_Pos (0UL)           /*!< Position of LOCK field.                                              */
  #define VDETPOF5V0_MIRROR_LOCK_Msk (0x1UL << VDETPOF5V0_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                        */
  #define VDETPOF5V0_MIRROR_LOCK_Min (0x0UL)         /*!< Min enumerator value of LOCK field.                                  */
  #define VDETPOF5V0_MIRROR_LOCK_Max (0x1UL)         /*!< Max enumerator value of LOCK field.                                  */
  #define VDETPOF5V0_MIRROR_LOCK_Disabled (0x0UL)    /*!< Lock disabled                                                        */
  #define VDETPOF5V0_MIRROR_LOCK_Enabled (0x1UL)     /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VDETVS0V8                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VDETVS0V8_CONFIG ================================================= */
/**
  * @brief CONFIG [VDETVS0V8_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Voltage detector configuration                        */
  __IOM uint32_t  PWRGOODLVL;                        /*!< (@ 0x00000004) Power good detector threshold voltage level           */
  __IOM uint32_t  BROWNOUTLVL;                       /*!< (@ 0x00000008) Brown out detector threshold voltage level            */
} NRF_VDETVS0V8_CONFIG_Type;                         /*!< Size = 12 (0x00C)                                                    */

