adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SELMUX @Bits 0..2 : Select multiplexer for DTB1 */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Msk (0x7UL << VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Min (0x1UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Max (0x7UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_ReadyVDETAO0V8AO0V8 (0x1UL) /*!< READY_VDETAO0V8_AO_0V8                              */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_BODCompOutput (0x2UL) /*!< BOD comparator output                                     */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_BODCompOutputPost (0x3UL) /*!< BOD comparator output after the deglitch logic.       */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_PWRUPBODSW1V8 (0x4UL) /*!< PWRUP_BOD_SW_1V8                                          */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_PWRUPBODBIASSW1V8 (0x5UL) /*!< PWRUP_BOD_BIAS_SW_1V8                                 */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_BODLockReqSW1V8 (0x6UL) /*!< BOD_LOCK_REQ_SW_1V8                                     */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_ReadyBODSW1V8 (0x7UL) /*!< READY_BOD_SW_1V8                                          */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Msk (0x1UL << VDETVS0V8_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VDETVS0V8_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VDETVS0V8_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                          */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                   */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                   */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                     */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                       */


/* VDETVS0V8_DFT_TCFG: Test mode configuration */
  #define VDETVS0V8_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                      */

/* VDETAO0V8PGDAO0V8 @Bit 0 : Override VDETAO0V8_PGD_AO_0V8 to 0 */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Pos (0UL) /*!< Position of VDETAO0V8PGDAO0V8 field.                             */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Msk (0x1UL << VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Pos) /*!< Bit mask of
                                                                            VDETAO0V8PGDAO0V8 field.*/
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Min (0x0UL) /*!< Min enumerator value of VDETAO0V8PGDAO0V8 field.               */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Max (0x1UL) /*!< Max enumerator value of VDETAO0V8PGDAO0V8 field.               */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Disabled (0x0UL) /*!< Override disabled                                         */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Enabled (0x1UL) /*!< Override enabled                                           */

/* VDETAO0V8BODAO0V81V8 @Bit 1 : Override VDETAO0V8_BOD_AO_0V8 and VDETAO0V8_BOD_AO_1V8 to 0 */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Pos (1UL) /*!< Position of VDETAO0V8BODAO0V81V8 field.                       */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Msk (0x1UL << VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Pos) /*!< Bit mask of
                                                                            VDETAO0V8BODAO0V81V8 field.*/
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Min (0x0UL) /*!< Min enumerator value of VDETAO0V8BODAO0V81V8 field.         */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Max (0x1UL) /*!< Max enumerator value of VDETAO0V8BODAO0V81V8 field.         */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Disabled (0x0UL) /*!< Override disabled                                      */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Enabled (0x1UL) /*!< Override enabled                                        */

/* PGDCOMPARATOR @Bit 2 : If bit TCFG.OVERRIDEN is one, this bit will directly control the internal power-up or power-down the
                          PGD comparator. */

  #define VDETVS0V8_DFT_TCFG_PGDCOMPARATOR_Pos (2UL) /*!< Position of PGDCOMPARATOR field.                                     */
  #define VDETVS0V8_DFT_TCFG_PGDCOMPARATOR_Msk (0x1UL << VDETVS0V8_DFT_TCFG_PGDCOMPARATOR_Pos) /*!< Bit mask of PGDCOMPARATOR
                                                                            field.*/

/* BODCOMPARATOR @Bit 3 : If bit TCFG.OVERRIDEN is one, this bit will directly control power-up or power-down the BOD
                          comparator. */

  #define VDETVS0V8_DFT_TCFG_BODCOMPARATOR_Pos (3UL) /*!< Position of BODCOMPARATOR field.                                     */
  #define VDETVS0V8_DFT_TCFG_BODCOMPARATOR_Msk (0x1UL << VDETVS0V8_DFT_TCFG_BODCOMPARATOR_Pos) /*!< Bit mask of BODCOMPARATOR
                                                                            field.*/

/* BODCOMPARATOR1UA @Bit 4 : If bit TCFG.OVERRIDEN is one, this bit will directly control power-up or power-down the BOD
                             comparator 500nA bias. */

  #define VDETVS0V8_DFT_TCFG_BODCOMPARATOR1UA_Pos (4UL) /*!< Position of BODCOMPARATOR1UA field.                               */
  #define VDETVS0V8_DFT_TCFG_BODCOMPARATOR1UA_Msk (0x1UL << VDETVS0V8_DFT_TCFG_BODCOMPARATOR1UA_Pos) /*!< Bit mask of
                                                                            BODCOMPARATOR1UA field.*/

/* UNLOCKBOD @Bit 5 : Unlock the BOD deglitch logic when TCFG.OVERRIDEN is one. No effect when bit TCFG.OVERRIDEN is 0. */
  #define VDETVS0V8_DFT_TCFG_UNLOCKBOD_Pos (5UL)     /*!< Position of UNLOCKBOD field.                                         */
  #define VDETVS0V8_DFT_TCFG_UNLOCKBOD_Msk (0x1UL << VDETVS0V8_DFT_TCFG_UNLOCKBOD_Pos) /*!< Bit mask of UNLOCKBOD field.       */

/* OVERRIDEN @Bit 6 : Override of the internal logic to change the power-up and power-down of internal blocks independently. */
  #define VDETVS0V8_DFT_TCFG_OVERRIDEN_Pos (6UL)     /*!< Position of OVERRIDEN field.                                         */
  #define VDETVS0V8_DFT_TCFG_OVERRIDEN_Msk (0x1UL << VDETVS0V8_DFT_TCFG_OVERRIDEN_Pos) /*!< Bit mask of OVERRIDEN field.       */

/* DISCONNECTSENSE @Bit 7 : Disconnect the sense line of the comparator and short-circuit both inputs of the comparator to vref.
                            */

  #define VDETVS0V8_DFT_TCFG_DISCONNECTSENSE_Pos (7UL) /*!< Position of DISCONNECTSENSE field.                                 */
  #define VDETVS0V8_DFT_TCFG_DISCONNECTSENSE_Msk (0x1UL << VDETVS0V8_DFT_TCFG_DISCONNECTSENSE_Pos) /*!< Bit mask of
                                                                            DISCONNECTSENSE field.*/


/* ==================================================== Struct VDETVS0V8 ===================================================== */
/**
  * @brief VDETVS0V8 peripheral
  */
  typedef struct {                                   /*!< VDETVS0V8 Structure                                                  */
    __OM uint32_t TASKS_PWRUP;                       /*!< (@ 0x00000000) Power up voltage detector                             */
    __OM uint32_t TASKS_PWRDOWN;                     /*!< (@ 0x00000004) Power down voltage detector                           */
    __OM uint32_t TASKS_STARTPWRGOOD;                /*!< (@ 0x00000008) Start power good detection                            */
    __OM uint32_t TASKS_CANCELPWRGOOD;               /*!< (@ 0x0000000C) Cancel power good detection                           */
    __OM uint32_t TASKS_APPLYBROWNOUT;               /*!< (@ 0x00000010) Apply value in BROWNOUTLVL to analog module           */
    __IM uint32_t RESERVED[59];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IOM uint32_t EVENTS_PWRGOOD;                   /*!< (@ 0x00000108) Power good detector detected voltage above threshold
                                                                         level*/
    __IOM uint32_t EVENTS_BROWNOUT;                  /*!< (@ 0x0000010C) VDD_VS supply below brownout threshold                */
    __IM uint32_t RESERVED1[124];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Voltage detector status                               */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_VDETVS0V8_CONFIG_Type CONFIG;          /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[9];
    __IOM NRF_VDETVS0V8_TRIM_Type TRIM;              /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[14];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000484) Voltage detector mode                                 */
    __IM uint32_t RESERVED6[30];
    __IOM NRF_VDETVS0V8_OVERRIDE_Type OVERRIDE;      /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[53];
    __IOM NRF_VDETVS0V8_DFT_Type DFT;                /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VDETVS0V8_Type;                              /*!< Size = 1588 (0x634)                                                  */

/* VDETVS0V8_TASKS_PWRUP: Power up voltage detector */
  #define VDETVS0V8_TASKS_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUP register.                            */

