adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EVENTS_SETTLED @Bit 0 : Settled flag for MODE handshake */
  #define VDETVS0V8_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                             */
  #define VDETVS0V8_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << VDETVS0V8_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/
  #define VDETVS0V8_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.               */
  #define VDETVS0V8_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.               */
  #define VDETVS0V8_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define VDETVS0V8_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                       */


/* VDETVS0V8_EVENTS_PWRGOOD: Power good detector detected voltage above threshold level */
  #define VDETVS0V8_EVENTS_PWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PWRGOOD register.                      */

/* EVENTS_PWRGOOD @Bit 0 : Power good detector detected voltage above threshold level */
  #define VDETVS0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Pos (0UL) /*!< Position of EVENTS_PWRGOOD field.                             */
  #define VDETVS0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Msk (0x1UL << VDETVS0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Pos) /*!< Bit mask of
                                                                            EVENTS_PWRGOOD field.*/
  #define VDETVS0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Min (0x0UL) /*!< Min enumerator value of EVENTS_PWRGOOD field.               */
  #define VDETVS0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Max (0x1UL) /*!< Max enumerator value of EVENTS_PWRGOOD field.               */
  #define VDETVS0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define VDETVS0V8_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Generated (0x1UL) /*!< Event generated                                       */


/* VDETVS0V8_EVENTS_BROWNOUT: VDD_VS supply below brownout threshold */
  #define VDETVS0V8_EVENTS_BROWNOUT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BROWNOUT register.                    */

/* EVENTS_BROWNOUT @Bit 0 : VDD_VS supply below brownout threshold */
  #define VDETVS0V8_EVENTS_BROWNOUT_EVENTS_BROWNOUT_Pos (0UL) /*!< Position of EVENTS_BROWNOUT field.                          */
  #define VDETVS0V8_EVENTS_BROWNOUT_EVENTS_BROWNOUT_Msk (0x1UL << VDETVS0V8_EVENTS_BROWNOUT_EVENTS_BROWNOUT_Pos) /*!< Bit mask
                                                                            of EVENTS_BROWNOUT field.*/
  #define VDETVS0V8_EVENTS_BROWNOUT_EVENTS_BROWNOUT_Min (0x0UL) /*!< Min enumerator value of EVENTS_BROWNOUT field.            */
  #define VDETVS0V8_EVENTS_BROWNOUT_EVENTS_BROWNOUT_Max (0x1UL) /*!< Max enumerator value of EVENTS_BROWNOUT field.            */
  #define VDETVS0V8_EVENTS_BROWNOUT_EVENTS_BROWNOUT_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define VDETVS0V8_EVENTS_BROWNOUT_EVENTS_BROWNOUT_Generated (0x1UL) /*!< Event generated                                     */


/* VDETVS0V8_INTEN: Enable or disable interrupt */
  #define VDETVS0V8_INTEN_ResetValue (0x00000000UL)  /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VDETVS0V8_INTEN_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define VDETVS0V8_INTEN_READY_Msk (0x1UL << VDETVS0V8_INTEN_READY_Pos) /*!< Bit mask of READY field.                         */
  #define VDETVS0V8_INTEN_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define VDETVS0V8_INTEN_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define VDETVS0V8_INTEN_READY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VDETVS0V8_INTEN_READY_Enabled (0x1UL)      /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VDETVS0V8_INTEN_SETTLED_Pos (1UL)          /*!< Position of SETTLED field.                                           */
  #define VDETVS0V8_INTEN_SETTLED_Msk (0x1UL << VDETVS0V8_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                   */
  #define VDETVS0V8_INTEN_SETTLED_Min (0x0UL)        /*!< Min enumerator value of SETTLED field.                               */
  #define VDETVS0V8_INTEN_SETTLED_Max (0x1UL)        /*!< Max enumerator value of SETTLED field.                               */
  #define VDETVS0V8_INTEN_SETTLED_Disabled (0x0UL)   /*!< Disable                                                              */
  #define VDETVS0V8_INTEN_SETTLED_Enabled (0x1UL)    /*!< Enable                                                               */

/* PWRGOOD @Bit 2 : Enable or disable interrupt for event PWRGOOD */
  #define VDETVS0V8_INTEN_PWRGOOD_Pos (2UL)          /*!< Position of PWRGOOD field.                                           */
  #define VDETVS0V8_INTEN_PWRGOOD_Msk (0x1UL << VDETVS0V8_INTEN_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.                   */
  #define VDETVS0V8_INTEN_PWRGOOD_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDETVS0V8_INTEN_PWRGOOD_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDETVS0V8_INTEN_PWRGOOD_Disabled (0x0UL)   /*!< Disable                                                              */
  #define VDETVS0V8_INTEN_PWRGOOD_Enabled (0x1UL)    /*!< Enable                                                               */

/* BROWNOUT @Bit 3 : Enable or disable interrupt for event BROWNOUT */
  #define VDETVS0V8_INTEN_BROWNOUT_Pos (3UL)         /*!< Position of BROWNOUT field.                                          */
  #define VDETVS0V8_INTEN_BROWNOUT_Msk (0x1UL << VDETVS0V8_INTEN_BROWNOUT_Pos) /*!< Bit mask of BROWNOUT field.                */
  #define VDETVS0V8_INTEN_BROWNOUT_Min (0x0UL)       /*!< Min enumerator value of BROWNOUT field.                              */
  #define VDETVS0V8_INTEN_BROWNOUT_Max (0x1UL)       /*!< Max enumerator value of BROWNOUT field.                              */
  #define VDETVS0V8_INTEN_BROWNOUT_Disabled (0x0UL)  /*!< Disable                                                              */
  #define VDETVS0V8_INTEN_BROWNOUT_Enabled (0x1UL)   /*!< Enable                                                               */


/* VDETVS0V8_INTENSET: Enable interrupt */
  #define VDETVS0V8_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                  */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VDETVS0V8_INTENSET_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETVS0V8_INTENSET_READY_Msk (0x1UL << VDETVS0V8_INTENSET_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETVS0V8_INTENSET_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETVS0V8_INTENSET_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETVS0V8_INTENSET_READY_Set (0x1UL)       /*!< Enable                                                               */
  #define VDETVS0V8_INTENSET_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDETVS0V8_INTENSET_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

