adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define VDETVS0V8_INTENSET_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETVS0V8_INTENSET_SETTLED_Msk (0x1UL << VDETVS0V8_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETVS0V8_INTENSET_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETVS0V8_INTENSET_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETVS0V8_INTENSET_SETTLED_Set (0x1UL)     /*!< Enable                                                               */
  #define VDETVS0V8_INTENSET_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETVS0V8_INTENSET_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* PWRGOOD @Bit 2 : Write '1' to enable interrupt for event PWRGOOD */
  #define VDETVS0V8_INTENSET_PWRGOOD_Pos (2UL)       /*!< Position of PWRGOOD field.                                           */
  #define VDETVS0V8_INTENSET_PWRGOOD_Msk (0x1UL << VDETVS0V8_INTENSET_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.             */
  #define VDETVS0V8_INTENSET_PWRGOOD_Min (0x0UL)     /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDETVS0V8_INTENSET_PWRGOOD_Max (0x1UL)     /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDETVS0V8_INTENSET_PWRGOOD_Set (0x1UL)     /*!< Enable                                                               */
  #define VDETVS0V8_INTENSET_PWRGOOD_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETVS0V8_INTENSET_PWRGOOD_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* BROWNOUT @Bit 3 : Write '1' to enable interrupt for event BROWNOUT */
  #define VDETVS0V8_INTENSET_BROWNOUT_Pos (3UL)      /*!< Position of BROWNOUT field.                                          */
  #define VDETVS0V8_INTENSET_BROWNOUT_Msk (0x1UL << VDETVS0V8_INTENSET_BROWNOUT_Pos) /*!< Bit mask of BROWNOUT field.          */
  #define VDETVS0V8_INTENSET_BROWNOUT_Min (0x0UL)    /*!< Min enumerator value of BROWNOUT field.                              */
  #define VDETVS0V8_INTENSET_BROWNOUT_Max (0x1UL)    /*!< Max enumerator value of BROWNOUT field.                              */
  #define VDETVS0V8_INTENSET_BROWNOUT_Set (0x1UL)    /*!< Enable                                                               */
  #define VDETVS0V8_INTENSET_BROWNOUT_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDETVS0V8_INTENSET_BROWNOUT_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* VDETVS0V8_INTENCLR: Disable interrupt */
  #define VDETVS0V8_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                  */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VDETVS0V8_INTENCLR_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETVS0V8_INTENCLR_READY_Msk (0x1UL << VDETVS0V8_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETVS0V8_INTENCLR_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETVS0V8_INTENCLR_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETVS0V8_INTENCLR_READY_Clear (0x1UL)     /*!< Disable                                                              */
  #define VDETVS0V8_INTENCLR_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDETVS0V8_INTENCLR_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define VDETVS0V8_INTENCLR_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETVS0V8_INTENCLR_SETTLED_Msk (0x1UL << VDETVS0V8_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETVS0V8_INTENCLR_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETVS0V8_INTENCLR_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETVS0V8_INTENCLR_SETTLED_Clear (0x1UL)   /*!< Disable                                                              */
  #define VDETVS0V8_INTENCLR_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETVS0V8_INTENCLR_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* PWRGOOD @Bit 2 : Write '1' to disable interrupt for event PWRGOOD */
  #define VDETVS0V8_INTENCLR_PWRGOOD_Pos (2UL)       /*!< Position of PWRGOOD field.                                           */
  #define VDETVS0V8_INTENCLR_PWRGOOD_Msk (0x1UL << VDETVS0V8_INTENCLR_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.             */
  #define VDETVS0V8_INTENCLR_PWRGOOD_Min (0x0UL)     /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDETVS0V8_INTENCLR_PWRGOOD_Max (0x1UL)     /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDETVS0V8_INTENCLR_PWRGOOD_Clear (0x1UL)   /*!< Disable                                                              */
  #define VDETVS0V8_INTENCLR_PWRGOOD_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETVS0V8_INTENCLR_PWRGOOD_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* BROWNOUT @Bit 3 : Write '1' to disable interrupt for event BROWNOUT */
  #define VDETVS0V8_INTENCLR_BROWNOUT_Pos (3UL)      /*!< Position of BROWNOUT field.                                          */
  #define VDETVS0V8_INTENCLR_BROWNOUT_Msk (0x1UL << VDETVS0V8_INTENCLR_BROWNOUT_Pos) /*!< Bit mask of BROWNOUT field.          */
  #define VDETVS0V8_INTENCLR_BROWNOUT_Min (0x0UL)    /*!< Min enumerator value of BROWNOUT field.                              */
  #define VDETVS0V8_INTENCLR_BROWNOUT_Max (0x1UL)    /*!< Max enumerator value of BROWNOUT field.                              */
  #define VDETVS0V8_INTENCLR_BROWNOUT_Clear (0x1UL)  /*!< Disable                                                              */
  #define VDETVS0V8_INTENCLR_BROWNOUT_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDETVS0V8_INTENCLR_BROWNOUT_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* VDETVS0V8_INTPEND: Pending interrupts */
  #define VDETVS0V8_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                    */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VDETVS0V8_INTPEND_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VDETVS0V8_INTPEND_READY_Msk (0x1UL << VDETVS0V8_INTPEND_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VDETVS0V8_INTPEND_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VDETVS0V8_INTPEND_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VDETVS0V8_INTPEND_READY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VDETVS0V8_INTPEND_READY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define VDETVS0V8_INTPEND_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VDETVS0V8_INTPEND_SETTLED_Msk (0x1UL << VDETVS0V8_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */
  #define VDETVS0V8_INTPEND_SETTLED_Min (0x0UL)      /*!< Min enumerator value of SETTLED field.                               */
  #define VDETVS0V8_INTPEND_SETTLED_Max (0x1UL)      /*!< Max enumerator value of SETTLED field.                               */
  #define VDETVS0V8_INTPEND_SETTLED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VDETVS0V8_INTPEND_SETTLED_Pending (0x1UL)  /*!< Read: Pending                                                        */

