adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VPR_EVENTS_TRIGGERED: VPR event [n] register */
  #define VPR_EVENTS_TRIGGERED_MaxCount (32UL)       /*!< Max size of EVENTS_TRIGGERED[32] array.                              */
  #define VPR_EVENTS_TRIGGERED_MaxIndex (31UL)       /*!< Max index of EVENTS_TRIGGERED[32] array.                             */
  #define VPR_EVENTS_TRIGGERED_MinIndex (0UL)        /*!< Min index of EVENTS_TRIGGERED[32] array.                             */
  #define VPR_EVENTS_TRIGGERED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIGGERED[32] register.                    */

/* EVENTS_TRIGGERED @Bit 0 : VPR event [n] register */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos (0UL) /*!< Position of EVENTS_TRIGGERED field.                             */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Msk (0x1UL << VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos) /*!< Bit mask of
                                                                            EVENTS_TRIGGERED field.*/
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIGGERED field.               */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIGGERED field.               */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Generated (0x1UL) /*!< Event generated                                         */


/* VPR_PUBLISH_TRIGGERED: Publish configuration for event EVENTS_TRIGGERED[n] */
  #define VPR_PUBLISH_TRIGGERED_MaxCount (32UL)      /*!< Max size of PUBLISH_TRIGGERED[32] array.                             */
  #define VPR_PUBLISH_TRIGGERED_MaxIndex (31UL)      /*!< Max index of PUBLISH_TRIGGERED[32] array.                            */
  #define VPR_PUBLISH_TRIGGERED_MinIndex (0UL)       /*!< Min index of PUBLISH_TRIGGERED[32] array.                            */
  #define VPR_PUBLISH_TRIGGERED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TRIGGERED[32] register.                  */

/* ENABLE @Bit 0 : Publication enable bit (write only) */
  #define VPR_PUBLISH_TRIGGERED_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define VPR_PUBLISH_TRIGGERED_ENABLE_Msk (0x1UL << VPR_PUBLISH_TRIGGERED_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */

/* EN @Bit 31 : Publication enable bit */
  #define VPR_PUBLISH_TRIGGERED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define VPR_PUBLISH_TRIGGERED_EN_Msk (0x1UL << VPR_PUBLISH_TRIGGERED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define VPR_PUBLISH_TRIGGERED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define VPR_PUBLISH_TRIGGERED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define VPR_PUBLISH_TRIGGERED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define VPR_PUBLISH_TRIGGERED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* VPR_INTEN: Enable or disable interrupt */
  #define VPR_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* TRIGGERED0 @Bit 0 : Enable or disable interrupt for event TRIGGERED[0] */
  #define VPR_INTEN_TRIGGERED0_Pos (0UL)             /*!< Position of TRIGGERED0 field.                                        */
  #define VPR_INTEN_TRIGGERED0_Msk (0x1UL << VPR_INTEN_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.                      */
  #define VPR_INTEN_TRIGGERED0_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define VPR_INTEN_TRIGGERED0_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define VPR_INTEN_TRIGGERED0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED0_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED1 @Bit 1 : Enable or disable interrupt for event TRIGGERED[1] */
  #define VPR_INTEN_TRIGGERED1_Pos (1UL)             /*!< Position of TRIGGERED1 field.                                        */
  #define VPR_INTEN_TRIGGERED1_Msk (0x1UL << VPR_INTEN_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.                      */
  #define VPR_INTEN_TRIGGERED1_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define VPR_INTEN_TRIGGERED1_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define VPR_INTEN_TRIGGERED1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED1_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED2 @Bit 2 : Enable or disable interrupt for event TRIGGERED[2] */
  #define VPR_INTEN_TRIGGERED2_Pos (2UL)             /*!< Position of TRIGGERED2 field.                                        */
  #define VPR_INTEN_TRIGGERED2_Msk (0x1UL << VPR_INTEN_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.                      */
  #define VPR_INTEN_TRIGGERED2_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define VPR_INTEN_TRIGGERED2_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define VPR_INTEN_TRIGGERED2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED2_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED3 @Bit 3 : Enable or disable interrupt for event TRIGGERED[3] */
  #define VPR_INTEN_TRIGGERED3_Pos (3UL)             /*!< Position of TRIGGERED3 field.                                        */
  #define VPR_INTEN_TRIGGERED3_Msk (0x1UL << VPR_INTEN_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.                      */
  #define VPR_INTEN_TRIGGERED3_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define VPR_INTEN_TRIGGERED3_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define VPR_INTEN_TRIGGERED3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED3_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED4 @Bit 4 : Enable or disable interrupt for event TRIGGERED[4] */
  #define VPR_INTEN_TRIGGERED4_Pos (4UL)             /*!< Position of TRIGGERED4 field.                                        */
  #define VPR_INTEN_TRIGGERED4_Msk (0x1UL << VPR_INTEN_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field.                      */
  #define VPR_INTEN_TRIGGERED4_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED4 field.                            */
  #define VPR_INTEN_TRIGGERED4_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED4 field.                            */
  #define VPR_INTEN_TRIGGERED4_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED4_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED5 @Bit 5 : Enable or disable interrupt for event TRIGGERED[5] */
  #define VPR_INTEN_TRIGGERED5_Pos (5UL)             /*!< Position of TRIGGERED5 field.                                        */
  #define VPR_INTEN_TRIGGERED5_Msk (0x1UL << VPR_INTEN_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field.                      */
  #define VPR_INTEN_TRIGGERED5_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED5 field.                            */
  #define VPR_INTEN_TRIGGERED5_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED5 field.                            */
  #define VPR_INTEN_TRIGGERED5_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED5_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED6 @Bit 6 : Enable or disable interrupt for event TRIGGERED[6] */
  #define VPR_INTEN_TRIGGERED6_Pos (6UL)             /*!< Position of TRIGGERED6 field.                                        */
  #define VPR_INTEN_TRIGGERED6_Msk (0x1UL << VPR_INTEN_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field.                      */
  #define VPR_INTEN_TRIGGERED6_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED6 field.                            */
  #define VPR_INTEN_TRIGGERED6_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED6 field.                            */
  #define VPR_INTEN_TRIGGERED6_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED6_Enabled (0x1UL)       /*!< Enable                                                               */

