adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TRIGGERED10 @Bit 10 : Write '1' to disable interrupt for event TRIGGERED[10] */
  #define VPR_INTENCLR_TRIGGERED10_Pos (10UL)        /*!< Position of TRIGGERED10 field.                                       */
  #define VPR_INTENCLR_TRIGGERED10_Msk (0x1UL << VPR_INTENCLR_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10 field.             */
  #define VPR_INTENCLR_TRIGGERED10_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED10 field.                           */
  #define VPR_INTENCLR_TRIGGERED10_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED10 field.                           */
  #define VPR_INTENCLR_TRIGGERED10_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED10_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED10_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED11 @Bit 11 : Write '1' to disable interrupt for event TRIGGERED[11] */
  #define VPR_INTENCLR_TRIGGERED11_Pos (11UL)        /*!< Position of TRIGGERED11 field.                                       */
  #define VPR_INTENCLR_TRIGGERED11_Msk (0x1UL << VPR_INTENCLR_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11 field.             */
  #define VPR_INTENCLR_TRIGGERED11_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED11 field.                           */
  #define VPR_INTENCLR_TRIGGERED11_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED11 field.                           */
  #define VPR_INTENCLR_TRIGGERED11_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED11_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED11_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED12 @Bit 12 : Write '1' to disable interrupt for event TRIGGERED[12] */
  #define VPR_INTENCLR_TRIGGERED12_Pos (12UL)        /*!< Position of TRIGGERED12 field.                                       */
  #define VPR_INTENCLR_TRIGGERED12_Msk (0x1UL << VPR_INTENCLR_TRIGGERED12_Pos) /*!< Bit mask of TRIGGERED12 field.             */
  #define VPR_INTENCLR_TRIGGERED12_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED12 field.                           */
  #define VPR_INTENCLR_TRIGGERED12_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED12 field.                           */
  #define VPR_INTENCLR_TRIGGERED12_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED12_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED12_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED13 @Bit 13 : Write '1' to disable interrupt for event TRIGGERED[13] */
  #define VPR_INTENCLR_TRIGGERED13_Pos (13UL)        /*!< Position of TRIGGERED13 field.                                       */
  #define VPR_INTENCLR_TRIGGERED13_Msk (0x1UL << VPR_INTENCLR_TRIGGERED13_Pos) /*!< Bit mask of TRIGGERED13 field.             */
  #define VPR_INTENCLR_TRIGGERED13_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED13 field.                           */
  #define VPR_INTENCLR_TRIGGERED13_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED13 field.                           */
  #define VPR_INTENCLR_TRIGGERED13_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED13_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED13_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED14 @Bit 14 : Write '1' to disable interrupt for event TRIGGERED[14] */
  #define VPR_INTENCLR_TRIGGERED14_Pos (14UL)        /*!< Position of TRIGGERED14 field.                                       */
  #define VPR_INTENCLR_TRIGGERED14_Msk (0x1UL << VPR_INTENCLR_TRIGGERED14_Pos) /*!< Bit mask of TRIGGERED14 field.             */
  #define VPR_INTENCLR_TRIGGERED14_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED14 field.                           */
  #define VPR_INTENCLR_TRIGGERED14_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED14 field.                           */
  #define VPR_INTENCLR_TRIGGERED14_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED14_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED14_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED15 @Bit 15 : Write '1' to disable interrupt for event TRIGGERED[15] */
  #define VPR_INTENCLR_TRIGGERED15_Pos (15UL)        /*!< Position of TRIGGERED15 field.                                       */
  #define VPR_INTENCLR_TRIGGERED15_Msk (0x1UL << VPR_INTENCLR_TRIGGERED15_Pos) /*!< Bit mask of TRIGGERED15 field.             */
  #define VPR_INTENCLR_TRIGGERED15_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED15 field.                           */
  #define VPR_INTENCLR_TRIGGERED15_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED15 field.                           */
  #define VPR_INTENCLR_TRIGGERED15_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED15_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED15_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED16 @Bit 16 : Write '1' to disable interrupt for event TRIGGERED[16] */
  #define VPR_INTENCLR_TRIGGERED16_Pos (16UL)        /*!< Position of TRIGGERED16 field.                                       */
  #define VPR_INTENCLR_TRIGGERED16_Msk (0x1UL << VPR_INTENCLR_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16 field.             */
  #define VPR_INTENCLR_TRIGGERED16_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTENCLR_TRIGGERED16_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTENCLR_TRIGGERED16_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED16_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED16_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED17 @Bit 17 : Write '1' to disable interrupt for event TRIGGERED[17] */
  #define VPR_INTENCLR_TRIGGERED17_Pos (17UL)        /*!< Position of TRIGGERED17 field.                                       */
  #define VPR_INTENCLR_TRIGGERED17_Msk (0x1UL << VPR_INTENCLR_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17 field.             */
  #define VPR_INTENCLR_TRIGGERED17_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTENCLR_TRIGGERED17_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTENCLR_TRIGGERED17_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED17_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED17_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED18 @Bit 18 : Write '1' to disable interrupt for event TRIGGERED[18] */
  #define VPR_INTENCLR_TRIGGERED18_Pos (18UL)        /*!< Position of TRIGGERED18 field.                                       */
  #define VPR_INTENCLR_TRIGGERED18_Msk (0x1UL << VPR_INTENCLR_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18 field.             */
  #define VPR_INTENCLR_TRIGGERED18_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTENCLR_TRIGGERED18_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTENCLR_TRIGGERED18_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED18_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED18_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED19 @Bit 19 : Write '1' to disable interrupt for event TRIGGERED[19] */
  #define VPR_INTENCLR_TRIGGERED19_Pos (19UL)        /*!< Position of TRIGGERED19 field.                                       */
  #define VPR_INTENCLR_TRIGGERED19_Msk (0x1UL << VPR_INTENCLR_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field.             */
  #define VPR_INTENCLR_TRIGGERED19_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTENCLR_TRIGGERED19_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTENCLR_TRIGGERED19_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED19_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED19_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED20 @Bit 20 : Write '1' to disable interrupt for event TRIGGERED[20] */
  #define VPR_INTENCLR_TRIGGERED20_Pos (20UL)        /*!< Position of TRIGGERED20 field.                                       */
  #define VPR_INTENCLR_TRIGGERED20_Msk (0x1UL << VPR_INTENCLR_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field.             */
  #define VPR_INTENCLR_TRIGGERED20_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTENCLR_TRIGGERED20_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTENCLR_TRIGGERED20_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED20_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED20_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED21 @Bit 21 : Write '1' to disable interrupt for event TRIGGERED[21] */
  #define VPR_INTENCLR_TRIGGERED21_Pos (21UL)        /*!< Position of TRIGGERED21 field.                                       */
  #define VPR_INTENCLR_TRIGGERED21_Msk (0x1UL << VPR_INTENCLR_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field.             */
  #define VPR_INTENCLR_TRIGGERED21_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTENCLR_TRIGGERED21_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTENCLR_TRIGGERED21_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED21_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED21_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED22 @Bit 22 : Write '1' to disable interrupt for event TRIGGERED[22] */
  #define VPR_INTENCLR_TRIGGERED22_Pos (22UL)        /*!< Position of TRIGGERED22 field.                                       */
  #define VPR_INTENCLR_TRIGGERED22_Msk (0x1UL << VPR_INTENCLR_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field.             */
  #define VPR_INTENCLR_TRIGGERED22_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTENCLR_TRIGGERED22_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTENCLR_TRIGGERED22_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED22_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED22_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED23 @Bit 23 : Write '1' to disable interrupt for event TRIGGERED[23] */
  #define VPR_INTENCLR_TRIGGERED23_Pos (23UL)        /*!< Position of TRIGGERED23 field.                                       */
  #define VPR_INTENCLR_TRIGGERED23_Msk (0x1UL << VPR_INTENCLR_TRIGGERED23_Pos) /*!< Bit mask of TRIGGERED23 field.             */
  #define VPR_INTENCLR_TRIGGERED23_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED23 field.                           */
  #define VPR_INTENCLR_TRIGGERED23_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED23 field.                           */
  #define VPR_INTENCLR_TRIGGERED23_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED23_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED23_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED24 @Bit 24 : Write '1' to disable interrupt for event TRIGGERED[24] */
  #define VPR_INTENCLR_TRIGGERED24_Pos (24UL)        /*!< Position of TRIGGERED24 field.                                       */
  #define VPR_INTENCLR_TRIGGERED24_Msk (0x1UL << VPR_INTENCLR_TRIGGERED24_Pos) /*!< Bit mask of TRIGGERED24 field.             */
  #define VPR_INTENCLR_TRIGGERED24_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED24 field.                           */
  #define VPR_INTENCLR_TRIGGERED24_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED24 field.                           */
  #define VPR_INTENCLR_TRIGGERED24_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED24_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED24_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED25 @Bit 25 : Write '1' to disable interrupt for event TRIGGERED[25] */
  #define VPR_INTENCLR_TRIGGERED25_Pos (25UL)        /*!< Position of TRIGGERED25 field.                                       */
  #define VPR_INTENCLR_TRIGGERED25_Msk (0x1UL << VPR_INTENCLR_TRIGGERED25_Pos) /*!< Bit mask of TRIGGERED25 field.             */
  #define VPR_INTENCLR_TRIGGERED25_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED25 field.                           */
  #define VPR_INTENCLR_TRIGGERED25_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED25 field.                           */
  #define VPR_INTENCLR_TRIGGERED25_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED25_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED25_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED26 @Bit 26 : Write '1' to disable interrupt for event TRIGGERED[26] */
  #define VPR_INTENCLR_TRIGGERED26_Pos (26UL)        /*!< Position of TRIGGERED26 field.                                       */
  #define VPR_INTENCLR_TRIGGERED26_Msk (0x1UL << VPR_INTENCLR_TRIGGERED26_Pos) /*!< Bit mask of TRIGGERED26 field.             */
  #define VPR_INTENCLR_TRIGGERED26_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED26 field.                           */
  #define VPR_INTENCLR_TRIGGERED26_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED26 field.                           */
  #define VPR_INTENCLR_TRIGGERED26_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED26_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED26_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED27 @Bit 27 : Write '1' to disable interrupt for event TRIGGERED[27] */
  #define VPR_INTENCLR_TRIGGERED27_Pos (27UL)        /*!< Position of TRIGGERED27 field.                                       */
  #define VPR_INTENCLR_TRIGGERED27_Msk (0x1UL << VPR_INTENCLR_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27 field.             */
  #define VPR_INTENCLR_TRIGGERED27_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED27 field.                           */
  #define VPR_INTENCLR_TRIGGERED27_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED27 field.                           */
  #define VPR_INTENCLR_TRIGGERED27_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED27_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED27_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

