adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VPR_CPURUN: State of the CPU after a core reset */
  #define VPR_CPURUN_ResetValue (0x00000000UL)       /*!< Reset value of CPURUN register.                                      */

/* EN @Bit 0 : Controls CPU running state after a core reset. */
  #define VPR_CPURUN_EN_Pos (0UL)                    /*!< Position of EN field.                                                */
  #define VPR_CPURUN_EN_Msk (0x1UL << VPR_CPURUN_EN_Pos) /*!< Bit mask of EN field.                                            */
  #define VPR_CPURUN_EN_Min (0x0UL)                  /*!< Min enumerator value of EN field.                                    */
  #define VPR_CPURUN_EN_Max (0x1UL)                  /*!< Max enumerator value of EN field.                                    */
  #define VPR_CPURUN_EN_Stopped (0x0UL)              /*!< CPU stopped. If this is the CPU state after a core reset, setting this
                                                          bit will change the CPU state to CPU running.*/
  #define VPR_CPURUN_EN_Running (0x1UL)              /*!< CPU running. If this is the CPU state after a core reset, clearing
                                                          this bit will change the CPU state to CPU stopped after a core reset.*/


/* VPR_INITPC: Initial value of the PC at CPU start. */
  #define VPR_INITPC_ResetValue (0x00000000UL)       /*!< Reset value of INITPC register.                                      */

/* INITPC @Bits 0..31 : Initial value of the PC at CPU start. */
  #define VPR_INITPC_INITPC_Pos (0UL)                /*!< Position of INITPC field.                                            */
  #define VPR_INITPC_INITPC_Msk (0xFFFFFFFFUL << VPR_INITPC_INITPC_Pos) /*!< Bit mask of INITPC field.                         */


/* VPR_TASKFULLPENALTY0: Set the penalty to full for Power/Clock pair 0 */
  #define VPR_TASKFULLPENALTY0_ResetValue (0x00000000UL) /*!< Reset value of TASKFULLPENALTY0 register.                        */

/* TASKFULLPENALTY0 @Bits 0..31 : Set the penalty to full for Power/Clock pair 0 */
  #define VPR_TASKFULLPENALTY0_TASKFULLPENALTY0_Pos (0UL) /*!< Position of TASKFULLPENALTY0 field.                             */
  #define VPR_TASKFULLPENALTY0_TASKFULLPENALTY0_Msk (0xFFFFFFFFUL << VPR_TASKFULLPENALTY0_TASKFULLPENALTY0_Pos) /*!< Bit mask of
                                                                            TASKFULLPENALTY0 field.*/


/* VPR_TASKZEROPENALTY0: Set the penalty to zero for Power/Clock pair 0 */
  #define VPR_TASKZEROPENALTY0_ResetValue (0x00000000UL) /*!< Reset value of TASKZEROPENALTY0 register.                        */

/* TASKZEROPENALTY0 @Bits 0..31 : Set the penalty to zero for Power/Clock pair 0 */
  #define VPR_TASKZEROPENALTY0_TASKZEROPENALTY0_Pos (0UL) /*!< Position of TASKZEROPENALTY0 field.                             */
  #define VPR_TASKZEROPENALTY0_TASKZEROPENALTY0_Msk (0xFFFFFFFFUL << VPR_TASKZEROPENALTY0_TASKZEROPENALTY0_Pos) /*!< Bit mask of
                                                                            TASKZEROPENALTY0 field.*/


/* VPR_TASKFULLPENALTY1: Set the penalty to full for Power/Clock pair 1 */
  #define VPR_TASKFULLPENALTY1_ResetValue (0x00000000UL) /*!< Reset value of TASKFULLPENALTY1 register.                        */

/* TASKFULLPENALTY1 @Bits 0..31 : Set the penalty to full for Power/Clock pair 1 */
  #define VPR_TASKFULLPENALTY1_TASKFULLPENALTY1_Pos (0UL) /*!< Position of TASKFULLPENALTY1 field.                             */
  #define VPR_TASKFULLPENALTY1_TASKFULLPENALTY1_Msk (0xFFFFFFFFUL << VPR_TASKFULLPENALTY1_TASKFULLPENALTY1_Pos) /*!< Bit mask of
                                                                            TASKFULLPENALTY1 field.*/


/* VPR_TASKZEROPENALTY1: Set the penalty to zero for Power/Clock pair 1 */
  #define VPR_TASKZEROPENALTY1_ResetValue (0x00000000UL) /*!< Reset value of TASKZEROPENALTY1 register.                        */

/* TASKZEROPENALTY1 @Bits 0..31 : Set the penalty to zero for Power/Clock pair 1 */
  #define VPR_TASKZEROPENALTY1_TASKZEROPENALTY1_Pos (0UL) /*!< Position of TASKZEROPENALTY1 field.                             */
  #define VPR_TASKZEROPENALTY1_TASKZEROPENALTY1_Msk (0xFFFFFFFFUL << VPR_TASKZEROPENALTY1_TASKZEROPENALTY1_Pos) /*!< Bit mask of
                                                                            TASKZEROPENALTY1 field.*/


/* VPR_PENALTYRG0: Register where the actual penalty from the tasks for Power/Clock pair 0 is stored. */
  #define VPR_PENALTYRG0_ResetValue (0x00000000UL)   /*!< Reset value of PENALTYRG0 register.                                  */

/* PENALTYRG0 @Bits 0..31 : Register where the actual penalty from the tasks for Power/Clock pair 0 is stored */
  #define VPR_PENALTYRG0_PENALTYRG0_Pos (0UL)        /*!< Position of PENALTYRG0 field.                                        */
  #define VPR_PENALTYRG0_PENALTYRG0_Msk (0xFFFFFFFFUL << VPR_PENALTYRG0_PENALTYRG0_Pos) /*!< Bit mask of PENALTYRG0 field.     */


/* VPR_PENALTYRG1: Register where the actual penalty from the tasks for Power/Clock pair 1 is stored. */
  #define VPR_PENALTYRG1_ResetValue (0x00000000UL)   /*!< Reset value of PENALTYRG1 register.                                  */

/* PENALTYRG1 @Bits 0..31 : Register where the actual penalty from the tasks for Power/Clock pair 1 is stored. */
  #define VPR_PENALTYRG1_PENALTYRG1_Pos (0UL)        /*!< Position of PENALTYRG1 field.                                        */
  #define VPR_PENALTYRG1_PENALTYRG1_Msk (0xFFFFFFFFUL << VPR_PENALTYRG1_PENALTYRG1_Pos) /*!< Bit mask of PENALTYRG1 field.     */


/* VPR_FORCEOVERRIDE0: Clock and power request override register for Power/Clock pair 0. */
  #define VPR_FORCEOVERRIDE0_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE0 register.                            */

/* FORCEOVERRIDE0 @Bits 0..31 : Clock and power request override register for Power/Clock pair 0. */
  #define VPR_FORCEOVERRIDE0_FORCEOVERRIDE0_Pos (0UL) /*!< Position of FORCEOVERRIDE0 field.                                   */
  #define VPR_FORCEOVERRIDE0_FORCEOVERRIDE0_Msk (0xFFFFFFFFUL << VPR_FORCEOVERRIDE0_FORCEOVERRIDE0_Pos) /*!< Bit mask of
                                                                            FORCEOVERRIDE0 field.*/


/* VPR_FORCEOVERRIDE1: Clock and power request override register for Power/Clock pair 1. */
  #define VPR_FORCEOVERRIDE1_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE1 register.                            */

