adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* FORCEOVERRIDE1 @Bits 0..31 : Clock and power request override register for Power/Clock pair 1. */
  #define VPR_FORCEOVERRIDE1_FORCEOVERRIDE1_Pos (0UL) /*!< Position of FORCEOVERRIDE1 field.                                   */
  #define VPR_FORCEOVERRIDE1_FORCEOVERRIDE1_Msk (0xFFFFFFFFUL << VPR_FORCEOVERRIDE1_FORCEOVERRIDE1_Pos) /*!< Bit mask of
                                                                            FORCEOVERRIDE1 field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VPRCSR                                          ================ */
/* =========================================================================================================================== */

/**
  * @brief VPR CSR registers
  */
/**
  * @brief  [VPRCSR] (unspecified)
  */

/**
  * @brief  [VPRCSR] (unspecified)
  */

/**
  * @brief MSTATUS [VPRCSR_MSTATUS] Machine Status
  */
  #define VPRCSR_MSTATUS (0x00000300ul)
  #define VPRCSR_MSTATUS_ResetValue (0x00001800UL)   /*!< Reset value of MSTATUS register.                                     */

/* MIE @Bit 3 : global interrupt enable for machine privilege mode */
  #define VPRCSR_MSTATUS_MIE_Pos (3UL)               /*!< Position of MIE field.                                               */
  #define VPRCSR_MSTATUS_MIE_Msk (0x1UL << VPRCSR_MSTATUS_MIE_Pos) /*!< Bit mask of MIE field.                                 */
  #define VPRCSR_MSTATUS_MIE_Min (0x0UL)             /*!< Min enumerator value of MIE field.                                   */
  #define VPRCSR_MSTATUS_MIE_Max (0x1UL)             /*!< Max enumerator value of MIE field.                                   */
  #define VPRCSR_MSTATUS_MIE_Disabled (0x0UL)        /*!< (unspecified)                                                        */
  #define VPRCSR_MSTATUS_MIE_Enabled (0x1UL)         /*!< (unspecified)                                                        */

/* MPIE @Bit 7 : Exists to support nested traps. Value of the interrupt-enable bit active prior to the trap for machine
                 privilege mode */

  #define VPRCSR_MSTATUS_MPIE_Pos (7UL)              /*!< Position of MPIE field.                                              */
  #define VPRCSR_MSTATUS_MPIE_Msk (0x1UL << VPRCSR_MSTATUS_MPIE_Pos) /*!< Bit mask of MPIE field.                              */
  #define VPRCSR_MSTATUS_MPIE_Min (0x0UL)            /*!< Min enumerator value of MPIE field.                                  */
  #define VPRCSR_MSTATUS_MPIE_Max (0x1UL)            /*!< Max enumerator value of MPIE field.                                  */
  #define VPRCSR_MSTATUS_MPIE_Disabled (0x0UL)       /*!< (unspecified)                                                        */
  #define VPRCSR_MSTATUS_MPIE_Enabled (0x1UL)        /*!< (unspecified)                                                        */

/* MPP @Bits 11..12 : Exists to support nested traps. Value of the privlege mode prior to the trap for machine privilege mode */
  #define VPRCSR_MSTATUS_MPP_Pos (11UL)              /*!< Position of MPP field.                                               */
  #define VPRCSR_MSTATUS_MPP_Msk (0x3UL << VPRCSR_MSTATUS_MPP_Pos) /*!< Bit mask of MPP field.                                 */


/**
  * @brief MISA [VPRCSR_MISA] Machine ISA
  */
  #define VPRCSR_MISA (0x00000301ul)
  #define VPRCSR_MISA_ResetValue (0x40001014UL)      /*!< Reset value of MISA register.                                        */

/* A @Bit 0 : Atomic extension */
  #define VPRCSR_MISA_A_Pos (0UL)                    /*!< Position of A field.                                                 */
  #define VPRCSR_MISA_A_Msk (0x1UL << VPRCSR_MISA_A_Pos) /*!< Bit mask of A field.                                             */
  #define VPRCSR_MISA_A_Min (0x0UL)                  /*!< Min enumerator value of A field.                                     */
  #define VPRCSR_MISA_A_Max (0x1UL)                  /*!< Max enumerator value of A field.                                     */
  #define VPRCSR_MISA_A_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_A_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* B @Bit 1 : Bit-Manipulation extension */
  #define VPRCSR_MISA_B_Pos (1UL)                    /*!< Position of B field.                                                 */
  #define VPRCSR_MISA_B_Msk (0x1UL << VPRCSR_MISA_B_Pos) /*!< Bit mask of B field.                                             */
  #define VPRCSR_MISA_B_Min (0x0UL)                  /*!< Min enumerator value of B field.                                     */
  #define VPRCSR_MISA_B_Max (0x1UL)                  /*!< Max enumerator value of B field.                                     */
  #define VPRCSR_MISA_B_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_B_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* C @Bit 2 : Compressed extension */
  #define VPRCSR_MISA_C_Pos (2UL)                    /*!< Position of C field.                                                 */
  #define VPRCSR_MISA_C_Msk (0x1UL << VPRCSR_MISA_C_Pos) /*!< Bit mask of C field.                                             */
  #define VPRCSR_MISA_C_Min (0x0UL)                  /*!< Min enumerator value of C field.                                     */
  #define VPRCSR_MISA_C_Max (0x1UL)                  /*!< Max enumerator value of C field.                                     */
  #define VPRCSR_MISA_C_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_C_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* E @Bit 4 : RV32E base ISA */
  #define VPRCSR_MISA_E_Pos (4UL)                    /*!< Position of E field.                                                 */
  #define VPRCSR_MISA_E_Msk (0x1UL << VPRCSR_MISA_E_Pos) /*!< Bit mask of E field.                                             */
  #define VPRCSR_MISA_E_Min (0x0UL)                  /*!< Min enumerator value of E field.                                     */
  #define VPRCSR_MISA_E_Max (0x1UL)                  /*!< Max enumerator value of E field.                                     */
  #define VPRCSR_MISA_E_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_E_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* I @Bit 8 : RV32I/64I/128I base ISA */
  #define VPRCSR_MISA_I_Pos (8UL)                    /*!< Position of I field.                                                 */
  #define VPRCSR_MISA_I_Msk (0x1UL << VPRCSR_MISA_I_Pos) /*!< Bit mask of I field.                                             */
  #define VPRCSR_MISA_I_Min (0x0UL)                  /*!< Min enumerator value of I field.                                     */
  #define VPRCSR_MISA_I_Max (0x1UL)                  /*!< Max enumerator value of I field.                                     */
  #define VPRCSR_MISA_I_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_I_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* M @Bit 12 : Integer Multiply/Divide extension */
  #define VPRCSR_MISA_M_Pos (12UL)                   /*!< Position of M field.                                                 */
  #define VPRCSR_MISA_M_Msk (0x1UL << VPRCSR_MISA_M_Pos) /*!< Bit mask of M field.                                             */
  #define VPRCSR_MISA_M_Min (0x0UL)                  /*!< Min enumerator value of M field.                                     */
  #define VPRCSR_MISA_M_Max (0x1UL)                  /*!< Max enumerator value of M field.                                     */
  #define VPRCSR_MISA_M_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_M_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* N @Bit 13 : User-level interrupts supported */
  #define VPRCSR_MISA_N_Pos (13UL)                   /*!< Position of N field.                                                 */
  #define VPRCSR_MISA_N_Msk (0x1UL << VPRCSR_MISA_N_Pos) /*!< Bit mask of N field.                                             */
  #define VPRCSR_MISA_N_Min (0x0UL)                  /*!< Min enumerator value of N field.                                     */
  #define VPRCSR_MISA_N_Max (0x1UL)                  /*!< Max enumerator value of N field.                                     */
  #define VPRCSR_MISA_N_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_N_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* MXL @Bits 30..31 : Machine XLEN */
  #define VPRCSR_MISA_MXL_Pos (30UL)                 /*!< Position of MXL field.                                               */
  #define VPRCSR_MISA_MXL_Msk (0x3UL << VPRCSR_MISA_MXL_Pos) /*!< Bit mask of MXL field.                                       */
  #define VPRCSR_MISA_MXL_Min (0x1UL)                /*!< Min enumerator value of MXL field.                                   */
  #define VPRCSR_MISA_MXL_Max (0x3UL)                /*!< Max enumerator value of MXL field.                                   */
  #define VPRCSR_MISA_MXL_XLEN32 (0x1UL)             /*!< XLEN is 32 bits                                                      */
  #define VPRCSR_MISA_MXL_XLEN64 (0x2UL)             /*!< XLEN is 64 bits                                                      */
  #define VPRCSR_MISA_MXL_XLEN128 (0x3UL)            /*!< XLEN is 128 bits                                                     */


/**
  * @brief MTVEC [VPRCSR_MTVEC] Machine Trap-Vector
  */
  #define VPRCSR_MTVEC (0x00000305ul)
  #define VPRCSR_MTVEC_ResetValue (0x00000003UL)     /*!< Reset value of MTVEC register.                                       */

/* MODE @Bits 0..1 : Mode */
  #define VPRCSR_MTVEC_MODE_Pos (0UL)                /*!< Position of MODE field.                                              */
  #define VPRCSR_MTVEC_MODE_Msk (0x3UL << VPRCSR_MTVEC_MODE_Pos) /*!< Bit mask of MODE field.                                  */
  #define VPRCSR_MTVEC_MODE_Min (0x3UL)              /*!< Min enumerator value of MODE field.                                  */
  #define VPRCSR_MTVEC_MODE_Max (0x3UL)              /*!< Max enumerator value of MODE field.                                  */
  #define VPRCSR_MTVEC_MODE_CLIC (0x3UL)             /*!< Core Local Interrupt Controller (CLIC) interrupt handling mode       */

/* BASE @Bits 2..31 : Vector base address */
  #define VPRCSR_MTVEC_BASE_Pos (2UL)                /*!< Position of BASE field.                                              */
  #define VPRCSR_MTVEC_BASE_Msk (0x3FFFFFFFUL << VPRCSR_MTVEC_BASE_Pos) /*!< Bit mask of BASE field.                           */


/**
  * @brief MTVT [VPRCSR_MTVT] Machine Trap Vector Table
  */
  #define VPRCSR_MTVT (0x00000307ul)
  #define VPRCSR_MTVT_ResetValue (0x00000000UL)      /*!< Reset value of MTVT register.                                        */

/* VAL @Bits 6..31 : Machine Trap Vector Table base address value for CLIC vectored interrupts */
  #define VPRCSR_MTVT_VAL_Pos (6UL)                  /*!< Position of VAL field.                                               */
  #define VPRCSR_MTVT_VAL_Msk (0x3FFFFFFUL << VPRCSR_MTVT_VAL_Pos) /*!< Bit mask of VAL field.                                 */


/**
  * @brief MCOUNTINHIBIT [VPRCSR_MCOUNTINHIBIT] Machine Counter-Inhibit
  */
  #define VPRCSR_MCOUNTINHIBIT (0x00000320ul)
  #define VPRCSR_MCOUNTINHIBIT_ResetValue (0x00000005UL) /*!< Reset value of MCOUNTINHIBIT register.                           */

/* CY @Bit 0 : (unspecified) */
  #define VPRCSR_MCOUNTINHIBIT_CY_Pos (0UL)          /*!< Position of CY field.                                                */
  #define VPRCSR_MCOUNTINHIBIT_CY_Msk (0x1UL << VPRCSR_MCOUNTINHIBIT_CY_Pos) /*!< Bit mask of CY field.                        */
  #define VPRCSR_MCOUNTINHIBIT_CY_Min (0x0UL)        /*!< Min enumerator value of CY field.                                    */
  #define VPRCSR_MCOUNTINHIBIT_CY_Max (0x1UL)        /*!< Max enumerator value of CY field.                                    */
  #define VPRCSR_MCOUNTINHIBIT_CY_INCREMENT (0x0UL)  /*!< MCYCLE increments as usual                                           */
  #define VPRCSR_MCOUNTINHIBIT_CY_INHIBIT (0x1UL)    /*!< MCYCLE doesn't increment                                             */

/* IR @Bit 2 : (unspecified) */
  #define VPRCSR_MCOUNTINHIBIT_IR_Pos (2UL)          /*!< Position of IR field.                                                */
  #define VPRCSR_MCOUNTINHIBIT_IR_Msk (0x1UL << VPRCSR_MCOUNTINHIBIT_IR_Pos) /*!< Bit mask of IR field.                        */
  #define VPRCSR_MCOUNTINHIBIT_IR_Min (0x0UL)        /*!< Min enumerator value of IR field.                                    */
  #define VPRCSR_MCOUNTINHIBIT_IR_Max (0x1UL)        /*!< Max enumerator value of IR field.                                    */
  #define VPRCSR_MCOUNTINHIBIT_IR_INCREMENT (0x0UL)  /*!< MINSTRET increments as usual                                         */
  #define VPRCSR_MCOUNTINHIBIT_IR_INHIBIT (0x1UL)    /*!< MINSTRET doesn't increment                                           */


/**
  * @brief MSCRATCH [VPRCSR_MSCRATCH] Machine Scratch
  */
  #define VPRCSR_MSCRATCH (0x00000340ul)
  #define VPRCSR_MSCRATCH_ResetValue (0x00000000UL)  /*!< Reset value of MSCRATCH register.                                    */

/* VAL @Bits 0..31 : Machine Scratch value */
  #define VPRCSR_MSCRATCH_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define VPRCSR_MSCRATCH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MSCRATCH_VAL_Pos) /*!< Bit mask of VAL field.                        */


/**
  * @brief MEPC [VPRCSR_MEPC] Machine Exception Program Counter
  */
  #define VPRCSR_MEPC (0x00000341ul)
  #define VPRCSR_MEPC_ResetValue (0x00000000UL)      /*!< Reset value of MEPC register.                                        */

