adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HARTNUM @Bits 0..31 : Machine Hart ID value */
  #define VPRCSR_MHARTID_HARTNUM_Pos (0UL)           /*!< Position of HARTNUM field.                                           */
  #define VPRCSR_MHARTID_HARTNUM_Msk (0xFFFFFFFFUL << VPRCSR_MHARTID_HARTNUM_Pos) /*!< Bit mask of HARTNUM field.              */


/**
  * @brief NORDIC [VPRCSR_NORDIC] (unspecified)
  */

/**
  * @brief VPRNORDICCTRL [VPRCSR_NORDIC_VPRNORDICCTRL] Nordic Core Control
  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL (0x000007C0ul)
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ResetValue (0x00000000UL) /*!< Reset value of VPRNORDICCTRL register.                    */

/* ENABLERTPERIPH @Bit 0 : Control bit to enable Real-Time Peripherals */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Pos (0UL) /*!< Position of ENABLERTPERIPH field.                          */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Pos) /*!< Bit mask
                                                                            of ENABLERTPERIPH field.*/
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Min (0x0UL) /*!< Min enumerator value of ENABLERTPERIPH field.            */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Max (0x1UL) /*!< Max enumerator value of ENABLERTPERIPH field.            */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Disabled (0x0UL) /*!< (unspecified)                                       */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Enabled (0x1UL) /*!< (unspecified)                                        */

/* RESETUNRECOVERABLE @Bit 1 : Core resets when it runs into an unrecoverable exception */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Pos (1UL) /*!< Position of RESETUNRECOVERABLE field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Pos) /*!<
                                                                            Bit mask of RESETUNRECOVERABLE field.*/
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Min (0x0UL) /*!< Min enumerator value of RESETUNRECOVERABLE field.    */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Max (0x1UL) /*!< Max enumerator value of RESETUNRECOVERABLE field.    */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Disabled (0x0UL) /*!< (unspecified)                                   */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Enabled (0x1UL) /*!< (unspecified)                                    */

/* ENABLEREMAP @Bit 3 : Enable remap feature */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Pos (3UL) /*!< Position of ENABLEREMAP field.                                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Pos) /*!< Bit mask of
                                                                            ENABLEREMAP field.*/
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Min (0x0UL) /*!< Min enumerator value of ENABLEREMAP field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Max (0x1UL) /*!< Max enumerator value of ENABLEREMAP field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Disabled (0x0UL) /*!< (unspecified)                                          */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Enabled (0x1UL) /*!< (unspecified)                                           */

/* FORCERAMCLK @Bit 4 : Force RAM clock request */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Pos (4UL) /*!< Position of FORCERAMCLK field.                                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Pos) /*!< Bit mask of
                                                                            FORCERAMCLK field.*/
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Min (0x0UL) /*!< Min enumerator value of FORCERAMCLK field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Max (0x1UL) /*!< Max enumerator value of FORCERAMCLK field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Disabled (0x0UL) /*!< (unspecified)                                          */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Enabled (0x1UL) /*!< (unspecified)                                           */

/* FORCEEXTCLK @Bit 5 : Force external clock request */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Pos (5UL) /*!< Position of FORCEEXTCLK field.                                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Pos) /*!< Bit mask of
                                                                            FORCEEXTCLK field.*/
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Min (0x0UL) /*!< Min enumerator value of FORCEEXTCLK field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Max (0x1UL) /*!< Max enumerator value of FORCEEXTCLK field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Disabled (0x0UL) /*!< (unspecified)                                          */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Enabled (0x1UL) /*!< (unspecified)                                           */

/* CNTIRQENABLE @Bit 6 : Enables the generation of IRQ number COUNTER_IRQ_NUM */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Pos (6UL) /*!< Position of CNTIRQENABLE field.                              */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Pos) /*!< Bit mask of
                                                                            CNTIRQENABLE field.*/
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Min (0x0UL) /*!< Min enumerator value of CNTIRQENABLE field.                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Max (0x1UL) /*!< Max enumerator value of CNTIRQENABLE field.                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Disabled (0x0UL) /*!< (unspecified)                                         */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Enabled (0x1UL) /*!< (unspecified)                                          */

/* NORDICKEY @Bits 16..31 : Used in order to protect the write to this register */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos (16UL) /*!< Position of NORDICKEY field.                                   */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Msk (0xFFFFUL << VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos) /*!< Bit mask of
                                                                            NORDICKEY field.*/
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Min (0x507DUL) /*!< Min enumerator value of NORDICKEY field.                   */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Max (0x507DUL) /*!< Max enumerator value of NORDICKEY field.                   */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled (0x507DUL) /*!< Write enabled                                          */


/**
  * @brief VPRNORDICSLEEPCTRL [VPRCSR_NORDIC_VPRNORDICSLEEPCTRL] Nordic Sleep Control
  */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL (0x000007C1ul)
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_ResetValue (0x00000002UL) /*!< Reset value of VPRNORDICSLEEPCTRL register.          */

