adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* PUBLISH12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Pos (12UL) /*!< Position of PUBLISH12 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH12_Pos) /*!< Bit mask of PUBLISH12 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Min (0x0UL) /*!< Min enumerator value of PUBLISH12 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Max (0x1UL) /*!< Max enumerator value of PUBLISH12 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Disabled (0x0UL) /*!< Publish disabled for EVENTS[12]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Enabled (0x1UL) /*!< Publish enabled for EVENTS[12]                                  */

/* PUBLISH13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Pos (13UL) /*!< Position of PUBLISH13 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH13_Pos) /*!< Bit mask of PUBLISH13 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Min (0x0UL) /*!< Min enumerator value of PUBLISH13 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Max (0x1UL) /*!< Max enumerator value of PUBLISH13 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Disabled (0x0UL) /*!< Publish disabled for EVENTS[13]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Enabled (0x1UL) /*!< Publish enabled for EVENTS[13]                                  */

/* PUBLISH14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Pos (14UL) /*!< Position of PUBLISH14 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH14_Pos) /*!< Bit mask of PUBLISH14 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Min (0x0UL) /*!< Min enumerator value of PUBLISH14 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Max (0x1UL) /*!< Max enumerator value of PUBLISH14 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Disabled (0x0UL) /*!< Publish disabled for EVENTS[14]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Enabled (0x1UL) /*!< Publish enabled for EVENTS[14]                                  */

/* PUBLISH15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Pos (15UL) /*!< Position of PUBLISH15 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH15_Pos) /*!< Bit mask of PUBLISH15 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Min (0x0UL) /*!< Min enumerator value of PUBLISH15 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Max (0x1UL) /*!< Max enumerator value of PUBLISH15 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Disabled (0x0UL) /*!< Publish disabled for EVENTS[15]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Enabled (0x1UL) /*!< Publish enabled for EVENTS[15]                                  */

/* PUBLISH16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Pos (16UL) /*!< Position of PUBLISH16 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH16_Pos) /*!< Bit mask of PUBLISH16 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Min (0x0UL) /*!< Min enumerator value of PUBLISH16 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Max (0x1UL) /*!< Max enumerator value of PUBLISH16 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Disabled (0x0UL) /*!< Publish disabled for EVENTS[16]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Enabled (0x1UL) /*!< Publish enabled for EVENTS[16]                                  */

/* PUBLISH17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Pos (17UL) /*!< Position of PUBLISH17 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH17_Pos) /*!< Bit mask of PUBLISH17 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Min (0x0UL) /*!< Min enumerator value of PUBLISH17 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Max (0x1UL) /*!< Max enumerator value of PUBLISH17 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Disabled (0x0UL) /*!< Publish disabled for EVENTS[17]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Enabled (0x1UL) /*!< Publish enabled for EVENTS[17]                                  */

/* PUBLISH18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Pos (18UL) /*!< Position of PUBLISH18 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH18_Pos) /*!< Bit mask of PUBLISH18 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Min (0x0UL) /*!< Min enumerator value of PUBLISH18 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Max (0x1UL) /*!< Max enumerator value of PUBLISH18 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Disabled (0x0UL) /*!< Publish disabled for EVENTS[18]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Enabled (0x1UL) /*!< Publish enabled for EVENTS[18]                                  */

/* PUBLISH19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Pos (19UL) /*!< Position of PUBLISH19 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH19_Pos) /*!< Bit mask of PUBLISH19 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Min (0x0UL) /*!< Min enumerator value of PUBLISH19 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Max (0x1UL) /*!< Max enumerator value of PUBLISH19 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Disabled (0x0UL) /*!< Publish disabled for EVENTS[19]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Enabled (0x1UL) /*!< Publish enabled for EVENTS[19]                                  */

/* PUBLISH20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Pos (20UL) /*!< Position of PUBLISH20 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH20_Pos) /*!< Bit mask of PUBLISH20 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Min (0x0UL) /*!< Min enumerator value of PUBLISH20 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Max (0x1UL) /*!< Max enumerator value of PUBLISH20 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Disabled (0x0UL) /*!< Publish disabled for EVENTS[20]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Enabled (0x1UL) /*!< Publish enabled for EVENTS[20]                                  */

/* PUBLISH21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Pos (21UL) /*!< Position of PUBLISH21 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH21_Pos) /*!< Bit mask of PUBLISH21 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Min (0x0UL) /*!< Min enumerator value of PUBLISH21 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Max (0x1UL) /*!< Max enumerator value of PUBLISH21 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Disabled (0x0UL) /*!< Publish disabled for EVENTS[21]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Enabled (0x1UL) /*!< Publish enabled for EVENTS[21]                                  */

/* PUBLISH22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Pos (22UL) /*!< Position of PUBLISH22 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH22_Pos) /*!< Bit mask of PUBLISH22 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Min (0x0UL) /*!< Min enumerator value of PUBLISH22 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Max (0x1UL) /*!< Max enumerator value of PUBLISH22 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Disabled (0x0UL) /*!< Publish disabled for EVENTS[22]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Enabled (0x1UL) /*!< Publish enabled for EVENTS[22]                                  */

