adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VPRPUBLIC_TASKS_TRIGGER: VPR task [n] register */
  #define VPRPUBLIC_TASKS_TRIGGER_MaxCount (32UL)    /*!< Max size of TASKS_TRIGGER[32] array.                                 */
  #define VPRPUBLIC_TASKS_TRIGGER_MaxIndex (31UL)    /*!< Max index of TASKS_TRIGGER[32] array.                                */
  #define VPRPUBLIC_TASKS_TRIGGER_MinIndex (0UL)     /*!< Min index of TASKS_TRIGGER[32] array.                                */
  #define VPRPUBLIC_TASKS_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGGER[32] register.                    */

/* TASKS_TRIGGER @Bit 0 : VPR task [n] register */
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL) /*!< Position of TASKS_TRIGGER field.                                */
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGGER field.*/
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGGER field.                  */
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGGER field.                  */
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL) /*!< Trigger task                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VREG1V0                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct VREG1V0_CONFIG ================================================== */
/**
  * @brief CONFIG [VREG1V0_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) Voltage regulator static CFG configuration            */
  __IOM uint32_t  CFGDYNAMIC;                        /*!< (@ 0x00000004) Voltage regulator dynamic CFG configuration           */
} NRF_VREG1V0_CONFIG_Type;                           /*!< Size = 8 (0x008)                                                     */

/* VREG1V0_CONFIG_CFGSTATIC: Voltage regulator static CFG configuration */
  #define VREG1V0_CONFIG_CFGSTATIC_ResetValue (0x00000000UL) /*!< Reset value of CFGSTATIC register.                           */

/* ULPRREFRESHCMPDIS @Bit 0 : Disable the ULPR refresh comparator */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Pos (0UL) /*!< Position of ULPRREFRESHCMPDIS field.                       */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Pos) /*!< Bit mask
                                                                            of ULPRREFRESHCMPDIS field.*/
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Min (0x0UL) /*!< Min enumerator value of ULPRREFRESHCMPDIS field.         */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Max (0x1UL) /*!< Max enumerator value of ULPRREFRESHCMPDIS field.         */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Disabled (0x0UL) /*!< Configuration disabled                              */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Enabled (0x1UL) /*!< Configuration enabled                                */

/* VREFTIMERDIV2 @Bit 1 : Double the VREF timer */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Pos (1UL) /*!< Position of VREFTIMERDIV2 field.                               */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Pos) /*!< Bit mask of
                                                                            VREFTIMERDIV2 field.*/
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Min (0x0UL) /*!< Min enumerator value of VREFTIMERDIV2 field.                 */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Max (0x1UL) /*!< Max enumerator value of VREFTIMERDIV2 field.                 */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Disabled (0x0UL) /*!< Configuration disabled                                  */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Enabled (0x1UL) /*!< Configuration enabled                                    */

/* ULPRREFRESHDIV2 @Bit 2 : Double the ULPR refresh timer */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Pos (2UL) /*!< Position of ULPRREFRESHDIV2 field.                           */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Pos) /*!< Bit mask of
                                                                            ULPRREFRESHDIV2 field.*/
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Min (0x0UL) /*!< Min enumerator value of ULPRREFRESHDIV2 field.             */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Max (0x1UL) /*!< Max enumerator value of ULPRREFRESHDIV2 field.             */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Disabled (0x0UL) /*!< Configuration disabled                                */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Enabled (0x1UL) /*!< Configuration enabled                                  */

/* CURRCMPDIS @Bit 3 : Disable the current comparator */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Pos (3UL) /*!< Position of CURRCMPDIS field.                                     */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Pos) /*!< Bit mask of CURRCMPDIS
                                                                            field.*/
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Min (0x0UL) /*!< Min enumerator value of CURRCMPDIS field.                       */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Max (0x1UL) /*!< Max enumerator value of CURRCMPDIS field.                       */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Enabled (0x1UL) /*!< Configuration enabled                                       */

