adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LPDOUBLEBIAS @Bit 4 : Double the LP core bias current */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Pos (4UL) /*!< Position of LPDOUBLEBIAS field.                                 */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Pos) /*!< Bit mask of
                                                                            LPDOUBLEBIAS field.*/
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Min (0x0UL) /*!< Min enumerator value of LPDOUBLEBIAS field.                   */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Max (0x1UL) /*!< Max enumerator value of LPDOUBLEBIAS field.                   */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Disabled (0x0UL) /*!< Configuration disabled                                   */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Enabled (0x1UL) /*!< Configuration enabled                                     */

/* ULPRREFOFFSET @Bits 5..6 : Offset of voltage reference in ULPR mode. */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_Pos (5UL) /*!< Position of ULPRREFOFFSET field.                               */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_Msk (0x3UL << VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_Pos) /*!< Bit mask of
                                                                            ULPRREFOFFSET field.*/
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_Min (0x0UL) /*!< Min enumerator value of ULPRREFOFFSET field.                 */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_Max (0x3UL) /*!< Max enumerator value of ULPRREFOFFSET field.                 */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_VRO00mV (0x0UL) /*!< 0mV                                                      */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_VRO10mV (0x1UL) /*!< 10mV                                                     */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_VRO20mV (0x2UL) /*!< 20mV                                                     */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFOFFSET_VRO30mV (0x3UL) /*!< 30mV                                                     */


/* VREG1V0_CONFIG_CFGDYNAMIC: Voltage regulator dynamic CFG configuration */
  #define VREG1V0_CONFIG_CFGDYNAMIC_ResetValue (0x00000004UL) /*!< Reset value of CFGDYNAMIC register.                         */

/* SOFTSTART @Bits 0..2 : Current limit configuration for the voltage regulator */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Pos (0UL) /*!< Position of SOFTSTART field.                                      */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Msk (0x7UL << VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Pos) /*!< Bit mask of SOFTSTART
                                                                            field.*/
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Min (0x0UL) /*!< Min enumerator value of SOFTSTART field.                        */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Max (0x4UL) /*!< Max enumerator value of SOFTSTART field.                        */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Auto (0x0UL) /*!< Automatically handled by the peripheral                        */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Normal (0x1UL) /*!< Normal operation                                             */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_IlimHigh (0x2UL) /*!< Radio soft start                                           */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_IlimMid (0x3UL) /*!< WU soft start                                               */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_IlimLow (0x4UL) /*!< Reset current limit                                         */



/* =================================================== Struct VREG1V0_TRIM =================================================== */
/**
  * @brief TRIM [VREG1V0_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  IREF;                              /*!< (@ 0x00000000) Local current reference trimming                      */
  __IOM uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) High power mode output voltage offset trimming        */
  __IOM uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Low power mode output voltage offset trimming         */
  __IOM uint32_t  ULPR;                              /*!< (@ 0x0000000C) ULPR mode comparator offset trimming                  */
} NRF_VREG1V0_TRIM_Type;                             /*!< Size = 16 (0x010)                                                    */

/* VREG1V0_TRIM_IREF: Local current reference trimming */
  #define VREG1V0_TRIM_IREF_ResetValue (0x00000008UL) /*!< Reset value of IREF register.                                       */

/* VAL @Bits 0..6 : Current reference trimming value */
  #define VREG1V0_TRIM_IREF_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define VREG1V0_TRIM_IREF_VAL_Msk (0x7FUL << VREG1V0_TRIM_IREF_VAL_Pos) /*!< Bit mask of VAL field.                          */


/* VREG1V0_TRIM_HIGHPOWER: High power mode output voltage offset trimming */
  #define VREG1V0_TRIM_HIGHPOWER_ResetValue (0x00000000UL) /*!< Reset value of HIGHPOWER register.                             */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREG1V0_TRIM_HIGHPOWER_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREG1V0_TRIM_HIGHPOWER_VAL_Msk (0xFUL << VREG1V0_TRIM_HIGHPOWER_VAL_Pos) /*!< Bit mask of VAL field.                 */


/* VREG1V0_TRIM_LOWPOWER: Low power mode output voltage offset trimming */
  #define VREG1V0_TRIM_LOWPOWER_ResetValue (0x00000000UL) /*!< Reset value of LOWPOWER register.                               */

/* VAL @Bits 0..3 : Voltage offset trimming value. */
  #define VREG1V0_TRIM_LOWPOWER_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VREG1V0_TRIM_LOWPOWER_VAL_Msk (0xFUL << VREG1V0_TRIM_LOWPOWER_VAL_Pos) /*!< Bit mask of VAL field.                   */


/* VREG1V0_TRIM_ULPR: ULPR mode comparator offset trimming */
  #define VREG1V0_TRIM_ULPR_ResetValue (0x00000000UL) /*!< Reset value of ULPR register.                                       */

