adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VAL @Bits 0..2 : Comparator offset trimming value. */
  #define VREG1V0_TRIM_ULPR_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define VREG1V0_TRIM_ULPR_VAL_Msk (0x7UL << VREG1V0_TRIM_ULPR_VAL_Pos) /*!< Bit mask of VAL field.                           */



/* ================================================= Struct VREG1V0_OVERRIDE ================================================= */
/**
  * @brief OVERRIDE [VREG1V0_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x00000008) Override the MODE LP signal to the analog module      */
  __IOM uint32_t  MODEULPR;                          /*!< (@ 0x0000000C) Override the MODE ULPR signal to the analog module    */
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000010) Override the dynamic CFG signal to the analog module  */
  __IOM uint32_t  VOLTHP;                            /*!< (@ 0x00000014) Override the VOLT HP signal to the analog module      */
  __IOM uint32_t  VOLTLP;                            /*!< (@ 0x00000018) Override the VOLT LP signal to the analog module      */
  __IOM uint32_t  READY;                             /*!< (@ 0x0000001C) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000020) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  IOUTCMP;                           /*!< (@ 0x00000024) Override the IOUTCMP signal from the analog module    */
} NRF_VREG1V0_OVERRIDE_Type;                         /*!< Size = 40 (0x028)                                                    */

/* VREG1V0_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VREG1V0_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                 */

/* VAL @Bit 0 : Override value for the signal */
  #define VREG1V0_OVERRIDE_PWRUP_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Msk (0x1UL << VREG1V0_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VREG1V0_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VREG1V0_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VREG1V0_OVERRIDE_RETAIN_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Msk (0x1UL << VREG1V0_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREG1V0_OVERRIDE_MODELP: Override the MODE LP signal to the analog module */
  #define VREG1V0_OVERRIDE_MODELP_ResetValue (0x00000000UL) /*!< Reset value of MODELP register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VREG1V0_OVERRIDE_MODELP_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_MODELP_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_MODELP_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_MODELP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_MODELP_EN_Msk (0x1UL << VREG1V0_OVERRIDE_MODELP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREG1V0_OVERRIDE_MODELP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_MODELP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_MODELP_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREG1V0_OVERRIDE_MODELP_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREG1V0_OVERRIDE_MODEULPR: Override the MODE ULPR signal to the analog module */
  #define VREG1V0_OVERRIDE_MODEULPR_ResetValue (0x00000000UL) /*!< Reset value of MODEULPR register.                           */

/* VAL @Bit 0 : Override value for the signal */
  #define VREG1V0_OVERRIDE_MODEULPR_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_MODEULPR_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_MODEULPR_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_MODEULPR_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_MODEULPR_EN_Msk (0x1UL << VREG1V0_OVERRIDE_MODEULPR_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREG1V0_OVERRIDE_MODEULPR_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_MODEULPR_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_MODEULPR_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREG1V0_OVERRIDE_MODEULPR_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREG1V0_OVERRIDE_CFG: Override the dynamic CFG signal to the analog module */
  #define VREG1V0_OVERRIDE_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                     */

/* VAL @Bits 0..1 : Override value for the signal */
  #define VREG1V0_OVERRIDE_CFG_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_CFG_VAL_Msk (0x3UL << VREG1V0_OVERRIDE_CFG_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_CFG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_CFG_EN_Msk (0x1UL << VREG1V0_OVERRIDE_CFG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define VREG1V0_OVERRIDE_CFG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_CFG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_CFG_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define VREG1V0_OVERRIDE_CFG_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* VREG1V0_OVERRIDE_VOLTHP: Override the VOLT HP signal to the analog module */
  #define VREG1V0_OVERRIDE_VOLTHP_ResetValue (0x00000000UL) /*!< Reset value of VOLTHP register.                               */

/* VAL @Bits 0..5 : Override value for the signal */
  #define VREG1V0_OVERRIDE_VOLTHP_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_VOLTHP_VAL_Msk (0x3FUL << VREG1V0_OVERRIDE_VOLTHP_VAL_Pos) /*!< Bit mask of VAL field.              */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_VOLTHP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_VOLTHP_EN_Msk (0x1UL << VREG1V0_OVERRIDE_VOLTHP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREG1V0_OVERRIDE_VOLTHP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_VOLTHP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_VOLTHP_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREG1V0_OVERRIDE_VOLTHP_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREG1V0_OVERRIDE_VOLTLP: Override the VOLT LP signal to the analog module */
  #define VREG1V0_OVERRIDE_VOLTLP_ResetValue (0x00000000UL) /*!< Reset value of VOLTLP register.                               */

/* VAL @Bits 0..5 : Override value for the signal */
  #define VREG1V0_OVERRIDE_VOLTLP_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_VOLTLP_VAL_Msk (0x3FUL << VREG1V0_OVERRIDE_VOLTLP_VAL_Pos) /*!< Bit mask of VAL field.              */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_VOLTLP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_VOLTLP_EN_Msk (0x1UL << VREG1V0_OVERRIDE_VOLTLP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREG1V0_OVERRIDE_VOLTLP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_VOLTLP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_VOLTLP_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREG1V0_OVERRIDE_VOLTLP_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREG1V0_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VREG1V0_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                 */

/* VAL @Bit 0 : Current value of the signal */
  #define VREG1V0_OVERRIDE_READY_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_READY_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_READY_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_READY_EN_Msk (0x1UL << VREG1V0_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREG1V0_OVERRIDE_READY_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_READY_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VREG1V0_OVERRIDE_READY_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VREG1V0_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define VREG1V0_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                             */

/* VAL @Bit 0 : Current value of the signal */
  #define VREG1V0_OVERRIDE_SETTLED_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_SETTLED_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_SETTLED_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_SETTLED_EN_Msk (0x1UL << VREG1V0_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREG1V0_OVERRIDE_SETTLED_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_SETTLED_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREG1V0_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREG1V0_OVERRIDE_IOUTCMP: Override the IOUTCMP signal from the analog module */
  #define VREG1V0_OVERRIDE_IOUTCMP_ResetValue (0x00000000UL) /*!< Reset value of IOUTCMP register.                             */

/* VAL @Bit 0 : Current value of the signal */
  #define VREG1V0_OVERRIDE_IOUTCMP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_IOUTCMP_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_IOUTCMP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_IOUTCMP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_IOUTCMP_EN_Msk (0x1UL << VREG1V0_OVERRIDE_IOUTCMP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREG1V0_OVERRIDE_IOUTCMP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_IOUTCMP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_IOUTCMP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREG1V0_OVERRIDE_IOUTCMP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */



