adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* =================================================== Struct VREG1V0_DFT ==================================================== */
/**
  * @brief DFT [VREG1V0_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
  __IOM uint32_t  CALEN;                             /*!< (@ 0x00000034) Calibration enable                                    */
  __IM  uint32_t  CALCMP;                            /*!< (@ 0x00000038) Calibration compare                                   */
} NRF_VREG1V0_DFT_Type;                              /*!< Size = 60 (0x03C)                                                    */

/* VREG1V0_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VREG1V0_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                            */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define VREG1V0_DFT_ATB0CONFIG_SELMUX_Pos (0UL)    /*!< Position of SELMUX field.                                            */
  #define VREG1V0_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << VREG1V0_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.        */
  #define VREG1V0_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)  /*!< Min enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_ATB0CONFIG_SELMUX_Max (0x3UL)  /*!< Max enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_ATB0CONFIG_SELMUX_ExtVref (0x0UL) /*!< Negative input of calibration comparator                          */
  #define VREG1V0_DFT_ATB0CONFIG_SELMUX_Ibpp50n (0x1UL) /*!< Internal 50nA current reference                                   */
  #define VREG1V0_DFT_ATB0CONFIG_SELMUX_ibpsr8u (0x2UL) /*!< Internal 8uA current reference                                    */
  #define VREG1V0_DFT_ATB0CONFIG_SELMUX_VSS (0x3UL)  /*!< VSS                                                                  */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREG1V0_DFT_ATB0CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREG1V0_DFT_ATB0CONFIG_EN_Msk (0x1UL << VREG1V0_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREG1V0_DFT_ATB0CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_DFT_ATB0CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                          */
  #define VREG1V0_DFT_ATB0CONFIG_EN_Enabled (0x1UL)  /*!< Analog test bus is enabled                                           */


/* VREG1V0_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VREG1V0_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                            */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define VREG1V0_DFT_ATB1CONFIG_SELMUX_Pos (0UL)    /*!< Position of SELMUX field.                                            */
  #define VREG1V0_DFT_ATB1CONFIG_SELMUX_Msk (0x3UL << VREG1V0_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.        */
  #define VREG1V0_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)  /*!< Min enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_ATB1CONFIG_SELMUX_Max (0x3UL)  /*!< Max enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_ATB1CONFIG_SELMUX_None (0x0UL) /*!< None selected                                                        */
  #define VREG1V0_DFT_ATB1CONFIG_SELMUX_BufferedHPvref (0x1UL) /*!< Buffered HP vref                                           */
  #define VREG1V0_DFT_ATB1CONFIG_SELMUX_VDD1V0 (0x2UL) /*!< VDD_1V0                                                            */
  #define VREG1V0_DFT_ATB1CONFIG_SELMUX_Ibpsr4u (0x3UL) /*!< Internal 4uA current reference, through 225kOhm resistor          */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREG1V0_DFT_ATB1CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREG1V0_DFT_ATB1CONFIG_EN_Msk (0x1UL << VREG1V0_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREG1V0_DFT_ATB1CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_DFT_ATB1CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                          */
  #define VREG1V0_DFT_ATB1CONFIG_EN_Enabled (0x1UL)  /*!< Analog test bus is enabled                                           */


/* VREG1V0_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VREG1V0_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                            */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_Pos (0UL)    /*!< Position of SELMUX field.                                            */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << VREG1V0_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.        */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)  /*!< Min enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_Max (0x7UL)  /*!< Max enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_None (0x0UL) /*!< None selected, logic 0                                               */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_RefreshULPR (0x1UL) /*!< ULPR refresh pulse                                            */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_SettledIBPSR (0x2UL) /*!< BIAS_IBPSR_4U_DVT settled signal                             */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_CurrCmp (0x4UL) /*!< Current comparator output                                         */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_ReqModeLP (0x5UL) /*!< LP mode request                                                 */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_RegModeULPR (0x6UL) /*!< ULPR mode request                                             */
  #define VREG1V0_DFT_DTB0CONFIG_SELMUX_CalCmp (0x7UL) /*!< Calibration comparator output                                      */

