adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define VREG1V0_DFT_DTB0CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREG1V0_DFT_DTB0CONFIG_EN_Msk (0x1UL << VREG1V0_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREG1V0_DFT_DTB0CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_DFT_DTB0CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define VREG1V0_DFT_DTB0CONFIG_EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */


/* VREG1V0_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VREG1V0_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                            */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB1 */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_Pos (0UL)    /*!< Position of SELMUX field.                                            */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_Msk (0x7UL << VREG1V0_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.        */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)  /*!< Min enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_Max (0x7UL)  /*!< Max enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_VrefTimerAck (0x0UL) /*!< Vref timer acknowledge                                       */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_RefreshTimerAck (0x1UL) /*!< ULPR refresh timer acknowledge                            */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_ReadyIBPSR (0x2UL) /*!< IBPSR ready signal                                             */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_ReadyHP (0x3UL) /*!< High power core ready signal                                      */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_ReadyLP (0x4UL) /*!< Low power core ready signal                                       */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_CancelLPAck (0x5UL) /*!< Low power core cancel acknowledge signal                      */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_ReadyIBPP5n (0x6UL) /*!< BIAS_IBPP_5N ready signal                                     */
  #define VREG1V0_DFT_DTB1CONFIG_SELMUX_Settled (0x7UL) /*!< Settled signal                                                    */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREG1V0_DFT_DTB1CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREG1V0_DFT_DTB1CONFIG_EN_Msk (0x1UL << VREG1V0_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREG1V0_DFT_DTB1CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_DFT_DTB1CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define VREG1V0_DFT_DTB1CONFIG_EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */


/* VREG1V0_DFT_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define VREG1V0_DFT_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                            */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB2 */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_Pos (0UL)    /*!< Position of SELMUX field.                                            */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_Msk (0x7UL << VREG1V0_DFT_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.        */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_Min (0x0UL)  /*!< Min enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_Max (0x7UL)  /*!< Max enumerator value of SELMUX field.                                */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_VrefTimerReq (0x0UL) /*!< Vref timer request                                           */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_RefreshTimerReq (0x1UL) /*!< ULPR refresh timer request                                */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_PwrupIBPSR (0x2UL) /*!< IBPSR power up signal                                          */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_PwrupHP (0x3UL) /*!< High power core power up signal                                   */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_PwrupLP (0x4UL) /*!< Low power core power up signal                                    */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_CancelLP (0x5UL) /*!< Low power core cancel signal                                     */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_PwrupIBPP5n (0x6UL) /*!< BIAS_IBPP_5N power up signal                                  */
  #define VREG1V0_DFT_DTB2CONFIG_SELMUX_None (0x7UL) /*!< None selected, logic 0                                               */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREG1V0_DFT_DTB2CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREG1V0_DFT_DTB2CONFIG_EN_Msk (0x1UL << VREG1V0_DFT_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREG1V0_DFT_DTB2CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_DFT_DTB2CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_DFT_DTB2CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define VREG1V0_DFT_DTB2CONFIG_EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */


/* VREG1V0_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VREG1V0_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                            */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VREG1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                  */
  #define VREG1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VREG1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/
  #define VREG1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                     */
  #define VREG1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                     */
  #define VREG1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                       */
  #define VREG1V0_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                         */


/* VREG1V0_DFT_TCFG: Test mode configuration */
  #define VREG1V0_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                        */

/* VREFTIMERREQ @Bit 0 : Controls VREF_TIMER_REQ_SW_1V8 */
  #define VREG1V0_DFT_TCFG_VREFTIMERREQ_Pos (0UL)    /*!< Position of VREFTIMERREQ field.                                      */
  #define VREG1V0_DFT_TCFG_VREFTIMERREQ_Msk (0x1UL << VREG1V0_DFT_TCFG_VREFTIMERREQ_Pos) /*!< Bit mask of VREFTIMERREQ field.  */

/* RFRENDCRITERIA @Bit 1 : Controls RFR_END_CRITERIA_REQ_SW_1V8 */
  #define VREG1V0_DFT_TCFG_RFRENDCRITERIA_Pos (1UL)  /*!< Position of RFRENDCRITERIA field.                                    */
  #define VREG1V0_DFT_TCFG_RFRENDCRITERIA_Msk (0x1UL << VREG1V0_DFT_TCFG_RFRENDCRITERIA_Pos) /*!< Bit mask of RFRENDCRITERIA
                                                                            field.*/

