adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define VREGAO0V8_DFT_DTB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO0V8_DFT_DTB1CONFIG_EN_Msk (0x1UL << VREGAO0V8_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO0V8_DFT_DTB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_DTB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VREGAO0V8_DFT_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VREGAO0V8_DFT_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define VREGAO0V8_DFT_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB2 */
  #define VREGAO0V8_DFT_DTB2CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO0V8_DFT_DTB2CONFIG_SELMUX_Msk (0x3UL << VREGAO0V8_DFT_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO0V8_DFT_DTB2CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_DTB2CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_DTB2CONFIG_SELMUX_IcmpLp (0x0UL) /*!< ICMP_LP                                                          */
  #define VREGAO0V8_DFT_DTB2CONFIG_SELMUX_VoutCmp (0x1UL) /*!< VOUTCMP                                                         */
  #define VREGAO0V8_DFT_DTB2CONFIG_SELMUX_ReqBp (0x2UL) /*!< REQ_BP                                                            */
  #define VREGAO0V8_DFT_DTB2CONFIG_SELMUX_CalCmp (0x3UL) /*!< CAL_CMP                                                          */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGAO0V8_DFT_DTB2CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO0V8_DFT_DTB2CONFIG_EN_Msk (0x1UL << VREGAO0V8_DFT_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO0V8_DFT_DTB2CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_DTB2CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_DTB2CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VREGAO0V8_DFT_DTB2CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VREGAO0V8_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VREGAO0V8_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                          */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VREGAO0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                */
  #define VREGAO0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VREGAO0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/
  #define VREGAO0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                   */
  #define VREGAO0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                   */
  #define VREGAO0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                     */
  #define VREGAO0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                       */


/* VREGAO0V8_DFT_TCFG: Test mode configuration */
  #define VREGAO0V8_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                      */

/* PWRUPIBPSR @Bit 0 : (unspecified) */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPSR_Pos (0UL)    /*!< Position of PWRUPIBPSR field.                                        */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPSR_Msk (0x1UL << VREGAO0V8_DFT_TCFG_PWRUPIBPSR_Pos) /*!< Bit mask of PWRUPIBPSR field.    */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPSR_Min (0x0UL)  /*!< Min enumerator value of PWRUPIBPSR field.                            */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPSR_Max (0x1UL)  /*!< Max enumerator value of PWRUPIBPSR field.                            */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPSR_Disabled (0x0UL) /*!< (unspecified)                                                    */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPSR_Enabled (0x1UL) /*!< (unspecified)                                                     */

/* PWRUPHPCORE @Bit 1 : (unspecified) */
  #define VREGAO0V8_DFT_TCFG_PWRUPHPCORE_Pos (1UL)   /*!< Position of PWRUPHPCORE field.                                       */
  #define VREGAO0V8_DFT_TCFG_PWRUPHPCORE_Msk (0x1UL << VREGAO0V8_DFT_TCFG_PWRUPHPCORE_Pos) /*!< Bit mask of PWRUPHPCORE field. */
  #define VREGAO0V8_DFT_TCFG_PWRUPHPCORE_Min (0x0UL) /*!< Min enumerator value of PWRUPHPCORE field.                           */
  #define VREGAO0V8_DFT_TCFG_PWRUPHPCORE_Max (0x1UL) /*!< Max enumerator value of PWRUPHPCORE field.                           */
  #define VREGAO0V8_DFT_TCFG_PWRUPHPCORE_Disabled (0x0UL) /*!< (unspecified)                                                   */
  #define VREGAO0V8_DFT_TCFG_PWRUPHPCORE_Enabled (0x1UL) /*!< (unspecified)                                                    */

/* PWRUPIBPP @Bit 2 : (unspecified) */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPP_Pos (2UL)     /*!< Position of PWRUPIBPP field.                                         */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPP_Msk (0x1UL << VREGAO0V8_DFT_TCFG_PWRUPIBPP_Pos) /*!< Bit mask of PWRUPIBPP field.       */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPP_Min (0x0UL)   /*!< Min enumerator value of PWRUPIBPP field.                             */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPP_Max (0x1UL)   /*!< Max enumerator value of PWRUPIBPP field.                             */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPP_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGAO0V8_DFT_TCFG_PWRUPIBPP_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* PWRUPLPCORE @Bit 3 : (unspecified) */
  #define VREGAO0V8_DFT_TCFG_PWRUPLPCORE_Pos (3UL)   /*!< Position of PWRUPLPCORE field.                                       */
  #define VREGAO0V8_DFT_TCFG_PWRUPLPCORE_Msk (0x1UL << VREGAO0V8_DFT_TCFG_PWRUPLPCORE_Pos) /*!< Bit mask of PWRUPLPCORE field. */
  #define VREGAO0V8_DFT_TCFG_PWRUPLPCORE_Min (0x0UL) /*!< Min enumerator value of PWRUPLPCORE field.                           */
  #define VREGAO0V8_DFT_TCFG_PWRUPLPCORE_Max (0x1UL) /*!< Max enumerator value of PWRUPLPCORE field.                           */
  #define VREGAO0V8_DFT_TCFG_PWRUPLPCORE_Disabled (0x0UL) /*!< (unspecified)                                                   */
  #define VREGAO0V8_DFT_TCFG_PWRUPLPCORE_Enabled (0x1UL) /*!< (unspecified)                                                    */

