adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* ENBYPASS @Bit 4 : (unspecified) */
  #define VREGAO0V8_DFT_TCFG_ENBYPASS_Pos (4UL)      /*!< Position of ENBYPASS field.                                          */
  #define VREGAO0V8_DFT_TCFG_ENBYPASS_Msk (0x1UL << VREGAO0V8_DFT_TCFG_ENBYPASS_Pos) /*!< Bit mask of ENBYPASS field.          */
  #define VREGAO0V8_DFT_TCFG_ENBYPASS_Min (0x0UL)    /*!< Min enumerator value of ENBYPASS field.                              */
  #define VREGAO0V8_DFT_TCFG_ENBYPASS_Max (0x1UL)    /*!< Max enumerator value of ENBYPASS field.                              */
  #define VREGAO0V8_DFT_TCFG_ENBYPASS_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define VREGAO0V8_DFT_TCFG_ENBYPASS_Enabled (0x1UL) /*!< (unspecified)                                                       */

/* PWRUPBPDET @Bit 5 : (unspecified) */
  #define VREGAO0V8_DFT_TCFG_PWRUPBPDET_Pos (5UL)    /*!< Position of PWRUPBPDET field.                                        */
  #define VREGAO0V8_DFT_TCFG_PWRUPBPDET_Msk (0x1UL << VREGAO0V8_DFT_TCFG_PWRUPBPDET_Pos) /*!< Bit mask of PWRUPBPDET field.    */
  #define VREGAO0V8_DFT_TCFG_PWRUPBPDET_Min (0x0UL)  /*!< Min enumerator value of PWRUPBPDET field.                            */
  #define VREGAO0V8_DFT_TCFG_PWRUPBPDET_Max (0x1UL)  /*!< Max enumerator value of PWRUPBPDET field.                            */
  #define VREGAO0V8_DFT_TCFG_PWRUPBPDET_Disabled (0x0UL) /*!< (unspecified)                                                    */
  #define VREGAO0V8_DFT_TCFG_PWRUPBPDET_Enabled (0x1UL) /*!< (unspecified)                                                     */

/* PWRUPVOUTCMP @Bit 6 : (unspecified) */
  #define VREGAO0V8_DFT_TCFG_PWRUPVOUTCMP_Pos (6UL)  /*!< Position of PWRUPVOUTCMP field.                                      */
  #define VREGAO0V8_DFT_TCFG_PWRUPVOUTCMP_Msk (0x1UL << VREGAO0V8_DFT_TCFG_PWRUPVOUTCMP_Pos) /*!< Bit mask of PWRUPVOUTCMP
                                                                            field.*/
  #define VREGAO0V8_DFT_TCFG_PWRUPVOUTCMP_Min (0x0UL) /*!< Min enumerator value of PWRUPVOUTCMP field.                         */
  #define VREGAO0V8_DFT_TCFG_PWRUPVOUTCMP_Max (0x1UL) /*!< Max enumerator value of PWRUPVOUTCMP field.                         */
  #define VREGAO0V8_DFT_TCFG_PWRUPVOUTCMP_Disabled (0x0UL) /*!< (unspecified)                                                  */
  #define VREGAO0V8_DFT_TCFG_PWRUPVOUTCMP_Enabled (0x1UL) /*!< (unspecified)                                                   */

/* RESETDIG @Bit 7 : (unspecified) */
  #define VREGAO0V8_DFT_TCFG_RESETDIG_Pos (7UL)      /*!< Position of RESETDIG field.                                          */
  #define VREGAO0V8_DFT_TCFG_RESETDIG_Msk (0x1UL << VREGAO0V8_DFT_TCFG_RESETDIG_Pos) /*!< Bit mask of RESETDIG field.          */
  #define VREGAO0V8_DFT_TCFG_RESETDIG_Min (0x0UL)    /*!< Min enumerator value of RESETDIG field.                              */
  #define VREGAO0V8_DFT_TCFG_RESETDIG_Max (0x1UL)    /*!< Max enumerator value of RESETDIG field.                              */
  #define VREGAO0V8_DFT_TCFG_RESETDIG_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define VREGAO0V8_DFT_TCFG_RESETDIG_Enabled (0x1UL) /*!< (unspecified)                                                       */


/* VREGAO0V8_DFT_CALEN: Calibration enable */
  #define VREGAO0V8_DFT_CALEN_ResetValue (0x00000000UL) /*!< Reset value of CALEN register.                                    */

/* CALEN @Bit 0 : Calibration enable */
  #define VREGAO0V8_DFT_CALEN_CALEN_Pos (0UL)        /*!< Position of CALEN field.                                             */
  #define VREGAO0V8_DFT_CALEN_CALEN_Msk (0x1UL << VREGAO0V8_DFT_CALEN_CALEN_Pos) /*!< Bit mask of CALEN field.                 */
  #define VREGAO0V8_DFT_CALEN_CALEN_Min (0x0UL)      /*!< Min enumerator value of CALEN field.                                 */
  #define VREGAO0V8_DFT_CALEN_CALEN_Max (0x1UL)      /*!< Max enumerator value of CALEN field.                                 */
  #define VREGAO0V8_DFT_CALEN_CALEN_ATCMPOff (0x0UL) /*!< ATCMP Off                                                            */
  #define VREGAO0V8_DFT_CALEN_CALEN_ATCMPOn (0x1UL)  /*!< ATCMP On                                                             */


/* VREGAO0V8_DFT_CALCMP: Calibration compare */
  #define VREGAO0V8_DFT_CALCMP_ResetValue (0x00000000UL) /*!< Reset value of CALCMP register.                                  */

/* CALCMP @Bit 0 : Calibration compare */
  #define VREGAO0V8_DFT_CALCMP_CALCMP_Pos (0UL)      /*!< Position of CALCMP field.                                            */
  #define VREGAO0V8_DFT_CALCMP_CALCMP_Msk (0x1UL << VREGAO0V8_DFT_CALCMP_CALCMP_Pos) /*!< Bit mask of CALCMP field.            */


/* ==================================================== Struct VREGAO0V8 ===================================================== */
/**
  * @brief VREGAO0V8 peripheral
  */
  typedef struct {                                   /*!< VREGAO0V8 Structure                                                  */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IOM uint32_t EVENTS_BPREADY;                   /*!< (@ 0x00000108) Bypass ready flag                                     */
    __IOM uint32_t EVENTS_IOUTCMPHP;                 /*!< (@ 0x0000010C) HP mode analog current comparator                     */
    __IOM uint32_t EVENTS_IOUTCMPLP;                 /*!< (@ 0x00000110) LP mode analog current comparator                     */
    __IOM uint32_t EVENTS_LP2HP;                     /*!< (@ 0x00000114) Current consumption above threshold                   */
    __IOM uint32_t EVENTS_HP2LP;                     /*!< (@ 0x00000118) Current consumption below threshold                   */
    __IM uint32_t RESERVED1[121];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Voltage regulator status                              */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_VREGAO0V8_CONFIG_Type CONFIG;          /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_VREGAO0V8_TRIM_Type TRIM;              /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[11];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t VOUT;                             /*!< (@ 0x00000484) Output voltage programming                            */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000488) Voltage regulator mode                                */
    __IOM uint32_t ITHRESHOLD;                       /*!< (@ 0x0000048C) Current threshold for mode transistion                */
    __IM uint32_t RESERVED6[28];
    __IOM NRF_VREGAO0V8_OVERRIDE_Type OVERRIDE;      /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[54];
    __IOM NRF_VREGAO0V8_DFT_Type DFT;                /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VREGAO0V8_Type;                              /*!< Size = 1596 (0x63C)                                                  */

/* VREGAO0V8_EVENTS_READY: Power up done */
  #define VREGAO0V8_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                          */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VREGAO0V8_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                   */
  #define VREGAO0V8_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VREGAO0V8_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of
                                                                            EVENTS_READY field.*/
  #define VREGAO0V8_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                     */
  #define VREGAO0V8_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                     */
  #define VREGAO0V8_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define VREGAO0V8_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                           */


/* VREGAO0V8_EVENTS_SETTLED: Settled flag for MODE handshake */
  #define VREGAO0V8_EVENTS_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED register.                      */

