adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGAO0V8_INTEN: Enable or disable interrupt */
  #define VREGAO0V8_INTEN_ResetValue (0x00000000UL)  /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VREGAO0V8_INTEN_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define VREGAO0V8_INTEN_READY_Msk (0x1UL << VREGAO0V8_INTEN_READY_Pos) /*!< Bit mask of READY field.                         */
  #define VREGAO0V8_INTEN_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define VREGAO0V8_INTEN_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define VREGAO0V8_INTEN_READY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VREGAO0V8_INTEN_READY_Enabled (0x1UL)      /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VREGAO0V8_INTEN_SETTLED_Pos (1UL)          /*!< Position of SETTLED field.                                           */
  #define VREGAO0V8_INTEN_SETTLED_Msk (0x1UL << VREGAO0V8_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                   */
  #define VREGAO0V8_INTEN_SETTLED_Min (0x0UL)        /*!< Min enumerator value of SETTLED field.                               */
  #define VREGAO0V8_INTEN_SETTLED_Max (0x1UL)        /*!< Max enumerator value of SETTLED field.                               */
  #define VREGAO0V8_INTEN_SETTLED_Disabled (0x0UL)   /*!< Disable                                                              */
  #define VREGAO0V8_INTEN_SETTLED_Enabled (0x1UL)    /*!< Enable                                                               */

/* BPREADY @Bit 2 : Enable or disable interrupt for event BPREADY */
  #define VREGAO0V8_INTEN_BPREADY_Pos (2UL)          /*!< Position of BPREADY field.                                           */
  #define VREGAO0V8_INTEN_BPREADY_Msk (0x1UL << VREGAO0V8_INTEN_BPREADY_Pos) /*!< Bit mask of BPREADY field.                   */
  #define VREGAO0V8_INTEN_BPREADY_Min (0x0UL)        /*!< Min enumerator value of BPREADY field.                               */
  #define VREGAO0V8_INTEN_BPREADY_Max (0x1UL)        /*!< Max enumerator value of BPREADY field.                               */
  #define VREGAO0V8_INTEN_BPREADY_Disabled (0x0UL)   /*!< Disable                                                              */
  #define VREGAO0V8_INTEN_BPREADY_Enabled (0x1UL)    /*!< Enable                                                               */

/* IOUTCMPHP @Bit 3 : Enable or disable interrupt for event IOUTCMPHP */
  #define VREGAO0V8_INTEN_IOUTCMPHP_Pos (3UL)        /*!< Position of IOUTCMPHP field.                                         */
  #define VREGAO0V8_INTEN_IOUTCMPHP_Msk (0x1UL << VREGAO0V8_INTEN_IOUTCMPHP_Pos) /*!< Bit mask of IOUTCMPHP field.             */
  #define VREGAO0V8_INTEN_IOUTCMPHP_Min (0x0UL)      /*!< Min enumerator value of IOUTCMPHP field.                             */
  #define VREGAO0V8_INTEN_IOUTCMPHP_Max (0x1UL)      /*!< Max enumerator value of IOUTCMPHP field.                             */
  #define VREGAO0V8_INTEN_IOUTCMPHP_Disabled (0x0UL) /*!< Disable                                                              */
  #define VREGAO0V8_INTEN_IOUTCMPHP_Enabled (0x1UL)  /*!< Enable                                                               */

/* IOUTCMPLP @Bit 4 : Enable or disable interrupt for event IOUTCMPLP */
  #define VREGAO0V8_INTEN_IOUTCMPLP_Pos (4UL)        /*!< Position of IOUTCMPLP field.                                         */
  #define VREGAO0V8_INTEN_IOUTCMPLP_Msk (0x1UL << VREGAO0V8_INTEN_IOUTCMPLP_Pos) /*!< Bit mask of IOUTCMPLP field.             */
  #define VREGAO0V8_INTEN_IOUTCMPLP_Min (0x0UL)      /*!< Min enumerator value of IOUTCMPLP field.                             */
  #define VREGAO0V8_INTEN_IOUTCMPLP_Max (0x1UL)      /*!< Max enumerator value of IOUTCMPLP field.                             */
  #define VREGAO0V8_INTEN_IOUTCMPLP_Disabled (0x0UL) /*!< Disable                                                              */
  #define VREGAO0V8_INTEN_IOUTCMPLP_Enabled (0x1UL)  /*!< Enable                                                               */

/* LP2HP @Bit 5 : Enable or disable interrupt for event LP2HP */
  #define VREGAO0V8_INTEN_LP2HP_Pos (5UL)            /*!< Position of LP2HP field.                                             */
  #define VREGAO0V8_INTEN_LP2HP_Msk (0x1UL << VREGAO0V8_INTEN_LP2HP_Pos) /*!< Bit mask of LP2HP field.                         */
  #define VREGAO0V8_INTEN_LP2HP_Min (0x0UL)          /*!< Min enumerator value of LP2HP field.                                 */
  #define VREGAO0V8_INTEN_LP2HP_Max (0x1UL)          /*!< Max enumerator value of LP2HP field.                                 */
  #define VREGAO0V8_INTEN_LP2HP_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VREGAO0V8_INTEN_LP2HP_Enabled (0x1UL)      /*!< Enable                                                               */

/* HP2LP @Bit 6 : Enable or disable interrupt for event HP2LP */
  #define VREGAO0V8_INTEN_HP2LP_Pos (6UL)            /*!< Position of HP2LP field.                                             */
  #define VREGAO0V8_INTEN_HP2LP_Msk (0x1UL << VREGAO0V8_INTEN_HP2LP_Pos) /*!< Bit mask of HP2LP field.                         */
  #define VREGAO0V8_INTEN_HP2LP_Min (0x0UL)          /*!< Min enumerator value of HP2LP field.                                 */
  #define VREGAO0V8_INTEN_HP2LP_Max (0x1UL)          /*!< Max enumerator value of HP2LP field.                                 */
  #define VREGAO0V8_INTEN_HP2LP_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VREGAO0V8_INTEN_HP2LP_Enabled (0x1UL)      /*!< Enable                                                               */


/* VREGAO0V8_INTENSET: Enable interrupt */
  #define VREGAO0V8_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                  */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VREGAO0V8_INTENSET_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VREGAO0V8_INTENSET_READY_Msk (0x1UL << VREGAO0V8_INTENSET_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VREGAO0V8_INTENSET_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VREGAO0V8_INTENSET_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VREGAO0V8_INTENSET_READY_Set (0x1UL)       /*!< Enable                                                               */
  #define VREGAO0V8_INTENSET_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VREGAO0V8_INTENSET_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

