adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define VREGAO0V8_INTENCLR_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VREGAO0V8_INTENCLR_SETTLED_Msk (0x1UL << VREGAO0V8_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VREGAO0V8_INTENCLR_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VREGAO0V8_INTENCLR_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VREGAO0V8_INTENCLR_SETTLED_Clear (0x1UL)   /*!< Disable                                                              */
  #define VREGAO0V8_INTENCLR_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VREGAO0V8_INTENCLR_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* BPREADY @Bit 2 : Write '1' to disable interrupt for event BPREADY */
  #define VREGAO0V8_INTENCLR_BPREADY_Pos (2UL)       /*!< Position of BPREADY field.                                           */
  #define VREGAO0V8_INTENCLR_BPREADY_Msk (0x1UL << VREGAO0V8_INTENCLR_BPREADY_Pos) /*!< Bit mask of BPREADY field.             */
  #define VREGAO0V8_INTENCLR_BPREADY_Min (0x0UL)     /*!< Min enumerator value of BPREADY field.                               */
  #define VREGAO0V8_INTENCLR_BPREADY_Max (0x1UL)     /*!< Max enumerator value of BPREADY field.                               */
  #define VREGAO0V8_INTENCLR_BPREADY_Clear (0x1UL)   /*!< Disable                                                              */
  #define VREGAO0V8_INTENCLR_BPREADY_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VREGAO0V8_INTENCLR_BPREADY_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* IOUTCMPHP @Bit 3 : Write '1' to disable interrupt for event IOUTCMPHP */
  #define VREGAO0V8_INTENCLR_IOUTCMPHP_Pos (3UL)     /*!< Position of IOUTCMPHP field.                                         */
  #define VREGAO0V8_INTENCLR_IOUTCMPHP_Msk (0x1UL << VREGAO0V8_INTENCLR_IOUTCMPHP_Pos) /*!< Bit mask of IOUTCMPHP field.       */
  #define VREGAO0V8_INTENCLR_IOUTCMPHP_Min (0x0UL)   /*!< Min enumerator value of IOUTCMPHP field.                             */
  #define VREGAO0V8_INTENCLR_IOUTCMPHP_Max (0x1UL)   /*!< Max enumerator value of IOUTCMPHP field.                             */
  #define VREGAO0V8_INTENCLR_IOUTCMPHP_Clear (0x1UL) /*!< Disable                                                              */
  #define VREGAO0V8_INTENCLR_IOUTCMPHP_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGAO0V8_INTENCLR_IOUTCMPHP_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* IOUTCMPLP @Bit 4 : Write '1' to disable interrupt for event IOUTCMPLP */
  #define VREGAO0V8_INTENCLR_IOUTCMPLP_Pos (4UL)     /*!< Position of IOUTCMPLP field.                                         */
  #define VREGAO0V8_INTENCLR_IOUTCMPLP_Msk (0x1UL << VREGAO0V8_INTENCLR_IOUTCMPLP_Pos) /*!< Bit mask of IOUTCMPLP field.       */
  #define VREGAO0V8_INTENCLR_IOUTCMPLP_Min (0x0UL)   /*!< Min enumerator value of IOUTCMPLP field.                             */
  #define VREGAO0V8_INTENCLR_IOUTCMPLP_Max (0x1UL)   /*!< Max enumerator value of IOUTCMPLP field.                             */
  #define VREGAO0V8_INTENCLR_IOUTCMPLP_Clear (0x1UL) /*!< Disable                                                              */
  #define VREGAO0V8_INTENCLR_IOUTCMPLP_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGAO0V8_INTENCLR_IOUTCMPLP_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* LP2HP @Bit 5 : Write '1' to disable interrupt for event LP2HP */
  #define VREGAO0V8_INTENCLR_LP2HP_Pos (5UL)         /*!< Position of LP2HP field.                                             */
  #define VREGAO0V8_INTENCLR_LP2HP_Msk (0x1UL << VREGAO0V8_INTENCLR_LP2HP_Pos) /*!< Bit mask of LP2HP field.                   */
  #define VREGAO0V8_INTENCLR_LP2HP_Min (0x0UL)       /*!< Min enumerator value of LP2HP field.                                 */
  #define VREGAO0V8_INTENCLR_LP2HP_Max (0x1UL)       /*!< Max enumerator value of LP2HP field.                                 */
  #define VREGAO0V8_INTENCLR_LP2HP_Clear (0x1UL)     /*!< Disable                                                              */
  #define VREGAO0V8_INTENCLR_LP2HP_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VREGAO0V8_INTENCLR_LP2HP_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* HP2LP @Bit 6 : Write '1' to disable interrupt for event HP2LP */
  #define VREGAO0V8_INTENCLR_HP2LP_Pos (6UL)         /*!< Position of HP2LP field.                                             */
  #define VREGAO0V8_INTENCLR_HP2LP_Msk (0x1UL << VREGAO0V8_INTENCLR_HP2LP_Pos) /*!< Bit mask of HP2LP field.                   */
  #define VREGAO0V8_INTENCLR_HP2LP_Min (0x0UL)       /*!< Min enumerator value of HP2LP field.                                 */
  #define VREGAO0V8_INTENCLR_HP2LP_Max (0x1UL)       /*!< Max enumerator value of HP2LP field.                                 */
  #define VREGAO0V8_INTENCLR_HP2LP_Clear (0x1UL)     /*!< Disable                                                              */
  #define VREGAO0V8_INTENCLR_HP2LP_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VREGAO0V8_INTENCLR_HP2LP_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* VREGAO0V8_INTPEND: Pending interrupts */
  #define VREGAO0V8_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                    */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VREGAO0V8_INTPEND_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VREGAO0V8_INTPEND_READY_Msk (0x1UL << VREGAO0V8_INTPEND_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VREGAO0V8_INTPEND_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VREGAO0V8_INTPEND_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VREGAO0V8_INTPEND_READY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VREGAO0V8_INTPEND_READY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define VREGAO0V8_INTPEND_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VREGAO0V8_INTPEND_SETTLED_Msk (0x1UL << VREGAO0V8_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */
  #define VREGAO0V8_INTPEND_SETTLED_Min (0x0UL)      /*!< Min enumerator value of SETTLED field.                               */
  #define VREGAO0V8_INTPEND_SETTLED_Max (0x1UL)      /*!< Max enumerator value of SETTLED field.                               */
  #define VREGAO0V8_INTPEND_SETTLED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VREGAO0V8_INTPEND_SETTLED_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* BPREADY @Bit 2 : Read pending status of interrupt for event BPREADY */
  #define VREGAO0V8_INTPEND_BPREADY_Pos (2UL)        /*!< Position of BPREADY field.                                           */
  #define VREGAO0V8_INTPEND_BPREADY_Msk (0x1UL << VREGAO0V8_INTPEND_BPREADY_Pos) /*!< Bit mask of BPREADY field.               */
  #define VREGAO0V8_INTPEND_BPREADY_Min (0x0UL)      /*!< Min enumerator value of BPREADY field.                               */
  #define VREGAO0V8_INTPEND_BPREADY_Max (0x1UL)      /*!< Max enumerator value of BPREADY field.                               */
  #define VREGAO0V8_INTPEND_BPREADY_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VREGAO0V8_INTPEND_BPREADY_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* IOUTCMPHP @Bit 3 : Read pending status of interrupt for event IOUTCMPHP */
  #define VREGAO0V8_INTPEND_IOUTCMPHP_Pos (3UL)      /*!< Position of IOUTCMPHP field.                                         */
  #define VREGAO0V8_INTPEND_IOUTCMPHP_Msk (0x1UL << VREGAO0V8_INTPEND_IOUTCMPHP_Pos) /*!< Bit mask of IOUTCMPHP field.         */
  #define VREGAO0V8_INTPEND_IOUTCMPHP_Min (0x0UL)    /*!< Min enumerator value of IOUTCMPHP field.                             */
  #define VREGAO0V8_INTPEND_IOUTCMPHP_Max (0x1UL)    /*!< Max enumerator value of IOUTCMPHP field.                             */
  #define VREGAO0V8_INTPEND_IOUTCMPHP_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define VREGAO0V8_INTPEND_IOUTCMPHP_Pending (0x1UL) /*!< Read: Pending                                                       */

/* IOUTCMPLP @Bit 4 : Read pending status of interrupt for event IOUTCMPLP */
  #define VREGAO0V8_INTPEND_IOUTCMPLP_Pos (4UL)      /*!< Position of IOUTCMPLP field.                                         */
  #define VREGAO0V8_INTPEND_IOUTCMPLP_Msk (0x1UL << VREGAO0V8_INTPEND_IOUTCMPLP_Pos) /*!< Bit mask of IOUTCMPLP field.         */
  #define VREGAO0V8_INTPEND_IOUTCMPLP_Min (0x0UL)    /*!< Min enumerator value of IOUTCMPLP field.                             */
  #define VREGAO0V8_INTPEND_IOUTCMPLP_Max (0x1UL)    /*!< Max enumerator value of IOUTCMPLP field.                             */
  #define VREGAO0V8_INTPEND_IOUTCMPLP_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define VREGAO0V8_INTPEND_IOUTCMPLP_Pending (0x1UL) /*!< Read: Pending                                                       */

/* LP2HP @Bit 5 : Read pending status of interrupt for event LP2HP */
  #define VREGAO0V8_INTPEND_LP2HP_Pos (5UL)          /*!< Position of LP2HP field.                                             */
  #define VREGAO0V8_INTPEND_LP2HP_Msk (0x1UL << VREGAO0V8_INTPEND_LP2HP_Pos) /*!< Bit mask of LP2HP field.                     */
  #define VREGAO0V8_INTPEND_LP2HP_Min (0x0UL)        /*!< Min enumerator value of LP2HP field.                                 */
  #define VREGAO0V8_INTPEND_LP2HP_Max (0x1UL)        /*!< Max enumerator value of LP2HP field.                                 */
  #define VREGAO0V8_INTPEND_LP2HP_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VREGAO0V8_INTPEND_LP2HP_Pending (0x1UL)    /*!< Read: Pending                                                        */

