adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGAO0V8_ITHRESHOLD: Current threshold for mode transistion */
  #define VREGAO0V8_ITHRESHOLD_ResetValue (0x0000000AUL) /*!< Reset value of ITHRESHOLD register.                              */

/* VAL @Bits 0..3 : Current consumption */
  #define VREGAO0V8_ITHRESHOLD_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGAO0V8_ITHRESHOLD_VAL_Msk (0xFUL << VREGAO0V8_ITHRESHOLD_VAL_Pos) /*!< Bit mask of VAL field.                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VREGAO1V8                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VREGAO1V8_CONFIG ================================================= */
/**
  * @brief CONFIG [VREGAO1V8_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) VREGAO1V8 static CFG configuration                    */
  __IOM uint32_t  CFGDYNAMIC;                        /*!< (@ 0x00000004) VREGAO1V8 dynamic CFG configuration                   */
} NRF_VREGAO1V8_CONFIG_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VREGAO1V8_CONFIG_CFGSTATIC: VREGAO1V8 static CFG configuration */
  #define VREGAO1V8_CONFIG_CFGSTATIC_ResetValue (0x00000008UL) /*!< Reset value of CFGSTATIC register.                         */

/* EOCBYICMP @Bit 0 : Configuration for EOC by ICMP */
  #define VREGAO1V8_CONFIG_CFGSTATIC_EOCBYICMP_Pos (0UL) /*!< Position of EOCBYICMP field.                                     */
  #define VREGAO1V8_CONFIG_CFGSTATIC_EOCBYICMP_Msk (0x1UL << VREGAO1V8_CONFIG_CFGSTATIC_EOCBYICMP_Pos) /*!< Bit mask of
                                                                            EOCBYICMP field.*/
  #define VREGAO1V8_CONFIG_CFGSTATIC_EOCBYICMP_Min (0x0UL) /*!< Min enumerator value of EOCBYICMP field.                       */
  #define VREGAO1V8_CONFIG_CFGSTATIC_EOCBYICMP_Max (0x1UL) /*!< Max enumerator value of EOCBYICMP field.                       */
  #define VREGAO1V8_CONFIG_CFGSTATIC_EOCBYICMP_Disabled (0x0UL) /*!< Configuration disabled                                    */
  #define VREGAO1V8_CONFIG_CFGSTATIC_EOCBYICMP_Enabled (0x1UL) /*!< Configuration enabled                                      */

/* LPEOCBYVOUTCMP @Bit 1 : Configuration for LP EOC BY VOUTCMP */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LPEOCBYVOUTCMP_Pos (1UL) /*!< Position of LPEOCBYVOUTCMP field.                           */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LPEOCBYVOUTCMP_Msk (0x1UL << VREGAO1V8_CONFIG_CFGSTATIC_LPEOCBYVOUTCMP_Pos) /*!< Bit mask
                                                                            of LPEOCBYVOUTCMP field.*/
  #define VREGAO1V8_CONFIG_CFGSTATIC_LPEOCBYVOUTCMP_Min (0x0UL) /*!< Min enumerator value of LPEOCBYVOUTCMP field.             */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LPEOCBYVOUTCMP_Max (0x1UL) /*!< Max enumerator value of LPEOCBYVOUTCMP field.             */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LPEOCBYVOUTCMP_Disabled (0x0UL) /*!< Configuration disabled                               */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LPEOCBYVOUTCMP_Enabled (0x1UL) /*!< Configuration enabled                                 */

/* SCMPLPMODE @Bit 2 : Configuration for SCMP in LP mode */
  #define VREGAO1V8_CONFIG_CFGSTATIC_SCMPLPMODE_Pos (2UL) /*!< Position of SCMPLPMODE field.                                   */
  #define VREGAO1V8_CONFIG_CFGSTATIC_SCMPLPMODE_Msk (0x1UL << VREGAO1V8_CONFIG_CFGSTATIC_SCMPLPMODE_Pos) /*!< Bit mask of
                                                                            SCMPLPMODE field.*/
  #define VREGAO1V8_CONFIG_CFGSTATIC_SCMPLPMODE_Min (0x0UL) /*!< Min enumerator value of SCMPLPMODE field.                     */
  #define VREGAO1V8_CONFIG_CFGSTATIC_SCMPLPMODE_Max (0x1UL) /*!< Max enumerator value of SCMPLPMODE field.                     */
  #define VREGAO1V8_CONFIG_CFGSTATIC_SCMPLPMODE_Disabled (0x0UL) /*!< Configuration disabled                                   */
  #define VREGAO1V8_CONFIG_CFGSTATIC_SCMPLPMODE_Enabled (0x1UL) /*!< Configuration enabled                                     */

/* REFRESHOVERDRIVE @Bit 3 : Configuration for 10mV refresh overdrive */
  #define VREGAO1V8_CONFIG_CFGSTATIC_REFRESHOVERDRIVE_Pos (3UL) /*!< Position of REFRESHOVERDRIVE field.                       */
  #define VREGAO1V8_CONFIG_CFGSTATIC_REFRESHOVERDRIVE_Msk (0x1UL << VREGAO1V8_CONFIG_CFGSTATIC_REFRESHOVERDRIVE_Pos) /*!< Bit
                                                                            mask of REFRESHOVERDRIVE field.*/
  #define VREGAO1V8_CONFIG_CFGSTATIC_REFRESHOVERDRIVE_Min (0x0UL) /*!< Min enumerator value of REFRESHOVERDRIVE field.         */
  #define VREGAO1V8_CONFIG_CFGSTATIC_REFRESHOVERDRIVE_Max (0x1UL) /*!< Max enumerator value of REFRESHOVERDRIVE field.         */
  #define VREGAO1V8_CONFIG_CFGSTATIC_REFRESHOVERDRIVE_Disabled (0x0UL) /*!< Configuration disabled                             */
  #define VREGAO1V8_CONFIG_CFGSTATIC_REFRESHOVERDRIVE_Enabled (0x1UL) /*!< Configuration enabled                               */

/* LONGREFRESHTIMER @Bit 4 : Configuration for Long refresh timer */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LONGREFRESHTIMER_Pos (4UL) /*!< Position of LONGREFRESHTIMER field.                       */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LONGREFRESHTIMER_Msk (0x1UL << VREGAO1V8_CONFIG_CFGSTATIC_LONGREFRESHTIMER_Pos) /*!< Bit
                                                                            mask of LONGREFRESHTIMER field.*/
  #define VREGAO1V8_CONFIG_CFGSTATIC_LONGREFRESHTIMER_Min (0x0UL) /*!< Min enumerator value of LONGREFRESHTIMER field.         */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LONGREFRESHTIMER_Max (0x1UL) /*!< Max enumerator value of LONGREFRESHTIMER field.         */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LONGREFRESHTIMER_Disabled (0x0UL) /*!< Configuration disabled                             */
  #define VREGAO1V8_CONFIG_CFGSTATIC_LONGREFRESHTIMER_Enabled (0x1UL) /*!< Configuration enabled                               */


/* VREGAO1V8_CONFIG_CFGDYNAMIC: VREGAO1V8 dynamic CFG configuration */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_ResetValue (0x00000010UL) /*!< Reset value of CFGDYNAMIC register.                       */

/* DOUBLEBIAS @Bits 0..1 : Double bias current configuration for the voltage regulator */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DOUBLEBIAS_Pos (0UL) /*!< Position of DOUBLEBIAS field.                                  */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DOUBLEBIAS_Msk (0x3UL << VREGAO1V8_CONFIG_CFGDYNAMIC_DOUBLEBIAS_Pos) /*!< Bit mask of
                                                                            DOUBLEBIAS field.*/
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DOUBLEBIAS_Min (0x0UL) /*!< Min enumerator value of DOUBLEBIAS field.                    */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DOUBLEBIAS_Max (0x2UL) /*!< Max enumerator value of DOUBLEBIAS field.                    */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DOUBLEBIAS_Auto (0x0UL) /*!< Automatically handled by the peripheral                     */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DOUBLEBIAS_Disabled (0x1UL) /*!< Configuration disabled                                  */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DOUBLEBIAS_Enabled (0x2UL) /*!< Configuration enabled                                    */

/* ILIMLOW @Bit 4 : Current limit low configuration for the voltage regulator */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_ILIMLOW_Pos (4UL) /*!< Position of ILIMLOW field.                                        */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_ILIMLOW_Msk (0x1UL << VREGAO1V8_CONFIG_CFGDYNAMIC_ILIMLOW_Pos) /*!< Bit mask of ILIMLOW
                                                                            field.*/
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_ILIMLOW_Min (0x0UL) /*!< Min enumerator value of ILIMLOW field.                          */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_ILIMLOW_Max (0x1UL) /*!< Max enumerator value of ILIMLOW field.                          */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_ILIMLOW_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_ILIMLOW_Enabled (0x1UL) /*!< Configuration enabled                                       */

/* DCMP @Bits 8..9 : Configuration for DCMP (differential comparator) and LPD mode */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DCMP_Pos (8UL) /*!< Position of DCMP field.                                              */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DCMP_Msk (0x3UL << VREGAO1V8_CONFIG_CFGDYNAMIC_DCMP_Pos) /*!< Bit mask of DCMP field.    */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DCMP_Min (0x0UL) /*!< Min enumerator value of DCMP field.                                */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DCMP_Max (0x2UL) /*!< Max enumerator value of DCMP field.                                */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DCMP_Auto (0x0UL) /*!< Automatically handled by the peripheral                           */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DCMP_Disabled (0x1UL) /*!< Configuration disabled                                        */
  #define VREGAO1V8_CONFIG_CFGDYNAMIC_DCMP_Enabled (0x2UL) /*!< Configuration enabled                                          */



/* ================================================== Struct VREGAO1V8_TRIM ================================================== */
/**
  * @brief TRIM [VREGAO1V8_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  IREF;                              /*!< (@ 0x00000000) Local current reference trimming                      */
  __IOM uint32_t  VREF;                              /*!< (@ 0x00000004) Reference voltage trim                                */
  __IOM uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Low power mode output comparator trimming             */
  __IOM uint32_t  LOWPOWERDIFF;                      /*!< (@ 0x0000000C) Low power differential mode output comparator trimming*/
} NRF_VREGAO1V8_TRIM_Type;                           /*!< Size = 16 (0x010)                                                    */

/* VREGAO1V8_TRIM_IREF: Local current reference trimming */
  #define VREGAO1V8_TRIM_IREF_ResetValue (0x00000008UL) /*!< Reset value of IREF register.                                     */

/* VAL @Bits 0..6 : Current reference trimming value */
  #define VREGAO1V8_TRIM_IREF_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREGAO1V8_TRIM_IREF_VAL_Msk (0x7FUL << VREGAO1V8_TRIM_IREF_VAL_Pos) /*!< Bit mask of VAL field.                      */


/* VREGAO1V8_TRIM_VREF: Reference voltage trim */
  #define VREGAO1V8_TRIM_VREF_ResetValue (0x00000002UL) /*!< Reset value of VREF register.                                     */

/* VAL @Bits 0..3 : Voltage trimming value */
  #define VREGAO1V8_TRIM_VREF_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREGAO1V8_TRIM_VREF_VAL_Msk (0xFUL << VREGAO1V8_TRIM_VREF_VAL_Pos) /*!< Bit mask of VAL field.                       */


/* VREGAO1V8_TRIM_LOWPOWER: Low power mode output comparator trimming */
  #define VREGAO1V8_TRIM_LOWPOWER_ResetValue (0x00000000UL) /*!< Reset value of LOWPOWER register.                             */

/* VAL @Bits 0..3 : Voltage trimming value. */
  #define VREGAO1V8_TRIM_LOWPOWER_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGAO1V8_TRIM_LOWPOWER_VAL_Msk (0xFUL << VREGAO1V8_TRIM_LOWPOWER_VAL_Pos) /*!< Bit mask of VAL field.               */


/* VREGAO1V8_TRIM_LOWPOWERDIFF: Low power differential mode output comparator trimming */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_ResetValue (0x00000000UL) /*!< Reset value of LOWPOWERDIFF register.                     */

/* VAL @Bits 0..1 : Voltage trimming value. */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_Msk (0x3UL << VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_Pos) /*!< Bit mask of VAL field.       */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_Min (0x0UL) /*!< Min enumerator value of VAL field.                                  */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_Max (0x3UL) /*!< Max enumerator value of VAL field.                                  */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_21mV (0x1UL) /*!< (unspecified)                                                      */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_27mV (0x0UL) /*!< (unspecified)                                                      */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_33mV (0x3UL) /*!< (unspecified)                                                      */
  #define VREGAO1V8_TRIM_LOWPOWERDIFF_VAL_39mV (0x2UL) /*!< (unspecified)                                                      */



/* ================================================ Struct VREGAO1V8_OVERRIDE ================================================ */
/**
  * @brief OVERRIDE [VREGAO1V8_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x00000008) Override the MODE LP signal to the analog module      */
  __IOM uint32_t  MODEULP;                           /*!< (@ 0x0000000C) Override the MODE ULP signal to the analog module     */
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000010) Override the dynamic config signals to the analog
                                                                         module*/
  __IOM uint32_t  VOLTHP;                            /*!< (@ 0x00000014) Override the VOLT HP signal to the analog module      */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000018) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x0000001C) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  IOUTCMP;                           /*!< (@ 0x00000020) Override the ICMP signal from the analog module       */
} NRF_VREGAO1V8_OVERRIDE_Type;                       /*!< Size = 36 (0x024)                                                    */

/* VREGAO1V8_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VREGAO1V8_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO1V8_OVERRIDE_PWRUP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGAO1V8_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VREGAO1V8_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_PWRUP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_PWRUP_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO1V8_OVERRIDE_PWRUP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_PWRUP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGAO1V8_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGAO1V8_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VREGAO1V8_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO1V8_OVERRIDE_RETAIN_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGAO1V8_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VREGAO1V8_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_RETAIN_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_RETAIN_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGAO1V8_OVERRIDE_RETAIN_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_RETAIN_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGAO1V8_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGAO1V8_OVERRIDE_MODELP: Override the MODE LP signal to the analog module */
  #define VREGAO1V8_OVERRIDE_MODELP_ResetValue (0x00000000UL) /*!< Reset value of MODELP register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO1V8_OVERRIDE_MODELP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGAO1V8_OVERRIDE_MODELP_VAL_Msk (0x1UL << VREGAO1V8_OVERRIDE_MODELP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_MODELP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_MODELP_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_MODELP_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGAO1V8_OVERRIDE_MODELP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_MODELP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_MODELP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGAO1V8_OVERRIDE_MODELP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


