adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define VREGAO1V8_DFT_ATB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO1V8_DFT_ATB1CONFIG_EN_Msk (0x1UL << VREGAO1V8_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO1V8_DFT_ATB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_ATB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VREGAO1V8_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VREGAO1V8_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VREGAO1V8_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB0 */
  #define VREGAO1V8_DFT_DTB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO1V8_DFT_DTB0CONFIG_SELMUX_Msk (0x3UL << VREGAO1V8_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO1V8_DFT_DTB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_DTB0CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_DTB0CONFIG_SELMUX_PwrupIbpp (0x0UL) /*!< PWRUP_IBPP                                                    */
  #define VREGAO1V8_DFT_DTB0CONFIG_SELMUX_PwrupIbpsr (0x1UL) /*!< PWRUP_IBPSR                                                  */
  #define VREGAO1V8_DFT_DTB0CONFIG_SELMUX_ModeLp (0x2UL) /*!< MODE_LP                                                          */
  #define VREGAO1V8_DFT_DTB0CONFIG_SELMUX_VoutCmp (0x3UL) /*!< VOUTCMP                                                         */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGAO1V8_DFT_DTB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO1V8_DFT_DTB0CONFIG_EN_Msk (0x1UL << VREGAO1V8_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO1V8_DFT_DTB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_DTB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VREGAO1V8_DFT_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VREGAO1V8_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VREGAO1V8_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB1 */
  #define VREGAO1V8_DFT_DTB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO1V8_DFT_DTB1CONFIG_SELMUX_Msk (0x3UL << VREGAO1V8_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO1V8_DFT_DTB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_DTB1CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_DTB1CONFIG_SELMUX_SettledIbpp (0x0UL) /*!< SETTLED_IBPP                                                */
  #define VREGAO1V8_DFT_DTB1CONFIG_SELMUX_ReadyIbpsr (0x1UL) /*!< READY_IBPSR                                                  */
  #define VREGAO1V8_DFT_DTB1CONFIG_SELMUX_ModeUlp (0x2UL) /*!< MODE_ULP                                                        */
  #define VREGAO1V8_DFT_DTB1CONFIG_SELMUX_VoutCmpd (0x3UL) /*!< VOUTCMPD                                                       */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGAO1V8_DFT_DTB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO1V8_DFT_DTB1CONFIG_EN_Msk (0x1UL << VREGAO1V8_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO1V8_DFT_DTB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_DTB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VREGAO1V8_DFT_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VREGAO1V8_DFT_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define VREGAO1V8_DFT_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB2 */
  #define VREGAO1V8_DFT_DTB2CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO1V8_DFT_DTB2CONFIG_SELMUX_Msk (0x3UL << VREGAO1V8_DFT_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO1V8_DFT_DTB2CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_DTB2CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_DTB2CONFIG_SELMUX_PwrupVregLdo (0x0UL) /*!< PWRUP_VREG_LDO                                             */
  #define VREGAO1V8_DFT_DTB2CONFIG_SELMUX_SettledIbpsr (0x1UL) /*!< SETTLED_IBPSR                                              */
  #define VREGAO1V8_DFT_DTB2CONFIG_SELMUX_SettledLdo (0x2UL) /*!< SETTLED_LDO                                                  */
  #define VREGAO1V8_DFT_DTB2CONFIG_SELMUX_VoutCmps (0x3UL) /*!< VOUTCMPS                                                       */

