adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define VREGAO1V8_DFT_DTB2CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO1V8_DFT_DTB2CONFIG_EN_Msk (0x1UL << VREGAO1V8_DFT_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO1V8_DFT_DTB2CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_DTB2CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_DTB2CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VREGAO1V8_DFT_DTB2CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VREGAO1V8_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VREGAO1V8_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB3 */
  #define VREGAO1V8_DFT_DTB3CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO1V8_DFT_DTB3CONFIG_SELMUX_Msk (0x3UL << VREGAO1V8_DFT_DTB3CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO1V8_DFT_DTB3CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_DTB3CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_DTB3CONFIG_SELMUX_SetTimer (0x0UL) /*!< SET_TIMER                                                      */
  #define VREGAO1V8_DFT_DTB3CONFIG_SELMUX_SettledMbias (0x1UL) /*!< SETTLED_MBIAS                                              */
  #define VREGAO1V8_DFT_DTB3CONFIG_SELMUX_ReadyLdo (0x2UL) /*!< READY_LDO                                                      */
  #define VREGAO1V8_DFT_DTB3CONFIG_SELMUX_Icmp5ma (0x3UL) /*!< ICMP_5MA                                                        */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VREGAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                */
  #define VREGAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VREGAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/
  #define VREGAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                   */
  #define VREGAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                   */
  #define VREGAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                     */
  #define VREGAO1V8_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                       */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGAO1V8_DFT_DTB3CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO1V8_DFT_DTB3CONFIG_EN_Msk (0x1UL << VREGAO1V8_DFT_DTB3CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO1V8_DFT_DTB3CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_DTB3CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_DTB3CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VREGAO1V8_DFT_DTB3CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VREGAO1V8_DFT_TCFG: Test mode configuration */
  #define VREGAO1V8_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                      */

/* PWRUPIBPP @Bit 0 : (unspecified) */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPP_Pos (0UL)     /*!< Position of PWRUPIBPP field.                                         */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPP_Msk (0x1UL << VREGAO1V8_DFT_TCFG_PWRUPIBPP_Pos) /*!< Bit mask of PWRUPIBPP field.       */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPP_Min (0x0UL)   /*!< Min enumerator value of PWRUPIBPP field.                             */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPP_Max (0x1UL)   /*!< Max enumerator value of PWRUPIBPP field.                             */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPP_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPP_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* PWRUPIBPSRDVT @Bit 1 : (unspecified) */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPSRDVT_Pos (1UL) /*!< Position of PWRUPIBPSRDVT field.                                     */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPSRDVT_Msk (0x1UL << VREGAO1V8_DFT_TCFG_PWRUPIBPSRDVT_Pos) /*!< Bit mask of PWRUPIBPSRDVT
                                                                            field.*/
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPSRDVT_Min (0x0UL) /*!< Min enumerator value of PWRUPIBPSRDVT field.                       */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPSRDVT_Max (0x1UL) /*!< Max enumerator value of PWRUPIBPSRDVT field.                       */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPSRDVT_Disabled (0x0UL) /*!< (unspecified)                                                 */
  #define VREGAO1V8_DFT_TCFG_PWRUPIBPSRDVT_Enabled (0x1UL) /*!< (unspecified)                                                  */

/* PWRUPVREGLDO @Bit 2 : (unspecified) */
  #define VREGAO1V8_DFT_TCFG_PWRUPVREGLDO_Pos (2UL)  /*!< Position of PWRUPVREGLDO field.                                      */
  #define VREGAO1V8_DFT_TCFG_PWRUPVREGLDO_Msk (0x1UL << VREGAO1V8_DFT_TCFG_PWRUPVREGLDO_Pos) /*!< Bit mask of PWRUPVREGLDO
                                                                            field.*/
  #define VREGAO1V8_DFT_TCFG_PWRUPVREGLDO_Min (0x0UL) /*!< Min enumerator value of PWRUPVREGLDO field.                         */
  #define VREGAO1V8_DFT_TCFG_PWRUPVREGLDO_Max (0x1UL) /*!< Max enumerator value of PWRUPVREGLDO field.                         */
  #define VREGAO1V8_DFT_TCFG_PWRUPVREGLDO_Disabled (0x0UL) /*!< (unspecified)                                                  */
  #define VREGAO1V8_DFT_TCFG_PWRUPVREGLDO_Enabled (0x1UL) /*!< (unspecified)                                                   */

/* PWRUPICMP @Bit 3 : (unspecified) */
  #define VREGAO1V8_DFT_TCFG_PWRUPICMP_Pos (3UL)     /*!< Position of PWRUPICMP field.                                         */
  #define VREGAO1V8_DFT_TCFG_PWRUPICMP_Msk (0x1UL << VREGAO1V8_DFT_TCFG_PWRUPICMP_Pos) /*!< Bit mask of PWRUPICMP field.       */
  #define VREGAO1V8_DFT_TCFG_PWRUPICMP_Min (0x0UL)   /*!< Min enumerator value of PWRUPICMP field.                             */
  #define VREGAO1V8_DFT_TCFG_PWRUPICMP_Max (0x1UL)   /*!< Max enumerator value of PWRUPICMP field.                             */
  #define VREGAO1V8_DFT_TCFG_PWRUPICMP_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGAO1V8_DFT_TCFG_PWRUPICMP_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* PWRUPVOUTCMP @Bit 4 : (unspecified) */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMP_Pos (4UL)  /*!< Position of PWRUPVOUTCMP field.                                      */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMP_Msk (0x1UL << VREGAO1V8_DFT_TCFG_PWRUPVOUTCMP_Pos) /*!< Bit mask of PWRUPVOUTCMP
                                                                            field.*/
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMP_Min (0x0UL) /*!< Min enumerator value of PWRUPVOUTCMP field.                         */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMP_Max (0x1UL) /*!< Max enumerator value of PWRUPVOUTCMP field.                         */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMP_Disabled (0x0UL) /*!< (unspecified)                                                  */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMP_Enabled (0x1UL) /*!< (unspecified)                                                   */

/* PWRUPVOUTCMPD @Bit 5 : (unspecified) */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPD_Pos (5UL) /*!< Position of PWRUPVOUTCMPD field.                                     */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPD_Msk (0x1UL << VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPD_Pos) /*!< Bit mask of PWRUPVOUTCMPD
                                                                            field.*/
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPD_Min (0x0UL) /*!< Min enumerator value of PWRUPVOUTCMPD field.                       */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPD_Max (0x1UL) /*!< Max enumerator value of PWRUPVOUTCMPD field.                       */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPD_Disabled (0x0UL) /*!< (unspecified)                                                 */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPD_Enabled (0x1UL) /*!< (unspecified)                                                  */

/* PWRUPVOUTCMPS @Bit 6 : (unspecified) */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPS_Pos (6UL) /*!< Position of PWRUPVOUTCMPS field.                                     */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPS_Msk (0x1UL << VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPS_Pos) /*!< Bit mask of PWRUPVOUTCMPS
                                                                            field.*/
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPS_Min (0x0UL) /*!< Min enumerator value of PWRUPVOUTCMPS field.                       */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPS_Max (0x1UL) /*!< Max enumerator value of PWRUPVOUTCMPS field.                       */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPS_Disabled (0x0UL) /*!< (unspecified)                                                 */
  #define VREGAO1V8_DFT_TCFG_PWRUPVOUTCMPS_Enabled (0x1UL) /*!< (unspecified)                                                  */

/* RESETDIG @Bit 7 : (unspecified) */
  #define VREGAO1V8_DFT_TCFG_RESETDIG_Pos (7UL)      /*!< Position of RESETDIG field.                                          */
  #define VREGAO1V8_DFT_TCFG_RESETDIG_Msk (0x1UL << VREGAO1V8_DFT_TCFG_RESETDIG_Pos) /*!< Bit mask of RESETDIG field.          */
  #define VREGAO1V8_DFT_TCFG_RESETDIG_Min (0x0UL)    /*!< Min enumerator value of RESETDIG field.                              */
  #define VREGAO1V8_DFT_TCFG_RESETDIG_Max (0x1UL)    /*!< Max enumerator value of RESETDIG field.                              */
  #define VREGAO1V8_DFT_TCFG_RESETDIG_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define VREGAO1V8_DFT_TCFG_RESETDIG_Enabled (0x1UL) /*!< (unspecified)                                                       */


/* ==================================================== Struct VREGAO1V8 ===================================================== */
/**
  * @brief VREGAO1V8 peripheral
  */
  typedef struct {                                   /*!< VREGAO1V8 Structure                                                  */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IOM uint32_t EVENTS_IOUTCMP;                   /*!< (@ 0x00000108) Analog current comparator                             */
    __IOM uint32_t EVENTS_LP2HP;                     /*!< (@ 0x0000010C) Current consumption above threshold                   */
    __IOM uint32_t EVENTS_HP2LP;                     /*!< (@ 0x00000110) Current consumption below threshold                   */
    __IM uint32_t RESERVED1[123];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Voltage regulator status                              */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_VREGAO1V8_CONFIG_Type CONFIG;          /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_VREGAO1V8_TRIM_Type TRIM;              /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[12];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t VOUTHPNOMINAL;                    /*!< (@ 0x00000484) Nominal high power mode output voltage programming    */
    __IOM uint32_t VOUTHPHELPER;                     /*!< (@ 0x00000488) High power helper mode output voltage programming     */
    __IOM uint32_t VOUTLP;                           /*!< (@ 0x0000048C) Low power mode output voltage programming             */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000490) Voltage regulator mode                                */
    __IOM uint32_t ITHRESHOLD;                       /*!< (@ 0x00000494) Current threshold for mode transistion                */
    __IM uint32_t RESERVED6[26];
    __IOM NRF_VREGAO1V8_OVERRIDE_Type OVERRIDE;      /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[55];
    __IOM NRF_VREGAO1V8_DFT_Type DFT;                /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VREGAO1V8_Type;                              /*!< Size = 1588 (0x634)                                                  */

/* VREGAO1V8_EVENTS_READY: Power up done */
  #define VREGAO1V8_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                          */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VREGAO1V8_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                   */
  #define VREGAO1V8_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VREGAO1V8_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of
                                                                            EVENTS_READY field.*/
  #define VREGAO1V8_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                     */
  #define VREGAO1V8_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                     */
  #define VREGAO1V8_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define VREGAO1V8_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                           */


