adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* HP2LP @Bit 4 : Read pending status of interrupt for event HP2LP */
  #define VREGAO1V8_INTPEND_HP2LP_Pos (4UL)          /*!< Position of HP2LP field.                                             */
  #define VREGAO1V8_INTPEND_HP2LP_Msk (0x1UL << VREGAO1V8_INTPEND_HP2LP_Pos) /*!< Bit mask of HP2LP field.                     */
  #define VREGAO1V8_INTPEND_HP2LP_Min (0x0UL)        /*!< Min enumerator value of HP2LP field.                                 */
  #define VREGAO1V8_INTPEND_HP2LP_Max (0x1UL)        /*!< Max enumerator value of HP2LP field.                                 */
  #define VREGAO1V8_INTPEND_HP2LP_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VREGAO1V8_INTPEND_HP2LP_Pending (0x1UL)    /*!< Read: Pending                                                        */


/* VREGAO1V8_STATUS: Voltage regulator status */
  #define VREGAO1V8_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Current voltage regulator mode */
  #define VREGAO1V8_STATUS_MODE_Pos (0UL)            /*!< Position of MODE field.                                              */
  #define VREGAO1V8_STATUS_MODE_Msk (0x3UL << VREGAO1V8_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define VREGAO1V8_STATUS_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define VREGAO1V8_STATUS_MODE_Max (0x3UL)          /*!< Max enumerator value of MODE field.                                  */
  #define VREGAO1V8_STATUS_MODE_HighPower (0x0UL)    /*!< High power mode                                                      */
  #define VREGAO1V8_STATUS_MODE_LowPowerRefresh (0x1UL) /*!< Low power refresh mode                                            */
  #define VREGAO1V8_STATUS_MODE_UltraLowPowerRefresh (0x2UL) /*!< Ultra-low power refresh mode                                 */
  #define VREGAO1V8_STATUS_MODE_LowPowerRefreshDiff (0x3UL) /*!< Low Power Refresh Differential 5v0 and 1v8                    */


/* VREGAO1V8_STATUSANA: Status of analog module output signals */
  #define VREGAO1V8_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VREGAO1V8_STATUSANA_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VREGAO1V8_STATUSANA_READY_Msk (0x1UL << VREGAO1V8_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                 */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VREGAO1V8_STATUSANA_SETTLED_Pos (1UL)      /*!< Position of SETTLED field.                                           */
  #define VREGAO1V8_STATUSANA_SETTLED_Msk (0x1UL << VREGAO1V8_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.           */

/* IOUTCMP @Bit 2 : Current value of the ICMP signal from the analog module */
  #define VREGAO1V8_STATUSANA_IOUTCMP_Pos (2UL)      /*!< Position of IOUTCMP field.                                           */
  #define VREGAO1V8_STATUSANA_IOUTCMP_Msk (0x1UL << VREGAO1V8_STATUSANA_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.           */


/* VREGAO1V8_MIRROR: Enable LOCK for mirrored registers */
  #define VREGAO1V8_MIRROR_ResetValue (0x00000001UL) /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VREGAO1V8_MIRROR_LOCK_Pos (0UL)            /*!< Position of LOCK field.                                              */
  #define VREGAO1V8_MIRROR_LOCK_Msk (0x1UL << VREGAO1V8_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                          */
  #define VREGAO1V8_MIRROR_LOCK_Min (0x0UL)          /*!< Min enumerator value of LOCK field.                                  */
  #define VREGAO1V8_MIRROR_LOCK_Max (0x1UL)          /*!< Max enumerator value of LOCK field.                                  */
  #define VREGAO1V8_MIRROR_LOCK_Disabled (0x0UL)     /*!< Lock disabled                                                        */
  #define VREGAO1V8_MIRROR_LOCK_Enabled (0x1UL)      /*!< Lock enabled                                                         */


/* VREGAO1V8_VOUTHPNOMINAL: Nominal high power mode output voltage programming */
  #define VREGAO1V8_VOUTHPNOMINAL_ResetValue (0x00000004UL) /*!< Reset value of VOUTHPNOMINAL register.                        */

/* VAL @Bits 0..2 : Output voltage value */
  #define VREGAO1V8_VOUTHPNOMINAL_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGAO1V8_VOUTHPNOMINAL_VAL_Msk (0x7UL << VREGAO1V8_VOUTHPNOMINAL_VAL_Pos) /*!< Bit mask of VAL field.               */


/* VREGAO1V8_VOUTHPHELPER: High power helper mode output voltage programming */
  #define VREGAO1V8_VOUTHPHELPER_ResetValue (0x00000002UL) /*!< Reset value of VOUTHPHELPER register.                          */

/* VAL @Bits 0..2 : Output voltage value */
  #define VREGAO1V8_VOUTHPHELPER_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREGAO1V8_VOUTHPHELPER_VAL_Msk (0x7UL << VREGAO1V8_VOUTHPHELPER_VAL_Pos) /*!< Bit mask of VAL field.                 */


/* VREGAO1V8_VOUTLP: Low power mode output voltage programming */
  #define VREGAO1V8_VOUTLP_ResetValue (0x00000004UL) /*!< Reset value of VOUTLP register.                                      */

/* VAL @Bits 0..2 : Output voltage value */
  #define VREGAO1V8_VOUTLP_VAL_Pos (0UL)             /*!< Position of VAL field.                                               */
  #define VREGAO1V8_VOUTLP_VAL_Msk (0x7UL << VREGAO1V8_VOUTLP_VAL_Pos) /*!< Bit mask of VAL field.                             */


/* VREGAO1V8_MODE: Voltage regulator mode */
  #define VREGAO1V8_MODE_ResetValue (0x00000000UL)   /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..2 : Mode */
  #define VREGAO1V8_MODE_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define VREGAO1V8_MODE_MODE_Msk (0x7UL << VREGAO1V8_MODE_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define VREGAO1V8_MODE_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define VREGAO1V8_MODE_MODE_Max (0x4UL)            /*!< Max enumerator value of MODE field.                                  */
  #define VREGAO1V8_MODE_MODE_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define VREGAO1V8_MODE_MODE_HighPower (0x1UL)      /*!< High power mode                                                      */
  #define VREGAO1V8_MODE_MODE_LowPowerRefresh (0x2UL) /*!< Low power refresh mode                                              */
  #define VREGAO1V8_MODE_MODE_UltraLowPowerRefresh (0x3UL) /*!< Ultra-low power refresh mode                                   */
  #define VREGAO1V8_MODE_MODE_LowPowerRefreshDiff (0x4UL) /*!< Low Power Refresh Differential 5v0 and 1v8                      */


