adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGAO1V8_ITHRESHOLD: Current threshold for mode transistion */
  #define VREGAO1V8_ITHRESHOLD_ResetValue (0x0000000AUL) /*!< Reset value of ITHRESHOLD register.                              */

/* VAL @Bits 0..3 : Current consumption */
  #define VREGAO1V8_ITHRESHOLD_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGAO1V8_ITHRESHOLD_VAL_Msk (0xFUL << VREGAO1V8_ITHRESHOLD_VAL_Pos) /*!< Bit mask of VAL field.                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VREGMAIN                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VREGMAIN_CONFIG ================================================== */
/**
  * @brief CONFIG [VREGMAIN_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) VREGMAIN static CFGC configuration                    */
  __IOM uint32_t  CFGCH1;                            /*!< (@ 0x00000004) VREGMAIN CH1 configuration                            */
  __IOM uint32_t  CFGCH2;                            /*!< (@ 0x00000008) VREGMAIN CH2 configuration                            */
  __IOM uint32_t  CFGCH3;                            /*!< (@ 0x0000000C) VREGMAIN CH3 configuration                            */
} NRF_VREGMAIN_CONFIG_Type;                          /*!< Size = 16 (0x010)                                                    */

/* VREGMAIN_CONFIG_CFGSTATIC: VREGMAIN static CFGC configuration */
  #define VREGMAIN_CONFIG_CFGSTATIC_ResetValue (0x00000070UL) /*!< Reset value of CFGSTATIC register.                          */

/* ENICMP3MA @Bit 0 : Enables DCDC current comparator */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Pos (0UL) /*!< Position of ENICMP3MA field.                                      */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Pos) /*!< Bit mask of ENICMP3MA
                                                                            field.*/
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Min (0x0UL) /*!< Min enumerator value of ENICMP3MA field.                        */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Max (0x1UL) /*!< Max enumerator value of ENICMP3MA field.                        */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Enabled (0x1UL) /*!< Configuration enabled                                       */

/* HSILIMMANUAL @Bit 1 : Overrides coil current limit to prog value */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Pos (1UL) /*!< Position of HSILIMMANUAL field.                                */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Pos) /*!< Bit mask of
                                                                            HSILIMMANUAL field.*/
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Min (0x0UL) /*!< Min enumerator value of HSILIMMANUAL field.                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Max (0x1UL) /*!< Max enumerator value of HSILIMMANUAL field.                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Disabled (0x0UL) /*!< Configuration disabled                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Enabled (0x1UL) /*!< Configuration enabled                                    */

/* VREFVGNDREADY @Bit 2 : Vref gnd ready, alternative configuration */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Pos (2UL) /*!< Position of VREFVGNDREADY field.                              */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Pos) /*!< Bit mask of
                                                                            VREFVGNDREADY field.*/
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Min (0x0UL) /*!< Min enumerator value of VREFVGNDREADY field.                */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Max (0x1UL) /*!< Max enumerator value of VREFVGNDREADY field.                */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Disabled (0x0UL) /*!< Configuration disabled                                 */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Enabled (0x1UL) /*!< Configuration enabled                                   */

/* MIDDLEMODEBIAS @Bit 3 : Additional bias for enhanced response and ripple in LP hysteretic mode */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Pos (3UL) /*!< Position of MIDDLEMODEBIAS field.                            */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Pos) /*!< Bit mask of
                                                                            MIDDLEMODEBIAS field.*/
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Min (0x0UL) /*!< Min enumerator value of MIDDLEMODEBIAS field.              */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Max (0x1UL) /*!< Max enumerator value of MIDDLEMODEBIAS field.              */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Disabled (0x0UL) /*!< Configuration disabled                                */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Enabled (0x1UL) /*!< Configuration enabled                                  */

/* ATCZ @Bit 4 : Enbles auto-zero function for P_DCCHV zero cross comparator */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Pos (4UL)   /*!< Position of ATCZ field.                                              */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Pos) /*!< Bit mask of ATCZ field.        */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Min (0x0UL) /*!< Min enumerator value of ATCZ field.                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Max (0x1UL) /*!< Max enumerator value of ATCZ field.                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Disabled (0x0UL) /*!< Configuration disabled                                          */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Enabled (0x1UL) /*!< Configuration enabled                                            */

/* PWMCC @Bit 5 : Enables clamp function in PWM mode */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Pos (5UL)  /*!< Position of PWMCC field.                                             */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Pos) /*!< Bit mask of PWMCC field.     */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Min (0x0UL) /*!< Min enumerator value of PWMCC field.                                */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Max (0x1UL) /*!< Max enumerator value of PWMCC field.                                */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Disabled (0x0UL) /*!< Configuration disabled                                         */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Enabled (0x1UL) /*!< Configuration enabled                                           */

/* HYSTCC @Bit 6 : Enables clamp function in HYST mode */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Pos (6UL) /*!< Position of HYSTCC field.                                            */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Pos) /*!< Bit mask of HYSTCC field.  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Min (0x0UL) /*!< Min enumerator value of HYSTCC field.                              */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Max (0x1UL) /*!< Max enumerator value of HYSTCC field.                              */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Disabled (0x0UL) /*!< Configuration disabled                                        */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Enabled (0x1UL) /*!< Configuration enabled                                          */

/* HYSTCTRL @Bit 7 : Controls amount of hysteresis */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Pos (7UL) /*!< Position of HYSTCTRL field.                                        */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Pos) /*!< Bit mask of HYSTCTRL
                                                                            field.*/
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Min (0x0UL) /*!< Min enumerator value of HYSTCTRL field.                          */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Max (0x1UL) /*!< Max enumerator value of HYSTCTRL field.                          */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Hyst4mV (0x0UL) /*!< 4mV Hysteresis                                               */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Hyst8mV (0x1UL) /*!< 8mV hysteresis                                               */

