adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGMAIN_CONFIG_CFGCH3: VREGMAIN CH3 configuration */
  #define VREGMAIN_CONFIG_CFGCH3_ResetValue (0x00000000UL) /*!< Reset value of CFGCH3 register.                                */

/* ENDUTYLIM3 @Bit 0 : Maximum duty cycle limitation */
  #define VREGMAIN_CONFIG_CFGCH3_ENDUTYLIM3_Pos (0UL) /*!< Position of ENDUTYLIM3 field.                                       */
  #define VREGMAIN_CONFIG_CFGCH3_ENDUTYLIM3_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH3_ENDUTYLIM3_Pos) /*!< Bit mask of ENDUTYLIM3
                                                                            field.*/
  #define VREGMAIN_CONFIG_CFGCH3_ENDUTYLIM3_Min (0x0UL) /*!< Min enumerator value of ENDUTYLIM3 field.                         */
  #define VREGMAIN_CONFIG_CFGCH3_ENDUTYLIM3_Max (0x1UL) /*!< Max enumerator value of ENDUTYLIM3 field.                         */
  #define VREGMAIN_CONFIG_CFGCH3_ENDUTYLIM3_Disabled (0x0UL) /*!< Configuration disabled                                       */
  #define VREGMAIN_CONFIG_CFGCH3_ENDUTYLIM3_Enabled (0x1UL) /*!< Configuration enabled                                         */

/* FASTPWM3 @Bit 1 : Faster loop for PWM modulator */
  #define VREGMAIN_CONFIG_CFGCH3_FASTPWM3_Pos (1UL)  /*!< Position of FASTPWM3 field.                                          */
  #define VREGMAIN_CONFIG_CFGCH3_FASTPWM3_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH3_FASTPWM3_Pos) /*!< Bit mask of FASTPWM3 field.  */
  #define VREGMAIN_CONFIG_CFGCH3_FASTPWM3_Min (0x0UL) /*!< Min enumerator value of FASTPWM3 field.                             */
  #define VREGMAIN_CONFIG_CFGCH3_FASTPWM3_Max (0x1UL) /*!< Max enumerator value of FASTPWM3 field.                             */
  #define VREGMAIN_CONFIG_CFGCH3_FASTPWM3_Disabled (0x0UL) /*!< Configuration disabled                                         */
  #define VREGMAIN_CONFIG_CFGCH3_FASTPWM3_Enabled (0x1UL) /*!< Configuration enabled                                           */

/* BIASBOOSTLP3 @Bit 2 : Doubles bias current for VOUTCMP */
  #define VREGMAIN_CONFIG_CFGCH3_BIASBOOSTLP3_Pos (2UL) /*!< Position of BIASBOOSTLP3 field.                                   */
  #define VREGMAIN_CONFIG_CFGCH3_BIASBOOSTLP3_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH3_BIASBOOSTLP3_Pos) /*!< Bit mask of
                                                                            BIASBOOSTLP3 field.*/
  #define VREGMAIN_CONFIG_CFGCH3_BIASBOOSTLP3_Min (0x0UL) /*!< Min enumerator value of BIASBOOSTLP3 field.                     */
  #define VREGMAIN_CONFIG_CFGCH3_BIASBOOSTLP3_Max (0x1UL) /*!< Max enumerator value of BIASBOOSTLP3 field.                     */
  #define VREGMAIN_CONFIG_CFGCH3_BIASBOOSTLP3_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREGMAIN_CONFIG_CFGCH3_BIASBOOSTLP3_Enabled (0x1UL) /*!< Configuration enabled                                       */

/* DISVOUTCMPLP3 @Bit 3 : Disables VOUT comparator in LP mode */
  #define VREGMAIN_CONFIG_CFGCH3_DISVOUTCMPLP3_Pos (3UL) /*!< Position of DISVOUTCMPLP3 field.                                 */
  #define VREGMAIN_CONFIG_CFGCH3_DISVOUTCMPLP3_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH3_DISVOUTCMPLP3_Pos) /*!< Bit mask of
                                                                            DISVOUTCMPLP3 field.*/
  #define VREGMAIN_CONFIG_CFGCH3_DISVOUTCMPLP3_Min (0x0UL) /*!< Min enumerator value of DISVOUTCMPLP3 field.                   */
  #define VREGMAIN_CONFIG_CFGCH3_DISVOUTCMPLP3_Max (0x1UL) /*!< Max enumerator value of DISVOUTCMPLP3 field.                   */
  #define VREGMAIN_CONFIG_CFGCH3_DISVOUTCMPLP3_Disabled (0x0UL) /*!< Configuration disabled                                    */
  #define VREGMAIN_CONFIG_CFGCH3_DISVOUTCMPLP3_Enabled (0x1UL) /*!< Configuration enabled                                      */



/* ================================================== Struct VREGMAIN_TRIM =================================================== */
/**
  * @brief TRIM [VREGMAIN_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  BIASIBPP;                          /*!< (@ 0x00000000) IBPP current trimming                                 */
  __IOM uint32_t  BIASIBPSR;                         /*!< (@ 0x00000004) IBPSR current and VREF voltage trimming               */
  __IOM uint32_t  VDDAO1V8HYSTOUTPUT;                /*!< (@ 0x00000008) VDD_AO_1V8 hysteretic (HYST) output voltage trimming  */
  __IOM uint32_t  VDDAO1V8PWMOUTPUT;                 /*!< (@ 0x0000000C) VDD_AO_1V8 PWM output voltage trimming                */
  __IOM uint32_t  VDD1V0HYSTOUTPUT;                  /*!< (@ 0x00000010) VDD_1V0 hysteretic (HYST) output voltage trimming     */
  __IOM uint32_t  VDDVS0V8HYSTOUTPUT;                /*!< (@ 0x00000014) VDD_VS_0V8 hysteretic (HYST) output voltage trimming  */
  __IOM uint32_t  VDDVS0V8PWMOUTPUT;                 /*!< (@ 0x00000018) VDD_VS_0V8 PWM output voltage trimming                */
  __IOM uint32_t  VDD1V0PWMOUTPUT;                   /*!< (@ 0x0000001C) VDD_1V0 PWM output voltage trimming                   */
  __IOM uint32_t  ZCROSS;                            /*!< (@ 0x00000020) Zero cross detector trimming                          */
  __IOM uint32_t  HSILIM;                            /*!< (@ 0x00000024) HS current limiter trimming                           */
  __IOM uint32_t  ICMP;                              /*!< (@ 0x00000028) DCDC output current comparator trimming               */
  __IOM uint32_t  VGND;                              /*!< (@ 0x0000002C) VGND trim                                             */
} NRF_VREGMAIN_TRIM_Type;                            /*!< Size = 48 (0x030)                                                    */

/* VREGMAIN_TRIM_BIASIBPP: IBPP current trimming */
  #define VREGMAIN_TRIM_BIASIBPP_ResetValue (0x00000000UL) /*!< Reset value of BIASIBPP register.                              */

/* VAL @Bits 0..2 : Bias trim value */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_Msk (0x7UL << VREGMAIN_TRIM_BIASIBPP_VAL_Pos) /*!< Bit mask of VAL field.                 */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_Min (0x0UL)     /*!< Min enumerator value of VAL field.                                   */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_Max (0x7UL)     /*!< Max enumerator value of VAL field.                                   */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_Normal (0x0UL)  /*!< Normal trim value                                                    */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_Val23 (0x1UL)   /*!< The trim value is 23 percent                                         */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_Val54 (0x2UL)   /*!< The trim value is 54 percent                                         */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_Val98 (0x3UL)   /*!< The trim value is 98 percent                                         */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_ValNeg51 (0x4UL) /*!< The trim value is -51 percent                                       */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_ValNeg42 (0x5UL) /*!< The trim value is -42 percent                                       */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_ValNeg31 (0x6UL) /*!< The trim value is -31 percent                                       */
  #define VREGMAIN_TRIM_BIASIBPP_VAL_ValNeg18 (0x7UL) /*!< The trim value is -18 percent                                       */


/* VREGMAIN_TRIM_BIASIBPSR: IBPSR current and VREF voltage trimming */
  #define VREGMAIN_TRIM_BIASIBPSR_ResetValue (0x00000000UL) /*!< Reset value of BIASIBPSR register.                            */

/* VAL @Bits 0..4 : Bias trim value */
  #define VREGMAIN_TRIM_BIASIBPSR_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_TRIM_BIASIBPSR_VAL_Msk (0x1FUL << VREGMAIN_TRIM_BIASIBPSR_VAL_Pos) /*!< Bit mask of VAL field.              */


/* VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT: VDD_AO_1V8 hysteretic (HYST) output voltage trimming */
  #define VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT_ResetValue (0x00000000UL) /*!< Reset value of VDDAO1V8HYSTOUTPUT register.          */

/* VAL @Bits 0..3 : Trim value */
  #define VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT_VAL_Pos (0UL) /*!< Position of VAL field.                                           */
  #define VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT_VAL_Msk (0xFUL << VREGMAIN_TRIM_VDDAO1V8HYSTOUTPUT_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/


