adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGMAIN_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VREGMAIN_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                           */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB1 */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_Pos (0UL)   /*!< Position of SELMUX field.                                            */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_Msk (0x7UL << VREGMAIN_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.      */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_Min (0x1UL) /*!< Min enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_Max (0x6UL) /*!< Max enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_VREF0V9 (0x1UL) /*!< VREF_0V9 selected                                                */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_VREF1V0 (0x2UL) /*!< VREF_1V0 selected                                                */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_VREF0V8 (0x3UL) /*!< VREF_0V8 selected                                                */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_VGNDREF5V (0x4UL) /*!< VGNDREF_5V selected                                            */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_MBIASVREF (0x5UL) /*!< MBIAS_VREF selected                                            */
  #define VREGMAIN_DFT_ATB1CONFIG_SELMUX_AVSSSIMO (0x6UL) /*!< AVSS_SIMO selected                                              */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGMAIN_DFT_ATB1CONFIG_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_DFT_ATB1CONFIG_EN_Msk (0x1UL << VREGMAIN_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_DFT_ATB1CONFIG_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_ATB1CONFIG_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                         */
  #define VREGMAIN_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                           */


/* VREGMAIN_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VREGMAIN_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                           */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_Pos (0UL)   /*!< Position of SELMUX field.                                            */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << VREGMAIN_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.      */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_Max (0x7UL) /*!< Max enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_CLK (0x0UL) /*!< CLK selected                                                         */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_IBPPREADY (0x1UL) /*!< IBPP_READY selected                                            */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_REQUESTMBIAS (0x2UL) /*!< REQUEST_MBIAS selected                                      */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_MBIASREADY (0x3UL) /*!< MBIAS_READY selected                                          */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_SELVOLTLP (0x4UL) /*!< SEL_VOLT_LP selected                                           */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_DRVHS (0x6UL) /*!< DRVHS selected                                                     */
  #define VREGMAIN_DFT_DTB0CONFIG_SELMUX_MBIASSETTLED (0x7UL) /*!< MBIAS_SETTLED selected                                      */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGMAIN_DFT_DTB0CONFIG_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_DFT_DTB0CONFIG_EN_Msk (0x1UL << VREGMAIN_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_DFT_DTB0CONFIG_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_DTB0CONFIG_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                        */
  #define VREGMAIN_DFT_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                          */


/* VREGMAIN_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VREGMAIN_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                           */

/* SELMUX @Bits 0..3 : Select multiplexer for DTB1 */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_Pos (0UL)   /*!< Position of SELMUX field.                                            */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_Msk (0xFUL << VREGMAIN_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.      */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_Min (0x1UL) /*!< Min enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_Max (0xFUL) /*!< Max enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_PWRUPCH1 (0x1UL) /*!< PWRUPCH1 selected                                               */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_VOUTCMP1 (0x2UL) /*!< VOUTCMP1 selected                                               */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_PWMCMP1 (0x3UL) /*!< PWMCMP1 selected                                                 */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_DRVSEC1 (0x4UL) /*!< DRVSEC1 selected                                                 */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_ZCROSS (0x5UL) /*!< ZCROSS selected                                                   */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_PDCCHREADY (0x6UL) /*!< P_DCCH_READY selected                                         */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_MODELP (0x8UL) /*!< MODE_LP selected                                                  */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_HVBUCKREADY (0x9UL) /*!< HVBUCK_READY selected                                        */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_SETTLEDCH3 (0xAUL) /*!< SETTLED_CH3 selected                                          */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_PWMILIM2 (0xBUL) /*!< PWM_ILIM2 selected                                              */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_PWMOC1 (0xCUL) /*!< PWM_OC1 selected                                                  */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_PWMSKIP1 (0xDUL) /*!< PWM_SKIP1 selected                                              */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_PWMFAULT1 (0xEUL) /*!< PWM_FAULT1 selected                                            */
  #define VREGMAIN_DFT_DTB1CONFIG_SELMUX_CHRG1 (0xFUL) /*!< CHRG1 selected                                                     */

