adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define VREGMAIN_DFT_DTB3CONFIG_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_DFT_DTB3CONFIG_EN_Msk (0x1UL << VREGMAIN_DFT_DTB3CONFIG_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_DFT_DTB3CONFIG_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_DTB3CONFIG_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_DTB3CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                        */
  #define VREGMAIN_DFT_DTB3CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                          */


/* VREGMAIN_DFT_TCFG: Test mode configuration */
  #define VREGMAIN_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                       */

/* PWRUPIBPSR @Bit 0 : Enable PWRUP_IBPSR */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPSR_Pos (0UL)     /*!< Position of PWRUPIBPSR field.                                        */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPSR_Msk (0x1UL << VREGMAIN_DFT_TCFG_PWRUPIBPSR_Pos) /*!< Bit mask of PWRUPIBPSR field.      */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPSR_Min (0x0UL)   /*!< Min enumerator value of PWRUPIBPSR field.                            */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPSR_Max (0x1UL)   /*!< Max enumerator value of PWRUPIBPSR field.                            */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPSR_Disabled (0x0UL) /*!< PWRUP_IBPSR disabled                                              */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPSR_Enabled (0x1UL) /*!< PWRUP_IBPSR enabled                                                */

/* PWRUPIBPP @Bit 1 : Enable PWRUP_IBPP */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPP_Pos (1UL)      /*!< Position of PWRUPIBPP field.                                         */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPP_Msk (0x1UL << VREGMAIN_DFT_TCFG_PWRUPIBPP_Pos) /*!< Bit mask of PWRUPIBPP field.         */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPP_Min (0x0UL)    /*!< Min enumerator value of PWRUPIBPP field.                             */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPP_Max (0x1UL)    /*!< Max enumerator value of PWRUPIBPP field.                             */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPP_Disabled (0x0UL) /*!< PWRUP_IBPP disabled                                                */
  #define VREGMAIN_DFT_TCFG_PWRUPIBPP_Enabled (0x1UL) /*!< PWRUP_IBPP enabled                                                  */

/* PWRUPWM @Bit 2 : Enable PWRUP_PWM */
  #define VREGMAIN_DFT_TCFG_PWRUPWM_Pos (2UL)        /*!< Position of PWRUPWM field.                                           */
  #define VREGMAIN_DFT_TCFG_PWRUPWM_Msk (0x1UL << VREGMAIN_DFT_TCFG_PWRUPWM_Pos) /*!< Bit mask of PWRUPWM field.               */
  #define VREGMAIN_DFT_TCFG_PWRUPWM_Min (0x0UL)      /*!< Min enumerator value of PWRUPWM field.                               */
  #define VREGMAIN_DFT_TCFG_PWRUPWM_Max (0x1UL)      /*!< Max enumerator value of PWRUPWM field.                               */
  #define VREGMAIN_DFT_TCFG_PWRUPWM_Disabled (0x0UL) /*!< PWRUP_PWM disabled                                                   */
  #define VREGMAIN_DFT_TCFG_PWRUPWM_Enabled (0x1UL)  /*!< PWRUP_PWM enabled                                                    */

/* PWRUPHYST @Bit 3 : Enable PWRUP_HYST */
  #define VREGMAIN_DFT_TCFG_PWRUPHYST_Pos (3UL)      /*!< Position of PWRUPHYST field.                                         */
  #define VREGMAIN_DFT_TCFG_PWRUPHYST_Msk (0x1UL << VREGMAIN_DFT_TCFG_PWRUPHYST_Pos) /*!< Bit mask of PWRUPHYST field.         */
  #define VREGMAIN_DFT_TCFG_PWRUPHYST_Min (0x0UL)    /*!< Min enumerator value of PWRUPHYST field.                             */
  #define VREGMAIN_DFT_TCFG_PWRUPHYST_Max (0x1UL)    /*!< Max enumerator value of PWRUPHYST field.                             */
  #define VREGMAIN_DFT_TCFG_PWRUPHYST_Disabled (0x0UL) /*!< PWRUP_HYST disabled                                                */
  #define VREGMAIN_DFT_TCFG_PWRUPHYST_Enabled (0x1UL) /*!< PWRUP_HYST enabled                                                  */

/* MINIDRV @Bit 4 : Enable MINIDRV */
  #define VREGMAIN_DFT_TCFG_MINIDRV_Pos (4UL)        /*!< Position of MINIDRV field.                                           */
  #define VREGMAIN_DFT_TCFG_MINIDRV_Msk (0x1UL << VREGMAIN_DFT_TCFG_MINIDRV_Pos) /*!< Bit mask of MINIDRV field.               */
  #define VREGMAIN_DFT_TCFG_MINIDRV_Min (0x0UL)      /*!< Min enumerator value of MINIDRV field.                               */
  #define VREGMAIN_DFT_TCFG_MINIDRV_Max (0x1UL)      /*!< Max enumerator value of MINIDRV field.                               */
  #define VREGMAIN_DFT_TCFG_MINIDRV_Disabled (0x0UL) /*!< MINIDRV disabled                                                     */
  #define VREGMAIN_DFT_TCFG_MINIDRV_Enabled (0x1UL)  /*!< MINIDRV enabled                                                      */

/* SAMPLEPDCCH @Bit 5 : Sample P_DCCH by ready */
  #define VREGMAIN_DFT_TCFG_SAMPLEPDCCH_Pos (5UL)    /*!< Position of SAMPLEPDCCH field.                                       */
  #define VREGMAIN_DFT_TCFG_SAMPLEPDCCH_Msk (0x1UL << VREGMAIN_DFT_TCFG_SAMPLEPDCCH_Pos) /*!< Bit mask of SAMPLEPDCCH field.   */
  #define VREGMAIN_DFT_TCFG_SAMPLEPDCCH_Min (0x0UL)  /*!< Min enumerator value of SAMPLEPDCCH field.                           */
  #define VREGMAIN_DFT_TCFG_SAMPLEPDCCH_Max (0x1UL)  /*!< Max enumerator value of SAMPLEPDCCH field.                           */
  #define VREGMAIN_DFT_TCFG_SAMPLEPDCCH_Disabled (0x0UL) /*!< Sample P_DCCH disabled                                           */
  #define VREGMAIN_DFT_TCFG_SAMPLEPDCCH_Enabled (0x1UL) /*!< Sample P_DCCH enabled                                             */

/* PWRUPPDCCHV @Bit 6 : Enable mux PWRUP_P_DCCHV */
  #define VREGMAIN_DFT_TCFG_PWRUPPDCCHV_Pos (6UL)    /*!< Position of PWRUPPDCCHV field.                                       */
  #define VREGMAIN_DFT_TCFG_PWRUPPDCCHV_Msk (0x1UL << VREGMAIN_DFT_TCFG_PWRUPPDCCHV_Pos) /*!< Bit mask of PWRUPPDCCHV field.   */
  #define VREGMAIN_DFT_TCFG_PWRUPPDCCHV_Min (0x0UL)  /*!< Min enumerator value of PWRUPPDCCHV field.                           */
  #define VREGMAIN_DFT_TCFG_PWRUPPDCCHV_Max (0x1UL)  /*!< Max enumerator value of PWRUPPDCCHV field.                           */
  #define VREGMAIN_DFT_TCFG_PWRUPPDCCHV_Disabled (0x0UL) /*!< PWRUPPDCCHV disabled                                             */
  #define VREGMAIN_DFT_TCFG_PWRUPPDCCHV_Enabled (0x1UL) /*!< PWRUPPDCCHV enabled                                               */

