adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* DRVSEC @Bits 7..8 : Select DRVSEC */
  #define VREGMAIN_DFT_TCFG_DRVSEC_Pos (7UL)         /*!< Position of DRVSEC field.                                            */
  #define VREGMAIN_DFT_TCFG_DRVSEC_Msk (0x3UL << VREGMAIN_DFT_TCFG_DRVSEC_Pos) /*!< Bit mask of DRVSEC field.                  */
  #define VREGMAIN_DFT_TCFG_DRVSEC_Min (0x0UL)       /*!< Min enumerator value of DRVSEC field.                                */
  #define VREGMAIN_DFT_TCFG_DRVSEC_Max (0x3UL)       /*!< Max enumerator value of DRVSEC field.                                */
  #define VREGMAIN_DFT_TCFG_DRVSEC_Normal (0x0UL)    /*!< Normal mode, DRVSEC2 in reset                                        */
  #define VREGMAIN_DFT_TCFG_DRVSEC_DRVSEC1 (0x1UL)   /*!< DRVSEC1 selected                                                     */
  #define VREGMAIN_DFT_TCFG_DRVSEC_DRVSEC2 (0x2UL)   /*!< DRVSEC2 selected                                                     */
  #define VREGMAIN_DFT_TCFG_DRVSEC_OFF (0x3UL)       /*!< OFF                                                                  */

/* HSFORCEON @Bits 9..10 : Enable HS force on */
  #define VREGMAIN_DFT_TCFG_HSFORCEON_Pos (9UL)      /*!< Position of HSFORCEON field.                                         */
  #define VREGMAIN_DFT_TCFG_HSFORCEON_Msk (0x3UL << VREGMAIN_DFT_TCFG_HSFORCEON_Pos) /*!< Bit mask of HSFORCEON field.         */
  #define VREGMAIN_DFT_TCFG_HSFORCEON_Min (0x0UL)    /*!< Min enumerator value of HSFORCEON field.                             */
  #define VREGMAIN_DFT_TCFG_HSFORCEON_Max (0x3UL)    /*!< Max enumerator value of HSFORCEON field.                             */
  #define VREGMAIN_DFT_TCFG_HSFORCEON_Normal (0x0UL) /*!< Normal mode                                                          */
  #define VREGMAIN_DFT_TCFG_HSFORCEON_HSILIM (0x1UL) /*!< HS force on HSILIM gating                                            */
  #define VREGMAIN_DFT_TCFG_HSFORCEON_GPI (0x2UL)    /*!< GPI                                                                  */
  #define VREGMAIN_DFT_TCFG_HSFORCEON_HSforceon (0x3UL) /*!< HS force on                                                       */

/* LSFORCEON @Bits 11..12 : Enable LS force on */
  #define VREGMAIN_DFT_TCFG_LSFORCEON_Pos (11UL)     /*!< Position of LSFORCEON field.                                         */
  #define VREGMAIN_DFT_TCFG_LSFORCEON_Msk (0x3UL << VREGMAIN_DFT_TCFG_LSFORCEON_Pos) /*!< Bit mask of LSFORCEON field.         */
  #define VREGMAIN_DFT_TCFG_LSFORCEON_Min (0x0UL)    /*!< Min enumerator value of LSFORCEON field.                             */
  #define VREGMAIN_DFT_TCFG_LSFORCEON_Max (0x3UL)    /*!< Max enumerator value of LSFORCEON field.                             */
  #define VREGMAIN_DFT_TCFG_LSFORCEON_Normal (0x0UL) /*!< Normal mode                                                          */
  #define VREGMAIN_DFT_TCFG_LSFORCEON_LSforceoff (0x1UL) /*!< LS force off-zx gating                                           */
  #define VREGMAIN_DFT_TCFG_LSFORCEON_GPI (0x2UL)    /*!< GPI                                                                  */
  #define VREGMAIN_DFT_TCFG_LSFORCEON_LSforceon (0x3UL) /*!< LS force on                                                       */

/* DIGOFF @Bit 13 : Enable DIGOFF */
  #define VREGMAIN_DFT_TCFG_DIGOFF_Pos (13UL)        /*!< Position of DIGOFF field.                                            */
  #define VREGMAIN_DFT_TCFG_DIGOFF_Msk (0x1UL << VREGMAIN_DFT_TCFG_DIGOFF_Pos) /*!< Bit mask of DIGOFF field.                  */
  #define VREGMAIN_DFT_TCFG_DIGOFF_Min (0x0UL)       /*!< Min enumerator value of DIGOFF field.                                */
  #define VREGMAIN_DFT_TCFG_DIGOFF_Max (0x1UL)       /*!< Max enumerator value of DIGOFF field.                                */
  #define VREGMAIN_DFT_TCFG_DIGOFF_Disabled (0x0UL)  /*!< DIGOFF disabled                                                      */
  #define VREGMAIN_DFT_TCFG_DIGOFF_Enabled (0x1UL)   /*!< DIGOFF enabled                                                       */

/* SIGDIG @Bit 14 : Enable SIGDIG */
  #define VREGMAIN_DFT_TCFG_SIGDIG_Pos (14UL)        /*!< Position of SIGDIG field.                                            */
  #define VREGMAIN_DFT_TCFG_SIGDIG_Msk (0x1UL << VREGMAIN_DFT_TCFG_SIGDIG_Pos) /*!< Bit mask of SIGDIG field.                  */
  #define VREGMAIN_DFT_TCFG_SIGDIG_Min (0x0UL)       /*!< Min enumerator value of SIGDIG field.                                */
  #define VREGMAIN_DFT_TCFG_SIGDIG_Max (0x1UL)       /*!< Max enumerator value of SIGDIG field.                                */
  #define VREGMAIN_DFT_TCFG_SIGDIG_Disabled (0x0UL)  /*!< SIGDIG disabled                                                      */
  #define VREGMAIN_DFT_TCFG_SIGDIG_Enabled (0x1UL)   /*!< SIGDIG enabled                                                       */

/* GPI @Bit 15 : Enable GPI (PSEUDO PWM) */
  #define VREGMAIN_DFT_TCFG_GPI_Pos (15UL)           /*!< Position of GPI field.                                               */
  #define VREGMAIN_DFT_TCFG_GPI_Msk (0x1UL << VREGMAIN_DFT_TCFG_GPI_Pos) /*!< Bit mask of GPI field.                           */
  #define VREGMAIN_DFT_TCFG_GPI_Min (0x0UL)          /*!< Min enumerator value of GPI field.                                   */
  #define VREGMAIN_DFT_TCFG_GPI_Max (0x1UL)          /*!< Max enumerator value of GPI field.                                   */
  #define VREGMAIN_DFT_TCFG_GPI_Disabled (0x0UL)     /*!< GPI disabled                                                         */
  #define VREGMAIN_DFT_TCFG_GPI_Enabled (0x1UL)      /*!< GPI enabled                                                          */


/* VREGMAIN_DFT_CALEN: Calibration enable */
  #define VREGMAIN_DFT_CALEN_ResetValue (0x00000000UL) /*!< Reset value of CALEN register.                                     */

/* CALEN @Bit 0 : Calibration enable */
  #define VREGMAIN_DFT_CALEN_CALEN_Pos (0UL)         /*!< Position of CALEN field.                                             */
  #define VREGMAIN_DFT_CALEN_CALEN_Msk (0x1UL << VREGMAIN_DFT_CALEN_CALEN_Pos) /*!< Bit mask of CALEN field.                   */
  #define VREGMAIN_DFT_CALEN_CALEN_Min (0x0UL)       /*!< Min enumerator value of CALEN field.                                 */
  #define VREGMAIN_DFT_CALEN_CALEN_Max (0x1UL)       /*!< Max enumerator value of CALEN field.                                 */
  #define VREGMAIN_DFT_CALEN_CALEN_ATCMPOff (0x0UL)  /*!< ATCMP Off                                                            */
  #define VREGMAIN_DFT_CALEN_CALEN_ATCMPOn (0x1UL)   /*!< ATCMP On                                                             */


/* VREGMAIN_DFT_CALCMP: Calibration compare */
  #define VREGMAIN_DFT_CALCMP_ResetValue (0x00000000UL) /*!< Reset value of CALCMP register.                                   */

/* CALCMP @Bit 0 : Calibration compare */
  #define VREGMAIN_DFT_CALCMP_CALCMP_Pos (0UL)       /*!< Position of CALCMP field.                                            */
  #define VREGMAIN_DFT_CALCMP_CALCMP_Msk (0x1UL << VREGMAIN_DFT_CALCMP_CALCMP_Pos) /*!< Bit mask of CALCMP field.              */


/* ===================================================== Struct VREGMAIN ===================================================== */
/**
  * @brief VREGMAIN peripheral
  */
  typedef struct {                                   /*!< VREGMAIN Structure                                                   */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IOM uint32_t EVENTS_SETTLEDCH1;                /*!< (@ 0x00000108) Settled flag for CH1 enable                           */
    __IOM uint32_t EVENTS_SETTLEDCH2;                /*!< (@ 0x0000010C) Settled flag for CH2 enable                           */
    __IOM uint32_t EVENTS_SETTLEDCH3;                /*!< (@ 0x00000110) Settled flag for CH3 enable                           */
    __IOM uint32_t EVENTS_IOUTCMP;                   /*!< (@ 0x00000114) Analog current comparator                             */
    __IOM uint32_t EVENTS_LP2HP;                     /*!< (@ 0x00000118) Current consumption above threshold                   */
    __IOM uint32_t EVENTS_HP2LP;                     /*!< (@ 0x0000011C) Current consumption below threshold                   */
    __IM uint32_t RESERVED1[120];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t STATUS;                           /*!< (@ 0x00000400) Current voltage regulator mode                        */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t STATUSDIG;                         /*!< (@ 0x00000408) Status of digital controllers                         */
    __IM uint32_t RESERVED3;
    __IOM NRF_VREGMAIN_CONFIG_Type CONFIG;           /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[8];
    __IOM NRF_VREGMAIN_TRIM_Type TRIM;               /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[4];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t PWRUPCTRL;                        /*!< (@ 0x00000484) Power up control                                      */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000488) Voltage regulator mode                                */
    __IOM uint32_t VDDAO1V8OUTPUT;                   /*!< (@ 0x0000048C) VDD_AO_1V8 output voltage                             */
    __IOM uint32_t VDDAO1V8LPOUTPUT;                 /*!< (@ 0x00000490) VDD_AO_1V8 Low Power output voltage                   */
    __IOM uint32_t VDD1V0OUTPUT;                     /*!< (@ 0x00000494) VDD_1V0 output voltage                                */
    __IOM uint32_t VDD1V0OUTPUTRADIO;                /*!< (@ 0x00000498) VDD_1V0 output voltage, radio upscaling               */
    __IOM uint32_t VDD1V0LPOUTPUT;                   /*!< (@ 0x0000049C) VDD_1V0 LP output voltage                             */
    __IOM uint32_t VDD1V0LPOUTPUTRADIO;              /*!< (@ 0x000004A0) VDD_1V0 LP output voltage, radio upscaling            */
    __IOM uint32_t VDD1V0ULPOUTPUT;                  /*!< (@ 0x000004A4) VDD_1V0 ULP output voltage                            */
    __IOM uint32_t VDDVS0V8OUTPUT;                   /*!< (@ 0x000004A8) VDD_VS_0V8 output voltage                             */
    __IOM uint32_t HSILIMPROG;                       /*!< (@ 0x000004AC) HS current limiter program                            */
    __IOM uint32_t PWMPROG;                          /*!< (@ 0x000004B0) PWM program                                           */
    __IOM uint32_t FBCTRL;                           /*!< (@ 0x000004B4) Regulator feedback point control                      */
    __IOM uint32_t ITHRESHOLD;                       /*!< (@ 0x000004B8) Current threshold for HP/LP mode transistion          */
    __IOM uint32_t ITHRESHOLDPWM;                    /*!< (@ 0x000004BC) Current threshold for half clock speed in PWM mode    */
    __IOM uint32_t ITHRESHOLD0V8LOW;                 /*!< (@ 0x000004C0) Current threshold LDO toggle at low 0V8 current
                                                                         consumption*/
    __IM uint32_t RESERVED6[15];
    __IOM NRF_VREGMAIN_OVERRIDE_Type OVERRIDE;       /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[44];
    __IOM NRF_VREGMAIN_DFT_Type DFT;                 /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VREGMAIN_Type;                               /*!< Size = 1596 (0x63C)                                                  */

/* VREGMAIN_EVENTS_READY: Power up done */
  #define VREGMAIN_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                           */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VREGMAIN_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                    */
  #define VREGMAIN_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VREGMAIN_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY
                                                                            field.*/
  #define VREGMAIN_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                      */
  #define VREGMAIN_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                      */
  #define VREGMAIN_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define VREGMAIN_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                            */


/* VREGMAIN_EVENTS_SETTLED: Settled flag for MODE handshake */
  #define VREGMAIN_EVENTS_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED register.                       */

