adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EVENTS_SETTLED @Bit 0 : Settled flag for MODE handshake */
  #define VREGMAIN_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                              */
  #define VREGMAIN_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << VREGMAIN_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/
  #define VREGMAIN_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.                */
  #define VREGMAIN_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.                */
  #define VREGMAIN_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define VREGMAIN_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                        */


/* VREGMAIN_EVENTS_SETTLEDCH1: Settled flag for CH1 enable */
  #define VREGMAIN_EVENTS_SETTLEDCH1_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLEDCH1 register.                 */

/* EVENTS_SETTLEDCH1 @Bit 0 : Settled flag for CH1 enable */
  #define VREGMAIN_EVENTS_SETTLEDCH1_EVENTS_SETTLEDCH1_Pos (0UL) /*!< Position of EVENTS_SETTLEDCH1 field.                     */
  #define VREGMAIN_EVENTS_SETTLEDCH1_EVENTS_SETTLEDCH1_Msk (0x1UL << VREGMAIN_EVENTS_SETTLEDCH1_EVENTS_SETTLEDCH1_Pos) /*!< Bit
                                                                            mask of EVENTS_SETTLEDCH1 field.*/
  #define VREGMAIN_EVENTS_SETTLEDCH1_EVENTS_SETTLEDCH1_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLEDCH1 field.       */
  #define VREGMAIN_EVENTS_SETTLEDCH1_EVENTS_SETTLEDCH1_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLEDCH1 field.       */
  #define VREGMAIN_EVENTS_SETTLEDCH1_EVENTS_SETTLEDCH1_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define VREGMAIN_EVENTS_SETTLEDCH1_EVENTS_SETTLEDCH1_Generated (0x1UL) /*!< Event generated                                  */


/* VREGMAIN_EVENTS_SETTLEDCH2: Settled flag for CH2 enable */
  #define VREGMAIN_EVENTS_SETTLEDCH2_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLEDCH2 register.                 */

/* EVENTS_SETTLEDCH2 @Bit 0 : Settled flag for CH2 enable */
  #define VREGMAIN_EVENTS_SETTLEDCH2_EVENTS_SETTLEDCH2_Pos (0UL) /*!< Position of EVENTS_SETTLEDCH2 field.                     */
  #define VREGMAIN_EVENTS_SETTLEDCH2_EVENTS_SETTLEDCH2_Msk (0x1UL << VREGMAIN_EVENTS_SETTLEDCH2_EVENTS_SETTLEDCH2_Pos) /*!< Bit
                                                                            mask of EVENTS_SETTLEDCH2 field.*/
  #define VREGMAIN_EVENTS_SETTLEDCH2_EVENTS_SETTLEDCH2_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLEDCH2 field.       */
  #define VREGMAIN_EVENTS_SETTLEDCH2_EVENTS_SETTLEDCH2_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLEDCH2 field.       */
  #define VREGMAIN_EVENTS_SETTLEDCH2_EVENTS_SETTLEDCH2_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define VREGMAIN_EVENTS_SETTLEDCH2_EVENTS_SETTLEDCH2_Generated (0x1UL) /*!< Event generated                                  */


/* VREGMAIN_EVENTS_SETTLEDCH3: Settled flag for CH3 enable */
  #define VREGMAIN_EVENTS_SETTLEDCH3_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLEDCH3 register.                 */

/* EVENTS_SETTLEDCH3 @Bit 0 : Settled flag for CH3 enable */
  #define VREGMAIN_EVENTS_SETTLEDCH3_EVENTS_SETTLEDCH3_Pos (0UL) /*!< Position of EVENTS_SETTLEDCH3 field.                     */
  #define VREGMAIN_EVENTS_SETTLEDCH3_EVENTS_SETTLEDCH3_Msk (0x1UL << VREGMAIN_EVENTS_SETTLEDCH3_EVENTS_SETTLEDCH3_Pos) /*!< Bit
                                                                            mask of EVENTS_SETTLEDCH3 field.*/
  #define VREGMAIN_EVENTS_SETTLEDCH3_EVENTS_SETTLEDCH3_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLEDCH3 field.       */
  #define VREGMAIN_EVENTS_SETTLEDCH3_EVENTS_SETTLEDCH3_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLEDCH3 field.       */
  #define VREGMAIN_EVENTS_SETTLEDCH3_EVENTS_SETTLEDCH3_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define VREGMAIN_EVENTS_SETTLEDCH3_EVENTS_SETTLEDCH3_Generated (0x1UL) /*!< Event generated                                  */


/* VREGMAIN_EVENTS_IOUTCMP: Analog current comparator */
  #define VREGMAIN_EVENTS_IOUTCMP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_IOUTCMP register.                       */

/* EVENTS_IOUTCMP @Bit 0 : Analog current comparator */
  #define VREGMAIN_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Pos (0UL) /*!< Position of EVENTS_IOUTCMP field.                              */
  #define VREGMAIN_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Msk (0x1UL << VREGMAIN_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Pos) /*!< Bit mask of
                                                                            EVENTS_IOUTCMP field.*/
  #define VREGMAIN_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Min (0x0UL) /*!< Min enumerator value of EVENTS_IOUTCMP field.                */
  #define VREGMAIN_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Max (0x1UL) /*!< Max enumerator value of EVENTS_IOUTCMP field.                */
  #define VREGMAIN_EVENTS_IOUTCMP_EVENTS_IOUTCMP_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define VREGMAIN_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Generated (0x1UL) /*!< Event generated                                        */


/* VREGMAIN_EVENTS_LP2HP: Current consumption above threshold */
  #define VREGMAIN_EVENTS_LP2HP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LP2HP register.                           */

/* EVENTS_LP2HP @Bit 0 : Current consumption above threshold */
  #define VREGMAIN_EVENTS_LP2HP_EVENTS_LP2HP_Pos (0UL) /*!< Position of EVENTS_LP2HP field.                                    */
  #define VREGMAIN_EVENTS_LP2HP_EVENTS_LP2HP_Msk (0x1UL << VREGMAIN_EVENTS_LP2HP_EVENTS_LP2HP_Pos) /*!< Bit mask of EVENTS_LP2HP
                                                                            field.*/
  #define VREGMAIN_EVENTS_LP2HP_EVENTS_LP2HP_Min (0x0UL) /*!< Min enumerator value of EVENTS_LP2HP field.                      */
  #define VREGMAIN_EVENTS_LP2HP_EVENTS_LP2HP_Max (0x1UL) /*!< Max enumerator value of EVENTS_LP2HP field.                      */
  #define VREGMAIN_EVENTS_LP2HP_EVENTS_LP2HP_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define VREGMAIN_EVENTS_LP2HP_EVENTS_LP2HP_Generated (0x1UL) /*!< Event generated                                            */


/* VREGMAIN_EVENTS_HP2LP: Current consumption below threshold */
  #define VREGMAIN_EVENTS_HP2LP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_HP2LP register.                           */

