adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define VREGMAIN_INTENSET_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VREGMAIN_INTENSET_SETTLED_Msk (0x1UL << VREGMAIN_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */
  #define VREGMAIN_INTENSET_SETTLED_Min (0x0UL)      /*!< Min enumerator value of SETTLED field.                               */
  #define VREGMAIN_INTENSET_SETTLED_Max (0x1UL)      /*!< Max enumerator value of SETTLED field.                               */
  #define VREGMAIN_INTENSET_SETTLED_Set (0x1UL)      /*!< Enable                                                               */
  #define VREGMAIN_INTENSET_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define VREGMAIN_INTENSET_SETTLED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* SETTLEDCH1 @Bit 2 : Write '1' to enable interrupt for event SETTLEDCH1 */
  #define VREGMAIN_INTENSET_SETTLEDCH1_Pos (2UL)     /*!< Position of SETTLEDCH1 field.                                        */
  #define VREGMAIN_INTENSET_SETTLEDCH1_Msk (0x1UL << VREGMAIN_INTENSET_SETTLEDCH1_Pos) /*!< Bit mask of SETTLEDCH1 field.      */
  #define VREGMAIN_INTENSET_SETTLEDCH1_Min (0x0UL)   /*!< Min enumerator value of SETTLEDCH1 field.                            */
  #define VREGMAIN_INTENSET_SETTLEDCH1_Max (0x1UL)   /*!< Max enumerator value of SETTLEDCH1 field.                            */
  #define VREGMAIN_INTENSET_SETTLEDCH1_Set (0x1UL)   /*!< Enable                                                               */
  #define VREGMAIN_INTENSET_SETTLEDCH1_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGMAIN_INTENSET_SETTLEDCH1_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* SETTLEDCH2 @Bit 3 : Write '1' to enable interrupt for event SETTLEDCH2 */
  #define VREGMAIN_INTENSET_SETTLEDCH2_Pos (3UL)     /*!< Position of SETTLEDCH2 field.                                        */
  #define VREGMAIN_INTENSET_SETTLEDCH2_Msk (0x1UL << VREGMAIN_INTENSET_SETTLEDCH2_Pos) /*!< Bit mask of SETTLEDCH2 field.      */
  #define VREGMAIN_INTENSET_SETTLEDCH2_Min (0x0UL)   /*!< Min enumerator value of SETTLEDCH2 field.                            */
  #define VREGMAIN_INTENSET_SETTLEDCH2_Max (0x1UL)   /*!< Max enumerator value of SETTLEDCH2 field.                            */
  #define VREGMAIN_INTENSET_SETTLEDCH2_Set (0x1UL)   /*!< Enable                                                               */
  #define VREGMAIN_INTENSET_SETTLEDCH2_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGMAIN_INTENSET_SETTLEDCH2_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* SETTLEDCH3 @Bit 4 : Write '1' to enable interrupt for event SETTLEDCH3 */
  #define VREGMAIN_INTENSET_SETTLEDCH3_Pos (4UL)     /*!< Position of SETTLEDCH3 field.                                        */
  #define VREGMAIN_INTENSET_SETTLEDCH3_Msk (0x1UL << VREGMAIN_INTENSET_SETTLEDCH3_Pos) /*!< Bit mask of SETTLEDCH3 field.      */
  #define VREGMAIN_INTENSET_SETTLEDCH3_Min (0x0UL)   /*!< Min enumerator value of SETTLEDCH3 field.                            */
  #define VREGMAIN_INTENSET_SETTLEDCH3_Max (0x1UL)   /*!< Max enumerator value of SETTLEDCH3 field.                            */
  #define VREGMAIN_INTENSET_SETTLEDCH3_Set (0x1UL)   /*!< Enable                                                               */
  #define VREGMAIN_INTENSET_SETTLEDCH3_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGMAIN_INTENSET_SETTLEDCH3_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* IOUTCMP @Bit 5 : Write '1' to enable interrupt for event IOUTCMP */
  #define VREGMAIN_INTENSET_IOUTCMP_Pos (5UL)        /*!< Position of IOUTCMP field.                                           */
  #define VREGMAIN_INTENSET_IOUTCMP_Msk (0x1UL << VREGMAIN_INTENSET_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.               */
  #define VREGMAIN_INTENSET_IOUTCMP_Min (0x0UL)      /*!< Min enumerator value of IOUTCMP field.                               */
  #define VREGMAIN_INTENSET_IOUTCMP_Max (0x1UL)      /*!< Max enumerator value of IOUTCMP field.                               */
  #define VREGMAIN_INTENSET_IOUTCMP_Set (0x1UL)      /*!< Enable                                                               */
  #define VREGMAIN_INTENSET_IOUTCMP_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define VREGMAIN_INTENSET_IOUTCMP_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* LP2HP @Bit 6 : Write '1' to enable interrupt for event LP2HP */
  #define VREGMAIN_INTENSET_LP2HP_Pos (6UL)          /*!< Position of LP2HP field.                                             */
  #define VREGMAIN_INTENSET_LP2HP_Msk (0x1UL << VREGMAIN_INTENSET_LP2HP_Pos) /*!< Bit mask of LP2HP field.                     */
  #define VREGMAIN_INTENSET_LP2HP_Min (0x0UL)        /*!< Min enumerator value of LP2HP field.                                 */
  #define VREGMAIN_INTENSET_LP2HP_Max (0x1UL)        /*!< Max enumerator value of LP2HP field.                                 */
  #define VREGMAIN_INTENSET_LP2HP_Set (0x1UL)        /*!< Enable                                                               */
  #define VREGMAIN_INTENSET_LP2HP_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define VREGMAIN_INTENSET_LP2HP_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* HP2LP @Bit 7 : Write '1' to enable interrupt for event HP2LP */
  #define VREGMAIN_INTENSET_HP2LP_Pos (7UL)          /*!< Position of HP2LP field.                                             */
  #define VREGMAIN_INTENSET_HP2LP_Msk (0x1UL << VREGMAIN_INTENSET_HP2LP_Pos) /*!< Bit mask of HP2LP field.                     */
  #define VREGMAIN_INTENSET_HP2LP_Min (0x0UL)        /*!< Min enumerator value of HP2LP field.                                 */
  #define VREGMAIN_INTENSET_HP2LP_Max (0x1UL)        /*!< Max enumerator value of HP2LP field.                                 */
  #define VREGMAIN_INTENSET_HP2LP_Set (0x1UL)        /*!< Enable                                                               */
  #define VREGMAIN_INTENSET_HP2LP_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define VREGMAIN_INTENSET_HP2LP_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* VREGMAIN_INTENCLR: Disable interrupt */
  #define VREGMAIN_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                   */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VREGMAIN_INTENCLR_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VREGMAIN_INTENCLR_READY_Msk (0x1UL << VREGMAIN_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VREGMAIN_INTENCLR_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VREGMAIN_INTENCLR_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VREGMAIN_INTENCLR_READY_Clear (0x1UL)      /*!< Disable                                                              */
  #define VREGMAIN_INTENCLR_READY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define VREGMAIN_INTENCLR_READY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

