adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* IOUTCMP @Bit 5 : Read pending status of interrupt for event IOUTCMP */
  #define VREGMAIN_INTPEND_IOUTCMP_Pos (5UL)         /*!< Position of IOUTCMP field.                                           */
  #define VREGMAIN_INTPEND_IOUTCMP_Msk (0x1UL << VREGMAIN_INTPEND_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.                 */
  #define VREGMAIN_INTPEND_IOUTCMP_Min (0x0UL)       /*!< Min enumerator value of IOUTCMP field.                               */
  #define VREGMAIN_INTPEND_IOUTCMP_Max (0x1UL)       /*!< Max enumerator value of IOUTCMP field.                               */
  #define VREGMAIN_INTPEND_IOUTCMP_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define VREGMAIN_INTPEND_IOUTCMP_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* LP2HP @Bit 6 : Read pending status of interrupt for event LP2HP */
  #define VREGMAIN_INTPEND_LP2HP_Pos (6UL)           /*!< Position of LP2HP field.                                             */
  #define VREGMAIN_INTPEND_LP2HP_Msk (0x1UL << VREGMAIN_INTPEND_LP2HP_Pos) /*!< Bit mask of LP2HP field.                       */
  #define VREGMAIN_INTPEND_LP2HP_Min (0x0UL)         /*!< Min enumerator value of LP2HP field.                                 */
  #define VREGMAIN_INTPEND_LP2HP_Max (0x1UL)         /*!< Max enumerator value of LP2HP field.                                 */
  #define VREGMAIN_INTPEND_LP2HP_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define VREGMAIN_INTPEND_LP2HP_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* HP2LP @Bit 7 : Read pending status of interrupt for event HP2LP */
  #define VREGMAIN_INTPEND_HP2LP_Pos (7UL)           /*!< Position of HP2LP field.                                             */
  #define VREGMAIN_INTPEND_HP2LP_Msk (0x1UL << VREGMAIN_INTPEND_HP2LP_Pos) /*!< Bit mask of HP2LP field.                       */
  #define VREGMAIN_INTPEND_HP2LP_Min (0x0UL)         /*!< Min enumerator value of HP2LP field.                                 */
  #define VREGMAIN_INTPEND_HP2LP_Max (0x1UL)         /*!< Max enumerator value of HP2LP field.                                 */
  #define VREGMAIN_INTPEND_HP2LP_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define VREGMAIN_INTPEND_HP2LP_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* VREGMAIN_STATUS: Current voltage regulator mode */
  #define VREGMAIN_STATUS_ResetValue (0x00000000UL)  /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Mode */
  #define VREGMAIN_STATUS_MODE_Pos (0UL)             /*!< Position of MODE field.                                              */
  #define VREGMAIN_STATUS_MODE_Msk (0x3UL << VREGMAIN_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                            */
  #define VREGMAIN_STATUS_MODE_Min (0x0UL)           /*!< Min enumerator value of MODE field.                                  */
  #define VREGMAIN_STATUS_MODE_Max (0x3UL)           /*!< Max enumerator value of MODE field.                                  */
  #define VREGMAIN_STATUS_MODE_HP (0x0UL)            /*!< High power hysteretic mode                                           */
  #define VREGMAIN_STATUS_MODE_LP (0x1UL)            /*!< Autonomous hysteretic low power mode                                 */
  #define VREGMAIN_STATUS_MODE_ULP (0x2UL)           /*!< Refresh based ultra-Low power mode                                   */
  #define VREGMAIN_STATUS_MODE_PWM (0x3UL)           /*!< PWM mode is fixed frequency DCDC operation mode                      */


/* VREGMAIN_STATUSANA: Status of analog module output signals */
  #define VREGMAIN_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                 */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VREGMAIN_STATUSANA_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VREGMAIN_STATUSANA_READY_Msk (0x1UL << VREGMAIN_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                   */

/* SETTLEDMODE @Bit 1 : Current value of the SETTLED_MODE signal from the analog module */
  #define VREGMAIN_STATUSANA_SETTLEDMODE_Pos (1UL)   /*!< Position of SETTLEDMODE field.                                       */
  #define VREGMAIN_STATUSANA_SETTLEDMODE_Msk (0x1UL << VREGMAIN_STATUSANA_SETTLEDMODE_Pos) /*!< Bit mask of SETTLEDMODE field. */

/* SETTLEDCH1 @Bit 2 : Current value of the CH1 SETTLED signal from the analog module */
  #define VREGMAIN_STATUSANA_SETTLEDCH1_Pos (2UL)    /*!< Position of SETTLEDCH1 field.                                        */
  #define VREGMAIN_STATUSANA_SETTLEDCH1_Msk (0x1UL << VREGMAIN_STATUSANA_SETTLEDCH1_Pos) /*!< Bit mask of SETTLEDCH1 field.    */

/* SETTLEDCH2 @Bit 3 : Current value of the CH2 SETTLED signal from the analog module */
  #define VREGMAIN_STATUSANA_SETTLEDCH2_Pos (3UL)    /*!< Position of SETTLEDCH2 field.                                        */
  #define VREGMAIN_STATUSANA_SETTLEDCH2_Msk (0x1UL << VREGMAIN_STATUSANA_SETTLEDCH2_Pos) /*!< Bit mask of SETTLEDCH2 field.    */

/* SETTLEDCH3 @Bit 4 : Current value of the CH3 SETTLED signal from the analog module */
  #define VREGMAIN_STATUSANA_SETTLEDCH3_Pos (4UL)    /*!< Position of SETTLEDCH3 field.                                        */
  #define VREGMAIN_STATUSANA_SETTLEDCH3_Msk (0x1UL << VREGMAIN_STATUSANA_SETTLEDCH3_Pos) /*!< Bit mask of SETTLEDCH3 field.    */

/* CHRGCH1 @Bit 5 : Current value of the CH1 CHRG signal from the analog module */
  #define VREGMAIN_STATUSANA_CHRGCH1_Pos (5UL)       /*!< Position of CHRGCH1 field.                                           */
  #define VREGMAIN_STATUSANA_CHRGCH1_Msk (0x1UL << VREGMAIN_STATUSANA_CHRGCH1_Pos) /*!< Bit mask of CHRGCH1 field.             */

