adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* CHRGCH2 @Bit 6 : Current value of the CH2 CHRG signal from the analog module */
  #define VREGMAIN_STATUSANA_CHRGCH2_Pos (6UL)       /*!< Position of CHRGCH2 field.                                           */
  #define VREGMAIN_STATUSANA_CHRGCH2_Msk (0x1UL << VREGMAIN_STATUSANA_CHRGCH2_Pos) /*!< Bit mask of CHRGCH2 field.             */

/* CHRGCH3 @Bit 7 : Current value of the CH3 CHRG signal from the analog module */
  #define VREGMAIN_STATUSANA_CHRGCH3_Pos (7UL)       /*!< Position of CHRGCH3 field.                                           */
  #define VREGMAIN_STATUSANA_CHRGCH3_Msk (0x1UL << VREGMAIN_STATUSANA_CHRGCH3_Pos) /*!< Bit mask of CHRGCH3 field.             */

/* ICMP @Bit 8 : Current value of the ICMP signal from the analog module */
  #define VREGMAIN_STATUSANA_ICMP_Pos (8UL)          /*!< Position of ICMP field.                                              */
  #define VREGMAIN_STATUSANA_ICMP_Msk (0x1UL << VREGMAIN_STATUSANA_ICMP_Pos) /*!< Bit mask of ICMP field.                      */


/* VREGMAIN_STATUSDIG: Status of digital controllers */
  #define VREGMAIN_STATUSDIG_ResetValue (0x00000000UL) /*!< Reset value of STATUSDIG register.                                 */

/* FSMMASTER @Bits 0..4 : State of MMI master FSM */
  #define VREGMAIN_STATUSDIG_FSMMASTER_Pos (0UL)     /*!< Position of FSMMASTER field.                                         */
  #define VREGMAIN_STATUSDIG_FSMMASTER_Msk (0x1FUL << VREGMAIN_STATUSDIG_FSMMASTER_Pos) /*!< Bit mask of FSMMASTER field.      */

/* FSM1V8 @Bits 8..9 : State of MMI 1V8 FSM */
  #define VREGMAIN_STATUSDIG_FSM1V8_Pos (8UL)        /*!< Position of FSM1V8 field.                                            */
  #define VREGMAIN_STATUSDIG_FSM1V8_Msk (0x3UL << VREGMAIN_STATUSDIG_FSM1V8_Pos) /*!< Bit mask of FSM1V8 field.                */

/* FSM0V8 @Bits 12..13 : State of MMI 0V8 FSM */
  #define VREGMAIN_STATUSDIG_FSM0V8_Pos (12UL)       /*!< Position of FSM0V8 field.                                            */
  #define VREGMAIN_STATUSDIG_FSM0V8_Msk (0x3UL << VREGMAIN_STATUSDIG_FSM0V8_Pos) /*!< Bit mask of FSM0V8 field.                */


/* VREGMAIN_MIRROR: Enable LOCK for mirrored registers */
  #define VREGMAIN_MIRROR_ResetValue (0x00000001UL)  /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VREGMAIN_MIRROR_LOCK_Pos (0UL)             /*!< Position of LOCK field.                                              */
  #define VREGMAIN_MIRROR_LOCK_Msk (0x1UL << VREGMAIN_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                            */
  #define VREGMAIN_MIRROR_LOCK_Min (0x0UL)           /*!< Min enumerator value of LOCK field.                                  */
  #define VREGMAIN_MIRROR_LOCK_Max (0x1UL)           /*!< Max enumerator value of LOCK field.                                  */
  #define VREGMAIN_MIRROR_LOCK_Disabled (0x0UL)      /*!< Lock disabled                                                        */
  #define VREGMAIN_MIRROR_LOCK_Enabled (0x1UL)       /*!< Lock enabled                                                         */


/* VREGMAIN_PWRUPCTRL: Power up control */
  #define VREGMAIN_PWRUPCTRL_ResetValue (0x00000000UL) /*!< Reset value of PWRUPCTRL register.                                 */

/* CTRL @Bits 0..1 : Power up control */
  #define VREGMAIN_PWRUPCTRL_CTRL_Pos (0UL)          /*!< Position of CTRL field.                                              */
  #define VREGMAIN_PWRUPCTRL_CTRL_Msk (0x3UL << VREGMAIN_PWRUPCTRL_CTRL_Pos) /*!< Bit mask of CTRL field.                      */
  #define VREGMAIN_PWRUPCTRL_CTRL_Min (0x0UL)        /*!< Min enumerator value of CTRL field.                                  */
  #define VREGMAIN_PWRUPCTRL_CTRL_Max (0x2UL)        /*!< Max enumerator value of CTRL field.                                  */
  #define VREGMAIN_PWRUPCTRL_CTRL_Auto (0x0UL)       /*!< Automatically handled by the peripheral                              */
  #define VREGMAIN_PWRUPCTRL_CTRL_PowerUp (0x1UL)    /*!< Power up                                                             */
  #define VREGMAIN_PWRUPCTRL_CTRL_PowerDown (0x2UL)  /*!< Power down                                                           */


/* VREGMAIN_MODE: Voltage regulator mode */
  #define VREGMAIN_MODE_ResetValue (0x00000000UL)    /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..2 : Mode */
  #define VREGMAIN_MODE_MODE_Pos (0UL)               /*!< Position of MODE field.                                              */
  #define VREGMAIN_MODE_MODE_Msk (0x7UL << VREGMAIN_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                */
  #define VREGMAIN_MODE_MODE_Min (0x0UL)             /*!< Min enumerator value of MODE field.                                  */
  #define VREGMAIN_MODE_MODE_Max (0x4UL)             /*!< Max enumerator value of MODE field.                                  */
  #define VREGMAIN_MODE_MODE_Auto (0x0UL)            /*!< Automatically handled by the peripheral                              */
  #define VREGMAIN_MODE_MODE_HP (0x1UL)              /*!< High power hysteretic mode                                           */
  #define VREGMAIN_MODE_MODE_LP (0x2UL)              /*!< Autonomous hysteretic low power mode                                 */
  #define VREGMAIN_MODE_MODE_ULP (0x3UL)             /*!< Refresh based ultra-Low power mode                                   */
  #define VREGMAIN_MODE_MODE_PWM (0x4UL)             /*!< PWM mode is fixed frequency DCDC operation mode                      */

/* BLOCKMODEHP @Bit 4 : Block HP mode while in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODEHP_Pos (4UL)        /*!< Position of BLOCKMODEHP field.                                       */
  #define VREGMAIN_MODE_BLOCKMODEHP_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODEHP_Pos) /*!< Bit mask of BLOCKMODEHP field.           */
  #define VREGMAIN_MODE_BLOCKMODEHP_Min (0x0UL)      /*!< Min enumerator value of BLOCKMODEHP field.                           */
  #define VREGMAIN_MODE_BLOCKMODEHP_Max (0x1UL)      /*!< Max enumerator value of BLOCKMODEHP field.                           */
  #define VREGMAIN_MODE_BLOCKMODEHP_NotBlocked (0x0UL) /*!< Mode not blocked                                                   */
  #define VREGMAIN_MODE_BLOCKMODEHP_Blocked (0x1UL)  /*!< Mode blocked                                                         */

/* BLOCKMODELP @Bit 5 : Block LP mode while in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODELP_Pos (5UL)        /*!< Position of BLOCKMODELP field.                                       */
  #define VREGMAIN_MODE_BLOCKMODELP_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODELP_Pos) /*!< Bit mask of BLOCKMODELP field.           */
  #define VREGMAIN_MODE_BLOCKMODELP_Min (0x0UL)      /*!< Min enumerator value of BLOCKMODELP field.                           */
  #define VREGMAIN_MODE_BLOCKMODELP_Max (0x1UL)      /*!< Max enumerator value of BLOCKMODELP field.                           */
  #define VREGMAIN_MODE_BLOCKMODELP_NotBlocked (0x0UL) /*!< Mode not blocked                                                   */
  #define VREGMAIN_MODE_BLOCKMODELP_Blocked (0x1UL)  /*!< Mode blocked                                                         */

/* BLOCKMODEULP @Bit 6 : Block ULP mode while in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODEULP_Pos (6UL)       /*!< Position of BLOCKMODEULP field.                                      */
  #define VREGMAIN_MODE_BLOCKMODEULP_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODEULP_Pos) /*!< Bit mask of BLOCKMODEULP field.        */
  #define VREGMAIN_MODE_BLOCKMODEULP_Min (0x0UL)     /*!< Min enumerator value of BLOCKMODEULP field.                          */
  #define VREGMAIN_MODE_BLOCKMODEULP_Max (0x1UL)     /*!< Max enumerator value of BLOCKMODEULP field.                          */
  #define VREGMAIN_MODE_BLOCKMODEULP_NotBlocked (0x0UL) /*!< Mode not blocked                                                  */
  #define VREGMAIN_MODE_BLOCKMODEULP_Blocked (0x1UL) /*!< Mode blocked                                                         */

/* BLOCKMODEPWM @Bit 7 : Block PWM mode while in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODEPWM_Pos (7UL)       /*!< Position of BLOCKMODEPWM field.                                      */
  #define VREGMAIN_MODE_BLOCKMODEPWM_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODEPWM_Pos) /*!< Bit mask of BLOCKMODEPWM field.        */
  #define VREGMAIN_MODE_BLOCKMODEPWM_Min (0x0UL)     /*!< Min enumerator value of BLOCKMODEPWM field.                          */
  #define VREGMAIN_MODE_BLOCKMODEPWM_Max (0x1UL)     /*!< Max enumerator value of BLOCKMODEPWM field.                          */
  #define VREGMAIN_MODE_BLOCKMODEPWM_NotBlocked (0x0UL) /*!< Mode not blocked                                                  */
  #define VREGMAIN_MODE_BLOCKMODEPWM_Blocked (0x1UL) /*!< Mode blocked                                                         */

/* BLOCKMODEHPRADIO @Bit 8 : Block HP RADIO mode while in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODEHPRADIO_Pos (8UL)   /*!< Position of BLOCKMODEHPRADIO field.                                  */
  #define VREGMAIN_MODE_BLOCKMODEHPRADIO_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODEHPRADIO_Pos) /*!< Bit mask of BLOCKMODEHPRADIO
                                                                            field.*/
  #define VREGMAIN_MODE_BLOCKMODEHPRADIO_Min (0x0UL) /*!< Min enumerator value of BLOCKMODEHPRADIO field.                      */
  #define VREGMAIN_MODE_BLOCKMODEHPRADIO_Max (0x1UL) /*!< Max enumerator value of BLOCKMODEHPRADIO field.                      */
  #define VREGMAIN_MODE_BLOCKMODEHPRADIO_NotBlocked (0x0UL) /*!< Mode not blocked                                              */
  #define VREGMAIN_MODE_BLOCKMODEHPRADIO_Blocked (0x1UL) /*!< Mode blocked                                                     */

/* BLOCKMODELPRADIO @Bit 9 : Block LP RADIO mode while in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODELPRADIO_Pos (9UL)   /*!< Position of BLOCKMODELPRADIO field.                                  */
  #define VREGMAIN_MODE_BLOCKMODELPRADIO_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODELPRADIO_Pos) /*!< Bit mask of BLOCKMODELPRADIO
                                                                            field.*/
  #define VREGMAIN_MODE_BLOCKMODELPRADIO_Min (0x0UL) /*!< Min enumerator value of BLOCKMODELPRADIO field.                      */
  #define VREGMAIN_MODE_BLOCKMODELPRADIO_Max (0x1UL) /*!< Max enumerator value of BLOCKMODELPRADIO field.                      */
  #define VREGMAIN_MODE_BLOCKMODELPRADIO_NotBlocked (0x0UL) /*!< Mode not blocked                                              */
  #define VREGMAIN_MODE_BLOCKMODELPRADIO_Blocked (0x1UL) /*!< Mode blocked                                                     */

/* BLOCKMODEULV @Bit 10 : Block ULV mode while in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODEULV_Pos (10UL)      /*!< Position of BLOCKMODEULV field.                                      */
  #define VREGMAIN_MODE_BLOCKMODEULV_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODEULV_Pos) /*!< Bit mask of BLOCKMODEULV field.        */
  #define VREGMAIN_MODE_BLOCKMODEULV_Min (0x0UL)     /*!< Min enumerator value of BLOCKMODEULV field.                          */
  #define VREGMAIN_MODE_BLOCKMODEULV_Max (0x1UL)     /*!< Max enumerator value of BLOCKMODEULV field.                          */
  #define VREGMAIN_MODE_BLOCKMODEULV_NotBlocked (0x0UL) /*!< Mode not blocked                                                  */
  #define VREGMAIN_MODE_BLOCKMODEULV_Blocked (0x1UL) /*!< Mode blocked                                                         */

/* BLOCKMODELDO1V8 @Bit 11 : Block VREGAO1V8 full mode request in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODELDO1V8_Pos (11UL)   /*!< Position of BLOCKMODELDO1V8 field.                                   */
  #define VREGMAIN_MODE_BLOCKMODELDO1V8_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODELDO1V8_Pos) /*!< Bit mask of BLOCKMODELDO1V8
                                                                            field.*/
  #define VREGMAIN_MODE_BLOCKMODELDO1V8_Min (0x0UL)  /*!< Min enumerator value of BLOCKMODELDO1V8 field.                       */
  #define VREGMAIN_MODE_BLOCKMODELDO1V8_Max (0x1UL)  /*!< Max enumerator value of BLOCKMODELDO1V8 field.                       */
  #define VREGMAIN_MODE_BLOCKMODELDO1V8_NotBlocked (0x0UL) /*!< Mode not blocked                                               */
  #define VREGMAIN_MODE_BLOCKMODELDO1V8_Blocked (0x1UL) /*!< Mode blocked                                                      */

