adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* BLOCKMODEVS0V8 @Bit 12 : Block VREGVS0V8 full mode request in MODE = Auto */
  #define VREGMAIN_MODE_BLOCKMODEVS0V8_Pos (12UL)    /*!< Position of BLOCKMODEVS0V8 field.                                    */
  #define VREGMAIN_MODE_BLOCKMODEVS0V8_Msk (0x1UL << VREGMAIN_MODE_BLOCKMODEVS0V8_Pos) /*!< Bit mask of BLOCKMODEVS0V8 field.  */
  #define VREGMAIN_MODE_BLOCKMODEVS0V8_Min (0x0UL)   /*!< Min enumerator value of BLOCKMODEVS0V8 field.                        */
  #define VREGMAIN_MODE_BLOCKMODEVS0V8_Max (0x1UL)   /*!< Max enumerator value of BLOCKMODEVS0V8 field.                        */
  #define VREGMAIN_MODE_BLOCKMODEVS0V8_NotBlocked (0x0UL) /*!< Mode not blocked                                                */
  #define VREGMAIN_MODE_BLOCKMODEVS0V8_Blocked (0x1UL) /*!< Mode blocked                                                       */

/* REQRADIOFULL @Bit 13 : (unspecified) */
  #define VREGMAIN_MODE_REQRADIOFULL_Pos (13UL)      /*!< Position of REQRADIOFULL field.                                      */
  #define VREGMAIN_MODE_REQRADIOFULL_Msk (0x1UL << VREGMAIN_MODE_REQRADIOFULL_Pos) /*!< Bit mask of REQRADIOFULL field.        */
  #define VREGMAIN_MODE_REQRADIOFULL_Min (0x0UL)     /*!< Min enumerator value of REQRADIOFULL field.                          */
  #define VREGMAIN_MODE_REQRADIOFULL_Max (0x1UL)     /*!< Max enumerator value of REQRADIOFULL field.                          */
  #define VREGMAIN_MODE_REQRADIOFULL_Disabled (0x0UL) /*!< Req disabled                                                        */
  #define VREGMAIN_MODE_REQRADIOFULL_Enabled (0x1UL) /*!< Req enabled                                                          */


/* VREGMAIN_VDDAO1V8OUTPUT: VDD_AO_1V8 output voltage */
  #define VREGMAIN_VDDAO1V8OUTPUT_ResetValue (0x00000004UL) /*!< Reset value of VDDAO1V8OUTPUT register.                       */

/* VAL @Bits 0..2 : Voltage value */
  #define VREGMAIN_VDDAO1V8OUTPUT_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_VDDAO1V8OUTPUT_VAL_Msk (0x7UL << VREGMAIN_VDDAO1V8OUTPUT_VAL_Pos) /*!< Bit mask of VAL field.               */


/* VREGMAIN_VDDAO1V8LPOUTPUT: VDD_AO_1V8 Low Power output voltage */
  #define VREGMAIN_VDDAO1V8LPOUTPUT_ResetValue (0x00000004UL) /*!< Reset value of VDDAO1V8LPOUTPUT register.                   */

/* VAL @Bits 0..2 : Voltage value */
  #define VREGMAIN_VDDAO1V8LPOUTPUT_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGMAIN_VDDAO1V8LPOUTPUT_VAL_Msk (0x7UL << VREGMAIN_VDDAO1V8LPOUTPUT_VAL_Pos) /*!< Bit mask of VAL field.           */


/* VREGMAIN_VDD1V0OUTPUT: VDD_1V0 output voltage */
  #define VREGMAIN_VDD1V0OUTPUT_ResetValue (0x0000001CUL) /*!< Reset value of VDD1V0OUTPUT register.                           */

/* VAL @Bits 0..5 : Voltage value */
  #define VREGMAIN_VDD1V0OUTPUT_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VREGMAIN_VDD1V0OUTPUT_VAL_Msk (0x3FUL << VREGMAIN_VDD1V0OUTPUT_VAL_Pos) /*!< Bit mask of VAL field.                  */


/* VREGMAIN_VDD1V0OUTPUTRADIO: VDD_1V0 output voltage, radio upscaling */
  #define VREGMAIN_VDD1V0OUTPUTRADIO_ResetValue (0x0000002BUL) /*!< Reset value of VDD1V0OUTPUTRADIO register.                 */

/* VAL @Bits 0..5 : Voltage value */
  #define VREGMAIN_VDD1V0OUTPUTRADIO_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VREGMAIN_VDD1V0OUTPUTRADIO_VAL_Msk (0x3FUL << VREGMAIN_VDD1V0OUTPUTRADIO_VAL_Pos) /*!< Bit mask of VAL field.        */


/* VREGMAIN_VDD1V0LPOUTPUT: VDD_1V0 LP output voltage */
  #define VREGMAIN_VDD1V0LPOUTPUT_ResetValue (0x00000018UL) /*!< Reset value of VDD1V0LPOUTPUT register.                       */

/* VAL @Bits 0..5 : Voltage value */
  #define VREGMAIN_VDD1V0LPOUTPUT_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_VDD1V0LPOUTPUT_VAL_Msk (0x3FUL << VREGMAIN_VDD1V0LPOUTPUT_VAL_Pos) /*!< Bit mask of VAL field.              */


/* VREGMAIN_VDD1V0LPOUTPUTRADIO: VDD_1V0 LP output voltage, radio upscaling */
  #define VREGMAIN_VDD1V0LPOUTPUTRADIO_ResetValue (0x0000002BUL) /*!< Reset value of VDD1V0LPOUTPUTRADIO register.             */

/* VAL @Bits 0..5 : Voltage value */
  #define VREGMAIN_VDD1V0LPOUTPUTRADIO_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VREGMAIN_VDD1V0LPOUTPUTRADIO_VAL_Msk (0x3FUL << VREGMAIN_VDD1V0LPOUTPUTRADIO_VAL_Pos) /*!< Bit mask of VAL field.    */


/* VREGMAIN_VDD1V0ULPOUTPUT: VDD_1V0 ULP output voltage */
  #define VREGMAIN_VDD1V0ULPOUTPUT_ResetValue (0x00000008UL) /*!< Reset value of VDD1V0ULPOUTPUT register.                     */

/* VAL @Bits 0..5 : Voltage value */
  #define VREGMAIN_VDD1V0ULPOUTPUT_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGMAIN_VDD1V0ULPOUTPUT_VAL_Msk (0x3FUL << VREGMAIN_VDD1V0ULPOUTPUT_VAL_Pos) /*!< Bit mask of VAL field.            */


/* VREGMAIN_VDDVS0V8OUTPUT: VDD_VS_0V8 output voltage */
  #define VREGMAIN_VDDVS0V8OUTPUT_ResetValue (0x00000030UL) /*!< Reset value of VDDVS0V8OUTPUT register.                       */

/* VAL @Bits 0..5 : Voltage value */
  #define VREGMAIN_VDDVS0V8OUTPUT_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_VDDVS0V8OUTPUT_VAL_Msk (0x3FUL << VREGMAIN_VDDVS0V8OUTPUT_VAL_Pos) /*!< Bit mask of VAL field.              */


/* VREGMAIN_HSILIMPROG: HS current limiter program */
  #define VREGMAIN_HSILIMPROG_ResetValue (0x00000000UL) /*!< Reset value of HSILIMPROG register.                               */

/* VAL @Bits 0..1 : HS current limiter value */
  #define VREGMAIN_HSILIMPROG_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREGMAIN_HSILIMPROG_VAL_Msk (0x3UL << VREGMAIN_HSILIMPROG_VAL_Pos) /*!< Bit mask of VAL field.                       */
  #define VREGMAIN_HSILIMPROG_VAL_Min (0x0UL)        /*!< Min enumerator value of VAL field.                                   */
  #define VREGMAIN_HSILIMPROG_VAL_Max (0x3UL)        /*!< Max enumerator value of VAL field.                                   */
  #define VREGMAIN_HSILIMPROG_VAL_Val150mA (0x0UL)   /*!< Current limit to 150mA                                               */
  #define VREGMAIN_HSILIMPROG_VAL_Val250mA (0x1UL)   /*!< Current limit to 250mA                                               */
  #define VREGMAIN_HSILIMPROG_VAL_Val350mA (0x2UL)   /*!< Current limit to 350mA                                               */
  #define VREGMAIN_HSILIMPROG_VAL_Val450mA (0x3UL)   /*!< Current limit to 450mA (PWM mode only)                               */


