adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGMRAM_TRIM_VBG: Bandgap voltage buffer trim */
  #define VREGMRAM_TRIM_VBG_ResetValue (0x00000008UL) /*!< Reset value of VBG register.                                        */

/* VAL @Bits 0..3 : Voltage reference trimming value */
  #define VREGMRAM_TRIM_VBG_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define VREGMRAM_TRIM_VBG_VAL_Msk (0xFUL << VREGMRAM_TRIM_VBG_VAL_Pos) /*!< Bit mask of VAL field.                           */


/* VREGMRAM_TRIM_BIAS: Bias trim */
  #define VREGMRAM_TRIM_BIAS_ResetValue (0x00000000UL) /*!< Reset value of BIAS register.                                      */

/* VAL @Bits 0..1 : Bias trimming value */
  #define VREGMRAM_TRIM_BIAS_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define VREGMRAM_TRIM_BIAS_VAL_Msk (0x3UL << VREGMRAM_TRIM_BIAS_VAL_Pos) /*!< Bit mask of VAL field.                         */
  #define VREGMRAM_TRIM_BIAS_VAL_Min (0x0UL)         /*!< Min enumerator value of VAL field.                                   */
  #define VREGMRAM_TRIM_BIAS_VAL_Max (0x2UL)         /*!< Max enumerator value of VAL field.                                   */
  #define VREGMRAM_TRIM_BIAS_VAL_Val450nA (0x0UL)    /*!< Bias trimming is 450nA                                               */
  #define VREGMRAM_TRIM_BIAS_VAL_Val530nA (0x1UL)    /*!< Bias trimming is 530nA                                               */
  #define VREGMRAM_TRIM_BIAS_VAL_Val400nA (0x2UL)    /*!< Bias trimming is 400nA                                               */


/* VREGMRAM_TRIM_VPR: VPR reference voltage trim for 1.2V VPR */
  #define VREGMRAM_TRIM_VPR_ResetValue (0x00000008UL) /*!< Reset value of VPR register.                                        */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREGMRAM_TRIM_VPR_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define VREGMRAM_TRIM_VPR_VAL_Msk (0xFUL << VREGMRAM_TRIM_VPR_VAL_Pos) /*!< Bit mask of VAL field.                           */


/* VREGMRAM_TRIM_VREF: VREF reference voltage trim for 0.6V VREF */
  #define VREGMRAM_TRIM_VREF_ResetValue (0x00000008UL) /*!< Reset value of VREF register.                                      */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREGMRAM_TRIM_VREF_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define VREGMRAM_TRIM_VREF_VAL_Msk (0xFUL << VREGMRAM_TRIM_VREF_VAL_Pos) /*!< Bit mask of VAL field.                         */



/* ================================================ Struct VREGMRAM_OVERRIDE ================================================= */
/**
  * @brief OVERRIDE [VREGMRAM_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000008) Override the MODE signal to the analog module         */
} NRF_VREGMRAM_OVERRIDE_Type;                        /*!< Size = 12 (0x00C)                                                    */

/* VREGMRAM_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VREGMRAM_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMRAM_OVERRIDE_PWRUP_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMRAM_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VREGMRAM_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VREGMRAM_OVERRIDE_PWRUP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMRAM_OVERRIDE_PWRUP_EN_Msk (0x1UL << VREGMRAM_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMRAM_OVERRIDE_PWRUP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMRAM_OVERRIDE_PWRUP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMRAM_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREGMRAM_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREGMRAM_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VREGMRAM_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                              */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMRAM_OVERRIDE_RETAIN_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGMRAM_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VREGMRAM_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGMRAM_OVERRIDE_RETAIN_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGMRAM_OVERRIDE_RETAIN_EN_Msk (0x1UL << VREGMRAM_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGMRAM_OVERRIDE_RETAIN_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGMRAM_OVERRIDE_RETAIN_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGMRAM_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGMRAM_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGMRAM_OVERRIDE_MODE: Override the MODE signal to the analog module */
  #define VREGMRAM_OVERRIDE_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                  */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMRAM_OVERRIDE_MODE_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREGMRAM_OVERRIDE_MODE_VAL_Msk (0x1UL << VREGMRAM_OVERRIDE_MODE_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VREGMRAM_OVERRIDE_MODE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREGMRAM_OVERRIDE_MODE_EN_Msk (0x1UL << VREGMRAM_OVERRIDE_MODE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREGMRAM_OVERRIDE_MODE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREGMRAM_OVERRIDE_MODE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREGMRAM_OVERRIDE_MODE_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VREGMRAM_OVERRIDE_MODE_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */



/* =================================================== Struct VREGMRAM_DFT =================================================== */
/**
  * @brief DFT [VREGMRAM_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[10];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_VREGMRAM_DFT_Type;                             /*!< Size = 52 (0x034)                                                    */

