adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGMRAM_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VREGMRAM_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                           */

/* IB300NA @Bit 0 : IB 300nA */
  #define VREGMRAM_DFT_ATB0CONFIG_IB300NA_Pos (0UL)  /*!< Position of IB300NA field.                                           */
  #define VREGMRAM_DFT_ATB0CONFIG_IB300NA_Msk (0x1UL << VREGMRAM_DFT_ATB0CONFIG_IB300NA_Pos) /*!< Bit mask of IB300NA field.   */
  #define VREGMRAM_DFT_ATB0CONFIG_IB300NA_Min (0x0UL) /*!< Min enumerator value of IB300NA field.                              */
  #define VREGMRAM_DFT_ATB0CONFIG_IB300NA_Max (0x1UL) /*!< Max enumerator value of IB300NA field.                              */
  #define VREGMRAM_DFT_ATB0CONFIG_IB300NA_Disabled (0x0UL) /*!< (unspecified)                                                  */
  #define VREGMRAM_DFT_ATB0CONFIG_IB300NA_Enabled (0x1UL) /*!< (unspecified)                                                   */

/* VREF @Bit 1 : VREF 0V6 */
  #define VREGMRAM_DFT_ATB0CONFIG_VREF_Pos (1UL)     /*!< Position of VREF field.                                              */
  #define VREGMRAM_DFT_ATB0CONFIG_VREF_Msk (0x1UL << VREGMRAM_DFT_ATB0CONFIG_VREF_Pos) /*!< Bit mask of VREF field.            */
  #define VREGMRAM_DFT_ATB0CONFIG_VREF_Min (0x0UL)   /*!< Min enumerator value of VREF field.                                  */
  #define VREGMRAM_DFT_ATB0CONFIG_VREF_Max (0x1UL)   /*!< Max enumerator value of VREF field.                                  */
  #define VREGMRAM_DFT_ATB0CONFIG_VREF_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGMRAM_DFT_ATB0CONFIG_VREF_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* VPR @Bit 2 : VPR 1V2 */
  #define VREGMRAM_DFT_ATB0CONFIG_VPR_Pos (2UL)      /*!< Position of VPR field.                                               */
  #define VREGMRAM_DFT_ATB0CONFIG_VPR_Msk (0x1UL << VREGMRAM_DFT_ATB0CONFIG_VPR_Pos) /*!< Bit mask of VPR field.               */
  #define VREGMRAM_DFT_ATB0CONFIG_VPR_Min (0x0UL)    /*!< Min enumerator value of VPR field.                                   */
  #define VREGMRAM_DFT_ATB0CONFIG_VPR_Max (0x1UL)    /*!< Max enumerator value of VPR field.                                   */
  #define VREGMRAM_DFT_ATB0CONFIG_VPR_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define VREGMRAM_DFT_ATB0CONFIG_VPR_Enabled (0x1UL) /*!< (unspecified)                                                       */

/* VTST @Bit 3 : V_TST */
  #define VREGMRAM_DFT_ATB0CONFIG_VTST_Pos (3UL)     /*!< Position of VTST field.                                              */
  #define VREGMRAM_DFT_ATB0CONFIG_VTST_Msk (0x1UL << VREGMRAM_DFT_ATB0CONFIG_VTST_Pos) /*!< Bit mask of VTST field.            */
  #define VREGMRAM_DFT_ATB0CONFIG_VTST_Min (0x0UL)   /*!< Min enumerator value of VTST field.                                  */
  #define VREGMRAM_DFT_ATB0CONFIG_VTST_Max (0x1UL)   /*!< Max enumerator value of VTST field.                                  */
  #define VREGMRAM_DFT_ATB0CONFIG_VTST_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGMRAM_DFT_ATB0CONFIG_VTST_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* SELMUX @Bits 0..3 : SELMUX 4-bit single signal */
  #define VREGMRAM_DFT_ATB0CONFIG_SELMUX_Pos (0UL)   /*!< Position of SELMUX field.                                            */
  #define VREGMRAM_DFT_ATB0CONFIG_SELMUX_Msk (0xFUL << VREGMRAM_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.      */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGMRAM_DFT_ATB0CONFIG_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMRAM_DFT_ATB0CONFIG_EN_Msk (0x1UL << VREGMRAM_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMRAM_DFT_ATB0CONFIG_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMRAM_DFT_ATB0CONFIG_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMRAM_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                         */
  #define VREGMRAM_DFT_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                           */


/* VREGMRAM_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VREGMRAM_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                           */

/* TSTBFMUX @Bit 0 : TST_BF MUX */
  #define VREGMRAM_DFT_ATB1CONFIG_TSTBFMUX_Pos (0UL) /*!< Position of TSTBFMUX field.                                          */
  #define VREGMRAM_DFT_ATB1CONFIG_TSTBFMUX_Msk (0x1UL << VREGMRAM_DFT_ATB1CONFIG_TSTBFMUX_Pos) /*!< Bit mask of TSTBFMUX field.*/
  #define VREGMRAM_DFT_ATB1CONFIG_TSTBFMUX_Min (0x0UL) /*!< Min enumerator value of TSTBFMUX field.                            */
  #define VREGMRAM_DFT_ATB1CONFIG_TSTBFMUX_Max (0x1UL) /*!< Max enumerator value of TSTBFMUX field.                            */
  #define VREGMRAM_DFT_ATB1CONFIG_TSTBFMUX_Disabled (0x0UL) /*!< (unspecified)                                                 */
  #define VREGMRAM_DFT_ATB1CONFIG_TSTBFMUX_Enabled (0x1UL) /*!< (unspecified)                                                  */

/* VREF @Bit 1 : VREF 0V6 */
  #define VREGMRAM_DFT_ATB1CONFIG_VREF_Pos (1UL)     /*!< Position of VREF field.                                              */
  #define VREGMRAM_DFT_ATB1CONFIG_VREF_Msk (0x1UL << VREGMRAM_DFT_ATB1CONFIG_VREF_Pos) /*!< Bit mask of VREF field.            */
  #define VREGMRAM_DFT_ATB1CONFIG_VREF_Min (0x0UL)   /*!< Min enumerator value of VREF field.                                  */
  #define VREGMRAM_DFT_ATB1CONFIG_VREF_Max (0x1UL)   /*!< Max enumerator value of VREF field.                                  */
  #define VREGMRAM_DFT_ATB1CONFIG_VREF_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGMRAM_DFT_ATB1CONFIG_VREF_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* VPR @Bit 2 : VPR 1V2 */
  #define VREGMRAM_DFT_ATB1CONFIG_VPR_Pos (2UL)      /*!< Position of VPR field.                                               */
  #define VREGMRAM_DFT_ATB1CONFIG_VPR_Msk (0x1UL << VREGMRAM_DFT_ATB1CONFIG_VPR_Pos) /*!< Bit mask of VPR field.               */
  #define VREGMRAM_DFT_ATB1CONFIG_VPR_Min (0x0UL)    /*!< Min enumerator value of VPR field.                                   */
  #define VREGMRAM_DFT_ATB1CONFIG_VPR_Max (0x1UL)    /*!< Max enumerator value of VPR field.                                   */
  #define VREGMRAM_DFT_ATB1CONFIG_VPR_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define VREGMRAM_DFT_ATB1CONFIG_VPR_Enabled (0x1UL) /*!< (unspecified)                                                       */

