adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGMRAM_STATUSANA: Status of analog module output signals */
  #define VREGMRAM_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                 */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VREGMRAM_STATUSANA_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VREGMRAM_STATUSANA_READY_Msk (0x1UL << VREGMRAM_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                   */


/* VREGMRAM_MIRROR: Enable LOCK for mirrored registers */
  #define VREGMRAM_MIRROR_ResetValue (0x00000001UL)  /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VREGMRAM_MIRROR_LOCK_Pos (0UL)             /*!< Position of LOCK field.                                              */
  #define VREGMRAM_MIRROR_LOCK_Msk (0x1UL << VREGMRAM_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                            */
  #define VREGMRAM_MIRROR_LOCK_Min (0x0UL)           /*!< Min enumerator value of LOCK field.                                  */
  #define VREGMRAM_MIRROR_LOCK_Max (0x1UL)           /*!< Max enumerator value of LOCK field.                                  */
  #define VREGMRAM_MIRROR_LOCK_Disabled (0x0UL)      /*!< Lock disabled                                                        */
  #define VREGMRAM_MIRROR_LOCK_Enabled (0x1UL)       /*!< Lock enabled                                                         */


/* VREGMRAM_VPRBLEED: Enable VPR output load current */
  #define VREGMRAM_VPRBLEED_ResetValue (0x00000001UL) /*!< Reset value of VPRBLEED register.                                   */

/* EN @Bit 0 : Enable */
  #define VREGMRAM_VPRBLEED_EN_Pos (0UL)             /*!< Position of EN field.                                                */
  #define VREGMRAM_VPRBLEED_EN_Msk (0x1UL << VREGMRAM_VPRBLEED_EN_Pos) /*!< Bit mask of EN field.                              */
  #define VREGMRAM_VPRBLEED_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define VREGMRAM_VPRBLEED_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define VREGMRAM_VPRBLEED_EN_Disabled (0x0UL)      /*!< VPR output load current disabled                                     */
  #define VREGMRAM_VPRBLEED_EN_Enabled (0x1UL)       /*!< VPR output load current enabled                                      */


/* VREGMRAM_VREFADAPTIVEBIAS: Adaptive bias enable for VREF */
  #define VREGMRAM_VREFADAPTIVEBIAS_ResetValue (0x00000001UL) /*!< Reset value of VREFADAPTIVEBIAS register.                   */

/* EN @Bit 0 : Enable */
  #define VREGMRAM_VREFADAPTIVEBIAS_EN_Pos (0UL)     /*!< Position of EN field.                                                */
  #define VREGMRAM_VREFADAPTIVEBIAS_EN_Msk (0x1UL << VREGMRAM_VREFADAPTIVEBIAS_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGMRAM_VREFADAPTIVEBIAS_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGMRAM_VREFADAPTIVEBIAS_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGMRAM_VREFADAPTIVEBIAS_EN_Disabled (0x0UL) /*!< Adaptive bias is disabled                                         */
  #define VREGMRAM_VREFADAPTIVEBIAS_EN_Enabled (0x1UL) /*!< Adaptive bias is enabled                                           */


/* VREGMRAM_VPRADAPTIVEBIAS: Adaptive bias enable for VPR */
  #define VREGMRAM_VPRADAPTIVEBIAS_ResetValue (0x00000001UL) /*!< Reset value of VPRADAPTIVEBIAS register.                     */

/* EN @Bit 0 : Enable */
  #define VREGMRAM_VPRADAPTIVEBIAS_EN_Pos (0UL)      /*!< Position of EN field.                                                */
  #define VREGMRAM_VPRADAPTIVEBIAS_EN_Msk (0x1UL << VREGMRAM_VPRADAPTIVEBIAS_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGMRAM_VPRADAPTIVEBIAS_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGMRAM_VPRADAPTIVEBIAS_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGMRAM_VPRADAPTIVEBIAS_EN_Disabled (0x0UL) /*!< Adaptive bias is disabled                                          */
  #define VREGMRAM_VPRADAPTIVEBIAS_EN_Enabled (0x1UL) /*!< Adaptive bias is enabled                                            */


/* VREGMRAM_MODE: MRAM regulator mode */
  #define VREGMRAM_MODE_ResetValue (0x00000000UL)    /*!< Reset value of MODE register.                                        */

/* MODE @Bit 0 : Enable */
  #define VREGMRAM_MODE_MODE_Pos (0UL)               /*!< Position of MODE field.                                              */
  #define VREGMRAM_MODE_MODE_Msk (0x1UL << VREGMRAM_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                */
  #define VREGMRAM_MODE_MODE_Min (0x0UL)             /*!< Min enumerator value of MODE field.                                  */
  #define VREGMRAM_MODE_MODE_Max (0x1UL)             /*!< Max enumerator value of MODE field.                                  */
  #define VREGMRAM_MODE_MODE_Normal (0x0UL)          /*!< Normal mode                                                          */
  #define VREGMRAM_MODE_MODE_Retain (0x1UL)          /*!< Retain mode                                                          */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VREGSU                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct VREGSU_DFT ==================================================== */
/**
  * @brief DFT [VREGSU_DFT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
} NRF_VREGSU_DFT_Type;                               /*!< Size = 8 (0x008)                                                     */

/* VREGSU_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VREGSU_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                             */

/* SELMUX @Bit 0 : Select multiplexer for ATB1 */
  #define VREGSU_DFT_ATB1CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define VREGSU_DFT_ATB1CONFIG_SELMUX_Msk (0x1UL << VREGSU_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define VREGSU_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define VREGSU_DFT_ATB1CONFIG_SELMUX_Max (0x1UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define VREGSU_DFT_ATB1CONFIG_SELMUX_Spare0 (0x0UL) /*!< HiZ. For future use                                                 */
  #define VREGSU_DFT_ATB1CONFIG_SELMUX_VFB1V2 (0x1UL) /*!< VDD_AO_1V8 scaled by 2/3                                            */

