adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define VREGSU_DFT_ATB1CONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define VREGSU_DFT_ATB1CONFIG_EN_Msk (0x1UL << VREGSU_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define VREGSU_DFT_ATB1CONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define VREGSU_DFT_ATB1CONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define VREGSU_DFT_ATB1CONFIG_EN_Disabled (0x0UL)  /*!< Analog test bus is disabled                                          */
  #define VREGSU_DFT_ATB1CONFIG_EN_Enabled (0x1UL)   /*!< Analog test bus is enabled                                           */


/* ====================================================== Struct VREGSU ====================================================== */
/**
  * @brief VREGSU peripheral
  */
  typedef struct {                                   /*!< VREGSU Structure                                                     */
    __IM uint32_t RESERVED[288];
    __IOM uint32_t PWRUPCTRL;                        /*!< (@ 0x00000480) Power up control                                      */
    __IM uint32_t RESERVED1[95];
    __IOM NRF_VREGSU_DFT_Type DFT;                   /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VREGSU_Type;                                 /*!< Size = 1544 (0x608)                                                  */

/* VREGSU_PWRUPCTRL: Power up control */
  #define VREGSU_PWRUPCTRL_ResetValue (0x00000000UL) /*!< Reset value of PWRUPCTRL register.                                   */

/* CTRL @Bit 0 : Power up control */
  #define VREGSU_PWRUPCTRL_CTRL_Pos (0UL)            /*!< Position of CTRL field.                                              */
  #define VREGSU_PWRUPCTRL_CTRL_Msk (0x1UL << VREGSU_PWRUPCTRL_CTRL_Pos) /*!< Bit mask of CTRL field.                          */
  #define VREGSU_PWRUPCTRL_CTRL_Min (0x0UL)          /*!< Min enumerator value of CTRL field.                                  */
  #define VREGSU_PWRUPCTRL_CTRL_Max (0x1UL)          /*!< Max enumerator value of CTRL field.                                  */
  #define VREGSU_PWRUPCTRL_CTRL_PowerDown (0x0UL)    /*!< Power down                                                           */
  #define VREGSU_PWRUPCTRL_CTRL_PowerUp (0x1UL)      /*!< Power up                                                             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VREGUSB                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct VREGUSB_CONFIG ================================================== */
/**
  * @brief CONFIG [VREGUSB_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RDYTIM;                            /*!< (@ 0x00000000) Time from pwrupPm to ready signal (0us-3us)           */
  __IOM uint32_t  VBRFT;                             /*!< (@ 0x00000004) Time from VBUSDETRAW until filtered VBUSDET
                                                                         (0us-500us)*/
  __IOM uint32_t  RDYLDOSTIM;                        /*!< (@ 0x00000008) Time from powerup LDOs until ready (0us-10us)         */
  __IOM uint32_t  SETL0V8TIM;                        /*!< (@ 0x0000000C) Time from LDOs ready to SETTLED0V8 (125us-1000us)     */
  __IOM uint32_t  SETL3V3TIM;                        /*!< (@ 0x00000010) Time from SETTLED0V8 to SETTLED3V3 (0us-1000us)       */
  __IOM uint32_t  WUEXT;                             /*!< (@ 0x00000014) Prolong of the wakeup pulse. 2+VAL clock cycles min
                                                                         length of the pulse.*/
} NRF_VREGUSB_CONFIG_Type;                           /*!< Size = 24 (0x018)                                                    */

/* VREGUSB_CONFIG_RDYTIM: Time from pwrupPm to ready signal (0us-3us) */
  #define VREGUSB_CONFIG_RDYTIM_ResetValue (0x00000018UL) /*!< Reset value of RDYTIM register.                                 */

/* VAL @Bits 0..5 : Timer value */
  #define VREGUSB_CONFIG_RDYTIM_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VREGUSB_CONFIG_RDYTIM_VAL_Msk (0x3FUL << VREGUSB_CONFIG_RDYTIM_VAL_Pos) /*!< Bit mask of VAL field.                  */
  #define VREGUSB_CONFIG_RDYTIM_VAL_Min (0x00UL)     /*!< 0 us                                                                 */
  #define VREGUSB_CONFIG_RDYTIM_VAL_Default (0x18UL) /*!< 1.5 us                                                               */
  #define VREGUSB_CONFIG_RDYTIM_VAL_Max (0x30UL)     /*!< 3 us                                                                 */


/* VREGUSB_CONFIG_VBRFT: Time from VBUSDETRAW until filtered VBUSDET (0us-500us) */
  #define VREGUSB_CONFIG_VBRFT_ResetValue (0x000000A0UL) /*!< Reset value of VBRFT register.                                   */

/* VAL @Bits 0..12 : Timer value */
  #define VREGUSB_CONFIG_VBRFT_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGUSB_CONFIG_VBRFT_VAL_Msk (0x1FFFUL << VREGUSB_CONFIG_VBRFT_VAL_Pos) /*!< Bit mask of VAL field.                  */
  #define VREGUSB_CONFIG_VBRFT_VAL_Min (0x0000UL)    /*!< 0 us                                                                 */
  #define VREGUSB_CONFIG_VBRFT_VAL_Default (0x00A0UL) /*!< 10 us                                                               */
  #define VREGUSB_CONFIG_VBRFT_VAL_Max (0x1F40UL)    /*!< 500 us                                                               */


/* VREGUSB_CONFIG_RDYLDOSTIM: Time from powerup LDOs until ready (0us-10us) */
  #define VREGUSB_CONFIG_RDYLDOSTIM_ResetValue (0x00000010UL) /*!< Reset value of RDYLDOSTIM register.                         */

/* VAL @Bits 0..7 : Timer value */
  #define VREGUSB_CONFIG_RDYLDOSTIM_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGUSB_CONFIG_RDYLDOSTIM_VAL_Msk (0xFFUL << VREGUSB_CONFIG_RDYLDOSTIM_VAL_Pos) /*!< Bit mask of VAL field.          */
  #define VREGUSB_CONFIG_RDYLDOSTIM_VAL_Min (0x00UL) /*!< 0 us                                                                 */
  #define VREGUSB_CONFIG_RDYLDOSTIM_VAL_Default (0x0AUL) /*!< 1 us                                                             */
  #define VREGUSB_CONFIG_RDYLDOSTIM_VAL_Max (0xA0UL) /*!< 10 us                                                                */


