adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* TESTVBUSDET @Bit 2 : VBUS det test */
  #define VREGUSB_DFT_TCFG_TESTVBUSDET_Pos (2UL)     /*!< Position of TESTVBUSDET field.                                       */
  #define VREGUSB_DFT_TCFG_TESTVBUSDET_Msk (0x1UL << VREGUSB_DFT_TCFG_TESTVBUSDET_Pos) /*!< Bit mask of TESTVBUSDET field.     */
  #define VREGUSB_DFT_TCFG_TESTVBUSDET_Min (0x0UL)   /*!< Min enumerator value of TESTVBUSDET field.                           */
  #define VREGUSB_DFT_TCFG_TESTVBUSDET_Max (0x1UL)   /*!< Max enumerator value of TESTVBUSDET field.                           */
  #define VREGUSB_DFT_TCFG_TESTVBUSDET_Disabled (0x0UL) /*!< Normal operation                                                  */
  #define VREGUSB_DFT_TCFG_TESTVBUSDET_Enabled (0x1UL) /*!< Test mode enabled                                                  */

/* TESTIBP @Bit 3 : IBP test */
  #define VREGUSB_DFT_TCFG_TESTIBP_Pos (3UL)         /*!< Position of TESTIBP field.                                           */
  #define VREGUSB_DFT_TCFG_TESTIBP_Msk (0x1UL << VREGUSB_DFT_TCFG_TESTIBP_Pos) /*!< Bit mask of TESTIBP field.                 */
  #define VREGUSB_DFT_TCFG_TESTIBP_Min (0x0UL)       /*!< Min enumerator value of TESTIBP field.                               */
  #define VREGUSB_DFT_TCFG_TESTIBP_Max (0x1UL)       /*!< Max enumerator value of TESTIBP field.                               */
  #define VREGUSB_DFT_TCFG_TESTIBP_Disabled (0x0UL)  /*!< Normal operation                                                     */
  #define VREGUSB_DFT_TCFG_TESTIBP_Enabled (0x1UL)   /*!< Test mode enabled                                                    */


/* ===================================================== Struct VREGUSB ====================================================== */
/**
  * @brief VREGUSB peripheral
  */
  typedef struct {                                   /*!< VREGUSB Structure                                                    */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Request power up of USB PM                            */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop requesting power up of USB PM                    */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_VBUSDETECTEDRAW;           /*!< (@ 0x00000100) VBUS detected                                         */
    __IOM uint32_t EVENTS_VBUSDETECTED;              /*!< (@ 0x00000104) VBUS detected                                         */
    __IOM uint32_t EVENTS_SETTLED0V8;                /*!< (@ 0x00000108) 0V8 settled                                           */
    __IOM uint32_t EVENTS_SETTLED3V3;                /*!< (@ 0x0000010C) 3V3 settled                                           */
    __IOM uint32_t EVENTS_VBUSREMOVED;               /*!< (@ 0x00000110) VBUS removed                                          */
    __IM uint32_t RESERVED1[123];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Status of USB PM                                      */
    __IM uint32_t RESERVED3[3];
    __IOM NRF_VREGUSB_CONFIG_Type CONFIG;            /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[6];
    __IOM NRF_VREGUSB_TRIM_Type TRIM;                /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[12];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t PWRUP;                            /*!< (@ 0x00000484) Power up USB PM                                       */
    __IOM uint32_t PWRUP0V8;                         /*!< (@ 0x00000488) Power up 0V8                                          */
    __IOM uint32_t PWRUP3V3;                         /*!< (@ 0x0000048C) Power up 3V3                                          */
    __IM uint32_t RESERVED6[28];
    __IOM NRF_VREGUSB_OVERRIDE_Type OVERRIDE;        /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[60];
    __IOM NRF_VREGUSB_DFT_Type DFT;                  /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VREGUSB_Type;                                /*!< Size = 1588 (0x634)                                                  */

/* VREGUSB_TASKS_START: Request power up of USB PM */
  #define VREGUSB_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                              */

/* TASKS_START @Bit 0 : Request power up of USB PM */
  #define VREGUSB_TASKS_START_TASKS_START_Pos (0UL)  /*!< Position of TASKS_START field.                                       */
  #define VREGUSB_TASKS_START_TASKS_START_Msk (0x1UL << VREGUSB_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START
                                                                            field.*/
  #define VREGUSB_TASKS_START_TASKS_START_Min (0x1UL) /*!< Min enumerator value of TASKS_START field.                          */
  #define VREGUSB_TASKS_START_TASKS_START_Max (0x1UL) /*!< Max enumerator value of TASKS_START field.                          */
  #define VREGUSB_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                    */


/* VREGUSB_TASKS_STOP: Stop requesting power up of USB PM */
  #define VREGUSB_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                */

/* TASKS_STOP @Bit 0 : Stop requesting power up of USB PM */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Pos (0UL)    /*!< Position of TASKS_STOP field.                                        */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Msk (0x1UL << VREGUSB_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.    */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Min (0x1UL)  /*!< Min enumerator value of TASKS_STOP field.                            */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Max (0x1UL)  /*!< Max enumerator value of TASKS_STOP field.                            */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                      */


/* VREGUSB_EVENTS_VBUSDETECTEDRAW: VBUS detected */
  #define VREGUSB_EVENTS_VBUSDETECTEDRAW_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_VBUSDETECTEDRAW register.        */

/* EVENTS_VBUSDETECTEDRAW @Bit 0 : VBUS detected */
  #define VREGUSB_EVENTS_VBUSDETECTEDRAW_EVENTS_VBUSDETECTEDRAW_Pos (0UL) /*!< Position of EVENTS_VBUSDETECTEDRAW field.       */
  #define VREGUSB_EVENTS_VBUSDETECTEDRAW_EVENTS_VBUSDETECTEDRAW_Msk (0x1UL << VREGUSB_EVENTS_VBUSDETECTEDRAW_EVENTS_VBUSDETECTEDRAW_Pos)
                                                                            /*!< Bit mask of EVENTS_VBUSDETECTEDRAW field.*/
  #define VREGUSB_EVENTS_VBUSDETECTEDRAW_EVENTS_VBUSDETECTEDRAW_Min (0x0UL) /*!< Min enumerator value of EVENTS_VBUSDETECTEDRAW
                                                                            field.*/
  #define VREGUSB_EVENTS_VBUSDETECTEDRAW_EVENTS_VBUSDETECTEDRAW_Max (0x1UL) /*!< Max enumerator value of EVENTS_VBUSDETECTEDRAW
                                                                            field.*/
  #define VREGUSB_EVENTS_VBUSDETECTEDRAW_EVENTS_VBUSDETECTEDRAW_NotGenerated (0x0UL) /*!< Event not generated                  */
  #define VREGUSB_EVENTS_VBUSDETECTEDRAW_EVENTS_VBUSDETECTEDRAW_Generated (0x1UL) /*!< Event generated                         */


/* VREGUSB_EVENTS_VBUSDETECTED: VBUS detected */
  #define VREGUSB_EVENTS_VBUSDETECTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_VBUSDETECTED register.              */

