adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SETTLED3V3 @Bit 3 : Write '1' to enable interrupt for event SETTLED3V3 */
  #define VREGUSB_INTENSET_SETTLED3V3_Pos (3UL)      /*!< Position of SETTLED3V3 field.                                        */
  #define VREGUSB_INTENSET_SETTLED3V3_Msk (0x1UL << VREGUSB_INTENSET_SETTLED3V3_Pos) /*!< Bit mask of SETTLED3V3 field.        */
  #define VREGUSB_INTENSET_SETTLED3V3_Min (0x0UL)    /*!< Min enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTENSET_SETTLED3V3_Max (0x1UL)    /*!< Max enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTENSET_SETTLED3V3_Set (0x1UL)    /*!< Enable                                                               */
  #define VREGUSB_INTENSET_SETTLED3V3_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VREGUSB_INTENSET_SETTLED3V3_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* VBUSREMOVED @Bit 4 : Write '1' to enable interrupt for event VBUSREMOVED */
  #define VREGUSB_INTENSET_VBUSREMOVED_Pos (4UL)     /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTENSET_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTENSET_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.     */
  #define VREGUSB_INTENSET_VBUSREMOVED_Min (0x0UL)   /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENSET_VBUSREMOVED_Max (0x1UL)   /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENSET_VBUSREMOVED_Set (0x1UL)   /*!< Enable                                                               */
  #define VREGUSB_INTENSET_VBUSREMOVED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGUSB_INTENSET_VBUSREMOVED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* VREGUSB_INTENCLR: Disable interrupt */
  #define VREGUSB_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                    */

/* VBUSDETECTEDRAW @Bit 0 : Write '1' to disable interrupt for event VBUSDETECTEDRAW */
  #define VREGUSB_INTENCLR_VBUSDETECTEDRAW_Pos (0UL) /*!< Position of VBUSDETECTEDRAW field.                                   */
  #define VREGUSB_INTENCLR_VBUSDETECTEDRAW_Msk (0x1UL << VREGUSB_INTENCLR_VBUSDETECTEDRAW_Pos) /*!< Bit mask of VBUSDETECTEDRAW
                                                                            field.*/
  #define VREGUSB_INTENCLR_VBUSDETECTEDRAW_Min (0x0UL) /*!< Min enumerator value of VBUSDETECTEDRAW field.                     */
  #define VREGUSB_INTENCLR_VBUSDETECTEDRAW_Max (0x1UL) /*!< Max enumerator value of VBUSDETECTEDRAW field.                     */
  #define VREGUSB_INTENCLR_VBUSDETECTEDRAW_Clear (0x1UL) /*!< Disable                                                          */
  #define VREGUSB_INTENCLR_VBUSDETECTEDRAW_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define VREGUSB_INTENCLR_VBUSDETECTEDRAW_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* VBUSDETECTED @Bit 1 : Write '1' to disable interrupt for event VBUSDETECTED */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Pos (1UL)    /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTENCLR_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.  */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Min (0x0UL)  /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Max (0x1UL)  /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Clear (0x1UL) /*!< Disable                                                             */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* SETTLED0V8 @Bit 2 : Write '1' to disable interrupt for event SETTLED0V8 */
  #define VREGUSB_INTENCLR_SETTLED0V8_Pos (2UL)      /*!< Position of SETTLED0V8 field.                                        */
  #define VREGUSB_INTENCLR_SETTLED0V8_Msk (0x1UL << VREGUSB_INTENCLR_SETTLED0V8_Pos) /*!< Bit mask of SETTLED0V8 field.        */
  #define VREGUSB_INTENCLR_SETTLED0V8_Min (0x0UL)    /*!< Min enumerator value of SETTLED0V8 field.                            */
  #define VREGUSB_INTENCLR_SETTLED0V8_Max (0x1UL)    /*!< Max enumerator value of SETTLED0V8 field.                            */
  #define VREGUSB_INTENCLR_SETTLED0V8_Clear (0x1UL)  /*!< Disable                                                              */
  #define VREGUSB_INTENCLR_SETTLED0V8_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VREGUSB_INTENCLR_SETTLED0V8_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* SETTLED3V3 @Bit 3 : Write '1' to disable interrupt for event SETTLED3V3 */
  #define VREGUSB_INTENCLR_SETTLED3V3_Pos (3UL)      /*!< Position of SETTLED3V3 field.                                        */
  #define VREGUSB_INTENCLR_SETTLED3V3_Msk (0x1UL << VREGUSB_INTENCLR_SETTLED3V3_Pos) /*!< Bit mask of SETTLED3V3 field.        */
  #define VREGUSB_INTENCLR_SETTLED3V3_Min (0x0UL)    /*!< Min enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTENCLR_SETTLED3V3_Max (0x1UL)    /*!< Max enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTENCLR_SETTLED3V3_Clear (0x1UL)  /*!< Disable                                                              */
  #define VREGUSB_INTENCLR_SETTLED3V3_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VREGUSB_INTENCLR_SETTLED3V3_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* VBUSREMOVED @Bit 4 : Write '1' to disable interrupt for event VBUSREMOVED */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Pos (4UL)     /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTENCLR_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.     */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Min (0x0UL)   /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Max (0x1UL)   /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Clear (0x1UL) /*!< Disable                                                              */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* VREGUSB_INTPEND: Pending interrupts */
  #define VREGUSB_INTPEND_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND register.                                     */

/* VBUSDETECTEDRAW @Bit 0 : Read pending status of interrupt for event VBUSDETECTEDRAW */
  #define VREGUSB_INTPEND_VBUSDETECTEDRAW_Pos (0UL)  /*!< Position of VBUSDETECTEDRAW field.                                   */
  #define VREGUSB_INTPEND_VBUSDETECTEDRAW_Msk (0x1UL << VREGUSB_INTPEND_VBUSDETECTEDRAW_Pos) /*!< Bit mask of VBUSDETECTEDRAW
                                                                            field.*/
  #define VREGUSB_INTPEND_VBUSDETECTEDRAW_Min (0x0UL) /*!< Min enumerator value of VBUSDETECTEDRAW field.                      */
  #define VREGUSB_INTPEND_VBUSDETECTEDRAW_Max (0x1UL) /*!< Max enumerator value of VBUSDETECTEDRAW field.                      */
  #define VREGUSB_INTPEND_VBUSDETECTEDRAW_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define VREGUSB_INTPEND_VBUSDETECTEDRAW_Pending (0x1UL) /*!< Read: Pending                                                   */

/* VBUSDETECTED @Bit 1 : Read pending status of interrupt for event VBUSDETECTED */
  #define VREGUSB_INTPEND_VBUSDETECTED_Pos (1UL)     /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTPEND_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTPEND_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.    */
  #define VREGUSB_INTPEND_VBUSDETECTED_Min (0x0UL)   /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTPEND_VBUSDETECTED_Max (0x1UL)   /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTPEND_VBUSDETECTED_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define VREGUSB_INTPEND_VBUSDETECTED_Pending (0x1UL) /*!< Read: Pending                                                      */

