adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* VREGUSB_PWRUP3V3: Power up 3V3 */
  #define VREGUSB_PWRUP3V3_ResetValue (0x00000000UL) /*!< Reset value of PWRUP3V3 register.                                    */

/* MANUAL @Bit 0 : Manual power mode configuration for 0V8 regulator */
  #define VREGUSB_PWRUP3V3_MANUAL_Pos (0UL)          /*!< Position of MANUAL field.                                            */
  #define VREGUSB_PWRUP3V3_MANUAL_Msk (0x1UL << VREGUSB_PWRUP3V3_MANUAL_Pos) /*!< Bit mask of MANUAL field.                    */
  #define VREGUSB_PWRUP3V3_MANUAL_Min (0x0UL)        /*!< Min enumerator value of MANUAL field.                                */
  #define VREGUSB_PWRUP3V3_MANUAL_Max (0x1UL)        /*!< Max enumerator value of MANUAL field.                                */
  #define VREGUSB_PWRUP3V3_MANUAL_Off (0x0UL)        /*!< USB 3V3 regulator powered down in manual mode                        */
  #define VREGUSB_PWRUP3V3_MANUAL_On (0x1UL)         /*!< USB 3V3 regulator powered up in manual mode                          */

/* AUTOMODE @Bit 1 : Automatic power mode configuration */
  #define VREGUSB_PWRUP3V3_AUTOMODE_Pos (1UL)        /*!< Position of AUTOMODE field.                                          */
  #define VREGUSB_PWRUP3V3_AUTOMODE_Msk (0x1UL << VREGUSB_PWRUP3V3_AUTOMODE_Pos) /*!< Bit mask of AUTOMODE field.              */
  #define VREGUSB_PWRUP3V3_AUTOMODE_Min (0x0UL)      /*!< Min enumerator value of AUTOMODE field.                              */
  #define VREGUSB_PWRUP3V3_AUTOMODE_Max (0x1UL)      /*!< Max enumerator value of AUTOMODE field.                              */
  #define VREGUSB_PWRUP3V3_AUTOMODE_Auto (0x0UL)     /*!< USB 3V3 regulator automatically powered                              */
  #define VREGUSB_PWRUP3V3_AUTOMODE_Manual (0x1UL)   /*!< USB 3V3 regulator manually powered                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VREGVS0V8                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VREGVS0V8_CONFIG ================================================= */
/**
  * @brief CONFIG [VREGVS0V8_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) Voltage regulator static CFG configuration            */
  __IOM uint32_t  CFGDYNAMIC;                        /*!< (@ 0x00000004) Voltage regulator dynamic CFG configuration           */
} NRF_VREGVS0V8_CONFIG_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VREGVS0V8_CONFIG_CFGSTATIC: Voltage regulator static CFG configuration */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ResetValue (0x00000000UL) /*!< Reset value of CFGSTATIC register.                         */

/* ULPRREFRESHCMPDIS @Bit 0 : Disable the ULPR refresh comparator */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Pos (0UL) /*!< Position of ULPRREFRESHCMPDIS field.                     */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Msk (0x1UL << VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Pos) /*!< Bit
                                                                            mask of ULPRREFRESHCMPDIS field.*/
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Min (0x0UL) /*!< Min enumerator value of ULPRREFRESHCMPDIS field.       */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Max (0x1UL) /*!< Max enumerator value of ULPRREFRESHCMPDIS field.       */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Disabled (0x0UL) /*!< Configuration disabled                            */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Enabled (0x1UL) /*!< Configuration enabled                              */

/* VREFTIMERDIV2 @Bit 1 : Divide the VREF timer by 2 */
  #define VREGVS0V8_CONFIG_CFGSTATIC_VREFTIMERDIV2_Pos (1UL) /*!< Position of VREFTIMERDIV2 field.                             */
  #define VREGVS0V8_CONFIG_CFGSTATIC_VREFTIMERDIV2_Msk (0x1UL << VREGVS0V8_CONFIG_CFGSTATIC_VREFTIMERDIV2_Pos) /*!< Bit mask of
                                                                            VREFTIMERDIV2 field.*/
  #define VREGVS0V8_CONFIG_CFGSTATIC_VREFTIMERDIV2_Min (0x0UL) /*!< Min enumerator value of VREFTIMERDIV2 field.               */
  #define VREGVS0V8_CONFIG_CFGSTATIC_VREFTIMERDIV2_Max (0x1UL) /*!< Max enumerator value of VREFTIMERDIV2 field.               */
  #define VREGVS0V8_CONFIG_CFGSTATIC_VREFTIMERDIV2_Disabled (0x0UL) /*!< Configuration disabled                                */
  #define VREGVS0V8_CONFIG_CFGSTATIC_VREFTIMERDIV2_Enabled (0x1UL) /*!< Configuration enabled                                  */

/* ULPRREFRESHDIV2 @Bit 2 : Divide the ULPR refresh timer by 2 */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Pos (2UL) /*!< Position of ULPRREFRESHDIV2 field.                         */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Msk (0x1UL << VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Pos) /*!< Bit mask
                                                                            of ULPRREFRESHDIV2 field.*/
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Min (0x0UL) /*!< Min enumerator value of ULPRREFRESHDIV2 field.           */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Max (0x1UL) /*!< Max enumerator value of ULPRREFRESHDIV2 field.           */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Disabled (0x0UL) /*!< Configuration disabled                              */
  #define VREGVS0V8_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Enabled (0x1UL) /*!< Configuration enabled                                */

/* CURRCMPDIS @Bit 3 : Disable the current comparator */
  #define VREGVS0V8_CONFIG_CFGSTATIC_CURRCMPDIS_Pos (3UL) /*!< Position of CURRCMPDIS field.                                   */
  #define VREGVS0V8_CONFIG_CFGSTATIC_CURRCMPDIS_Msk (0x1UL << VREGVS0V8_CONFIG_CFGSTATIC_CURRCMPDIS_Pos) /*!< Bit mask of
                                                                            CURRCMPDIS field.*/
  #define VREGVS0V8_CONFIG_CFGSTATIC_CURRCMPDIS_Min (0x0UL) /*!< Min enumerator value of CURRCMPDIS field.                     */
  #define VREGVS0V8_CONFIG_CFGSTATIC_CURRCMPDIS_Max (0x1UL) /*!< Max enumerator value of CURRCMPDIS field.                     */
  #define VREGVS0V8_CONFIG_CFGSTATIC_CURRCMPDIS_Disabled (0x0UL) /*!< Configuration disabled                                   */
  #define VREGVS0V8_CONFIG_CFGSTATIC_CURRCMPDIS_Enabled (0x1UL) /*!< Configuration enabled                                     */

