adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LPDOUBLEBIAS @Bit 4 : Double the LP core bias current */
  #define VREGVS0V8_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Pos (4UL) /*!< Position of LPDOUBLEBIAS field.                               */
  #define VREGVS0V8_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Msk (0x1UL << VREGVS0V8_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Pos) /*!< Bit mask of
                                                                            LPDOUBLEBIAS field.*/
  #define VREGVS0V8_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Min (0x0UL) /*!< Min enumerator value of LPDOUBLEBIAS field.                 */
  #define VREGVS0V8_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Max (0x1UL) /*!< Max enumerator value of LPDOUBLEBIAS field.                 */
  #define VREGVS0V8_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Disabled (0x0UL) /*!< Configuration disabled                                 */
  #define VREGVS0V8_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Enabled (0x1UL) /*!< Configuration enabled                                   */


/* VREGVS0V8_CONFIG_CFGDYNAMIC: Voltage regulator dynamic CFG configuration */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ResetValue (0x00000020UL) /*!< Reset value of CFGDYNAMIC register.                       */

/* AUTOILIM @Bit 0 : Current limit auto mode */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_AUTOILIM_Pos (0UL) /*!< Position of AUTOILIM field.                                      */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_AUTOILIM_Msk (0x1UL << VREGVS0V8_CONFIG_CFGDYNAMIC_AUTOILIM_Pos) /*!< Bit mask of AUTOILIM
                                                                            field.*/
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_AUTOILIM_Min (0x0UL) /*!< Min enumerator value of AUTOILIM field.                        */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_AUTOILIM_Max (0x1UL) /*!< Max enumerator value of AUTOILIM field.                        */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_AUTOILIM_Disabled (0x0UL) /*!< Auto mode disabled                                        */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_AUTOILIM_Enabled (0x1UL) /*!< Auto mode enabled                                          */

/* ILIMVAL @Bits 4..5 : Current limit configuration */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_Pos (4UL) /*!< Position of ILIMVAL field.                                        */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_Msk (0x3UL << VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_Pos) /*!< Bit mask of ILIMVAL
                                                                            field.*/
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_Min (0x0UL) /*!< Min enumerator value of ILIMVAL field.                          */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_Max (0x3UL) /*!< Max enumerator value of ILIMVAL field.                          */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_Normal (0x0UL) /*!< Normal operation                                             */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_IlimHigh (0x1UL) /*!< High soft start limit                                      */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_IlimMid (0x2UL) /*!< WU soft start                                               */
  #define VREGVS0V8_CONFIG_CFGDYNAMIC_ILIMVAL_IlimLow (0x3UL) /*!< Reset current limit                                         */



/* ================================================== Struct VREGVS0V8_TRIM ================================================== */
/**
  * @brief TRIM [VREGVS0V8_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  IREF;                              /*!< (@ 0x00000000) Local current reference trimming                      */
  __IOM uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) High power mode output voltage offset trimming        */
  __IOM uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Low power mode output voltage offset trimming         */
  __IOM uint32_t  ULPR;                              /*!< (@ 0x0000000C) ULPR mode comparator offset trimming                  */
} NRF_VREGVS0V8_TRIM_Type;                           /*!< Size = 16 (0x010)                                                    */

/* VREGVS0V8_TRIM_IREF: Local current reference trimming */
  #define VREGVS0V8_TRIM_IREF_ResetValue (0x00000008UL) /*!< Reset value of IREF register.                                     */

/* VAL @Bits 0..6 : Current reference trimming value */
  #define VREGVS0V8_TRIM_IREF_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREGVS0V8_TRIM_IREF_VAL_Msk (0x7FUL << VREGVS0V8_TRIM_IREF_VAL_Pos) /*!< Bit mask of VAL field.                      */


/* VREGVS0V8_TRIM_HIGHPOWER: High power mode output voltage offset trimming */
  #define VREGVS0V8_TRIM_HIGHPOWER_ResetValue (0x00000000UL) /*!< Reset value of HIGHPOWER register.                           */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREGVS0V8_TRIM_HIGHPOWER_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGVS0V8_TRIM_HIGHPOWER_VAL_Msk (0xFUL << VREGVS0V8_TRIM_HIGHPOWER_VAL_Pos) /*!< Bit mask of VAL field.             */


/* VREGVS0V8_TRIM_LOWPOWER: Low power mode output voltage offset trimming */
  #define VREGVS0V8_TRIM_LOWPOWER_ResetValue (0x00000000UL) /*!< Reset value of LOWPOWER register.                             */

/* VAL @Bits 0..3 : Voltage offset trimming value. */
  #define VREGVS0V8_TRIM_LOWPOWER_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGVS0V8_TRIM_LOWPOWER_VAL_Msk (0xFUL << VREGVS0V8_TRIM_LOWPOWER_VAL_Pos) /*!< Bit mask of VAL field.               */


/* VREGVS0V8_TRIM_ULPR: ULPR mode comparator offset trimming */
  #define VREGVS0V8_TRIM_ULPR_ResetValue (0x00000000UL) /*!< Reset value of ULPR register.                                     */

/* VAL @Bits 0..2 : Comparator offset trimming value. */
  #define VREGVS0V8_TRIM_ULPR_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREGVS0V8_TRIM_ULPR_VAL_Msk (0x7UL << VREGVS0V8_TRIM_ULPR_VAL_Pos) /*!< Bit mask of VAL field.                       */



