adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define VREGVS0V8_DFT_ATB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGVS0V8_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << VREGVS0V8_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGVS0V8_DFT_ATB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGVS0V8_DFT_ATB0CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGVS0V8_DFT_ATB0CONFIG_SELMUX_ExtVref (0x0UL) /*!< Negative input of calibration comparator                        */
  #define VREGVS0V8_DFT_ATB0CONFIG_SELMUX_Ibpp50n (0x1UL) /*!< Internal 50nA current reference                                 */
  #define VREGVS0V8_DFT_ATB0CONFIG_SELMUX_Ibpsr4u (0x2UL) /*!< Internal 4uA current reference                                  */
  #define VREGVS0V8_DFT_ATB0CONFIG_SELMUX_Ibpp50nIbpsr4u (0x3UL) /*!< Sum both internal current references                     */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGVS0V8_DFT_ATB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGVS0V8_DFT_ATB0CONFIG_EN_Msk (0x1UL << VREGVS0V8_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGVS0V8_DFT_ATB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_DFT_ATB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VREGVS0V8_DFT_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VREGVS0V8_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VREGVS0V8_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define VREGVS0V8_DFT_ATB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGVS0V8_DFT_ATB1CONFIG_SELMUX_Msk (0x3UL << VREGVS0V8_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGVS0V8_DFT_ATB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGVS0V8_DFT_ATB1CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGVS0V8_DFT_ATB1CONFIG_SELMUX_VSS (0x0UL) /*!< VSS                                                                 */
  #define VREGVS0V8_DFT_ATB1CONFIG_SELMUX_BufferedHPvref (0x1UL) /*!< Buffered HP vref                                         */
  #define VREGVS0V8_DFT_ATB1CONFIG_SELMUX_VDDVS0V8 (0x2UL) /*!< VDD_VS_0V8                                                     */
  #define VREGVS0V8_DFT_ATB1CONFIG_SELMUX_Ibpsr4u (0x3UL) /*!< Internal 4uA current reference, through 225kOhm resistor        */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGVS0V8_DFT_ATB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGVS0V8_DFT_ATB1CONFIG_EN_Msk (0x1UL << VREGVS0V8_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGVS0V8_DFT_ATB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_DFT_ATB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VREGVS0V8_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VREGVS0V8_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VREGVS0V8_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                          */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << VREGVS0V8_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_Max (0x7UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_Spare0 (0x0UL) /*!< None selected, logic 0                                           */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_RefreshULPR (0x1UL) /*!< ULPR refresh pulse                                          */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_SettledIBPSR (0x2UL) /*!< BIAS_IBPSR_4U_DVT settled signal                           */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_Spare1 (0x3UL) /*!< None selected, logic 0                                           */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_CurrCmp (0x4UL) /*!< Current comparator output                                       */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_ReqModeLP (0x5UL) /*!< LP mode request                                               */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_RegModeULPR (0x6UL) /*!< ULPR mode request                                           */
  #define VREGVS0V8_DFT_DTB0CONFIG_SELMUX_CalCmp (0x7UL) /*!< Calibration comparator output                                    */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGVS0V8_DFT_DTB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGVS0V8_DFT_DTB0CONFIG_EN_Msk (0x1UL << VREGVS0V8_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGVS0V8_DFT_DTB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_DFT_DTB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VREGVS0V8_DFT_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VREGVS0V8_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VREGVS0V8_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                          */

