adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* LPCANCELREQ @Bit 2 : Controls LDP_LP_CANCEL_REQ_AO_1V8 */
  #define VREGVS0V8_DFT_TCFG_LPCANCELREQ_Pos (2UL)   /*!< Position of LPCANCELREQ field.                                       */
  #define VREGVS0V8_DFT_TCFG_LPCANCELREQ_Msk (0x1UL << VREGVS0V8_DFT_TCFG_LPCANCELREQ_Pos) /*!< Bit mask of LPCANCELREQ field. */

/* MODELPREQ @Bit 3 : Controls MODE_LP_REQ_SW_1V8 */
  #define VREGVS0V8_DFT_TCFG_MODELPREQ_Pos (3UL)     /*!< Position of MODELPREQ field.                                         */
  #define VREGVS0V8_DFT_TCFG_MODELPREQ_Msk (0x1UL << VREGVS0V8_DFT_TCFG_MODELPREQ_Pos) /*!< Bit mask of MODELPREQ field.       */

/* MODEULPRREQ @Bit 4 : Controls MODE_ULPR_REQ_SW_1V8 */
  #define VREGVS0V8_DFT_TCFG_MODEULPRREQ_Pos (4UL)   /*!< Position of MODEULPRREQ field.                                       */
  #define VREGVS0V8_DFT_TCFG_MODEULPRREQ_Msk (0x1UL << VREGVS0V8_DFT_TCFG_MODEULPRREQ_Pos) /*!< Bit mask of MODEULPRREQ field. */

/* PWRUPIBPP @Bit 5 : Controls PWRUP_IBPP_BIAS_SW_1V8 */
  #define VREGVS0V8_DFT_TCFG_PWRUPIBPP_Pos (5UL)     /*!< Position of PWRUPIBPP field.                                         */
  #define VREGVS0V8_DFT_TCFG_PWRUPIBPP_Msk (0x1UL << VREGVS0V8_DFT_TCFG_PWRUPIBPP_Pos) /*!< Bit mask of PWRUPIBPP field.       */

/* PWRUPLP @Bit 6 : Controls PWRUP_LDO_LP_AO_1V8 */
  #define VREGVS0V8_DFT_TCFG_PWRUPLP_Pos (6UL)       /*!< Position of PWRUPLP field.                                           */
  #define VREGVS0V8_DFT_TCFG_PWRUPLP_Msk (0x1UL << VREGVS0V8_DFT_TCFG_PWRUPLP_Pos) /*!< Bit mask of PWRUPLP field.             */

/* PWRUPHP @Bit 7 : Controls PWRUP_LDO_HP_AO_1V8 */
  #define VREGVS0V8_DFT_TCFG_PWRUPHP_Pos (7UL)       /*!< Position of PWRUPHP field.                                           */
  #define VREGVS0V8_DFT_TCFG_PWRUPHP_Msk (0x1UL << VREGVS0V8_DFT_TCFG_PWRUPHP_Pos) /*!< Bit mask of PWRUPHP field.             */

/* PWRUPIBPSR @Bit 8 : Controls PWRUP_IBPSR_BIAS_SW_1V8 */
  #define VREGVS0V8_DFT_TCFG_PWRUPIBPSR_Pos (8UL)    /*!< Position of PWRUPIBPSR field.                                        */
  #define VREGVS0V8_DFT_TCFG_PWRUPIBPSR_Msk (0x1UL << VREGVS0V8_DFT_TCFG_PWRUPIBPSR_Pos) /*!< Bit mask of PWRUPIBPSR field.    */

/* TCFGENABLE @Bit 9 : Enable TCFG control */
  #define VREGVS0V8_DFT_TCFG_TCFGENABLE_Pos (9UL)    /*!< Position of TCFGENABLE field.                                        */
  #define VREGVS0V8_DFT_TCFG_TCFGENABLE_Msk (0x1UL << VREGVS0V8_DFT_TCFG_TCFGENABLE_Pos) /*!< Bit mask of TCFGENABLE field.    */

/* REFRESHCMPCLK @Bit 10 : Controls clock input of refresh comparator */
  #define VREGVS0V8_DFT_TCFG_REFRESHCMPCLK_Pos (10UL) /*!< Position of REFRESHCMPCLK field.                                    */
  #define VREGVS0V8_DFT_TCFG_REFRESHCMPCLK_Msk (0x1UL << VREGVS0V8_DFT_TCFG_REFRESHCMPCLK_Pos) /*!< Bit mask of REFRESHCMPCLK
                                                                            field.*/


/* VREGVS0V8_DFT_CALEN: Calibration enable */
  #define VREGVS0V8_DFT_CALEN_ResetValue (0x00000000UL) /*!< Reset value of CALEN register.                                    */

/* CALEN @Bit 0 : Calibration enable */
  #define VREGVS0V8_DFT_CALEN_CALEN_Pos (0UL)        /*!< Position of CALEN field.                                             */
  #define VREGVS0V8_DFT_CALEN_CALEN_Msk (0x1UL << VREGVS0V8_DFT_CALEN_CALEN_Pos) /*!< Bit mask of CALEN field.                 */
  #define VREGVS0V8_DFT_CALEN_CALEN_Min (0x0UL)      /*!< Min enumerator value of CALEN field.                                 */
  #define VREGVS0V8_DFT_CALEN_CALEN_Max (0x1UL)      /*!< Max enumerator value of CALEN field.                                 */
  #define VREGVS0V8_DFT_CALEN_CALEN_ATCMPOff (0x0UL) /*!< ATCMP Off                                                            */
  #define VREGVS0V8_DFT_CALEN_CALEN_ATCMPOn (0x1UL)  /*!< ATCMP ON                                                             */


/* VREGVS0V8_DFT_CALCMP: Calibration compare */
  #define VREGVS0V8_DFT_CALCMP_ResetValue (0x00000000UL) /*!< Reset value of CALCMP register.                                  */

/* CALCMP @Bit 0 : Calibration compare */
  #define VREGVS0V8_DFT_CALCMP_CALCMP_Pos (0UL)      /*!< Position of CALCMP field.                                            */
  #define VREGVS0V8_DFT_CALCMP_CALCMP_Msk (0x1UL << VREGVS0V8_DFT_CALCMP_CALCMP_Pos) /*!< Bit mask of CALCMP field.            */



/* =============================================== Struct VREGVS0V8_PCGCSLAVE ================================================ */
/**
  * @brief PCGCSLAVE [VREGVS0V8_PCGCSLAVE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PENALTY[2];                        /*!< (@ 0x00000000) Penalty level for power/clock pair n. When
                                                                         FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                                                         address overlaps the PENALTY0 address and register
                                                                         description for PENALTY[0] is not valid.*/
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  FORCEOVERRIDE[2];                  /*!< (@ 0x00000080) Force override of power/clock pair n.                 */
} NRF_VREGVS0V8_PCGCSLAVE_Type;                      /*!< Size = 136 (0x088)                                                   */

/* VREGVS0V8_PCGCSLAVE_PENALTY: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0]
                                 address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid. */

  #define VREGVS0V8_PCGCSLAVE_PENALTY_MaxCount (2UL) /*!< Max size of PENALTY[2] array.                                        */
  #define VREGVS0V8_PCGCSLAVE_PENALTY_MaxIndex (1UL) /*!< Max index of PENALTY[2] array.                                       */
  #define VREGVS0V8_PCGCSLAVE_PENALTY_MinIndex (0UL) /*!< Min index of PENALTY[2] array.                                       */
  #define VREGVS0V8_PCGCSLAVE_PENALTY_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PENALTY[2] register.                       */

/* PENALTY @Bits 0..1 : Penalty level */
  #define VREGVS0V8_PCGCSLAVE_PENALTY_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                        */
  #define VREGVS0V8_PCGCSLAVE_PENALTY_PENALTY_Msk (0x3UL << VREGVS0V8_PCGCSLAVE_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY
                                                                            field.*/


/* VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE: Force override of power/clock pair n. */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_MaxCount (2UL) /*!< Max size of FORCEOVERRIDE[2] array.                            */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_MaxIndex (1UL) /*!< Max index of FORCEOVERRIDE[2] array.                           */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_MinIndex (0UL) /*!< Min index of FORCEOVERRIDE[2] array.                           */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[2] register.           */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                  */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos)
                                                                            /*!< Bit mask of CLOCKFORCINGPRE field.*/

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                  */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos)
                                                                            /*!< Bit mask of DOFORCECLOCKPRE field.*/

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                  */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos)
                                                                            /*!< Bit mask of POWERFORCINGPRE field.*/

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                 */
  #define VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << VREGVS0V8_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos)
                                                                            /*!< Bit mask of DOFORCEPOWERPRE field.*/


/* ==================================================== Struct VREGVS0V8 ===================================================== */
/**
  * @brief VREGVS0V8 peripheral
  */
  typedef struct {                                   /*!< VREGVS0V8 Structure                                                  */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IOM uint32_t EVENTS_IOUTCMP;                   /*!< (@ 0x00000108) Analog current comparator                             */
    __IOM uint32_t EVENTS_LP2HP;                     /*!< (@ 0x0000010C) Current consumption above threshold                   */
    __IOM uint32_t EVENTS_HP2LP;                     /*!< (@ 0x00000110) Current consumption below threshold                   */
    __IM uint32_t RESERVED1[123];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Voltage regulator status                              */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_VREGVS0V8_CONFIG_Type CONFIG;          /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_VREGVS0V8_TRIM_Type TRIM;              /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[12];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t VOUTHP;                           /*!< (@ 0x00000484) High power mode output voltage programming            */
    __IOM uint32_t VOUTLP;                           /*!< (@ 0x00000488) Low power mode output voltage programming             */
    __IOM uint32_t MODE;                             /*!< (@ 0x0000048C) Voltage regulator mode                                */
    __IOM uint32_t ITHRESHOLD;                       /*!< (@ 0x00000490) Current threshold for mode transistion                */
    __IM uint32_t RESERVED6[27];
    __IOM NRF_VREGVS0V8_OVERRIDE_Type OVERRIDE;      /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[56];
    __IOM NRF_VREGVS0V8_DFT_Type DFT;                /*!< (@ 0x00000600) (unspecified)                                         */
    __IM uint32_t RESERVED8[561];
    __IOM NRF_VREGVS0V8_PCGCSLAVE_Type PCGCSLAVE;    /*!< (@ 0x00000F00) (unspecified)                                         */
  } NRF_VREGVS0V8_Type;                              /*!< Size = 3976 (0xF88)                                                  */

/* VREGVS0V8_EVENTS_READY: Power up done */
  #define VREGVS0V8_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                          */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VREGVS0V8_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                   */
  #define VREGVS0V8_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VREGVS0V8_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of
                                                                            EVENTS_READY field.*/
  #define VREGVS0V8_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                     */
  #define VREGVS0V8_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                     */
  #define VREGVS0V8_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define VREGVS0V8_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                           */


