adamkondraciuk/nrfx/mdk/nrf54h20_engb_types.h
/* RR0 @Bit 0 : Request status for RR[0] register */
  #define WDT_REQSTATUS_RR0_Pos (0UL)                /*!< Position of RR0 field.                                               */
  #define WDT_REQSTATUS_RR0_Msk (0x1UL << WDT_REQSTATUS_RR0_Pos) /*!< Bit mask of RR0 field.                                   */
  #define WDT_REQSTATUS_RR0_Min (0x0UL)              /*!< Min enumerator value of RR0 field.                                   */
  #define WDT_REQSTATUS_RR0_Max (0x1UL)              /*!< Max enumerator value of RR0 field.                                   */
  #define WDT_REQSTATUS_RR0_DisabledOrRequested (0x0UL) /*!< RR[0] register is not enabled, or are already requesting reload   */
  #define WDT_REQSTATUS_RR0_EnabledAndUnrequested (0x1UL) /*!< RR[0] register is enabled, and are not yet requesting reload    */

/* RR1 @Bit 1 : Request status for RR[1] register */
  #define WDT_REQSTATUS_RR1_Pos (1UL)                /*!< Position of RR1 field.                                               */
  #define WDT_REQSTATUS_RR1_Msk (0x1UL << WDT_REQSTATUS_RR1_Pos) /*!< Bit mask of RR1 field.                                   */
  #define WDT_REQSTATUS_RR1_Min (0x0UL)              /*!< Min enumerator value of RR1 field.                                   */
  #define WDT_REQSTATUS_RR1_Max (0x1UL)              /*!< Max enumerator value of RR1 field.                                   */
  #define WDT_REQSTATUS_RR1_DisabledOrRequested (0x0UL) /*!< RR[1] register is not enabled, or are already requesting reload   */
  #define WDT_REQSTATUS_RR1_EnabledAndUnrequested (0x1UL) /*!< RR[1] register is enabled, and are not yet requesting reload    */

/* RR2 @Bit 2 : Request status for RR[2] register */
  #define WDT_REQSTATUS_RR2_Pos (2UL)                /*!< Position of RR2 field.                                               */
  #define WDT_REQSTATUS_RR2_Msk (0x1UL << WDT_REQSTATUS_RR2_Pos) /*!< Bit mask of RR2 field.                                   */
  #define WDT_REQSTATUS_RR2_Min (0x0UL)              /*!< Min enumerator value of RR2 field.                                   */
  #define WDT_REQSTATUS_RR2_Max (0x1UL)              /*!< Max enumerator value of RR2 field.                                   */
  #define WDT_REQSTATUS_RR2_DisabledOrRequested (0x0UL) /*!< RR[2] register is not enabled, or are already requesting reload   */
  #define WDT_REQSTATUS_RR2_EnabledAndUnrequested (0x1UL) /*!< RR[2] register is enabled, and are not yet requesting reload    */

/* RR3 @Bit 3 : Request status for RR[3] register */
  #define WDT_REQSTATUS_RR3_Pos (3UL)                /*!< Position of RR3 field.                                               */
  #define WDT_REQSTATUS_RR3_Msk (0x1UL << WDT_REQSTATUS_RR3_Pos) /*!< Bit mask of RR3 field.                                   */
  #define WDT_REQSTATUS_RR3_Min (0x0UL)              /*!< Min enumerator value of RR3 field.                                   */
  #define WDT_REQSTATUS_RR3_Max (0x1UL)              /*!< Max enumerator value of RR3 field.                                   */
  #define WDT_REQSTATUS_RR3_DisabledOrRequested (0x0UL) /*!< RR[3] register is not enabled, or are already requesting reload   */
  #define WDT_REQSTATUS_RR3_EnabledAndUnrequested (0x1UL) /*!< RR[3] register is enabled, and are not yet requesting reload    */

/* RR4 @Bit 4 : Request status for RR[4] register */
  #define WDT_REQSTATUS_RR4_Pos (4UL)                /*!< Position of RR4 field.                                               */
  #define WDT_REQSTATUS_RR4_Msk (0x1UL << WDT_REQSTATUS_RR4_Pos) /*!< Bit mask of RR4 field.                                   */
  #define WDT_REQSTATUS_RR4_Min (0x0UL)              /*!< Min enumerator value of RR4 field.                                   */
  #define WDT_REQSTATUS_RR4_Max (0x1UL)              /*!< Max enumerator value of RR4 field.                                   */
  #define WDT_REQSTATUS_RR4_DisabledOrRequested (0x0UL) /*!< RR[4] register is not enabled, or are already requesting reload   */
  #define WDT_REQSTATUS_RR4_EnabledAndUnrequested (0x1UL) /*!< RR[4] register is enabled, and are not yet requesting reload    */

/* RR5 @Bit 5 : Request status for RR[5] register */
  #define WDT_REQSTATUS_RR5_Pos (5UL)                /*!< Position of RR5 field.                                               */
  #define WDT_REQSTATUS_RR5_Msk (0x1UL << WDT_REQSTATUS_RR5_Pos) /*!< Bit mask of RR5 field.                                   */
  #define WDT_REQSTATUS_RR5_Min (0x0UL)              /*!< Min enumerator value of RR5 field.                                   */
  #define WDT_REQSTATUS_RR5_Max (0x1UL)              /*!< Max enumerator value of RR5 field.                                   */
  #define WDT_REQSTATUS_RR5_DisabledOrRequested (0x0UL) /*!< RR[5] register is not enabled, or are already requesting reload   */
  #define WDT_REQSTATUS_RR5_EnabledAndUnrequested (0x1UL) /*!< RR[5] register is enabled, and are not yet requesting reload    */

/* RR6 @Bit 6 : Request status for RR[6] register */
  #define WDT_REQSTATUS_RR6_Pos (6UL)                /*!< Position of RR6 field.                                               */
  #define WDT_REQSTATUS_RR6_Msk (0x1UL << WDT_REQSTATUS_RR6_Pos) /*!< Bit mask of RR6 field.                                   */
  #define WDT_REQSTATUS_RR6_Min (0x0UL)              /*!< Min enumerator value of RR6 field.                                   */
  #define WDT_REQSTATUS_RR6_Max (0x1UL)              /*!< Max enumerator value of RR6 field.                                   */
  #define WDT_REQSTATUS_RR6_DisabledOrRequested (0x0UL) /*!< RR[6] register is not enabled, or are already requesting reload   */
  #define WDT_REQSTATUS_RR6_EnabledAndUnrequested (0x1UL) /*!< RR[6] register is enabled, and are not yet requesting reload    */

/* RR7 @Bit 7 : Request status for RR[7] register */
  #define WDT_REQSTATUS_RR7_Pos (7UL)                /*!< Position of RR7 field.                                               */
  #define WDT_REQSTATUS_RR7_Msk (0x1UL << WDT_REQSTATUS_RR7_Pos) /*!< Bit mask of RR7 field.                                   */
  #define WDT_REQSTATUS_RR7_Min (0x0UL)              /*!< Min enumerator value of RR7 field.                                   */
  #define WDT_REQSTATUS_RR7_Max (0x1UL)              /*!< Max enumerator value of RR7 field.                                   */
  #define WDT_REQSTATUS_RR7_DisabledOrRequested (0x0UL) /*!< RR[7] register is not enabled, or are already requesting reload   */
  #define WDT_REQSTATUS_RR7_EnabledAndUnrequested (0x1UL) /*!< RR[7] register is enabled, and are not yet requesting reload    */


